{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/buildanalysisdata/qoiclean/secondary/secqoiclean1617.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Jul 2022, 18:10:06
{txt}
{com}. 
. use $clndtadir/secondary/sec1617, clear
{txt}(2016-17 Secondary CHKS Data)

{com}. keep cdscode a21 a22 a23 a24 a25 a26 a27 a28 a29 a30 a31 a32 a33 a34 a35 a36 a37 a38 a39 //only keep questions of interest
{txt}
{com}. //rename questions of interest using question numbers in 1819 as standard
. foreach i of numlist 21/39 {c -(}
{txt}  2{com}.   local j = `i' + 1
{txt}  3{com}.   rename a`i' qoi`j'
{txt}  4{com}.   elabel rename a`i' qoi`j' //rename the value labels to be consistent with var name change
{txt}  5{com}. {c )-}
{res}{txt}
{com}. 
. * count the total number of responses in each school */
. sort cdscode
{txt}
{com}. by cdscode: gen totalresp = _N
{txt}
{com}. label var totalresp "total number of responses at each school including missing"
{txt}
{com}. 
. 
. *********** clean qoi 22-34 as they have the same response options *************
. /* value labels qoi 22- 34:
> 1 strongly disagree
> 2 disagree
> 3 neither disagree nor disagree4 disagree5 strongly agree
> 4 agree
> 5 strongly agree
> 
> Recode:
> -2 strongly disagree
> -1 disagree
> 0 neutral
> 1 agree
> 2 strongly agree
> */
. 
. /* recode qoi 22-34 */
. foreach i of numlist 22/34 {c -(}
{txt}  2{com}.   replace qoi`i' = qoi`i' - 3
{txt}  3{com}. {c )-}
{txt}(463,431 real changes made)
(462,559 real changes made)
(460,337 real changes made)
(462,809 real changes made)
(459,222 real changes made)
(462,098 real changes made)
(462,808 real changes made)
(458,877 real changes made)
(461,229 real changes made)
(462,164 real changes made)
(461,467 real changes made)
(462,272 real changes made)
(463,000 real changes made)

{com}. 
. /* generate dummies for each response option for qoi 22-34*/
. foreach i of numlist 22/34 {c -(}
{txt}  2{com}.   gen strdisagree`i' = 0
{txt}  3{com}.   replace strdisagree`i' = 1 if qoi`i' == -2
{txt}  4{com}. 
.   gen disagree`i' = 0
{txt}  5{com}.   replace disagree`i' = 1 if qoi`i' == -1
{txt}  6{com}. 
.   gen neither`i' = 0
{txt}  7{com}.   replace neither`i' = 1 if qoi`i' == 0
{txt}  8{com}. 
.   gen agree`i' = 0
{txt}  9{com}.   replace agree`i' = 1 if qoi`i' == 1
{txt} 10{com}. 
.   gen stragree`i' = 0
{txt} 11{com}.   replace stragree`i' = 1 if qoi`i' == 2
{txt} 12{com}. 
.   gen missing`i' = 0
{txt} 13{com}.   replace missing`i' = 1 if missing(qoi`i')
{txt} 14{com}. {c )-}
{txt}(26,366 real changes made)
(35,485 real changes made)
(110,394 real changes made)
(193,076 real changes made)
(98,110 real changes made)
(15,092 real changes made)
(32,167 real changes made)
(34,568 real changes made)
(110,742 real changes made)
(181,296 real changes made)
(103,786 real changes made)
(15,964 real changes made)
(32,556 real changes made)
(43,201 real changes made)
(128,459 real changes made)
(173,461 real changes made)
(82,660 real changes made)
(18,186 real changes made)
(31,252 real changes made)
(46,196 real changes made)
(117,220 real changes made)
(184,072 real changes made)
(84,069 real changes made)
(15,714 real changes made)
(24,008 real changes made)
(29,537 real changes made)
(108,624 real changes made)
(195,456 real changes made)
(101,597 real changes made)
(19,301 real changes made)
(43,795 real changes made)
(74,131 real changes made)
(131,653 real changes made)
(157,712 real changes made)
(54,807 real changes made)
(16,425 real changes made)
(30,846 real changes made)
(53,973 real changes made)
(134,930 real changes made)
(165,507 real changes made)
(77,552 real changes made)
(15,715 real changes made)
(23,908 real changes made)
(34,242 real changes made)
(169,031 real changes made)
(160,906 real changes made)
(70,790 real changes made)
(19,646 real changes made)
(29,600 real changes made)
(45,660 real changes made)
(160,912 real changes made)
(157,576 real changes made)
(67,481 real changes made)
(17,294 real changes made)
(13,529 real changes made)
(14,439 real changes made)
(58,290 real changes made)
(188,926 real changes made)
(186,980 real changes made)
(16,359 real changes made)
(24,034 real changes made)
(43,106 real changes made)
(114,958 real changes made)
(167,415 real changes made)
(111,954 real changes made)
(17,056 real changes made)
(16,030 real changes made)
(20,811 real changes made)
(82,174 real changes made)
(198,837 real changes made)
(144,420 real changes made)
(16,251 real changes made)
(14,517 real changes made)
(13,578 real changes made)
(64,994 real changes made)
(182,728 real changes made)
(187,183 real changes made)
(15,523 real changes made)

{com}. 
. *********** clean qoi 35-40 as they have the same response options *************
. /* value labels for qoi 35-40
>  1 not at all true
>  2 a little true
>  3 pretty much true
>  4 very much true
> 
>  recode:
> -2 not at all true
> -1 a little true
> 1 pretty much true
> 2 very much true
>  */
. 
.  /* recode qoi 35-40 */
.  foreach i of numlist 35/40 {c -(}
{txt}  2{com}.    replace qoi`i' = qoi`i' - 3 if qoi`i' == 1 | qoi`i' == 2
{txt}  3{com}.    replace qoi`i' = qoi`i' - 2 if qoi`i' == 3 | qoi`i' == 4
{txt}  4{com}.  {c )-}
{txt}(193,506 real changes made)
(268,551 real changes made)
(150,663 real changes made)
(311,478 real changes made)
(194,191 real changes made)
(264,038 real changes made)
(104,864 real changes made)
(355,695 real changes made)
(154,591 real changes made)
(306,793 real changes made)
(133,769 real changes made)
(327,382 real changes made)

{com}. 
. /* generate dummies for each response option for qoi 35-40*/
. foreach i of numlist 35/40 {c -(}
{txt}  2{com}.   gen nottrue`i' = 0
{txt}  3{com}.   replace nottrue`i' = 1 if qoi`i' == -2
{txt}  4{com}. 
.   gen littletrue`i' = 0
{txt}  5{com}.   replace littletrue`i' = 1 if qoi`i' == -1
{txt}  6{com}. 
.   gen prettytrue`i' = 0
{txt}  7{com}.   replace prettytrue`i' = 1 if qoi`i' == 1
{txt}  8{com}. 
.   gen verytrue`i' = 0
{txt}  9{com}.   replace verytrue`i' = 1 if qoi`i' == 2
{txt} 10{com}. 
.   gen missing`i' = 0
{txt} 11{com}.   replace missing`i' = 1 if missing(qoi`i')
{txt} 12{com}. {c )-}
{txt}(54,549 real changes made)
(138,957 real changes made)
(155,873 real changes made)
(112,678 real changes made)
(16,466 real changes made)
(43,594 real changes made)
(107,069 real changes made)
(171,457 real changes made)
(140,021 real changes made)
(16,382 real changes made)
(68,097 real changes made)
(126,094 real changes made)
(145,781 real changes made)
(118,257 real changes made)
(20,294 real changes made)
(28,249 real changes made)
(76,615 real changes made)
(152,609 real changes made)
(203,086 real changes made)
(17,964 real changes made)
(47,898 real changes made)
(106,693 real changes made)
(159,682 real changes made)
(147,111 real changes made)
(17,139 real changes made)
(42,699 real changes made)
(91,070 real changes made)
(148,284 real changes made)
(179,098 real changes made)
(17,372 real changes made)

{com}. 
. /* collapse the dataset, resulting dataset has mean for each qoi, total number of responses, and number of responses for each option in each question */
.  collapse (mean) qoi* totalresp (sum) strdisagree* disagree* neither* agree* stragree* missing* nottrue* littletrue* prettytrue* verytrue*, by(cdscode)
{res}{txt}
{com}. 
.  ************************ relabel all the vars **********************************
.  /* label all the mean qoi vars */
.  label var qoi22 "Mean of Q: I feel close to people at this school"
{txt}
{com}.  label var qoi23 "Mean of Q: I am happy to be at this school"
{txt}
{com}.  label var qoi24 "Mean of Q: I feel like I am part of this school"
{txt}
{com}.  label var qoi25 "Mean of Q: The teachers at this school treat students fairly"
{txt}
{com}.  label var qoi26 "Mean of Q: I feel safe in my school"
{txt}
{com}.  label var qoi27 "Mean of Q: My school is usually clean and tidy"
{txt}
{com}.  label var qoi28 "Mean of Q: Teachers communicate with parents... expected to learn..."
{txt}
{com}.  label var qoi29 "Mean of Q: Parents feel welcome to participate at this school"
{txt}
{com}.  label var qoi30 "Mean of Q: School staff take parent concerns seriously"
{txt}
{com}.  label var qoi31 "Mean of Q: I try hard to make sure that I am good at my schoolwork"
{txt}
{com}.  label var qoi32 "Mean of Q: I try hard at school because I am interested in my work"
{txt}
{com}.  label var qoi33 "Mean of Q: I work hard to try to understand new things at school"
{txt}
{com}.  label var qoi34 "Mean of Q: I am always trying to do better in my schoolwork"
{txt}
{com}. 
.  label var qoi35 "Mean of Q: There is... who really cares about me"
{txt}
{com}.  label var qoi36 "Mean of Q: There is... who tells me when I do a good job"
{txt}
{com}.  label var qoi37 "Mean of Q: There is... who notices when I’m not there"
{txt}
{com}.  label var qoi38 "Mean of Q: There is... who always wants me to do my best"
{txt}
{com}.  label var qoi39 "Mean of Q: There is... who listens to me when I have something to say"
{txt}
{com}.  label var qoi40 "Mean of Q: There is... who believes that I will be a success"
{txt}
{com}. 
.  label var totalresp "total number of responses in the school including missing"
{txt}
{com}. 
.  /* rename the qoi vars to reflect they are now averages */
.  rename qoi* qoi*mean
{res}{txt}
{com}. 
.  /* label vars for the number of response for each option */
.  foreach i of numlist 22/34 {c -(}
{txt}  2{com}.    label var strdisagree`i' "number of people choosing strongly disagree for qoi`i'"
{txt}  3{com}.    label var disagree`i' "number of people choosing disagree for qoi`i'"
{txt}  4{com}.    label var neither`i' "number of people choosing neither disagree or agree for qoi`i'"
{txt}  5{com}.    label var agree`i' "number of people choosing agree for qoi`i'"
{txt}  6{com}.    label var stragree`i' "number of people choosing strongly agree for qoi`i'"
{txt}  7{com}.    label var missing`i' "number of missing responses for qoi`i'"
{txt}  8{com}.  {c )-}
{txt}
{com}. 
.  foreach i of numlist 35/40 {c -(}
{txt}  2{com}.    label var nottrue`i' "number of people choosing not at all true for qoi`i'"
{txt}  3{com}.    label var littletrue`i' "number of people choosing a little true for qoi`i'"
{txt}  4{com}.    label var prettytrue`i' "number of people choosing pretty much true for qoi`i'"
{txt}  5{com}.    label var verytrue`i' "number of people choosing very much true for qoi`i'"
{txt}  6{com}.    label var missing`i' "number of missing responses for qoi`i'"
{txt}  7{com}.  {c )-}
{txt}
{com}. 
.  ********************* generate percentage agree/disagree etc *******************
. 
.  /* first, generate the net total responses for each question excluding missing */
.  foreach i of numlist 22/40 {c -(}
{txt}  2{com}.    gen nettotalresp`i' = totalresp - missing`i'
{txt}  3{com}.    label var nettotalresp`i' "net total responses for qoi`i' excluding missing "
{txt}  4{com}.  {c )-}
{txt}
{com}. 
.  /* generate pct disagree/agree for qoi 22-34 */
.  foreach i of numlist 22/34 {c -(}
{txt}  2{com}.    gen pctdisagree`i' = (strdisagree`i' + disagree`i')/nettotalresp`i'
{txt}  3{com}.    label var pctdisagree`i' "percent strongly disagree or disagree in qoi`i'"
{txt}  4{com}.    gen pctagree`i' = (stragree`i' + agree`i')/nettotalresp`i'
{txt}  5{com}.    label var pctagree`i' "percent strongly agree or agree in qoi`i'"
{txt}  6{com}.    gen pctneither`i' = neither`i'/nettotalresp`i'
{txt}  7{com}.    label var pctneither`i' "percent neither disagree nor agree in qoi`i'"
{txt}  8{com}.  {c )-}
{txt}(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)

{com}. 
.  /* generate pct no true/true for qoi 35-40 */
.  foreach i of numlist 35/40 {c -(}
{txt}  2{com}.    gen pctnottrue`i' = nottrue`i'/nettotalresp`i'
{txt}  3{com}.    label var pctnottrue`i' "percent not true in qoi`i'"
{txt}  4{com}.    gen pcttrue`i' = (littletrue`i' + prettytrue`i' + verytrue`i')/nettotalresp`i'
{txt}  5{com}.    label var pcttrue`i' "percent a little true, pretty much true, and very much true in qoi`i'"
{txt}  6{com}.  {c )-}
{txt}(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)

{com}. 
. /* generate a year var to prepare for constructing a panel */
. gen year = 1617
{txt}
{com}. 
.  label data "cleaned secondary 1617 survey questions of interest with percent disagree/agree etc."
{txt}note: label truncated to 80 characters

{com}.  compress
  {txt}variable {bf}{res}totalresp{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp22{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp23{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp24{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp25{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp26{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp27{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp28{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp29{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp30{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp31{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp32{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp33{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp34{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp35{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp36{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp37{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp38{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp39{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp40{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}disagree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}neither22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
{txt}  (1,115,504 bytes saved)

{com}.  save $projdir/dta/buildanalysisdata/qoiclean/secondary/secqoiclean1617, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/qoiclean/secondary/secqoiclean1617.dta{rm}
saved
{p_end}

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/buildanalysisdata/qoiclean/secondary/secqoiclean1617.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Jul 2022, 18:10:16
{txt}{.-}
{smcl}
{txt}{sf}{ul off}