{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/buildanalysisdata/qoiclean/secondary/secqoiclean1819_1718_1516.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Apr 2022, 14:56:15
{txt}
{com}. 
. /* ssc install elabel, replace //install the elabel package for easy renaming of labels
> ssc install labutil2, replace //package to help with managing value labels because stata sucks in that regard
> ssc install labundef, replace //package to list value labels unused in memory */
. 
. 
. local years `" "1516" "1718" "1819" "'
{txt}
{com}. 
. foreach year of local years {c -(}
{txt}  2{com}. 
. use $clndtadir/secondary/sec`year', clear
{txt}  3{com}. keep cdscode a22 a23 a24 a25 a26 a27 a28 a29 a30 a31 a32 a33 a34 a35 a36 a37 a38 a39 a40 //only keep questions of interest
{txt}  4{com}. //rename questions of interest using question numbers in 1819 as stasndard
. foreach i of numlist 22/40 {c -(}
{txt}  5{com}.   rename a`i' qoi`i'
{txt}  6{com}. {c )-}
{txt}  7{com}. elabel rename (a*) (qoi*) //rename the value labels to reflect the variable name change
{txt}  8{com}. labdu , delete //delete all value labels not associated with variables
{txt}  9{com}. 
. /* count the total number of responses in each school */
. sort cdscode
{txt} 10{com}. by cdscode: gen totalresp = _N
{txt} 11{com}. label var totalresp "total number of responses at each school including missing"
{txt} 12{com}. 
. 
. *********** clean qoi 22-34 as they have the same response options *************
. /* value labels qoi 22- 34:
> 1 strongly disagree
> 2 disagree
> 3 neither disagree nor disagree
> 4 agree
> 5 strongly agree
> 
> Recode:
> -2 strongly disagree
> -1 disagree
> 0 neutral
> 1 agree
> 2 strongly agree
> */
. 
. 
. /* recode qoi 22-34 */
. foreach i of numlist 22/34 {c -(}
{txt} 13{com}.   replace qoi`i' = qoi`i' - 3
{txt} 14{com}. {c )-}
{txt} 15{com}. 
. 
. /* generate dummies for each response option for qoi 22-34*/
. foreach i of numlist 22/34 {c -(}
{txt} 16{com}.   gen strdisagree`i' = 0
{txt} 17{com}.   replace strdisagree`i' = 1 if qoi`i' == -2
{txt} 18{com}. 
.   gen disagree`i' = 0
{txt} 19{com}.   replace disagree`i' = 1 if qoi`i' == -1
{txt} 20{com}. 
.   gen neither`i' = 0
{txt} 21{com}.   replace neither`i' = 1 if qoi`i' == 0
{txt} 22{com}. 
.   gen agree`i' = 0
{txt} 23{com}.   replace agree`i' = 1 if qoi`i' == 1
{txt} 24{com}. 
.   gen stragree`i' = 0
{txt} 25{com}.   replace stragree`i' = 1 if qoi`i' == 2
{txt} 26{com}. 
.   gen missing`i' = 0
{txt} 27{com}.   replace missing`i' = 1 if missing(qoi`i')
{txt} 28{com}. {c )-}
{txt} 29{com}. 
. ////////////////////////////////////////////////////////////////////////////////
> *********************************** Aside **************************************
. /* a snippet of code to check the dummies are correct and the total number for
> each response option plus missing add up to the total number of responses using qoi22*/
. /* by cdscode: egen check1 = total(strdisagree22)
> by cdscode: egen check2 = total(disagree22)
> by cdscode: egen check3 = total(neither22)
> by cdscode: egen check4 = total(agree22)
> by cdscode: egen check5 = total(stragree22)
> by cdscode: egen check6 = total(missing22)
> gen check = check1 + check2 + check3 + check4 + check5 + check6
> gen checkdiscrep = totalresp - check //check if they add up to the total number of responses
> tab checkdiscrep //result: all values = 0. Great success! dummies are correct and add up
> drop check* //drop all the temp vars generated in this snippet  */
. ////////////////////////////////////////////////////////////////////////////////
> 
. 
. *********** clean qoi 35-40 as they have the same response options *************
. /* value labels for qoi 35-40
>  1 not at all true
>  2 a little true
>  3 pretty much true
>  4 very much true
> 
>  recode:
> -2 not at all true
> -1 a little true
> 1 pretty much true
> 2 very much true
>  */
. 
.  /* recode qoi 35-40 */
.  foreach i of numlist 35/40 {c -(}
{txt} 30{com}.    replace qoi`i' = qoi`i' - 3 if qoi`i' == 1 | qoi`i' == 2
{txt} 31{com}.    replace qoi`i' = qoi`i' - 2 if qoi`i' == 3 | qoi`i' == 4
{txt} 32{com}.  {c )-}
{txt} 33{com}. 
. /* generate dummies for each response option for qoi 35-40*/
.  foreach i of numlist 35/40 {c -(}
{txt} 34{com}.    gen nottrue`i' = 0
{txt} 35{com}.    replace nottrue`i' = 1 if qoi`i' == -2
{txt} 36{com}. 
.    gen littletrue`i' = 0
{txt} 37{com}.    replace littletrue`i' = 1 if qoi`i' == -1
{txt} 38{com}. 
.    gen prettytrue`i' = 0
{txt} 39{com}.    replace prettytrue`i' = 1 if qoi`i' == 1
{txt} 40{com}. 
.    gen verytrue`i' = 0
{txt} 41{com}.    replace verytrue`i' = 1 if qoi`i' == 2
{txt} 42{com}. 
.    gen missing`i' = 0
{txt} 43{com}.    replace missing`i' = 1 if missing(qoi`i')
{txt} 44{com}.  {c )-}
{txt} 45{com}. 
. /* collapse the dataset, resulting dataset has mean for each qoi, total number of responses, and number of responses for each option in each question */
.  collapse (mean) qoi* totalresp (sum) strdisagree* disagree* neither* agree* stragree* missing* nottrue* littletrue* prettytrue* verytrue*, by(cdscode)
{txt} 46{com}. 
. /* a snipppet of code to confirm the collapse worked as intended, same idea as the previous check */
. /* gen check = strdisagree22 + disagree22 + neither22 + agree22 + stragree22 + missing22
> gen checkdiscrep = totalresp - check
> tab checkdiscrep //results: all values = 0. Very nice!
> drop check checkdiscrep */
. 
. ************************ relabel all the vars **********************************
. /* label all the vars */
. label var qoi22 "Mean of Q: I feel close to people at this school"
{txt} 47{com}. label var qoi23 "Mean of Q: I am happy to be at this school"
{txt} 48{com}. label var qoi24 "Mean of Q: I feel like I am part of this school"
{txt} 49{com}. label var qoi25 "Mean of Q: The teachers at this school treat students fairly"
{txt} 50{com}. label var qoi26 "Mean of Q: I feel safe in my school"
{txt} 51{com}. label var qoi27 "Mean of Q: My school is usually clean and tidy"
{txt} 52{com}. label var qoi28 "Mean of Q: Teachers communicate with parents... expected to learn..."
{txt} 53{com}. label var qoi29 "Mean of Q: Parents feel welcome to participate at this school"
{txt} 54{com}. label var qoi30 "Mean of Q: School staff take parent concerns seriously"
{txt} 55{com}. label var qoi31 "Mean of Q: I try hard to make sure that I am good at my schoolwork"
{txt} 56{com}. label var qoi32 "Mean of Q: I try hard at school because I am interested in my work"
{txt} 57{com}. label var qoi33 "Mean of Q: I work hard to try to understand new things at school"
{txt} 58{com}. label var qoi34 "Mean of Q: I am always trying to do better in my schoolwork"
{txt} 59{com}. 
. label var qoi35 "Mean of Q: There is... who really cares about me"
{txt} 60{com}. label var qoi36 "Mean of Q: There is... who tells me when I do a good job"
{txt} 61{com}. label var qoi37 "Mean of Q: There is... who notices when I’m not there"
{txt} 62{com}. label var qoi38 "Mean of Q: There is... who always wants me to do my best"
{txt} 63{com}. label var qoi39 "Mean of Q: There is... who listens to me when I have something to say"
{txt} 64{com}. label var qoi40 "Mean of Q: There is... who believes that I will be a success"
{txt} 65{com}. 
. label var totalresp "total number of responses in the school including missing"
{txt} 66{com}. 
. /* rename the qoi vars to reflect they are now averages */
. rename qoi* qoi*mean
{txt} 67{com}. 
. /* label vars for the number of response for each option */
. foreach i of numlist 22/34 {c -(}
{txt} 68{com}.   label var strdisagree`i' "number of people choosing strongly disagree for qoi`i'"
{txt} 69{com}.   label var disagree`i' "number of people choosing disagree for qoi`i'"
{txt} 70{com}.   label var neither`i' "number of people choosing neither disagree or agree for qoi`i'"
{txt} 71{com}.   label var agree`i' "number of people choosing agree for qoi`i'"
{txt} 72{com}.   label var stragree`i' "number of people choosing strongly agree for qoi`i'"
{txt} 73{com}.   label var missing`i' "number of missing responses for qoi`i'"
{txt} 74{com}. {c )-}
{txt} 75{com}. 
. foreach i of numlist 35/40 {c -(}
{txt} 76{com}.   label var nottrue`i' "number of people choosing not at all true for qoi`i'"
{txt} 77{com}.   label var littletrue`i' "number of people choosing a little true for qoi`i'"
{txt} 78{com}.   label var prettytrue`i' "number of people choosing pretty much true for qoi`i'"
{txt} 79{com}.   label var verytrue`i' "number of people choosing very much true for qoi`i'"
{txt} 80{com}.   label var missing`i' "number of missing responses for qoi`i'"
{txt} 81{com}. {c )-}
{txt} 82{com}. 
. 
. ********************* generate percentage agree/disagree etc *******************
. 
. /* first, generate the net total responses for each question excluding missing */
. foreach i of numlist 22/40 {c -(}
{txt} 83{com}.   gen nettotalresp`i' = totalresp - missing`i'
{txt} 84{com}.   label var nettotalresp`i' "net total responses for qoi`i' excluding missing "
{txt} 85{com}. {c )-}
{txt} 86{com}. 
. /* generate pct disagree/agree for qoi 22-34 */
. foreach i of numlist 22/34 {c -(}
{txt} 87{com}.   gen pctdisagree`i' = (strdisagree`i' + disagree`i')/nettotalresp`i'
{txt} 88{com}.   label var pctdisagree`i' "percent strongly disagree or disagree in qoi`i'"
{txt} 89{com}.   gen pctagree`i' = (stragree`i' + agree`i')/nettotalresp`i'
{txt} 90{com}.   label var pctagree`i' "percent strongly agree or agree in qoi`i'"
{txt} 91{com}.   gen pctneither`i' = neither`i'/nettotalresp`i'
{txt} 92{com}.   label var pctneither`i' "percent neither disagree nor agree in qoi`i'"
{txt} 93{com}. {c )-}
{txt} 94{com}. 
. /* generate pct no true/true for qoi 35-40 */
. foreach i of numlist 35/40 {c -(}
{txt} 95{com}.   gen pctnottrue`i' = nottrue`i'/nettotalresp`i'
{txt} 96{com}.   label var pctnottrue`i' "percent not true in qoi`i'"
{txt} 97{com}.   gen pcttrue`i' = (littletrue`i' + prettytrue`i' + verytrue`i')/nettotalresp`i'
{txt} 98{com}.   label var pcttrue`i' "percent a little true, pretty much true, and very much true in qoi`i'"
{txt} 99{com}. {c )-}
{txt}100{com}. 
. 
. 
. /* generate a year var to prepare for constructing a panel */
. gen year = `year'
{txt}101{com}. 
. 
. label data "cleaned secondary `year' survey questions of interest with percent disagree/agree etc."
{txt}102{com}. compress
{txt}103{com}. save $projdir/dta/buildanalysisdata/qoiclean/secondary/secqoiclean`year', replace
{txt}104{com}. 
. {c )-}
{txt}(2015-16 secondary CHKS data)
{res}{txt}(554,781 real changes made)
(554,956 real changes made)
(551,315 real changes made)
(554,526 real changes made)
(549,956 real changes made)
(553,764 real changes made)
(554,785 real changes made)
(553,535 real changes made)
(551,573 real changes made)
(552,276 real changes made)
(552,638 real changes made)
(553,846 real changes made)
(554,527 real changes made)
(35,040 real changes made)
(43,498 real changes made)
(132,813 real changes made)
(224,871 real changes made)
(118,559 real changes made)
(10,410 real changes made)
(40,025 real changes made)
(39,545 real changes made)
(126,690 real changes made)
(214,581 real changes made)
(134,115 real changes made)
(10,235 real changes made)
(40,459 real changes made)
(50,149 real changes made)
(148,947 real changes made)
(204,369 real changes made)
(107,391 real changes made)
(13,876 real changes made)
(39,683 real changes made)
(56,088 real changes made)
(138,107 real changes made)
(218,635 real changes made)
(102,013 real changes made)
(10,665 real changes made)
(30,705 real changes made)
(34,343 real changes made)
(125,559 real changes made)
(229,280 real changes made)
(130,069 real changes made)
(15,235 real changes made)
(49,497 real changes made)
(81,408 real changes made)
(153,228 real changes made)
(196,022 real changes made)
(73,609 real changes made)
(11,427 real changes made)
(38,627 real changes made)
(64,509 real changes made)
(160,757 real changes made)
(196,266 real changes made)
(94,626 real changes made)
(10,406 real changes made)
(30,217 real changes made)
(43,274 real changes made)
(200,877 real changes made)
(192,650 real changes made)
(86,517 real changes made)
(11,656 real changes made)
(41,109 real changes made)
(55,861 real changes made)
(181,998 real changes made)
(180,347 real changes made)
(92,258 real changes made)
(13,618 real changes made)
(21,182 real changes made)
(17,531 real changes made)
(68,615 real changes made)
(209,393 real changes made)
(235,555 real changes made)
(12,915 real changes made)
(33,612 real changes made)
(48,350 real changes made)
(131,319 real changes made)
(195,748 real changes made)
(143,609 real changes made)
(12,553 real changes made)
(23,968 real changes made)
(24,912 real changes made)
(96,431 real changes made)
(226,018 real changes made)
(182,517 real changes made)
(11,345 real changes made)
(22,553 real changes made)
(17,225 real changes made)
(76,469 real changes made)
(203,895 real changes made)
(234,385 real changes made)
(10,664 real changes made)
(222,899 real changes made)
(326,658 real changes made)
(169,905 real changes made)
(379,691 real changes made)
(222,864 real changes made)
(323,077 real changes made)
(120,175 real changes made)
(427,466 real changes made)
(175,916 real changes made)
(372,975 real changes made)
(151,767 real changes made)
(396,602 real changes made)
(62,814 real changes made)
(160,085 real changes made)
(184,716 real changes made)
(141,942 real changes made)
(15,634 real changes made)
(48,182 real changes made)
(121,723 real changes made)
(200,919 real changes made)
(178,772 real changes made)
(15,595 real changes made)
(76,874 real changes made)
(145,990 real changes made)
(174,058 real changes made)
(149,019 real changes made)
(19,250 real changes made)
(33,033 real changes made)
(87,142 real changes made)
(175,838 real changes made)
(251,628 real changes made)
(17,550 real changes made)
(54,606 real changes made)
(121,310 real changes made)
(187,672 real changes made)
(185,303 real changes made)
(16,300 real changes made)
(48,515 real changes made)
(103,252 real changes made)
(173,115 real changes made)
(223,487 real changes made)
(16,822 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(3 missing values generated)
(3 missing values generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
note: label truncated to 80 characters
  variable {bf}{res}totalresp{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp22{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp23{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp24{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp25{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp26{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp27{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp28{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp29{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp30{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp31{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp32{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp33{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp34{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp35{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp36{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp37{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp38{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp39{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp40{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}strdisagree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}neither22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}missing40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}nottrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
{txt}  (1,390,005 bytes saved)
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/qoiclean/secondary/secqoiclean1516.dta{rm}
saved
{p_end}
(2017-18 Secondary CHKS Data)
{res}{txt}(630,768 real changes made)
(629,340 real changes made)
(626,296 real changes made)
(630,077 real changes made)
(625,077 real changes made)
(629,055 real changes made)
(630,181 real changes made)
(625,157 real changes made)
(627,582 real changes made)
(628,803 real changes made)
(627,731 real changes made)
(629,040 real changes made)
(630,145 real changes made)
(37,174 real changes made)
(53,361 real changes made)
(154,510 real changes made)
(259,754 real changes made)
(125,969 real changes made)
(20,090 real changes made)
(45,655 real changes made)
(52,052 real changes made)
(157,675 real changes made)
(243,974 real changes made)
(129,984 real changes made)
(21,518 real changes made)
(45,339 real changes made)
(63,241 real changes made)
(178,935 real changes made)
(232,394 real changes made)
(106,387 real changes made)
(24,562 real changes made)
(40,821 real changes made)
(64,034 real changes made)
(159,576 real changes made)
(252,900 real changes made)
(112,746 real changes made)
(20,781 real changes made)
(34,854 real changes made)
(48,259 real changes made)
(160,044 real changes made)
(257,286 real changes made)
(124,634 real changes made)
(25,781 real changes made)
(60,477 real changes made)
(103,197 real changes made)
(177,058 real changes made)
(214,962 real changes made)
(73,361 real changes made)
(21,803 real changes made)
(41,458 real changes made)
(74,591 real changes made)
(185,501 real changes made)
(225,163 real changes made)
(103,468 real changes made)
(20,677 real changes made)
(31,035 real changes made)
(46,637 real changes made)
(233,713 real changes made)
(218,766 real changes made)
(95,006 real changes made)
(25,701 real changes made)
(39,869 real changes made)
(64,126 real changes made)
(222,888 real changes made)
(211,165 real changes made)
(89,534 real changes made)
(23,276 real changes made)
(17,381 real changes made)
(20,624 real changes made)
(78,908 real changes made)
(255,943 real changes made)
(255,947 real changes made)
(22,055 real changes made)
(35,616 real changes made)
(66,576 real changes made)
(161,472 real changes made)
(219,967 real changes made)
(144,100 real changes made)
(23,127 real changes made)
(21,617 real changes made)
(31,207 real changes made)
(116,208 real changes made)
(268,947 real changes made)
(191,061 real changes made)
(21,818 real changes made)
(18,857 real changes made)
(19,611 real changes made)
(90,764 real changes made)
(248,728 real changes made)
(252,185 real changes made)
(20,713 real changes made)
(263,658 real changes made)
(361,627 real changes made)
(208,089 real changes made)
(417,165 real changes made)
(266,561 real changes made)
(353,080 real changes made)
(142,622 real changes made)
(480,486 real changes made)
(208,727 real changes made)
(415,532 real changes made)
(186,116 real changes made)
(437,956 real changes made)
(72,764 real changes made)
(190,894 real changes made)
(211,027 real changes made)
(150,600 real changes made)
(25,573 real changes made)
(59,261 real changes made)
(148,828 real changes made)
(232,700 real changes made)
(184,465 real changes made)
(25,604 real changes made)
(92,582 real changes made)
(173,979 real changes made)
(195,922 real changes made)
(157,158 real changes made)
(31,217 real changes made)
(36,620 real changes made)
(106,002 real changes made)
(209,249 real changes made)
(271,237 real changes made)
(27,750 real changes made)
(62,858 real changes made)
(145,869 real changes made)
(218,868 real changes made)
(196,664 real changes made)
(26,599 real changes made)
(57,814 real changes made)
(128,302 real changes made)
(204,900 real changes made)
(233,056 real changes made)
(26,786 real changes made)
{res}{txt}note: label truncated to 80 characters
  variable {bf}{res}totalresp{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp22{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp23{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp24{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp25{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp26{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp27{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp28{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp29{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp30{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp31{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp32{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp33{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp34{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp35{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp36{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp37{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp38{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp39{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp40{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}strdisagree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
{txt}  (1,444,190 bytes saved)
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/qoiclean/secondary/secqoiclean1718.dta{rm}
saved
{p_end}
(2018-19 Secondary CHKS Data)
{res}{txt}(495,020 real changes made)
(493,707 real changes made)
(490,710 real changes made)
(493,908 real changes made)
(489,299 real changes made)
(492,481 real changes made)
(492,779 real changes made)
(491,489 real changes made)
(489,295 real changes made)
(490,469 real changes made)
(490,576 real changes made)
(491,754 real changes made)
(492,724 real changes made)
(29,616 real changes made)
(40,233 real changes made)
(119,898 real changes made)
(207,007 real changes made)
(98,266 real changes made)
(16,410 real changes made)
(37,424 real changes made)
(41,850 real changes made)
(129,887 real changes made)
(191,612 real changes made)
(92,934 real changes made)
(17,723 real changes made)
(36,982 real changes made)
(51,159 real changes made)
(144,963 real changes made)
(182,140 real changes made)
(75,466 real changes made)
(20,720 real changes made)
(32,412 real changes made)
(49,546 real changes made)
(127,123 real changes made)
(200,230 real changes made)
(84,597 real changes made)
(17,522 real changes made)
(27,574 real changes made)
(37,868 real changes made)
(127,919 real changes made)
(205,048 real changes made)
(90,890 real changes made)
(22,131 real changes made)
(47,257 real changes made)
(81,444 real changes made)
(140,336 real changes made)
(169,299 real changes made)
(54,145 real changes made)
(18,949 real changes made)
(31,366 real changes made)
(57,393 real changes made)
(143,547 real changes made)
(181,324 real changes made)
(79,149 real changes made)
(18,651 real changes made)
(23,529 real changes made)
(36,805 real changes made)
(183,818 real changes made)
(177,473 real changes made)
(69,864 real changes made)
(19,941 real changes made)
(33,921 real changes made)
(49,785 real changes made)
(165,198 real changes made)
(164,383 real changes made)
(76,008 real changes made)
(22,135 real changes made)
(16,513 real changes made)
(17,934 real changes made)
(65,543 real changes made)
(195,499 real changes made)
(194,980 real changes made)
(20,961 real changes made)
(32,296 real changes made)
(53,475 real changes made)
(127,794 real changes made)
(169,692 real changes made)
(107,319 real changes made)
(20,854 real changes made)
(19,841 real changes made)
(25,870 real changes made)
(93,125 real changes made)
(207,326 real changes made)
(145,592 real changes made)
(19,676 real changes made)
(17,673 real changes made)
(16,331 real changes made)
(71,714 real changes made)
(191,531 real changes made)
(195,475 real changes made)
(18,706 real changes made)
(207,886 real changes made)
(280,915 real changes made)
(166,222 real changes made)
(322,361 real changes made)
(209,310 real changes made)
(274,114 real changes made)
(112,230 real changes made)
(376,325 real changes made)
(165,220 real changes made)
(324,299 real changes made)
(147,857 real changes made)
(341,693 real changes made)
(56,829 real changes made)
(151,057 real changes made)
(165,705 real changes made)
(115,210 real changes made)
(22,629 real changes made)
(47,198 real changes made)
(119,024 real changes made)
(181,942 real changes made)
(140,419 real changes made)
(22,847 real changes made)
(71,973 real changes made)
(137,337 real changes made)
(153,865 real changes made)
(120,249 real changes made)
(28,006 real changes made)
(28,619 real changes made)
(83,611 real changes made)
(165,682 real changes made)
(210,643 real changes made)
(22,875 real changes made)
(49,052 real changes made)
(116,168 real changes made)
(172,604 real changes made)
(151,695 real changes made)
(21,911 real changes made)
(45,626 real changes made)
(102,231 real changes made)
(161,440 real changes made)
(180,253 real changes made)
(21,880 real changes made)
{res}{txt}note: label truncated to 80 characters
  variable {bf}{res}totalresp{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp22{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp23{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp24{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp25{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp26{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp27{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp28{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp29{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp30{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp31{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp32{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp33{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp34{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp35{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp36{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp37{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp38{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp39{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nettotalresp40{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}strdisagree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}strdisagree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}disagree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}disagree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}neither22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}neither34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}agree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}stragree34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing22{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing23{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing24{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing25{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing26{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing27{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing28{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing29{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing30{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing31{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing32{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing33{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing34{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}missing40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nottrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}littletrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}prettytrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue35{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue36{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue37{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue38{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue39{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}verytrue40{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
{txt}  (1,185,723 bytes saved)
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/qoiclean/secondary/secqoiclean1819.dta{rm}
saved
{p_end}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/buildanalysisdata/qoiclean/secondary/secqoiclean1819_1718_1516.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Apr 2022, 14:56:54
{txt}{.-}
{smcl}
{txt}{sf}{ul off}