-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/builda
> nalysisdata/poolingdata/mergegr11enr.smcl
  log type:  smcl
 opened on:   7 Apr 2022, 14:57:25

. 
. /* merge gr11 enrollment with parent pooled dataset */
. use $projdir/dta/buildanalysisdata/analysisready/parentanalysisready, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. merge 1:1 cdscode using $projdir/dta/enrollment/schoollevel/poolgr11enr, keep
> using(gr11enr_mean)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         9,029
        from master                       445  (_merge==1)
        from using                      8,584  (_merge==2)

    Matched                             2,551  (_merge==3)
    -----------------------------------------

. drop if _merge == 2 //drop unmatched observations from the enrollment dataset
(8,584 observations deleted)

. drop _merge

. 
. save, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/a
    > nalysisready/parentanalysisready.dta saved

. 
. 
. 
. /* merge gr11 enrollment with secondary pooled dataset */
. use $projdir/dta/buildanalysisdata/analysisready/secanalysisready, clear
(secondary pooled dataset ready for analysis with stats and response rate)

. merge 1:1 cdscode using $projdir/dta/enrollment/schoollevel/poolgr11enr, keep
> using(gr11enr_mean)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         8,416
        from master                       333  (_merge==1)
        from using                      8,083  (_merge==2)

    Matched                             3,052  (_merge==3)
    -----------------------------------------

. drop if _merge == 2 //drop unmatched observations from the enrollment dataset
(8,083 observations deleted)

. drop _merge

. 
. save, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/a
    > nalysisready/secanalysisready.dta saved

. 
. 
. 
. /* merge gr11 enrollment with staff pooled dataset */
. use $projdir/dta/buildanalysisdata/poolingdata/staffpooledstats, clear
(weighted average staff qoi statistics pooled over years)

. merge 1:1 cdscode using $projdir/dta/enrollment/schoollevel/poolgr11enr, keep
> using(gr11enr_mean)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         7,899
        from master                       488  (_merge==1)
        from using                      7,411  (_merge==2)

    Matched                             3,724  (_merge==3)
    -----------------------------------------

. drop if _merge == 2 //drop unmatched observations from the enrollment dataset
(7,411 observations deleted)

. drop _merge

. 
. save $projdir/dta/buildanalysisdata/analysisready/staffanalysisready, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/a
    > nalysisready/staffanalysisready.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/builda
> nalysisdata/poolingdata/mergegr11enr.smcl
  log type:  smcl
 closed on:   7 Apr 2022, 14:57:25
-------------------------------------------------------------------------------
