-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/builda
> nalysisdata/poolingva/combineva.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 18:10:38

. 
. use $projdir/dta/buildanalysisdata/va/ela, clear
(CST/SBAC Student Test Score Samples)

. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/va/math

    Result                      Number of obs
    -----------------------------------------
    Not matched                             4
        from master                         3  (_merge==1)
        from using                          1  (_merge==2)

    Matched                             1,366  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/va/enr

    Result                      Number of obs
    -----------------------------------------
    Not matched                            14
        from master                         4  (_merge==1)
        from using                         10  (_merge==2)

    Matched                             1,366  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/va/2yr

    Result                      Number of obs
    -----------------------------------------
    Not matched                             4
        from master                         4  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             1,376  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/va/4yr

    Result                      Number of obs
    -----------------------------------------
    Not matched                             4
        from master                         4  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             1,376  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. 
. label data "average VA estimates pooled over years 2015, 2016, and 2017"

. 
. save $projdir/dta/buildanalysisdata/va/combinedva, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/v
    > a/combinedva.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/builda
> nalysisdata/poolingva/combineva.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 18:10:38
-------------------------------------------------------------------------------
