{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}allsvymissing
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/check/allsvymissing.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Apr 2022, 14:57:50
{txt}
{com}. 
. use $projdir/dta/allsvyfactor/allsvyqoimeans, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. 
. /* generate a var that tallies the number of missing qoimean vars in each observation */
. egen nmissall = rmiss(*mean_pooled)
{txt}
{com}. tab nmissall

   {txt}nmissall {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        299       31.94       31.94
{txt}          1 {c |}{res}          6        0.64       32.59
{txt}          2 {c |}{res}         14        1.50       34.08
{txt}          3 {c |}{res}         48        5.13       39.21
{txt}          4 {c |}{res}          1        0.11       39.32
{txt}          5 {c |}{res}         20        2.14       41.45
{txt}          6 {c |}{res}          4        0.43       41.88
{txt}          8 {c |}{res}          1        0.11       41.99
{txt}         10 {c |}{res}          1        0.11       42.09
{txt}         11 {c |}{res}        115       12.29       54.38
{txt}         12 {c |}{res}          2        0.21       54.59
{txt}         13 {c |}{res}         43        4.59       59.19
{txt}         14 {c |}{res}         30        3.21       62.39
{txt}         15 {c |}{res}         13        1.39       63.78
{txt}         16 {c |}{res}          1        0.11       63.89
{txt}         18 {c |}{res}          9        0.96       64.85
{txt}         19 {c |}{res}          3        0.32       65.17
{txt}         26 {c |}{res}        309       33.01       98.18
{txt}         30 {c |}{res}         13        1.39       99.57
{txt}         32 {c |}{res}          1        0.11       99.68
{txt}         34 {c |}{res}          1        0.11       99.79
{txt}         35 {c |}{res}          1        0.11       99.89
{txt}         37 {c |}{res}          1        0.11      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        936      100.00
{txt}
{com}. 
. local climatevars parentqoi9mean_pooled parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27mean_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled secqoi25mean_pooled secqoi26mean_pooled secqoi27mean_pooled secqoi28mean_pooled secqoi29mean_pooled secqoi30mean_pooled staffqoi20mean_pooled staffqoi24mean_pooled staffqoi41mean_pooled staffqoi44mean_pooled staffqoi64mean_pooled staffqoi87mean_pooled staffqoi98mean_pooled
{txt}
{com}. local qualityvars parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled parentqoi33mean_pooled parentqoi34mean_pooled secqoi35mean_pooled secqoi36mean_pooled secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled secqoi40mean_pooled staffqoi103mean_pooled staffqoi104mean_pooled staffqoi105mean_pooled staffqoi109mean_pooled staffqoi111mean_pooled staffqoi112mean_pooled
{txt}
{com}. local supportvars parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mean_pooled staffqoi128mean_pooled
{txt}
{com}. local motivationvars secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled secqoi34mean_pooled
{txt}
{com}. 
. egen nmissclimate = rmiss(`climatevars')
{txt}
{com}. tab nmissclimate

{txt}nmissclimat {c |}
          e {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        320       34.19       34.19
{txt}          2 {c |}{res}         61        6.52       40.71
{txt}          3 {c |}{res}         11        1.18       41.88
{txt}          4 {c |}{res}        118       12.61       54.49
{txt}          6 {c |}{res}         46        4.91       59.40
{txt}          7 {c |}{res}         47        5.02       64.42
{txt}         11 {c |}{res}        316       33.76       98.18
{txt}         15 {c |}{res}         14        1.50       99.68
{txt}         16 {c |}{res}          3        0.32      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        936      100.00
{txt}
{com}. 
. egen nmissquality = rmiss(`qualityvars')
{txt}
{com}. tab nmissquality

{txt}nmissqualit {c |}
          y {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        319       34.08       34.08
{txt}          1 {c |}{res}         35        3.74       37.82
{txt}          3 {c |}{res}         39        4.17       41.99
{txt}          4 {c |}{res}          1        0.11       42.09
{txt}          5 {c |}{res}        198       21.15       63.25
{txt}          6 {c |}{res}         12        1.28       64.53
{txt}          7 {c |}{res}          1        0.11       64.64
{txt}          9 {c |}{res}          5        0.53       65.17
{txt}         11 {c |}{res}        323       34.51       99.68
{txt}         12 {c |}{res}          1        0.11       99.79
{txt}         13 {c |}{res}          1        0.11       99.89
{txt}         15 {c |}{res}          1        0.11      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        936      100.00
{txt}
{com}. 
. egen nmisssupport = rmiss(`supportvars')
{txt}
{com}. tab nmisssupport

{txt}nmisssuppor {c |}
          t {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        393       41.99       41.99
{txt}          2 {c |}{res}        212       22.65       64.64
{txt}          3 {c |}{res}          9        0.96       65.60
{txt}          4 {c |}{res}        322       34.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        936      100.00
{txt}
{com}. 
. egen nmissmotivation = rmiss(`motivationvars')
{txt}
{com}. tab nmissmotivation

{txt}nmissmotiva {c |}
       tion {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        932       99.57       99.57
{txt}          4 {c |}{res}          4        0.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        936      100.00
{txt}
{com}. 
. /* missing value patterns for schol climate questions */
. mvpatterns `climatevars'
{txt}Variable     {c |} type     obs   mv   variable label
{hline 13}{c +}{hline 65}
{txt}{lalign 12:parentqoi9mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  414{col 28}  522{col 36}{txt}weighted mean of qoi9 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi16mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  414{col 28}  522{col 36}{txt}weighted mean of qoi16 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi17mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  414{col 28}  522{col 36}{txt}weighted mean of qoi17 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi27mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  414{col 28}  522{col 36}{txt}weighted mean of qoi27 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi22mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi22 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi23mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi23 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi24mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi24 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi25mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi25 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi26mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi26 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi27mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  911{col 28}   25{col 36}{txt}weighted mean of qoi27 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi28mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  911{col 28}   25{col 36}{txt}weighted mean of qoi28 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi29mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  911{col 28}   25{col 36}{txt}weighted mean of qoi29 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi30mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  911{col 28}   25{col 36}{txt}weighted mean of qoi30 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi20mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi20 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi24mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  438{col 28}  498{col 36}{txt}weighted mean of qoi24 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi41mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi41 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi44mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi44 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi64mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  438{col 28}  498{col 36}{txt}weighted mean of qoi64 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi87mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  546{col 28}  390{col 36}{txt}weighted mean of qoi87 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi98mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi98 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{hline 13}{c BT}{hline 65}

Patterns of missing values

  {c TLC}{hline 22}{c -}{hline 5}{c -}{hline 7}{c TRC}
  {c |} {res}            _pattern   _mv   _freq {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}++++++++++++++++++++     0     320 {txt}{c |}
  {c |} {res}....+++++++++.......    11     309 {txt}{c |}
  {c |} {res}....++++++++++++++++     4     118 {txt}{c |}
  {c |} {res}++++++++++++++.++.++     2      61 {txt}{c |}
  {c |} {res}....++++++++++.++.++     6      46 {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}....++++++++++.++..+     7      28 {txt}{c |}
  {c |} {res}+++++++++++++.......     7      18 {txt}{c |}
  {c |} {res}....+++++...........    15      13 {txt}{c |}
  {c |} {res}++++++++++++++.++..+     3      11 {txt}{c |}
  {c |} {res}....+++++....+.++..+    11       7 {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}++++................    16       3 {txt}{c |}
  {c |} {res}+++++++++....+.++..+     7       1 {txt}{c |}
  {c |} {res}.............+.++.++    15       1 {txt}{c |}
  {c BLC}{hline 22}{c -}{hline 5}{c -}{hline 7}{c BRC}

{com}. /* missing value patterns for schol teacher and staff quality questions*/
. mvpatterns `qualityvars'
{txt}Variable     {c |} type     obs   mv   variable label
{hline 13}{c +}{hline 65}
{txt}{lalign 12:parentqoi30mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  369{col 28}  567{col 36}{txt}weighted mean of qoi30 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi31mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  414{col 28}  522{col 36}{txt}weighted mean of qoi31 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi32mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  333{col 28}  603{col 36}{txt}weighted mean of qoi32 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi33mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  414{col 28}  522{col 36}{txt}weighted mean of qoi33 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi34mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  369{col 28}  567{col 36}{txt}weighted mean of qoi34 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi35mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi35 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi36mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi36 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi37mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi37 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi38mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi38 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi39mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi39 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi40mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi40 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi103mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi103 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi104mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi104 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi105mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi105 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi109mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi109 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi111mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi111 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi112mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi112 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{hline 13}{c BT}{hline 65}

Patterns of missing values

  {c TLC}{hline 19}{c -}{hline 5}{c -}{hline 7}{c TRC}
  {c |} {res}         _pattern   _mv   _freq {txt}{c |}
  {c LT}{hline 19}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}.....++++++......    11     322 {txt}{c |}
  {c |} {res}+++++++++++++++++     0     319 {txt}{c |}
  {c |} {res}.....++++++++++++     5     198 {txt}{c |}
  {c |} {res}.+.+.++++++++++++     3      39 {txt}{c |}
  {c |} {res}++.++++++++++++++     1      35 {txt}{c |}
  {c LT}{hline 19}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}+++++++++++......     6      12 {txt}{c |}
  {c |} {res}.+.+.++++++......     9       5 {txt}{c |}
  {c |} {res}..+..++++++++++++     4       1 {txt}{c |}
  {c |} {res}++.++++++++......     7       1 {txt}{c |}
  {c |} {res}...........++++++    11       1 {txt}{c |}
  {c LT}{hline 19}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}+++++............    12       1 {txt}{c |}
  {c |} {res}++.++............    13       1 {txt}{c |}
  {c |} {res}.+.+.............    15       1 {txt}{c |}
  {c BLC}{hline 19}{c -}{hline 5}{c -}{hline 7}{c BRC}

{com}. /* missing value patterns for student support questions*/
. mvpatterns `supportvars'
{txt}Variable     {c |} type     obs   mv   variable label
{hline 13}{c +}{hline 65}
{txt}{lalign 12:parentqoi15mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  414{col 28}  522{col 36}{txt}weighted mean of qoi15 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi64mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  411{col 28}  525{col 36}{txt}weighted mean of qoi64 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi10mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  593{col 28}  343{col 36}{txt}weighted mean of qoi10 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi128mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  587{col 28}  349{col 36}{txt}weighted mean of qoi128 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{hline 13}{c BT}{hline 65}

Patterns of missing values

  {c TLC}{hline 10}{c -}{hline 5}{c -}{hline 7}{c TRC}
  {c |} {res}_pattern   _mv   _freq {txt}{c |}
  {c LT}{hline 10}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}    ++++     0     393 {txt}{c |}
  {c |} {res}    ....     4     322 {txt}{c |}
  {c |} {res}    ..++     2     194 {txt}{c |}
  {c |} {res}    ++..     2      18 {txt}{c |}
  {c |} {res}    ..+.     3       6 {txt}{c |}
  {c LT}{hline 10}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}    +...     3       3 {txt}{c |}
  {c BLC}{hline 10}{c -}{hline 5}{c -}{hline 7}{c BRC}

{com}. /* missing value patterns for student motivation questions */
. mvpatterns `motivationvars'
{txt}Variable     {c |} type     obs   mv   variable label
{hline 13}{c +}{hline 65}
{txt}{lalign 12:secqoi31mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi31 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi32mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi32 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi33mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi33 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi34mean_pooled}{col 14}{c |}{res}{col 16}float{col 23}  932{col 28}    4{col 36}{txt}weighted mean of qoi34 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{hline 13}{c BT}{hline 65}

Patterns of missing values

  {c TLC}{hline 10}{c -}{hline 5}{c -}{hline 7}{c TRC}
  {c |} {res}_pattern   _mv   _freq {txt}{c |}
  {c LT}{hline 10}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}    ++++     0     932 {txt}{c |}
  {c |} {res}    ....     4       4 {txt}{c |}
  {c BLC}{hline 10}{c -}{hline 5}{c -}{hline 7}{c BRC}

{com}. 
. 
. 
. log close allsvymissing
      {txt}name:  {res}allsvymissing
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/check/allsvymissing.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Apr 2022, 14:57:50
{txt}{.-}
{smcl}
{txt}{sf}{ul off}