{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}allsvymissing
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/check/allsvymissing.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Dec 2024, 19:17:38
{txt}
{com}. 
. use $projdir/dta/allsvyfactor/allsvyqoimeans, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. 
. /* generate a var that tallies the number of missing qoimean vars in each observation */
. egen nmissall = rmiss(*mean_pooled)
{txt}
{com}. tab nmissall

   {txt}nmissall {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        953       16.94       16.94
{txt}          1 {c |}{res}         28        0.50       17.44
{txt}          2 {c |}{res}         52        0.92       18.36
{txt}          3 {c |}{res}        137        2.44       20.80
{txt}          4 {c |}{res}         11        0.20       21.00
{txt}          5 {c |}{res}         55        0.98       21.97
{txt}          6 {c |}{res}         12        0.21       22.19
{txt}          7 {c |}{res}          5        0.09       22.28
{txt}          8 {c |}{res}          2        0.04       22.31
{txt}          9 {c |}{res}          1        0.02       22.33
{txt}         10 {c |}{res}          6        0.11       22.44
{txt}         11 {c |}{res}        496        8.82       31.25
{txt}         12 {c |}{res}         16        0.28       31.54
{txt}         13 {c |}{res}        209        3.72       35.25
{txt}         14 {c |}{res}        136        2.42       37.67
{txt}         15 {c |}{res}         69        1.23       38.90
{txt}         16 {c |}{res}          7        0.12       39.02
{txt}         17 {c |}{res}          2        0.04       39.06
{txt}         18 {c |}{res}         49        0.87       39.93
{txt}         19 {c |}{res}      1,033       18.36       58.29
{txt}         20 {c |}{res}         35        0.62       58.92
{txt}         21 {c |}{res}         51        0.91       59.82
{txt}         22 {c |}{res}        119        2.12       61.94
{txt}         23 {c |}{res}          2        0.04       61.97
{txt}         24 {c |}{res}         48        0.85       62.83
{txt}         25 {c |}{res}         18        0.32       63.15
{txt}         26 {c |}{res}      1,070       19.02       82.17
{txt}         27 {c |}{res}          3        0.05       82.22
{txt}         30 {c |}{res}        453        8.05       90.28
{txt}         31 {c |}{res}         14        0.25       90.52
{txt}         32 {c |}{res}        151        2.68       93.21
{txt}         33 {c |}{res}        157        2.79       96.00
{txt}         34 {c |}{res}         97        1.72       97.72
{txt}         35 {c |}{res}          8        0.14       97.87
{txt}         37 {c |}{res}         25        0.44       98.31
{txt}         38 {c |}{res}         19        0.34       98.65
{txt}         39 {c |}{res}          1        0.02       98.67
{txt}         40 {c |}{res}          1        0.02       98.68
{txt}         41 {c |}{res}          2        0.04       98.72
{txt}         45 {c |}{res}         72        1.28      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      5,625      100.00
{txt}
{com}. 
. local climatevars parentqoi9mean_pooled parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27mean_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled secqoi25mean_pooled secqoi26mean_pooled secqoi27mean_pooled secqoi28mean_pooled secqoi29mean_pooled secqoi30mean_pooled staffqoi20mean_pooled staffqoi24mean_pooled staffqoi41mean_pooled staffqoi44mean_pooled staffqoi64mean_pooled staffqoi87mean_pooled staffqoi98mean_pooled
{txt}
{com}. local qualityvars parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled parentqoi33mean_pooled parentqoi34mean_pooled secqoi35mean_pooled secqoi36mean_pooled secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled secqoi40mean_pooled staffqoi103mean_pooled staffqoi104mean_pooled staffqoi105mean_pooled staffqoi109mean_pooled staffqoi111mean_pooled staffqoi112mean_pooled
{txt}
{com}. local supportvars parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mean_pooled staffqoi128mean_pooled
{txt}
{com}. local motivationvars secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled secqoi34mean_pooled
{txt}
{com}. 
. egen nmissclimate = rmiss(`climatevars')
{txt}
{com}. tab nmissclimate

{txt}nmissclimat {c |}
          e {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,023       18.19       18.19
{txt}          1 {c |}{res}          4        0.07       18.26
{txt}          2 {c |}{res}        195        3.47       21.72
{txt}          3 {c |}{res}         31        0.55       22.28
{txt}          4 {c |}{res}        513        9.12       31.40
{txt}          6 {c |}{res}        235        4.18       35.57
{txt}          7 {c |}{res}        214        3.80       39.38
{txt}          8 {c |}{res}          2        0.04       39.41
{txt}          9 {c |}{res}      1,088       19.34       58.76
{txt}         10 {c |}{res}          3        0.05       58.81
{txt}         11 {c |}{res}      1,286       22.86       81.67
{txt}         12 {c |}{res}         29        0.52       82.19
{txt}         13 {c |}{res}        406        7.22       89.40
{txt}         14 {c |}{res}          1        0.02       89.42
{txt}         15 {c |}{res}        238        4.23       93.65
{txt}         16 {c |}{res}        283        5.03       98.68
{txt}         17 {c |}{res}          2        0.04       98.72
{txt}         20 {c |}{res}         72        1.28      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      5,625      100.00
{txt}
{com}. 
. egen nmissquality = rmiss(`qualityvars')
{txt}
{com}. tab nmissquality

{txt}nmissqualit {c |}
          y {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,029       18.29       18.29
{txt}          1 {c |}{res}        115        2.04       20.34
{txt}          2 {c |}{res}          1        0.02       20.36
{txt}          3 {c |}{res}        111        1.97       22.33
{txt}          4 {c |}{res}          1        0.02       22.35
{txt}          5 {c |}{res}        909       16.16       38.51
{txt}          6 {c |}{res}      1,151       20.46       58.97
{txt}          7 {c |}{res}        120        2.13       61.10
{txt}          9 {c |}{res}        119        2.12       63.22
{txt}         10 {c |}{res}          1        0.02       63.24
{txt}         11 {c |}{res}      1,857       33.01       96.25
{txt}         12 {c |}{res}         83        1.48       97.72
{txt}         13 {c |}{res}          8        0.14       97.87
{txt}         15 {c |}{res}         44        0.78       98.65
{txt}         16 {c |}{res}          1        0.02       98.67
{txt}         17 {c |}{res}         75        1.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      5,625      100.00
{txt}
{com}. 
. egen nmisssupport = rmiss(`supportvars')
{txt}
{com}. tab nmisssupport

{txt}nmisssuppor {c |}
          t {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,528       44.94       44.94
{txt}          1 {c |}{res}         33        0.59       45.53
{txt}          2 {c |}{res}      1,723       30.63       76.16
{txt}          3 {c |}{res}        139        2.47       78.63
{txt}          4 {c |}{res}      1,202       21.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      5,625      100.00
{txt}
{com}. 
. egen nmissmotivation = rmiss(`motivationvars')
{txt}
{com}. tab nmissmotivation

{txt}nmissmotiva {c |}
       tion {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,382       60.12       60.12
{txt}          1 {c |}{res}          3        0.05       60.18
{txt}          4 {c |}{res}      2,240       39.82      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      5,625      100.00
{txt}
{com}. 
. /* missing value patterns for schol climate questions */
. mvpatterns `climatevars'
{txt}Variable     {c |} type     obs   mv   variable label
{hline 13}{c +}{hline 66}
{txt}{lalign 12:parentqoi9mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2784{col 28} 2841{col 36}{txt}weighted mean of qoi9 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi16mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2785{col 28} 2840{col 36}{txt}weighted mean of qoi16 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi17mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2786{col 28} 2839{col 36}{txt}weighted mean of qoi17 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi27mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2786{col 28} 2839{col 36}{txt}weighted mean of qoi27 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi22mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi22 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi23mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi23 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi24mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3384{col 28} 2241{col 36}{txt}weighted mean of qoi24 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi25mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi25 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi26mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi26 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi27mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3276{col 28} 2349{col 36}{txt}weighted mean of qoi27 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi28mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3276{col 28} 2349{col 36}{txt}weighted mean of qoi28 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi29mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3276{col 28} 2349{col 36}{txt}weighted mean of qoi29 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi30mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3276{col 28} 2349{col 36}{txt}weighted mean of qoi30 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi20mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4194{col 28} 1431{col 36}{txt}weighted mean of qoi20 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi24mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3036{col 28} 2589{col 36}{txt}weighted mean of qoi24 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi41mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4199{col 28} 1426{col 36}{txt}weighted mean of qoi41 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi44mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4197{col 28} 1428{col 36}{txt}weighted mean of qoi44 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi64mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3035{col 28} 2590{col 36}{txt}weighted mean of qoi64 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi87mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3828{col 28} 1797{col 36}{txt}weighted mean of qoi87 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi98mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4199{col 28} 1426{col 36}{txt}weighted mean of qoi98 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{hline 13}{c BT}{hline 66}

Patterns of missing values

  {c TLC}{hline 22}{c -}{hline 5}{c -}{hline 7}{c TRC}
  {c |} {res}            _pattern   _mv   _freq {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}++++.........+++++++     9    1087 {txt}{c |}
  {c |} {res}....+++++++++.......    11    1067 {txt}{c |}
  {c |} {res}++++++++++++++++++++     0    1023 {txt}{c |}
  {c |} {res}....++++++++++++++++     4     513 {txt}{c |}
  {c |} {res}.............+++++++    13     404 {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}....++++++++++.++.++     6     234 {txt}{c |}
  {c |} {res}++++++++++++++.++.++     2     195 {txt}{c |}
  {c |} {res}++++.........+.++.++    11     183 {txt}{c |}
  {c |} {res}.............+.++.++    15     175 {txt}{c |}
  {c |} {res}.............+.++..+    16     146 {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}++++................    16     135 {txt}{c |}
  {c |} {res}....++++++++++.++..+     7     121 {txt}{c |}
  {c |} {res}+++++++++++++.......     7      85 {txt}{c |}
  {c |} {res}....................    20      72 {txt}{c |}
  {c |} {res}....+++++...........    15      63 {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}....+++++....+.++..+    11      36 {txt}{c |}
  {c |} {res}++++++++++++++.++..+     3      29 {txt}{c |}
  {c |} {res}++++.........+.++..+    12      29 {txt}{c |}
  {c |} {res}+++++++++....+.++..+     7       7 {txt}{c |}
  {c |} {res}+++++++++++++.++++++     1       3 {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}++++++++++++++++.+++     1       1 {txt}{c |}
  {c |} {res}+++++++++++++..++.++     3       1 {txt}{c |}
  {c |} {res}+...++++++++++++++++     3       1 {txt}{c |}
  {c |} {res}+++++++++....+.++.++     6       1 {txt}{c |}
  {c |} {res}....++.+++++++.++.++     7       1 {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}.++++++++++++.......     8       1 {txt}{c |}
  {c |} {res}....+++++....+++++++     8       1 {txt}{c |}
  {c |} {res}..+++++++++++.......     9       1 {txt}{c |}
  {c |} {res}++++.........++++.++    10       1 {txt}{c |}
  {c |} {res}++++.........+.+++++    10       1 {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}....+++++....+.++.++    10       1 {txt}{c |}
  {c |} {res}++++.........+..+..+    13       1 {txt}{c |}
  {c |} {res}++++...........++..+    13       1 {txt}{c |}
  {c |} {res}..............++++++    14       1 {txt}{c |}
  {c |} {res}.............++++...    16       1 {txt}{c |}
  {c LT}{hline 22}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}.............+.+..++    16       1 {txt}{c |}
  {c |} {res}.+++................    17       1 {txt}{c |}
  {c |} {res}.............+.+...+    17       1 {txt}{c |}
  {c BLC}{hline 22}{c -}{hline 5}{c -}{hline 7}{c BRC}

{com}. /* missing value patterns for schol teacher and staff quality questions*/
. mvpatterns `qualityvars'
{txt}Variable     {c |} type     obs   mv   variable label
{hline 13}{c +}{hline 66}
{txt}{lalign 12:parentqoi30mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2505{col 28} 3120{col 36}{txt}weighted mean of qoi30 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi31mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2778{col 28} 2847{col 36}{txt}weighted mean of qoi31 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi32mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2262{col 28} 3363{col 36}{txt}weighted mean of qoi32 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi33mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2781{col 28} 2844{col 36}{txt}weighted mean of qoi33 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi34mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2505{col 28} 3120{col 36}{txt}weighted mean of qoi34 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi35mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi35 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi36mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi36 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi37mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi37 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi38mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3383{col 28} 2242{col 36}{txt}weighted mean of qoi38 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi39mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi39 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi40mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi40 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi103mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4197{col 28} 1428{col 36}{txt}weighted mean of qoi103 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi104mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4197{col 28} 1428{col 36}{txt}weighted mean of qoi104 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi105mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4197{col 28} 1428{col 36}{txt}weighted mean of qoi105 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi109mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4197{col 28} 1428{col 36}{txt}weighted mean of qoi109 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi111mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4197{col 28} 1428{col 36}{txt}weighted mean of qoi111 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi112mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4197{col 28} 1428{col 36}{txt}weighted mean of qoi112 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{hline 13}{c BT}{hline 66}

Patterns of missing values

  {c TLC}{hline 19}{c -}{hline 5}{c -}{hline 7}{c TRC}
  {c |} {res}         _pattern   _mv   _freq {txt}{c |}
  {c LT}{hline 19}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}.....++++++......    11    1129 {txt}{c |}
  {c |} {res}+++++......++++++     6    1090 {txt}{c |}
  {c |} {res}+++++++++++++++++     0    1029 {txt}{c |}
  {c |} {res}.....++++++++++++     5     909 {txt}{c |}
  {c |} {res}...........++++++    11     728 {txt}{c |}
  {c LT}{hline 19}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}++.++++++++++++++     1     115 {txt}{c |}
  {c |} {res}++.++......++++++     7     114 {txt}{c |}
  {c |} {res}.+.+.++++++++++++     3     111 {txt}{c |}
  {c |} {res}.+.+.......++++++     9      97 {txt}{c |}
  {c |} {res}+++++............    12      82 {txt}{c |}
  {c LT}{hline 19}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}.................    17      75 {txt}{c |}
  {c |} {res}+++++++++++......     6      60 {txt}{c |}
  {c |} {res}.+.+.............    15      44 {txt}{c |}
  {c |} {res}.+.+.++++++......     9      22 {txt}{c |}
  {c |} {res}++.++............    13       8 {txt}{c |}
  {c LT}{hline 19}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}++.++++++++......     7       6 {txt}{c |}
  {c |} {res}+..++++++++++++++     2       1 {txt}{c |}
  {c |} {res}..+..++++++++++++     4       1 {txt}{c |}
  {c |} {res}.....+++.++++++++     6       1 {txt}{c |}
  {c |} {res}...+.......++++++    10       1 {txt}{c |}
  {c LT}{hline 19}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}.....+++.++......    12       1 {txt}{c |}
  {c |} {res}...+.............    16       1 {txt}{c |}
  {c BLC}{hline 19}{c -}{hline 5}{c -}{hline 7}{c BRC}

{com}. /* missing value patterns for student support questions*/
. mvpatterns `supportvars'
{txt}Variable     {c |} type     obs   mv   variable label
{hline 13}{c +}{hline 66}
{txt}{lalign 12:parentqoi15mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2786{col 28} 2839{col 36}{txt}weighted mean of qoi15 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:parentqoi64mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 2753{col 28} 2872{col 36}{txt}weighted mean of qoi64 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi10mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4199{col 28} 1426{col 36}{txt}weighted mean of qoi10 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:staffqoi128mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 4058{col 28} 1567{col 36}{txt}weighted mean of qoi128 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{hline 13}{c BT}{hline 66}

Patterns of missing values

  {c TLC}{hline 10}{c -}{hline 5}{c -}{hline 7}{c TRC}
  {c |} {res}_pattern   _mv   _freq {txt}{c |}
  {c LT}{hline 10}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}    ++++     0    2528 {txt}{c |}
  {c |} {res}    ..++     2    1527 {txt}{c |}
  {c |} {res}    ....     4    1202 {txt}{c |}
  {c |} {res}    ++..     2     193 {txt}{c |}
  {c |} {res}    ..+.     3     109 {txt}{c |}
  {c LT}{hline 10}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}    +++.     1      30 {txt}{c |}
  {c |} {res}    +...     3      29 {txt}{c |}
  {c |} {res}    +.+.     2       3 {txt}{c |}
  {c |} {res}    +.++     1       2 {txt}{c |}
  {c |} {res}    ++.+     1       1 {txt}{c |}
  {c LT}{hline 10}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}    .+..     3       1 {txt}{c |}
  {c BLC}{hline 10}{c -}{hline 5}{c -}{hline 7}{c BRC}

{com}. /* missing value patterns for student motivation questions */
. mvpatterns `motivationvars'
{txt}Variable     {c |} type     obs   mv   variable label
{hline 13}{c +}{hline 66}
{txt}{lalign 12:secqoi31mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi31 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi32mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3383{col 28} 2242{col 36}{txt}weighted mean of qoi32 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi33mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3385{col 28} 2240{col 36}{txt}weighted mean of qoi33 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{txt}{lalign 12:secqoi34mean_pooled}{col 14}{c |}{res}{col 16}float{col 23} 3384{col 28} 2241{col 36}{txt}weighted mean of qoi34 responses over years
{txt}{col 14}{c |}{col 36}for a given school
{hline 13}{c BT}{hline 66}

Patterns of missing values

  {c TLC}{hline 10}{c -}{hline 5}{c -}{hline 7}{c TRC}
  {c |} {res}_pattern   _mv   _freq {txt}{c |}
  {c LT}{hline 10}{c -}{hline 5}{c -}{hline 7}{c RT}
  {c |} {res}    ++++     0    3382 {txt}{c |}
  {c |} {res}    ....     4    2240 {txt}{c |}
  {c |} {res}    +.++     1       2 {txt}{c |}
  {c |} {res}    +++.     1       1 {txt}{c |}
  {c BLC}{hline 10}{c -}{hline 5}{c -}{hline 7}{c BRC}

{com}. 
. 
. 
. log close allsvymissing
      {txt}name:  {res}allsvymissing
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/check/allsvymissing.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}19 Dec 2024, 19:17:38
{txt}{.-}
{smcl}
{txt}{sf}{ul off}