{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}renamedata
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/renamedata.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Apr 2022, 22:07:48
{txt}
{com}. 
. ************************** elementary CHKS surveys *****************************
. 
. //14-15
. use "$rawdtadir/elementary/CHKS_1415_ElemData_AllDistricts_012916.dta", clear
{err}{p 0 4 2}
file {bf:{err}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata/elementary/CHKS_1415_ElemData_AllDistricts_012916.dta}
not found
{p_end}
{txt}{search r(601), local:r(601);}

end of do-file
{search r(601), local:r(601);}
{com}.   pause finished running $projdir/do/build/prepare/renamedata
. 
.   //running splitstaff0414.do
.   do $projdir/do/build/prepare/splitstaff0414
.   pause finished running $projdir/do/build/prepare/splitstaff0414
. {c )-}
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. do "./do/master.do"
{txt}
{com}. ********************************************************************************
. ******* master do file for common core va project do files ****************
. ***this master file executes all do files for the project in correct order *****
. ********************************************************************************
. ********************************************************************************
. *************** written by Che Sun. Email: ucsun@ucdavis.edu ********************
. ********************************************************************************
. 
. /* IMPORTAMT: before running this master do file, make sure the directories global macros
> are set correctly in the settings.do file according to your current file structure
> cd "/home/research/ca_ed_lab/chesun/gsr/caschls"
>  */
. 
. 
. /* to run this master do file, run the following line of code
> do "./do/master.do"
>  */
. 
. 
. /* For convenience of copy pasting:
> cd "/home/research/ca_ed_lab/users/chesun/gsr/caschls"
> do "./do/settings.do"
> */
. 
. clear all
{res}{txt}
{com}. set varabbrev off, perm //set variable abbreviation permanently off
{txt}({cmd:set varabbrev} preference recorded)

{com}. graph drop _all
{txt}
{com}. set more off
{txt}
{com}. 
. /* If pause is on, the pause [message] command displays message and temporarily suspends execution
> of the program, returning control to the keyboard. Execution of keyboard commands continues until
> you type end or q, at which time execution of the program resumes. Typing BREAK in pause mode
> (as opposed to pressing the Break key) also resumes program execution, but the break signal is sent
> to the calling program. */
. pause on
{txt}
{com}. 
. do "./do/settings.do" //set global project settings
{txt}
{com}. ********************************************************************************
. ******* global settings for common core va project do files********************
. ********************************************************************************
. ********************************************************************************
. *************** written by Che Sun. Email: ucsun@ucdavis.edu ********************
. ********************************************************************************
. 
. /* IMPORTAMT: before running running the master do file, make sure the directories global macros
> are set correctly in the settings.do file according to your current file structure */
. 
. /* creating global macro for the raw csv file directory */
. global rawcsvdir "/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv"
{txt}
{com}. 
. 
. /* creating global macro for the raw dta file directory */
. global rawdtadir "/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata"
{txt}
{com}. 
. 
. /* creating global macro for the clean dta file directory */
. global clndtadir "/home/research/ca_ed_lab/data/restricted_access/clean/calschls"
{txt}
{com}. 
. 
. /* creating global macro for the current project directory. IMPORTANT
> to set correctly so that the do files will run  */
. global projdir "/home/research/ca_ed_lab/users/chesun/gsr/caschls"
{txt}
{com}. 
. /* global macro for the common core VA project folder directory */
. global vaprojdir "/home/research/ca_ed_lab/projects/common_core_va"
{txt}
{com}. 
. /* create global macro for the value added estimates file directory */
. global vadtadir "/home/research/ca_ed_lab/projects/common_core_va/data/sbac"
{txt}
{com}. 
. 
. /* create global macro for CST data directory */
. global cstdtadir "/home/research/ca_ed_lab/data/restricted_access/clean/cst"
{txt}
{com}. 
. 
. /* create global macro for NSC data directory */
. global nscdtadir "/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc"
{txt}
{com}. 
. /* create global macro for NSC old format data directory */
. global nscdtadir_oldformat "/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat"
{txt}
{com}. 
. 
. /* global macro for Matt's crosswalks folder */
. global mattxwalks "/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks"
{txt}
{com}. 
. 
. /* global macro for common core VA project crosswalks folder  */
. global vaprojxwalks "/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks"
{txt}
{com}. 
{txt}end of do-file

{com}. log using "$projdir/log/master.smcl", replace name(master) //start log file for the master do file and overwrite existing log file
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. log close
{err}no log file open
{txt}{search r(606), local:r(606);}

{com}. do "./do/master.do"
{txt}
{com}. ********************************************************************************
. ******* master do file for common core va project do files ****************
. ***this master file executes all do files for the project in correct order *****
. ********************************************************************************
. ********************************************************************************
. *************** written by Che Sun. Email: ucsun@ucdavis.edu ********************
. ********************************************************************************
. 
. /* IMPORTAMT: before running this master do file, make sure the directories global macros
> are set correctly in the settings.do file according to your current file structure
> cd "/home/research/ca_ed_lab/chesun/gsr/caschls"
>  */
. 
. 
. /* to run this master do file, run the following line of code
> do "./do/master.do"
>  */
. 
. 
. /* For convenience of copy pasting:
> cd "/home/research/ca_ed_lab/users/chesun/gsr/caschls"
> do "./do/settings.do"
> */
. 
. clear all
{res}{txt}
{com}. set varabbrev off, perm //set variable abbreviation permanently off
{txt}({cmd:set varabbrev} preference recorded)

{com}. graph drop _all
{txt}
{com}. set more off
{txt}
{com}. 
. /* If pause is on, the pause [message] command displays message and temporarily suspends execution
> of the program, returning control to the keyboard. Execution of keyboard commands continues until
> you type end or q, at which time execution of the program resumes. Typing BREAK in pause mode
> (as opposed to pressing the Break key) also resumes program execution, but the break signal is sent
> to the calling program. */
. pause on
{txt}
{com}. 
. do "./do/settings.do" //set global project settings
{txt}
{com}. ********************************************************************************
. ******* global settings for common core va project do files********************
. ********************************************************************************
. ********************************************************************************
. *************** written by Che Sun. Email: ucsun@ucdavis.edu ********************
. ********************************************************************************
. 
. /* IMPORTAMT: before running running the master do file, make sure the directories global macros
> are set correctly in the settings.do file according to your current file structure */
. 
. /* creating global macro for the raw csv file directory */
. global rawcsvdir "/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv"
{txt}
{com}. 
. 
. /* creating global macro for the raw dta file directory */
. global rawdtadir "/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata"
{txt}
{com}. 
. 
. /* creating global macro for the clean dta file directory */
. global clndtadir "/home/research/ca_ed_lab/data/restricted_access/clean/calschls"
{txt}
{com}. 
. 
. /* creating global macro for the current project directory. IMPORTANT
> to set correctly so that the do files will run  */
. global projdir "/home/research/ca_ed_lab/users/chesun/gsr/caschls"
{txt}
{com}. 
. /* global macro for the common core VA project folder directory */
. global vaprojdir "/home/research/ca_ed_lab/projects/common_core_va"
{txt}
{com}. 
. /* create global macro for the value added estimates file directory */
. global vadtadir "/home/research/ca_ed_lab/projects/common_core_va/data/sbac"
{txt}
{com}. 
. 
. /* create global macro for CST data directory */
. global cstdtadir "/home/research/ca_ed_lab/data/restricted_access/clean/cst"
{txt}
{com}. 
. 
. /* create global macro for NSC data directory */
. global nscdtadir "/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc"
{txt}
{com}. 
. /* create global macro for NSC old format data directory */
. global nscdtadir_oldformat "/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat"
{txt}
{com}. 
. 
. /* global macro for Matt's crosswalks folder */
. global mattxwalks "/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks"
{txt}
{com}. 
. 
. /* global macro for common core VA project crosswalks folder  */
. global vaprojxwalks "/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks"
{txt}
{com}. 
{txt}end of do-file

{com}. log using "$projdir/log/master.smcl", replace name(master) //start log file for the master do file and overwrite existing log file
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. log close +all
{err}+ invalid name
{txt}{search r(198), local:r(198);}

{com}. log close _all
      {txt}name:  {res}renamedata
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/renamedata.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Apr 2022, 22:12:21
{txt}{.-}
{smcl}
{txt}{sf}{ul off}