{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingxwalk/siblingpairxwalk.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Apr 2022, 16:33:21
{txt}
{com}. 
. use $projdir/dta/siblingxwalk/uniquelinkedfamilyclean, clear
{txt}(CST data siblings crosswalk matching on same year, last name, and address)

{com}. 
. /* make tempfile for merging with joinby command */
. drop year numsiblings street_address_line_one street_address_line_two city state zip_code
{txt}
{com}. rename state_student_id sibling_state_student_id
{res}{txt}
{com}. rename first_name sibling_first_name
{res}{txt}
{com}. rename last_name sibling_last_name
{res}{txt}
{com}. rename birth_date sibling_birth_date
{res}{txt}
{com}. rename middle_intl sibling_middle_intl
{res}{txt}
{com}. 
. label var sibling_state_student_id "Sibling State Student ID"
{txt}
{com}. label var sibling_first_name "Sibling First Name"
{txt}
{com}. label var sibling_last_name "Sibling Last Name"
{txt}
{com}. label var sibling_birth_date "Sibling Birth Date"
{txt}
{com}. label var sibling_middle_intl "Sibling Middle Initial"
{txt}
{com}. 
. tempfile formerge
{txt}
{com}. save `formerge'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St192370.000001{rm}
saved
as .dta format
{p_end}

{com}. 
. use $projdir/dta/siblingxwalk/uniquelinkedfamilyclean, clear
{txt}(CST data siblings crosswalk matching on same year, last name, and address)

{com}. drop year numsiblings street_address_line_one street_address_line_two city state zip_code
{txt}
{com}. joinby ufamilyid using `formerge'
{txt}
{com}. 
. /* drop observations where self joins on self */
. drop if state_student_id == sibling_state_student_id
{txt}(4,095,244 observations deleted)

{com}. 
. order ufamilyid state_student_id sibling_state_student_id
{txt}
{com}. 
. 
. save $projdir/dta/siblingxwalk/siblingpairxwalk, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. *******create unique sibling pairs by dropping permutations
. //load the pairwise combination of siblings dataset
. use $projdir/dta/siblingxwalk/siblingpairxwalk, clear
{txt}(CST data siblings crosswalk matching on same year, last name, and address)

{com}. egen pairorder1 = concat(state_student_id sibling_state_student_id)
{txt}
{com}. egen pairorder2 = concat(sibling_state_student_id state_student_id)
{txt}
{com}. 
. //pairorder1 has pairs in ascending order
. replace pairorder1 = pairorder2 if state_student_id > sibling_state_student_id
{txt}(3,373,719 real changes made)

{com}. 
. //remove duplicate permutations within family
. bysort ufamilyid pairorder1: gen i = _n
{txt}
{com}. keep if i==1
{txt}(3,373,719 observations deleted)

{com}. 
. drop pairorder1 pairorder2 i
{txt}
{com}. 
. 
. //distance between birth dates for sibling pairs
. gen birth_date_distance = abs(birth_date - sibling_birth_date)
{txt}(224 missing values generated)

{com}. 
. bysort ufamilyid: egen avg_birth_date_distance_family = mean(birth_date_distance)
{txt}(85 missing values generated)

{com}. 
. replace avg_birth_date_distance_family = avg_birth_date_distance_family/365
{txt}(3,319,952 real changes made)

{com}. label var avg_birth_date_distance_family "Average distance of birth dates in family in years"
{txt}
{com}. 
. 
. label data "Unique sibling pairs after dropping duplicate permutations"
{txt}
{com}. 
. save $projdir/dta/siblingxwalk/uniquesiblingpairxwalk, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/uniquesiblingpairxwalk.dta{rm}
saved
{p_end}

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingxwalk/siblingpairxwalk.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Apr 2022, 16:34:08
{txt}{.-}
{smcl}
{txt}{sf}{ul off}