-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/allsvymerge.smcl
  log type:  smcl
 opened on:  19 Dec 2024, 19:17:28

. 
. /* rename vars and prep parentanalysisready.dta for merging */
. use $projdir/dta/buildanalysisdata/analysisready/parentanalysisready, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. 
. /* keep only the qoimean vars  and va to be used in factor analysis */
. keep cdscode qoi* 

. 
. /* rename variables and drop common vars to prepare for merging across survey
> s */
. rename qoi* parentqoi*

. 
. save $projdir/dta/allsvyfactor/formerge/parentqoimeans, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/former
    > ge/parentqoimeans.dta saved

. 
. 
. /* rename vars in secanalysisready.dta and prep for merging */
. use $projdir/dta/buildanalysisdata/analysisready/secanalysisready, clear
(secondary pooled dataset ready for analysis with stats and response rate)

. 
. keep cdscode qoi* 

. rename qoi* secqoi*

. 
. save $projdir/dta/allsvyfactor/formerge/secqoimeans, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/former
    > ge/secqoimeans.dta saved

. 
. 
. /* rename vars in staffanalysisready.dta and prep for merging */
. use $projdir/dta/buildanalysisdata/analysisready/staffanalysisready, clear
(weighted average staff qoi statistics pooled over years)

. 
. keep cdscode qoi* 

. rename qoi* staffqoi*

. 
. save $projdir/dta/allsvyfactor/formerge/staffqoimeans, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/former
    > ge/staffqoimeans.dta saved

. 
. 
. 
. /* merge all surveys */
. use $projdir/dta/allsvyfactor/formerge/parentqoimeans, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. merge 1:1 cdscode using $projdir/dta/allsvyfactor/formerge/secqoimeans, nogen
>  

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,505
        from master                     1,558  
        from using                      1,947  

    Matched                             1,438  
    -----------------------------------------

. merge 1:1 cdscode using $projdir/dta/allsvyfactor/formerge/staffqoimeans, nog
> en 

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,095
        from master                     1,413  
        from using                        682  

    Matched                             3,530  
    -----------------------------------------

. 
. // merge on VA 
. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/va/va_pooled_all.dta, 
> keep(1 3) nogen 

    Result                      Number of obs
    -----------------------------------------
    Not matched                         4,690
        from master                     4,690  
        from using                          0  

    Matched                               935  
    -----------------------------------------

. 
. save $projdir/dta/allsvyfactor/allsvyqoimeans, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/allsvy
    > qoimeans.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/allsvymerge.smcl
  log type:  smcl
 closed on:  19 Dec 2024, 19:17:29
-------------------------------------------------------------------------------
