-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/allsvymerge.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 18:11:06

. 
. /* rename vars and prep parentanalysisready.dta for merging */
. use $projdir/dta/buildanalysisdata/analysisready/parentanalysisready, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. 
. /* keep only the qoimean vars to be used in factor analysis */
. keep cdscode qoi*

. 
. /* rename variables and drop common vars to prepare for merging across survey
> s */
. rename qoi* parentqoi*

. 
. save $projdir/dta/allsvyfactor/formerge/parentqoimeans, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/former
    > ge/parentqoimeans.dta saved

. 
. 
. /* rename vars in secanalysisready.dta and prep for merging */
. use $projdir/dta/buildanalysisdata/analysisready/secanalysisready, clear
(secondary pooled dataset ready for analysis with stats and response rate)

. 
. keep cdscode qoi*

. rename qoi* secqoi*

. 
. save $projdir/dta/allsvyfactor/formerge/secqoimeans, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/former
    > ge/secqoimeans.dta saved

. 
. 
. /* rename vars in staffanalysisready.dta and prep for merging */
. use $projdir/dta/buildanalysisdata/analysisready/staffanalysisready, clear
(weighted average staff qoi statistics pooled over years)

. 
. keep cdscode qoi*

. rename qoi* staffqoi*

. 
. save $projdir/dta/allsvyfactor/formerge/staffqoimeans, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/former
    > ge/staffqoimeans.dta saved

. 
. 
. 
. /* merge all surveys */
. use $projdir/dta/allsvyfactor/formerge/parentqoimeans, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. merge 1:1 cdscode using $projdir/dta/allsvyfactor/formerge/secqoimeans

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,995
        from master                     1,555  (_merge==1)
        from using                      1,440  (_merge==2)

    Matched                             2,394  (_merge==3)
    -----------------------------------------

. /* keep only matched schools */
. keep if _merge == 3
(2,995 observations deleted)

. drop _merge

. 
. merge 1:1 cdscode using $projdir/dta/allsvyfactor/formerge/staffqoimeans

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,755
        from master                        75  (_merge==1)
        from using                      2,680  (_merge==2)

    Matched                             2,319  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(2,755 observations deleted)

. // 2300 records matched among all 3 surveys
. drop _merge

. 
. 
. 
. /* merge with va vars */
. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/va/combinedva

    Result                      Number of obs
    -----------------------------------------
    Not matched                           939
        from master                       939  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             1,380  (_merge==3)
    -----------------------------------------

. //940 records not matched from the master dataset. 1360 records matched
. keep if _merge == 3
(939 observations deleted)

. drop _merge

. 
. missings dropobs *mean_pooled, force //drop all observations with all qoimean
>  vars missing

Checking missings in parentqoi9mean_pooled parentqoi15mean_pooled
    parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27mean_pooled
    parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled
    parentqoi33mean_pooled parentqoi34mean_pooled parentqoi64mean_pooled
    secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled
    secqoi25mean_pooled secqoi26mean_pooled secqoi27mean_pooled
    secqoi28mean_pooled secqoi29mean_pooled secqoi30mean_pooled
    secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled
    secqoi34mean_pooled secqoi35mean_pooled secqoi36mean_pooled
    secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled
    secqoi40mean_pooled staffqoi10mean_pooled staffqoi20mean_pooled
    staffqoi24mean_pooled staffqoi41mean_pooled staffqoi44mean_pooled
    staffqoi64mean_pooled staffqoi87mean_pooled staffqoi98mean_pooled
    staffqoi103mean_pooled staffqoi104mean_pooled staffqoi105mean_pooled
    staffqoi109mean_pooled staffqoi111mean_pooled staffqoi112mean_pooled
    staffqoi128mean_pooled:
1081 observations with missing values

(445 observations deleted)

. 
. save $projdir/dta/allsvyfactor/allsvyqoimeans, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/allsvy
    > qoimeans.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/allsvymerge.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 18:11:06
-------------------------------------------------------------------------------
