{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/allsvymerge.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Dec 2024, 19:17:28
{txt}
{com}. 
. /* rename vars and prep parentanalysisready.dta for merging */
. use $projdir/dta/buildanalysisdata/analysisready/parentanalysisready, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. 
. /* keep only the qoimean vars  and va to be used in factor analysis */
. keep cdscode qoi* 
{txt}
{com}. 
. /* rename variables and drop common vars to prepare for merging across surveys */
. rename qoi* parentqoi*
{res}{txt}
{com}. 
. save $projdir/dta/allsvyfactor/formerge/parentqoimeans, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/formerge/parentqoimeans.dta{rm}
saved
{p_end}

{com}. 
. 
. /* rename vars in secanalysisready.dta and prep for merging */
. use $projdir/dta/buildanalysisdata/analysisready/secanalysisready, clear
{txt}(secondary pooled dataset ready for analysis with stats and response rate)

{com}. 
. keep cdscode qoi* 
{txt}
{com}. rename qoi* secqoi*
{res}{txt}
{com}. 
. save $projdir/dta/allsvyfactor/formerge/secqoimeans, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/formerge/secqoimeans.dta{rm}
saved
{p_end}

{com}. 
. 
. /* rename vars in staffanalysisready.dta and prep for merging */
. use $projdir/dta/buildanalysisdata/analysisready/staffanalysisready, clear
{txt}(weighted average staff qoi statistics pooled over years)

{com}. 
. keep cdscode qoi* 
{txt}
{com}. rename qoi* staffqoi*
{res}{txt}
{com}. 
. save $projdir/dta/allsvyfactor/formerge/staffqoimeans, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/formerge/staffqoimeans.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. /* merge all surveys */
. use $projdir/dta/allsvyfactor/formerge/parentqoimeans, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. merge 1:1 cdscode using $projdir/dta/allsvyfactor/formerge/secqoimeans, nogen 
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           3,505
{txt}{col 9}from master{col 30}{res}           1,558{txt}  
{col 9}from using{col 30}{res}           1,947{txt}  

{col 5}Matched{col 30}{res}           1,438{txt}  
{col 5}{hline 41}

{com}. merge 1:1 cdscode using $projdir/dta/allsvyfactor/formerge/staffqoimeans, nogen 
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           2,095
{txt}{col 9}from master{col 30}{res}           1,413{txt}  
{col 9}from using{col 30}{res}             682{txt}  

{col 5}Matched{col 30}{res}           3,530{txt}  
{col 5}{hline 41}

{com}. 
. // merge on VA 
. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/va/va_pooled_all.dta, keep(1 3) nogen 
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           4,690
{txt}{col 9}from master{col 30}{res}           4,690{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}             935{txt}  
{col 5}{hline 41}

{com}. 
. save $projdir/dta/allsvyfactor/allsvyqoimeans, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/allsvyfactor/allsvyqoimeans.dta{rm}
saved
{p_end}

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/allsvymerge.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}19 Dec 2024, 19:17:29
{txt}{.-}
{smcl}
{txt}{sf}{ul off}