-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/alpha.smcl
  log type:  smcl
 opened on:   7 Apr 2022, 15:49:35

. 
. /* secondary */
. use $projdir/dta/buildanalysisdata/analysisready/secanalysisready, clear
(secondary pooled dataset ready for analysis with stats and response rate)

. 
. /* std: standardize items in the scale to mean 0, variance 1
> item: display item-test and item-rest correlations*/
. alpha *mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
qoi22mean_~d | 3385    +       0.6738        0.6343          0.6265      0.9679
qoi23mean_~d | 3385    +       0.8620        0.8429          0.6076      0.9654
qoi24mean_~d | 3384    +       0.8997        0.8854          0.6038      0.9648
qoi25mean_~d | 3385    +       0.7875        0.7599          0.6151      0.9664
qoi26mean_~d | 3385    +       0.8368        0.8146          0.6101      0.9657
qoi27mean_~d | 3276    +       0.5922        0.5458          0.6341      0.9689
qoi28mean_~d | 3276    +       0.8507        0.8303          0.6089      0.9656
qoi29mean_~d | 3276    +       0.8814        0.8649          0.6059      0.9651
qoi30mean_~d | 3276    +       0.8467        0.8258          0.6093      0.9656
qoi31mean_~d | 3385    +       0.7689        0.7392          0.6169      0.9667
qoi32mean_~d | 3383    +       0.6976        0.6603          0.6241      0.9676
qoi33mean_~d | 3385    +       0.7906        0.7630          0.6148      0.9664
qoi34mean_~d | 3384    +       0.7477        0.7155          0.6192      0.9670
qoi35mean_~d | 3385    +       0.7829        0.7546          0.6156      0.9665
qoi36mean_~d | 3385    +       0.8475        0.8265          0.6091      0.9656
qoi37mean_~d | 3385    +       0.7052        0.6689          0.6234      0.9675
qoi38mean_~d | 3383    +       0.8786        0.8618          0.6059      0.9651
qoi39mean_~d | 3385    +       0.8265        0.8032          0.6113      0.9659
qoi40mean_~d | 3385    +       0.8543        0.8343          0.6086      0.9655
-------------+-----------------------------------------------------------------
Test scale   |                                               0.6142      0.9680
-------------------------------------------------------------------------------

. 
. //copy and paste results table and text to column in excel
. 
. 
. /* parent */
. use $projdir/dta/buildanalysisdata/analysisready/parentanalysisready, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. alpha *mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
qoi9mean_p~d | 2784    +       0.8602        0.8227          0.6303      0.9446
qoi15mean_~d | 2786    +       0.7725        0.7172          0.6488      0.9487
qoi16mean_~d | 2785    +       0.8919        0.8620          0.6229      0.9429
qoi17mean_~d | 2786    +       0.8675        0.8333          0.6288      0.9443
qoi27mean_~d | 2786    +       0.8459        0.8070          0.6335      0.9453
qoi30mean_~d | 2505    +       0.8782        0.8468          0.6272      0.9439
qoi31mean_~d | 2778    +       0.9034        0.8770          0.6211      0.9425
qoi32mean_~d | 2262    +       0.7757        0.7219          0.6452      0.9479
qoi33mean_~d | 2781    +       0.8114        0.7632          0.6403      0.9468
qoi34mean_~d | 2505    +       0.8733        0.8406          0.6280      0.9441
qoi64mean_~d | 2753    +       0.5423        0.4516          0.6961      0.9582
-------------+-----------------------------------------------------------------
Test scale   |                                               0.6384      0.9510
-------------------------------------------------------------------------------

. 
. 
. /* staff */
. use $projdir/dta/buildanalysisdata/analysisready/staffanalysisready, clear
(weighted average staff qoi statistics pooled over years)

. alpha *mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
qoi10mean_~d | 4199    +       0.4790        0.3785          0.3317      0.8742
qoi20mean_~d | 4194    +       0.4674        0.3667          0.3327      0.8747
qoi24mean_~d | 3036    +       0.7494        0.6908          0.3064      0.8608
qoi41mean_~d | 4199    +       0.6354        0.5539          0.3148      0.8655
qoi44mean_~d | 4197    +       0.7226        0.6546          0.3049      0.8600
qoi64mean_~d | 3035    +       0.7287        0.6668          0.3080      0.8617
qoi87mean_~d | 3828    +       0.6760        0.6026          0.3108      0.8632
qoi98mean_~d | 4199    +       0.4812        0.3822          0.3306      0.8737
qoi103mean~d | 4197    +       0.5715        0.4810          0.3230      0.8698
qoi104mean~d | 4197    +       0.5793        0.4902          0.3220      0.8693
qoi105mean~d | 4197    +       0.6244        0.5413          0.3169      0.8666
qoi109mean~d | 4197    +       0.6118        0.5279          0.3184      0.8674
qoi111mean~d | 4197    +       0.6139        0.5298          0.3180      0.8672
qoi112mean~d | 4197    +       0.7455        0.6835          0.3040      0.8594
qoi128mean~d | 4058    +       0.4359        0.3274          0.3359      0.8763
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3185      0.8752
-------------------------------------------------------------------------------

. 
. 
. 
. 
. 
. /* Alpha for question classifications  */
. use $projdir/dta/allsvyfactor/allsvyqoimeans, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. //School Climate
. alpha parentqoi9mean_pooled parentqoi16mean_pooled parentqoi17mean_pooled par
> entqoi27mean_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pool
> ed secqoi25mean_pooled secqoi26mean_pooled secqoi27mean_pooled secqoi28mean_p
> ooled secqoi29mean_pooled secqoi30mean_pooled staffqoi20mean_pooled staffqoi2
> 4mean_pooled staffqoi41mean_pooled staffqoi44mean_pooled staffqoi64mean_poole
> d staffqoi87mean_pooled staffqoi98mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
parentqoi9~d |  414    +       0.6194        0.5697          0.5149      0.9528
p~6mean_po~d |  414    +       0.6319        0.5852          0.5145      0.9527
parentqoi17~ |  414    +       0.5354        0.4799          0.5204      0.9537
parentqoi2~d |  414    +       0.5884        0.5372          0.5171      0.9531
secqoi22me~d |  932    +       0.5496        0.4663          0.5281      0.9551
secqoi23me~d |  932    +       0.8081        0.7683          0.4993      0.9499
secqoi24me~d |  932    +       0.8426        0.8109          0.4955      0.9491
secqoi25me~d |  932    +       0.8150        0.7753          0.4980      0.9496
secqoi26me~d |  932    +       0.8368        0.7998          0.4947      0.9490
secqoi27me~d |  911    +       0.7910        0.7477          0.4991      0.9498
secqoi28me~d |  911    +       0.7742        0.7254          0.5017      0.9503
secqoi29me~d |  911    +       0.8564        0.8246          0.4931      0.9487
secqoi30me~d |  911    +       0.8501        0.8178          0.4942      0.9489
staffqoi20~d |  593    +       0.5185        0.4550          0.5267      0.9548
staffqoi24~d |  438    +       0.6894        0.6456          0.5102      0.9519
staffqoi41~d |  593    +       0.6844        0.6358          0.5111      0.9521
staffqoi44~d |  593    +       0.7821        0.7456          0.5042      0.9508
staffqoi64~d |  438    +       0.7824        0.7511          0.5043      0.9508
staffqoi87~d |  546    +       0.7108        0.6683          0.5095      0.9518
staffqoi98~d |  593    +       0.7054        0.6603          0.5099      0.9519
-------------+-----------------------------------------------------------------
Test scale   |                                               0.5075      0.9537
-------------------------------------------------------------------------------

. 
. 
. //Teacher and Staff Quality
. alpha parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled pa
> rentqoi33mean_pooled parentqoi34mean_pooled secqoi35mean_pooled secqoi36mean_
> pooled secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled secqoi40me
> an_pooled staffqoi103mean_pooled staffqoi104mean_pooled staffqoi105mean_poole
> d staffqoi109mean_pooled staffqoi111mean_pooled staffqoi112mean_pooled, std i
> tem

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~0mean_po~d |  369    +       0.6454        0.5857          0.4253      0.9221
p~1mean_po~d |  414    +       0.5834        0.5135          0.4299      0.9234
p~2mean_po~d |  333    +       0.6894        0.6357          0.4218      0.9211
p~3mean_po~d |  414    +       0.6211        0.5533          0.4265      0.9225
parentqoi34~ |  369    +       0.6347        0.5723          0.4265      0.9225
secqoi35me~d |  932    +       0.8321        0.7929          0.3996      0.9142
secqoi36me~d |  932    +       0.8527        0.8184          0.3976      0.9135
secqoi37me~d |  932    +       0.7926        0.7418          0.4058      0.9162
secqoi38me~d |  932    +       0.8533        0.8178          0.3971      0.9133
secqoi39me~d |  932    +       0.8419        0.8018          0.3982      0.9137
secqoi40me~d |  932    +       0.8134        0.7678          0.4036      0.9154
staffqoi103~ |  593    +       0.4426        0.3506          0.4476      0.9284
staffqoi104~ |  593    +       0.5054        0.4221          0.4423      0.9269
staffqoi105~ |  593    +       0.6279        0.5588          0.4293      0.9233
staffqoi109~ |  593    +       0.5850        0.5107          0.4351      0.9249
staffqoi111~ |  593    +       0.4928        0.4080          0.4421      0.9269
staffqoi112~ |  593    +       0.6899        0.6283          0.4229      0.9214
-------------+-----------------------------------------------------------------
Test scale   |                                               0.4209      0.9251
-------------------------------------------------------------------------------

. 
. //Support for Students
. alpha parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mean_pooled sta
> ffqoi128mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~5mean_po~d |  414    +       0.7753        0.5316          0.3678      0.6357
parentqoi6~d |  411    +       0.7366        0.4709          0.4057      0.6719
staffqoi10m~ |  593    +       0.8167        0.5028          0.3732      0.6411
staffqoi12~d |  587    +       0.7867        0.4976          0.3684      0.6364
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3793      0.7097
-------------------------------------------------------------------------------

. 
. //Student Motivation
. alpha secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled secqoi34mea
> n_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
secqoi31me~d |  932    +       0.8657        0.7599          0.7563      0.9030
secqoi32me~d |  932    +       0.8041        0.6609          0.8295      0.9359
secqoi33me~d |  932    +       0.9648        0.9335          0.6385      0.8412
secqoi34me~d |  932    +       0.9306        0.8714          0.6791      0.8639
-------------+-----------------------------------------------------------------
Test scale   |                                               0.7259      0.9137
-------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/alpha.smcl
  log type:  smcl
 closed on:   7 Apr 2022, 15:49:35
-------------------------------------------------------------------------------
