-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/alpha.smcl
  log type:  smcl
 opened on:  19 Dec 2024, 19:20:25

. 
. /* Alpha for surveys  */
. 
. /* secondary */
. use $projdir/dta/buildanalysisdata/analysisready/secanalysisready, clear
(secondary pooled dataset ready for analysis with stats and response rate)

. 
. /* std: standardize items in the scale to mean 0, variance 1
> item: display item-test and item-rest correlations*/
. alpha *mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
qoi22mean_~d | 3385    +       0.6738        0.6343          0.6265      0.9679
qoi23mean_~d | 3385    +       0.8620        0.8429          0.6076      0.9654
qoi24mean_~d | 3384    +       0.8997        0.8854          0.6038      0.9648
qoi25mean_~d | 3385    +       0.7875        0.7599          0.6151      0.9664
qoi26mean_~d | 3385    +       0.8368        0.8146          0.6101      0.9657
qoi27mean_~d | 3276    +       0.5922        0.5458          0.6341      0.9689
qoi28mean_~d | 3276    +       0.8507        0.8303          0.6089      0.9656
qoi29mean_~d | 3276    +       0.8814        0.8649          0.6059      0.9651
qoi30mean_~d | 3276    +       0.8467        0.8258          0.6093      0.9656
qoi31mean_~d | 3385    +       0.7689        0.7392          0.6169      0.9667
qoi32mean_~d | 3383    +       0.6976        0.6603          0.6241      0.9676
qoi33mean_~d | 3385    +       0.7906        0.7630          0.6148      0.9664
qoi34mean_~d | 3384    +       0.7477        0.7155          0.6192      0.9670
qoi35mean_~d | 3385    +       0.7829        0.7546          0.6156      0.9665
qoi36mean_~d | 3385    +       0.8475        0.8265          0.6091      0.9656
qoi37mean_~d | 3385    +       0.7052        0.6689          0.6234      0.9675
qoi38mean_~d | 3383    +       0.8786        0.8618          0.6059      0.9651
qoi39mean_~d | 3385    +       0.8265        0.8032          0.6113      0.9659
qoi40mean_~d | 3385    +       0.8543        0.8343          0.6086      0.9655
-------------+-----------------------------------------------------------------
Test scale   |                                               0.6142      0.9680
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_sec", r
> eplace) replace
note: file will be replaced when the first putexcel command is issued.

. 
. putexcel A1 = ("Secondary Survey QOI") A2 = ("Cronbach's Alpha") B2 = (r(alph
> a))
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. clear matrix

. 
. putexcel save

. 
. /* parent */
. use $projdir/dta/buildanalysisdata/analysisready/parentanalysisready, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. alpha *mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
qoi9mean_p~d | 2784    +       0.8602        0.8227          0.6303      0.9446
qoi15mean_~d | 2786    +       0.7725        0.7172          0.6488      0.9487
qoi16mean_~d | 2785    +       0.8919        0.8620          0.6229      0.9429
qoi17mean_~d | 2786    +       0.8675        0.8333          0.6288      0.9443
qoi27mean_~d | 2786    +       0.8459        0.8070          0.6335      0.9453
qoi30mean_~d | 2505    +       0.8782        0.8468          0.6272      0.9439
qoi31mean_~d | 2778    +       0.9034        0.8770          0.6211      0.9425
qoi32mean_~d | 2262    +       0.7757        0.7219          0.6452      0.9479
qoi33mean_~d | 2781    +       0.8114        0.7632          0.6403      0.9468
qoi34mean_~d | 2505    +       0.8733        0.8406          0.6280      0.9441
qoi64mean_~d | 2753    +       0.5423        0.4516          0.6961      0.9582
-------------+-----------------------------------------------------------------
Test scale   |                                               0.6384      0.9510
-------------------------------------------------------------------------------

. 
. // use the open option so that stata writes to working memory, otherwise ther
> e are problems with changes not saving 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_parent"
> , replace) modify open
note: file will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("Parent Survey QOI") A2 = ("Cronbach's Alpha") B2= (r(alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. 
. /* staff */
. use $projdir/dta/buildanalysisdata/analysisready/staffanalysisready, clear
(weighted average staff qoi statistics pooled over years)

. alpha *mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
qoi10mean_~d | 4199    +       0.4790        0.3785          0.3317      0.8742
qoi20mean_~d | 4194    +       0.4674        0.3667          0.3327      0.8747
qoi24mean_~d | 3036    +       0.7494        0.6908          0.3064      0.8608
qoi41mean_~d | 4199    +       0.6354        0.5539          0.3148      0.8655
qoi44mean_~d | 4197    +       0.7226        0.6546          0.3049      0.8600
qoi64mean_~d | 3035    +       0.7287        0.6668          0.3080      0.8617
qoi87mean_~d | 3828    +       0.6760        0.6026          0.3108      0.8632
qoi98mean_~d | 4199    +       0.4812        0.3822          0.3306      0.8737
qoi103mean~d | 4197    +       0.5715        0.4810          0.3230      0.8698
qoi104mean~d | 4197    +       0.5793        0.4902          0.3220      0.8693
qoi105mean~d | 4197    +       0.6244        0.5413          0.3169      0.8666
qoi109mean~d | 4197    +       0.6118        0.5279          0.3184      0.8674
qoi111mean~d | 4197    +       0.6139        0.5298          0.3180      0.8672
qoi112mean~d | 4197    +       0.7455        0.6835          0.3040      0.8594
qoi128mean~d | 4058    +       0.4359        0.3274          0.3359      0.8763
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3185      0.8752
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_staff",
>  replace) modify open
note: file will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("Staff Survey QOI") A2 = ("Cronbach's Alpha") B2 = (r(alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. /* Alpha for question classifications  */
. use $projdir/dta/allsvyfactor/allsvyqoimeans, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. 
. //School Climate
. alpha parentqoi9mean_pooled parentqoi16mean_pooled parentqoi17mean_pooled par
> entqoi27mean_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pool
> ed secqoi25mean_pooled secqoi26mean_pooled secqoi27mean_pooled secqoi28mean_p
> ooled secqoi29mean_pooled secqoi30mean_pooled staffqoi20mean_pooled staffqoi2
> 4mean_pooled staffqoi41mean_pooled staffqoi44mean_pooled staffqoi64mean_poole
> d staffqoi87mean_pooled staffqoi98mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
parentqoi9~d | 2784    +       0.6295        0.5481          0.4613      0.9421
p~6mean_po~d | 2785    +       0.6859        0.6185          0.4567      0.9411
parentqoi17~ | 2786    +       0.6148        0.5385          0.4626      0.9424
parentqoi2~d | 2786    +       0.6662        0.5972          0.4583      0.9414
secqoi22me~d | 3385    +       0.6062        0.5330          0.4611      0.9421
secqoi23me~d | 3385    +       0.8162        0.7779          0.4420      0.9377
secqoi24me~d | 3384    +       0.8538        0.8241          0.4390      0.9370
secqoi25me~d | 3385    +       0.7725        0.7245          0.4454      0.9385
secqoi26me~d | 3385    +       0.8490        0.8158          0.4386      0.9369
secqoi27me~d | 3276    +       0.6718        0.6089          0.4529      0.9402
secqoi28me~d | 3276    +       0.8094        0.7710          0.4426      0.9378
secqoi29me~d | 3276    +       0.8493        0.8186          0.4390      0.9370
secqoi30me~d | 3276    +       0.8355        0.8018          0.4406      0.9374
staffqoi20~d | 4194    +       0.3781        0.2674          0.4888      0.9478
staffqoi24~d | 3036    +       0.7177        0.6585          0.4528      0.9402
staffqoi41~d | 4199    +       0.6228        0.5312          0.4635      0.9426
staffqoi44~d | 4197    +       0.7488        0.6822          0.4496      0.9395
staffqoi64~d | 3035    +       0.7715        0.7182          0.4478      0.9390
staffqoi87~d | 3828    +       0.7128        0.6458          0.4530      0.9402
staffqoi98~d | 4199    +       0.6430        0.5536          0.4563      0.9410
-------------+-----------------------------------------------------------------
Test scale   |                                               0.4526      0.9430
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_school_
> climate", replace) modify open
note: file will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("School Climate Questions") A2 = ("Cronbach's Alpha") B2 = (r(
> alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. //Teacher and Staff Quality
. alpha parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled pa
> rentqoi33mean_pooled parentqoi34mean_pooled secqoi35mean_pooled secqoi36mean_
> pooled secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled secqoi40me
> an_pooled staffqoi103mean_pooled staffqoi104mean_pooled staffqoi105mean_poole
> d staffqoi109mean_pooled staffqoi111mean_pooled staffqoi112mean_pooled, std i
> tem

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~0mean_po~d | 2505    +       0.6824        0.6044          0.3701      0.9039
p~1mean_po~d | 2778    +       0.6287        0.5353          0.3734      0.9051
p~2mean_po~d | 2262    +       0.6128        0.5243          0.3735      0.9051
p~3mean_po~d | 2781    +       0.6177        0.5232          0.3747      0.9056
parentqoi34~ | 2505    +       0.6326        0.5447          0.3742      0.9054
secqoi35me~d | 3385    +       0.8067        0.7571          0.3551      0.8981
secqoi36me~d | 3385    +       0.8183        0.7722          0.3536      0.8975
secqoi37me~d | 3385    +       0.7642        0.7019          0.3585      0.8994
secqoi38me~d | 3383    +       0.7729        0.7162          0.3578      0.8991
secqoi39me~d | 3385    +       0.8027        0.7524          0.3547      0.8979
secqoi40me~d | 3385    +       0.7818        0.7261          0.3584      0.8994
staffqoi103~ | 4197    +       0.5971        0.4968          0.3837      0.9088
staffqoi104~ | 4197    +       0.6038        0.5035          0.3826      0.9084
staffqoi105~ | 4197    +       0.6195        0.5175          0.3785      0.9069
staffqoi109~ | 4197    +       0.6304        0.5312          0.3781      0.9068
staffqoi111~ | 4197    +       0.5821        0.4722          0.3829      0.9085
staffqoi112~ | 4197    +       0.6765        0.5833          0.3699      0.9038
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3693      0.9087
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_teacher
> _quality", replace) modify open
note: file will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("Teacher and Staff Quality Questions") A2 = ("Cronbach's Alpha
> ") B2 = (r(alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. //Support for Students
. alpha parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mean_pooled sta
> ffqoi128mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~5mean_po~d | 2786    +       0.7511        0.4898          0.3341      0.6008
parentqoi6~d | 2753    +       0.6947        0.4102          0.3875      0.6549
staffqoi10m~ | 4199    +       0.7973        0.4715          0.3108      0.5750
staffqoi12~d | 4058    +       0.7842        0.4730          0.3242      0.5901
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3408      0.6741
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_student
> _support", replace) modify open
note: file will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("Student Support Questions") A2 = ("Cronbach's Alpha") B2 = (r
> (alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. //Student Motivation
. alpha secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled secqoi34mea
> n_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
secqoi31me~d | 3385    +       0.9410        0.8938          0.8331      0.9374
secqoi32me~d | 3383    +       0.8877        0.8032          0.9001      0.9643
secqoi33me~d | 3385    +       0.9668        0.9393          0.8008      0.9234
secqoi34me~d | 3384    +       0.9539        0.9163          0.8173      0.9307
-------------+-----------------------------------------------------------------
Test scale   |                                               0.8378      0.9538
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_student
> _motivation", replace) modify open
note: file will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("Student Motivation Questions") A2 = ("Cronbach's Alpha") B2 =
>  (r(alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. putexcel clear

. 
. 
. set trace off

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/alpha.smcl
  log type:  smcl
 closed on:  19 Dec 2024, 19:20:26
-------------------------------------------------------------------------------
