{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/alpha.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}31 Jul 2023, 21:45:34
{txt}
{com}. 
. /* Alpha for surveys  */
. 
. /* secondary */
. use $projdir/dta/buildanalysisdata/analysisready/secanalysisready, clear
{txt}(secondary pooled dataset ready for analysis with stats and response rate)

{com}. 
. /* std: standardize items in the scale to mean 0, variance 1
> item: display item-test and item-rest correlations*/
. alpha *mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
qoi22mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.6738{col 45} 0.6343{col 59}   0.6265{col 73} 0.9679
{txt}qoi23mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8620{col 45} 0.8429{col 59}   0.6076{col 73} 0.9654
{txt}qoi24mean_~d{col 14}{c |}{res}{col 16}3384{col 24}+{col 31} 0.8997{col 45} 0.8854{col 59}   0.6038{col 73} 0.9648
{txt}qoi25mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7875{col 45} 0.7599{col 59}   0.6151{col 73} 0.9664
{txt}qoi26mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8368{col 45} 0.8146{col 59}   0.6101{col 73} 0.9657
{txt}qoi27mean_~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.5922{col 45} 0.5458{col 59}   0.6341{col 73} 0.9689
{txt}qoi28mean_~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.8507{col 45} 0.8303{col 59}   0.6089{col 73} 0.9656
{txt}qoi29mean_~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.8814{col 45} 0.8649{col 59}   0.6059{col 73} 0.9651
{txt}qoi30mean_~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.8467{col 45} 0.8258{col 59}   0.6093{col 73} 0.9656
{txt}qoi31mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7689{col 45} 0.7392{col 59}   0.6169{col 73} 0.9667
{txt}qoi32mean_~d{col 14}{c |}{res}{col 16}3383{col 24}+{col 31} 0.6976{col 45} 0.6603{col 59}   0.6241{col 73} 0.9676
{txt}qoi33mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7906{col 45} 0.7630{col 59}   0.6148{col 73} 0.9664
{txt}qoi34mean_~d{col 14}{c |}{res}{col 16}3384{col 24}+{col 31} 0.7477{col 45} 0.7155{col 59}   0.6192{col 73} 0.9670
{txt}qoi35mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7829{col 45} 0.7546{col 59}   0.6156{col 73} 0.9665
{txt}qoi36mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8475{col 45} 0.8265{col 59}   0.6091{col 73} 0.9656
{txt}qoi37mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7052{col 45} 0.6689{col 59}   0.6234{col 73} 0.9675
{txt}qoi38mean_~d{col 14}{c |}{res}{col 16}3383{col 24}+{col 31} 0.8786{col 45} 0.8618{col 59}   0.6059{col 73} 0.9651
{txt}qoi39mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8265{col 45} 0.8032{col 59}   0.6113{col 73} 0.9659
{txt}qoi40mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8543{col 45} 0.8343{col 59}   0.6086{col 73} 0.9655
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.6142{col 73} 0.9680
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_sec", replace) replace
{res}{txt}Note: File will be replaced when the first {cmd:putexcel} command is issued.

{com}. 
. putexcel A1 = ("Secondary Survey QOI") A2 = ("Cronbach's Alpha") B2 = (r(alpha))
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/alpha.xlsx} saved

{com}. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation") ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/alpha.xlsx} saved

{com}. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'
{txt}
{com}. matrix item_rest = r(ItemRestCorr)'
{txt}
{com}. matrix inter_item = r(MeanInterItemCorr)'
{txt}
{com}. matrix alpha_ex_item = r(Alpha)'
{txt}
{com}. 
. putexcel A5=matrix(item_test) ///
>   , rownames
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/alpha.xlsx} saved

{com}. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/alpha.xlsx} saved

{com}. 
. clear matrix
{txt}
{com}. 
. putexcel save
{res}{txt}
{com}. 
. /* parent */
. use $projdir/dta/buildanalysisdata/analysisready/parentanalysisready, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. alpha *mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
qoi9mean_p~d{col 14}{c |}{res}{col 16}2784{col 24}+{col 31} 0.8602{col 45} 0.8227{col 59}   0.6303{col 73} 0.9446
{txt}qoi15mean_~d{col 14}{c |}{res}{col 16}2786{col 24}+{col 31} 0.7725{col 45} 0.7172{col 59}   0.6488{col 73} 0.9487
{txt}qoi16mean_~d{col 14}{c |}{res}{col 16}2785{col 24}+{col 31} 0.8919{col 45} 0.8620{col 59}   0.6229{col 73} 0.9429
{txt}qoi17mean_~d{col 14}{c |}{res}{col 16}2786{col 24}+{col 31} 0.8675{col 45} 0.8333{col 59}   0.6288{col 73} 0.9443
{txt}qoi27mean_~d{col 14}{c |}{res}{col 16}2786{col 24}+{col 31} 0.8459{col 45} 0.8070{col 59}   0.6335{col 73} 0.9453
{txt}qoi30mean_~d{col 14}{c |}{res}{col 16}2505{col 24}+{col 31} 0.8782{col 45} 0.8468{col 59}   0.6272{col 73} 0.9439
{txt}qoi31mean_~d{col 14}{c |}{res}{col 16}2778{col 24}+{col 31} 0.9034{col 45} 0.8770{col 59}   0.6211{col 73} 0.9425
{txt}qoi32mean_~d{col 14}{c |}{res}{col 16}2262{col 24}+{col 31} 0.7757{col 45} 0.7219{col 59}   0.6452{col 73} 0.9479
{txt}qoi33mean_~d{col 14}{c |}{res}{col 16}2781{col 24}+{col 31} 0.8114{col 45} 0.7632{col 59}   0.6403{col 73} 0.9468
{txt}qoi34mean_~d{col 14}{c |}{res}{col 16}2505{col 24}+{col 31} 0.8733{col 45} 0.8406{col 59}   0.6280{col 73} 0.9441
{txt}qoi64mean_~d{col 14}{c |}{res}{col 16}2753{col 24}+{col 31} 0.5423{col 45} 0.4516{col 59}   0.6961{col 73} 0.9582
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.6384{col 73} 0.9510
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. // use the open option so that stata writes to working memory, otherwise there are problems with changes not saving 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_parent", replace) modify open
{res}{txt}Note: File will be modified when {cmd:putexcel save} command is issued.

{com}. 
. putexcel A1 = ("Parent Survey QOI") A2 = ("Cronbach's Alpha") B2= (r(alpha))
{res}{txt}
{com}. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation") ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")
{res}{txt}
{com}. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'
{txt}
{com}. matrix item_rest = r(ItemRestCorr)'
{txt}
{com}. matrix inter_item = r(MeanInterItemCorr)'
{txt}
{com}. matrix alpha_ex_item = r(Alpha)'
{txt}
{com}. 
. putexcel A5=matrix(item_test) ///
>   , rownames
{res}{txt}
{com}. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)
{res}{txt}
{com}. 
. clear matrix
{txt}
{com}. 
. putexcel save
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/alpha.xlsx} saved

{com}. 
. 
. /* staff */
. use $projdir/dta/buildanalysisdata/analysisready/staffanalysisready, clear
{txt}(weighted average staff qoi statistics pooled over years)

{com}. alpha *mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
qoi10mean_~d{col 14}{c |}{res}{col 16}4199{col 24}+{col 31} 0.4790{col 45} 0.3785{col 59}   0.3317{col 73} 0.8742
{txt}qoi20mean_~d{col 14}{c |}{res}{col 16}4194{col 24}+{col 31} 0.4674{col 45} 0.3667{col 59}   0.3327{col 73} 0.8747
{txt}qoi24mean_~d{col 14}{c |}{res}{col 16}3036{col 24}+{col 31} 0.7494{col 45} 0.6908{col 59}   0.3064{col 73} 0.8608
{txt}qoi41mean_~d{col 14}{c |}{res}{col 16}4199{col 24}+{col 31} 0.6354{col 45} 0.5539{col 59}   0.3148{col 73} 0.8655
{txt}qoi44mean_~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.7226{col 45} 0.6546{col 59}   0.3049{col 73} 0.8600
{txt}qoi64mean_~d{col 14}{c |}{res}{col 16}3035{col 24}+{col 31} 0.7287{col 45} 0.6668{col 59}   0.3080{col 73} 0.8617
{txt}qoi87mean_~d{col 14}{c |}{res}{col 16}3828{col 24}+{col 31} 0.6760{col 45} 0.6026{col 59}   0.3108{col 73} 0.8632
{txt}qoi98mean_~d{col 14}{c |}{res}{col 16}4199{col 24}+{col 31} 0.4812{col 45} 0.3822{col 59}   0.3306{col 73} 0.8737
{txt}qoi103mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.5715{col 45} 0.4810{col 59}   0.3230{col 73} 0.8698
{txt}qoi104mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.5793{col 45} 0.4902{col 59}   0.3220{col 73} 0.8693
{txt}qoi105mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.6244{col 45} 0.5413{col 59}   0.3169{col 73} 0.8666
{txt}qoi109mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.6118{col 45} 0.5279{col 59}   0.3184{col 73} 0.8674
{txt}qoi111mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.6139{col 45} 0.5298{col 59}   0.3180{col 73} 0.8672
{txt}qoi112mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.7455{col 45} 0.6835{col 59}   0.3040{col 73} 0.8594
{txt}qoi128mean~d{col 14}{c |}{res}{col 16}4058{col 24}+{col 31} 0.4359{col 45} 0.3274{col 59}   0.3359{col 73} 0.8763
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.3185{col 73} 0.8752
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_staff", replace) modify open
{res}{txt}Note: File will be modified when {cmd:putexcel save} command is issued.

{com}. 
. putexcel A1 = ("Staff Survey QOI") A2 = ("Cronbach's Alpha") B2 = (r(alpha))
{res}{txt}
{com}. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation") ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")
{res}{txt}
{com}. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'
{txt}
{com}. matrix item_rest = r(ItemRestCorr)'
{txt}
{com}. matrix inter_item = r(MeanInterItemCorr)'
{txt}
{com}. matrix alpha_ex_item = r(Alpha)'
{txt}
{com}. 
. putexcel A5=matrix(item_test) ///
>   , rownames
{res}{txt}
{com}. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)
{res}{txt}
{com}. 
. clear matrix
{txt}
{com}. 
. putexcel save
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/alpha.xlsx} saved

{com}. 
. /* Alpha for question classifications  */
. use $projdir/dta/allsvyfactor/allsvyqoimeans, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. 
. //School Climate
. alpha parentqoi9mean_pooled parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27mean_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled secqoi25mean_pooled secqoi26mean_pooled secqoi27mean_pooled secqoi28mean_pooled secqoi29mean_pooled secqoi30mean_pooled staffqoi20mean_pooled staffqoi24mean_pooled staffqoi41mean_pooled staffqoi44mean_pooled staffqoi64mean_pooled staffqoi87mean_pooled staffqoi98mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
parentqoi9~d{col 14}{c |}{res}{col 16}1263{col 24}+{col 31} 0.5237{col 45} 0.4636{col 59}   0.4285{col 73} 0.9344
{txt}p~6mean_po~d{col 14}{c |}{res}{col 16}1262{col 24}+{col 31} 0.5925{col 45} 0.5389{col 59}   0.4233{col 73} 0.9331
{txt}parentqoi17~{col 14}{c |}{res}{col 16}1262{col 24}+{col 31} 0.4740{col 45} 0.4109{col 59}   0.4325{col 73} 0.9354
{txt}parentqoi2~d{col 14}{c |}{res}{col 16}1262{col 24}+{col 31} 0.5491{col 45} 0.4915{col 59}   0.4267{col 73} 0.9340
{txt}secqoi22me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.5189{col 45} 0.4572{col 59}   0.4300{col 73} 0.9348
{txt}secqoi23me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.7709{col 45} 0.7349{col 59}   0.4093{col 73} 0.9294
{txt}secqoi24me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8006{col 45} 0.7683{col 59}   0.4067{col 73} 0.9287
{txt}secqoi25me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.7521{col 45} 0.7130{col 59}   0.4104{col 73} 0.9297
{txt}secqoi26me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8399{col 45} 0.8132{col 59}   0.4036{col 73} 0.9278
{txt}secqoi27me~d{col 14}{c |}{res}{col 16}1321{col 24}+{col 31} 0.7354{col 45} 0.6961{col 59}   0.4120{col 73} 0.9301
{txt}secqoi28me~d{col 14}{c |}{res}{col 16}1321{col 24}+{col 31} 0.7660{col 45} 0.7298{col 59}   0.4095{col 73} 0.9295
{txt}secqoi29me~d{col 14}{c |}{res}{col 16}1321{col 24}+{col 31} 0.8191{col 45} 0.7903{col 59}   0.4053{col 73} 0.9283
{txt}secqoi30me~d{col 14}{c |}{res}{col 16}1321{col 24}+{col 31} 0.7962{col 45} 0.7642{col 59}   0.4072{col 73} 0.9288
{txt}staffqoi20~d{col 14}{c |}{res}{col 16}1339{col 24}+{col 31} 0.2770{col 45} 0.2005{col 59}   0.4491{col 73} 0.9393
{txt}staffqoi24~d{col 14}{c |}{res}{col 16}1051{col 24}+{col 31} 0.6599{col 45} 0.6140{col 59}   0.4174{col 73} 0.9316
{txt}staffqoi41~d{col 14}{c |}{res}{col 16}1343{col 24}+{col 31} 0.6074{col 45} 0.5527{col 59}   0.4221{col 73} 0.9328
{txt}staffqoi44~d{col 14}{c |}{res}{col 16}1342{col 24}+{col 31} 0.7440{col 45} 0.7047{col 59}   0.4113{col 73} 0.9299
{txt}staffqoi64~d{col 14}{c |}{res}{col 16}1051{col 24}+{col 31} 0.7587{col 45} 0.7238{col 59}   0.4110{col 73} 0.9299
{txt}staffqoi87~d{col 14}{c |}{res}{col 16}1264{col 24}+{col 31} 0.6763{col 45} 0.6301{col 59}   0.4165{col 73} 0.9313
{txt}staffqoi98~d{col 14}{c |}{res}{col 16}1343{col 24}+{col 31} 0.6939{col 45} 0.6484{col 59}   0.4154{col 73} 0.9310
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.4174{col 73} 0.9348
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_school_climate", replace) modify open
{res}{txt}Note: File will be modified when {cmd:putexcel save} command is issued.

{com}. 
. putexcel A1 = ("School Climate Questions") A2 = ("Cronbach's Alpha") B2 = (r(alpha))
{res}{txt}
{com}. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation") ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")
{res}{txt}
{com}. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'
{txt}
{com}. matrix item_rest = r(ItemRestCorr)'
{txt}
{com}. matrix inter_item = r(MeanInterItemCorr)'
{txt}
{com}. matrix alpha_ex_item = r(Alpha)'
{txt}
{com}. 
. putexcel A5=matrix(item_test) ///
>   , rownames
{res}{txt}
{com}. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)
{res}{txt}
{com}. 
. clear matrix
{txt}
{com}. 
. putexcel save
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/alpha.xlsx} saved

{com}. 
. //Teacher and Staff Quality
. alpha parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled parentqoi33mean_pooled parentqoi34mean_pooled secqoi35mean_pooled secqoi36mean_pooled secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled secqoi40mean_pooled staffqoi103mean_pooled staffqoi104mean_pooled staffqoi105mean_pooled staffqoi109mean_pooled staffqoi111mean_pooled staffqoi112mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~0mean_po~d{col 14}{c |}{res}{col 16}1148{col 24}+{col 31} 0.6082{col 45} 0.5394{col 59}   0.3238{col 73} 0.8846
{txt}p~1mean_po~d{col 14}{c |}{res}{col 16}1258{col 24}+{col 31} 0.5778{col 45} 0.5028{col 59}   0.3261{col 73} 0.8856
{txt}p~2mean_po~d{col 14}{c |}{res}{col 16}1033{col 24}+{col 31} 0.5700{col 45} 0.4977{col 59}   0.3264{col 73} 0.8857
{txt}p~3mean_po~d{col 14}{c |}{res}{col 16}1259{col 24}+{col 31} 0.5365{col 45} 0.4565{col 59}   0.3296{col 73} 0.8872
{txt}parentqoi34~{col 14}{c |}{res}{col 16}1148{col 24}+{col 31} 0.5477{col 45} 0.4720{col 59}   0.3285{col 73} 0.8867
{txt}secqoi35me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.7294{col 45} 0.6739{col 59}   0.3131{col 73} 0.8794
{txt}secqoi36me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.7555{col 45} 0.7051{col 59}   0.3108{col 73} 0.8783
{txt}secqoi37me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.7159{col 45} 0.6598{col 59}   0.3143{col 73} 0.8800
{txt}secqoi38me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.6871{col 45} 0.6268{col 59}   0.3170{col 73} 0.8813
{txt}secqoi39me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.7411{col 45} 0.6882{col 59}   0.3120{col 73} 0.8789
{txt}secqoi40me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.6886{col 45} 0.6280{col 59}   0.3169{col 73} 0.8813
{txt}staffqoi103~{col 14}{c |}{res}{col 16}1342{col 24}+{col 31} 0.4404{col 45} 0.3507{col 59}   0.3394{col 73} 0.8916
{txt}staffqoi104~{col 14}{c |}{res}{col 16}1342{col 24}+{col 31} 0.4652{col 45} 0.3774{col 59}   0.3371{col 73} 0.8906
{txt}staffqoi105~{col 14}{c |}{res}{col 16}1342{col 24}+{col 31} 0.5548{col 45} 0.4762{col 59}   0.3293{col 73} 0.8871
{txt}staffqoi109~{col 14}{c |}{res}{col 16}1342{col 24}+{col 31} 0.5065{col 45} 0.4226{col 59}   0.3332{col 73} 0.8888
{txt}staffqoi111~{col 14}{c |}{res}{col 16}1342{col 24}+{col 31} 0.4924{col 45} 0.4074{col 59}   0.3349{col 73} 0.8896
{txt}staffqoi112~{col 14}{c |}{res}{col 16}1342{col 24}+{col 31} 0.6361{col 45} 0.5668{col 59}   0.3218{col 73} 0.8836
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.3244{col 73} 0.8909
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_teacher_quality", replace) modify open
{res}{txt}Note: File will be modified when {cmd:putexcel save} command is issued.

{com}. 
. putexcel A1 = ("Teacher and Staff Quality Questions") A2 = ("Cronbach's Alpha") B2 = (r(alpha))
{res}{txt}
{com}. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation") ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")
{res}{txt}
{com}. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'
{txt}
{com}. matrix item_rest = r(ItemRestCorr)'
{txt}
{com}. matrix inter_item = r(MeanInterItemCorr)'
{txt}
{com}. matrix alpha_ex_item = r(Alpha)'
{txt}
{com}. 
. putexcel A5=matrix(item_test) ///
>   , rownames
{res}{txt}
{com}. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)
{res}{txt}
{com}. 
. clear matrix
{txt}
{com}. 
. putexcel save
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/alpha.xlsx} saved

{com}. 
. //Support for Students
. alpha parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mean_pooled staffqoi128mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~5mean_po~d{col 14}{c |}{res}{col 16}1263{col 24}+{col 31} 0.7234{col 45} 0.4519{col 59}   0.3068{col 73} 0.5704
{txt}parentqoi6~d{col 14}{c |}{res}{col 16}1259{col 24}+{col 31} 0.6484{col 45} 0.3496{col 59}   0.3796{col 73} 0.6473
{txt}staffqoi10m~{col 14}{c |}{res}{col 16}1342{col 24}+{col 31} 0.7415{col 45} 0.4572{col 59}   0.2982{col 73} 0.5603
{txt}staffqoi12~d{col 14}{c |}{res}{col 16}1319{col 24}+{col 31} 0.7225{col 45} 0.4533{col 59}   0.3070{col 73} 0.5706
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.3231{col 73} 0.6562
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_student_support", replace) modify open
{res}{txt}Note: File will be modified when {cmd:putexcel save} command is issued.

{com}. 
. putexcel A1 = ("Student Support Questions") A2 = ("Cronbach's Alpha") B2 = (r(alpha))
{res}{txt}
{com}. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation") ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")
{res}{txt}
{com}. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'
{txt}
{com}. matrix item_rest = r(ItemRestCorr)'
{txt}
{com}. matrix inter_item = r(MeanInterItemCorr)'
{txt}
{com}. matrix alpha_ex_item = r(Alpha)'
{txt}
{com}. 
. putexcel A5=matrix(item_test) ///
>   , rownames
{res}{txt}
{com}. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)
{res}{txt}
{com}. 
. clear matrix
{txt}
{com}. 
. putexcel save
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/alpha.xlsx} saved

{com}. 
. //Student Motivation
. alpha secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled secqoi34mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
secqoi31me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.9400{col 45} 0.8920{col 59}   0.8322{col 73} 0.9370
{txt}secqoi32me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8830{col 45} 0.7954{col 59}   0.9049{col 73} 0.9661
{txt}secqoi33me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.9671{col 45} 0.9401{col 59}   0.7986{col 73} 0.9225
{txt}secqoi34me~d{col 14}{c |}{res}{col 16}1344{col 24}+{col 31} 0.9583{col 45} 0.9238{col 59}   0.8110{col 73} 0.9279
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.8367{col 73} 0.9535
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_student_motivation", replace) modify open
{res}{txt}Note: File will be modified when {cmd:putexcel save} command is issued.

{com}. 
. putexcel A1 = ("Student Motivation Questions") A2 = ("Cronbach's Alpha") B2 = (r(alpha))
{res}{txt}
{com}. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation") ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")
{res}{txt}
{com}. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'
{txt}
{com}. matrix item_rest = r(ItemRestCorr)'
{txt}
{com}. matrix inter_item = r(MeanInterItemCorr)'
{txt}
{com}. matrix alpha_ex_item = r(Alpha)'
{txt}
{com}. 
. putexcel A5=matrix(item_test) ///
>   , rownames
{res}{txt}
{com}. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)
{res}{txt}
{com}. 
. clear matrix
{txt}
{com}. 
. 
. putexcel save
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/alpha.xlsx} saved

{com}. putexcel clear
{res}{txt}
{com}. 
. 
. set trace off
{txt}
{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/alpha.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}31 Jul 2023, 21:45:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}