{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/alpha.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Apr 2022, 15:49:35
{txt}
{com}. 
. /* secondary */
. use $projdir/dta/buildanalysisdata/analysisready/secanalysisready, clear
{txt}(secondary pooled dataset ready for analysis with stats and response rate)

{com}. 
. /* std: standardize items in the scale to mean 0, variance 1
> item: display item-test and item-rest correlations*/
. alpha *mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
qoi22mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.6738{col 45} 0.6343{col 59}   0.6265{col 73} 0.9679
{txt}qoi23mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8620{col 45} 0.8429{col 59}   0.6076{col 73} 0.9654
{txt}qoi24mean_~d{col 14}{c |}{res}{col 16}3384{col 24}+{col 31} 0.8997{col 45} 0.8854{col 59}   0.6038{col 73} 0.9648
{txt}qoi25mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7875{col 45} 0.7599{col 59}   0.6151{col 73} 0.9664
{txt}qoi26mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8368{col 45} 0.8146{col 59}   0.6101{col 73} 0.9657
{txt}qoi27mean_~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.5922{col 45} 0.5458{col 59}   0.6341{col 73} 0.9689
{txt}qoi28mean_~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.8507{col 45} 0.8303{col 59}   0.6089{col 73} 0.9656
{txt}qoi29mean_~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.8814{col 45} 0.8649{col 59}   0.6059{col 73} 0.9651
{txt}qoi30mean_~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.8467{col 45} 0.8258{col 59}   0.6093{col 73} 0.9656
{txt}qoi31mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7689{col 45} 0.7392{col 59}   0.6169{col 73} 0.9667
{txt}qoi32mean_~d{col 14}{c |}{res}{col 16}3383{col 24}+{col 31} 0.6976{col 45} 0.6603{col 59}   0.6241{col 73} 0.9676
{txt}qoi33mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7906{col 45} 0.7630{col 59}   0.6148{col 73} 0.9664
{txt}qoi34mean_~d{col 14}{c |}{res}{col 16}3384{col 24}+{col 31} 0.7477{col 45} 0.7155{col 59}   0.6192{col 73} 0.9670
{txt}qoi35mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7829{col 45} 0.7546{col 59}   0.6156{col 73} 0.9665
{txt}qoi36mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8475{col 45} 0.8265{col 59}   0.6091{col 73} 0.9656
{txt}qoi37mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7052{col 45} 0.6689{col 59}   0.6234{col 73} 0.9675
{txt}qoi38mean_~d{col 14}{c |}{res}{col 16}3383{col 24}+{col 31} 0.8786{col 45} 0.8618{col 59}   0.6059{col 73} 0.9651
{txt}qoi39mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8265{col 45} 0.8032{col 59}   0.6113{col 73} 0.9659
{txt}qoi40mean_~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8543{col 45} 0.8343{col 59}   0.6086{col 73} 0.9655
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.6142{col 73} 0.9680
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. //copy and paste results table and text to column in excel
. 
. 
. /* parent */
. use $projdir/dta/buildanalysisdata/analysisready/parentanalysisready, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. alpha *mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
qoi9mean_p~d{col 14}{c |}{res}{col 16}2784{col 24}+{col 31} 0.8602{col 45} 0.8227{col 59}   0.6303{col 73} 0.9446
{txt}qoi15mean_~d{col 14}{c |}{res}{col 16}2786{col 24}+{col 31} 0.7725{col 45} 0.7172{col 59}   0.6488{col 73} 0.9487
{txt}qoi16mean_~d{col 14}{c |}{res}{col 16}2785{col 24}+{col 31} 0.8919{col 45} 0.8620{col 59}   0.6229{col 73} 0.9429
{txt}qoi17mean_~d{col 14}{c |}{res}{col 16}2786{col 24}+{col 31} 0.8675{col 45} 0.8333{col 59}   0.6288{col 73} 0.9443
{txt}qoi27mean_~d{col 14}{c |}{res}{col 16}2786{col 24}+{col 31} 0.8459{col 45} 0.8070{col 59}   0.6335{col 73} 0.9453
{txt}qoi30mean_~d{col 14}{c |}{res}{col 16}2505{col 24}+{col 31} 0.8782{col 45} 0.8468{col 59}   0.6272{col 73} 0.9439
{txt}qoi31mean_~d{col 14}{c |}{res}{col 16}2778{col 24}+{col 31} 0.9034{col 45} 0.8770{col 59}   0.6211{col 73} 0.9425
{txt}qoi32mean_~d{col 14}{c |}{res}{col 16}2262{col 24}+{col 31} 0.7757{col 45} 0.7219{col 59}   0.6452{col 73} 0.9479
{txt}qoi33mean_~d{col 14}{c |}{res}{col 16}2781{col 24}+{col 31} 0.8114{col 45} 0.7632{col 59}   0.6403{col 73} 0.9468
{txt}qoi34mean_~d{col 14}{c |}{res}{col 16}2505{col 24}+{col 31} 0.8733{col 45} 0.8406{col 59}   0.6280{col 73} 0.9441
{txt}qoi64mean_~d{col 14}{c |}{res}{col 16}2753{col 24}+{col 31} 0.5423{col 45} 0.4516{col 59}   0.6961{col 73} 0.9582
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.6384{col 73} 0.9510
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. 
. /* staff */
. use $projdir/dta/buildanalysisdata/analysisready/staffanalysisready, clear
{txt}(weighted average staff qoi statistics pooled over years)

{com}. alpha *mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
qoi10mean_~d{col 14}{c |}{res}{col 16}4199{col 24}+{col 31} 0.4790{col 45} 0.3785{col 59}   0.3317{col 73} 0.8742
{txt}qoi20mean_~d{col 14}{c |}{res}{col 16}4194{col 24}+{col 31} 0.4674{col 45} 0.3667{col 59}   0.3327{col 73} 0.8747
{txt}qoi24mean_~d{col 14}{c |}{res}{col 16}3036{col 24}+{col 31} 0.7494{col 45} 0.6908{col 59}   0.3064{col 73} 0.8608
{txt}qoi41mean_~d{col 14}{c |}{res}{col 16}4199{col 24}+{col 31} 0.6354{col 45} 0.5539{col 59}   0.3148{col 73} 0.8655
{txt}qoi44mean_~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.7226{col 45} 0.6546{col 59}   0.3049{col 73} 0.8600
{txt}qoi64mean_~d{col 14}{c |}{res}{col 16}3035{col 24}+{col 31} 0.7287{col 45} 0.6668{col 59}   0.3080{col 73} 0.8617
{txt}qoi87mean_~d{col 14}{c |}{res}{col 16}3828{col 24}+{col 31} 0.6760{col 45} 0.6026{col 59}   0.3108{col 73} 0.8632
{txt}qoi98mean_~d{col 14}{c |}{res}{col 16}4199{col 24}+{col 31} 0.4812{col 45} 0.3822{col 59}   0.3306{col 73} 0.8737
{txt}qoi103mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.5715{col 45} 0.4810{col 59}   0.3230{col 73} 0.8698
{txt}qoi104mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.5793{col 45} 0.4902{col 59}   0.3220{col 73} 0.8693
{txt}qoi105mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.6244{col 45} 0.5413{col 59}   0.3169{col 73} 0.8666
{txt}qoi109mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.6118{col 45} 0.5279{col 59}   0.3184{col 73} 0.8674
{txt}qoi111mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.6139{col 45} 0.5298{col 59}   0.3180{col 73} 0.8672
{txt}qoi112mean~d{col 14}{c |}{res}{col 16}4197{col 24}+{col 31} 0.7455{col 45} 0.6835{col 59}   0.3040{col 73} 0.8594
{txt}qoi128mean~d{col 14}{c |}{res}{col 16}4058{col 24}+{col 31} 0.4359{col 45} 0.3274{col 59}   0.3359{col 73} 0.8763
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.3185{col 73} 0.8752
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. 
. 
. 
. 
. /* Alpha for question classifications  */
. use $projdir/dta/allsvyfactor/allsvyqoimeans, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. //School Climate
. alpha parentqoi9mean_pooled parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27mean_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled secqoi25mean_pooled secqoi26mean_pooled secqoi27mean_pooled secqoi28mean_pooled secqoi29mean_pooled secqoi30mean_pooled staffqoi20mean_pooled staffqoi24mean_pooled staffqoi41mean_pooled staffqoi44mean_pooled staffqoi64mean_pooled staffqoi87mean_pooled staffqoi98mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
parentqoi9~d{col 14}{c |}{res}{col 16} 414{col 24}+{col 31} 0.6194{col 45} 0.5697{col 59}   0.5149{col 73} 0.9528
{txt}p~6mean_po~d{col 14}{c |}{res}{col 16} 414{col 24}+{col 31} 0.6319{col 45} 0.5852{col 59}   0.5145{col 73} 0.9527
{txt}parentqoi17~{col 14}{c |}{res}{col 16} 414{col 24}+{col 31} 0.5354{col 45} 0.4799{col 59}   0.5204{col 73} 0.9537
{txt}parentqoi2~d{col 14}{c |}{res}{col 16} 414{col 24}+{col 31} 0.5884{col 45} 0.5372{col 59}   0.5171{col 73} 0.9531
{txt}secqoi22me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.5496{col 45} 0.4663{col 59}   0.5281{col 73} 0.9551
{txt}secqoi23me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8081{col 45} 0.7683{col 59}   0.4993{col 73} 0.9499
{txt}secqoi24me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8426{col 45} 0.8109{col 59}   0.4955{col 73} 0.9491
{txt}secqoi25me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8150{col 45} 0.7753{col 59}   0.4980{col 73} 0.9496
{txt}secqoi26me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8368{col 45} 0.7998{col 59}   0.4947{col 73} 0.9490
{txt}secqoi27me~d{col 14}{c |}{res}{col 16} 911{col 24}+{col 31} 0.7910{col 45} 0.7477{col 59}   0.4991{col 73} 0.9498
{txt}secqoi28me~d{col 14}{c |}{res}{col 16} 911{col 24}+{col 31} 0.7742{col 45} 0.7254{col 59}   0.5017{col 73} 0.9503
{txt}secqoi29me~d{col 14}{c |}{res}{col 16} 911{col 24}+{col 31} 0.8564{col 45} 0.8246{col 59}   0.4931{col 73} 0.9487
{txt}secqoi30me~d{col 14}{c |}{res}{col 16} 911{col 24}+{col 31} 0.8501{col 45} 0.8178{col 59}   0.4942{col 73} 0.9489
{txt}staffqoi20~d{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.5185{col 45} 0.4550{col 59}   0.5267{col 73} 0.9548
{txt}staffqoi24~d{col 14}{c |}{res}{col 16} 438{col 24}+{col 31} 0.6894{col 45} 0.6456{col 59}   0.5102{col 73} 0.9519
{txt}staffqoi41~d{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.6844{col 45} 0.6358{col 59}   0.5111{col 73} 0.9521
{txt}staffqoi44~d{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.7821{col 45} 0.7456{col 59}   0.5042{col 73} 0.9508
{txt}staffqoi64~d{col 14}{c |}{res}{col 16} 438{col 24}+{col 31} 0.7824{col 45} 0.7511{col 59}   0.5043{col 73} 0.9508
{txt}staffqoi87~d{col 14}{c |}{res}{col 16} 546{col 24}+{col 31} 0.7108{col 45} 0.6683{col 59}   0.5095{col 73} 0.9518
{txt}staffqoi98~d{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.7054{col 45} 0.6603{col 59}   0.5099{col 73} 0.9519
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.5075{col 73} 0.9537
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. 
. //Teacher and Staff Quality
. alpha parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled parentqoi33mean_pooled parentqoi34mean_pooled secqoi35mean_pooled secqoi36mean_pooled secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled secqoi40mean_pooled staffqoi103mean_pooled staffqoi104mean_pooled staffqoi105mean_pooled staffqoi109mean_pooled staffqoi111mean_pooled staffqoi112mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~0mean_po~d{col 14}{c |}{res}{col 16} 369{col 24}+{col 31} 0.6454{col 45} 0.5857{col 59}   0.4253{col 73} 0.9221
{txt}p~1mean_po~d{col 14}{c |}{res}{col 16} 414{col 24}+{col 31} 0.5834{col 45} 0.5135{col 59}   0.4299{col 73} 0.9234
{txt}p~2mean_po~d{col 14}{c |}{res}{col 16} 333{col 24}+{col 31} 0.6894{col 45} 0.6357{col 59}   0.4218{col 73} 0.9211
{txt}p~3mean_po~d{col 14}{c |}{res}{col 16} 414{col 24}+{col 31} 0.6211{col 45} 0.5533{col 59}   0.4265{col 73} 0.9225
{txt}parentqoi34~{col 14}{c |}{res}{col 16} 369{col 24}+{col 31} 0.6347{col 45} 0.5723{col 59}   0.4265{col 73} 0.9225
{txt}secqoi35me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8321{col 45} 0.7929{col 59}   0.3996{col 73} 0.9142
{txt}secqoi36me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8527{col 45} 0.8184{col 59}   0.3976{col 73} 0.9135
{txt}secqoi37me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.7926{col 45} 0.7418{col 59}   0.4058{col 73} 0.9162
{txt}secqoi38me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8533{col 45} 0.8178{col 59}   0.3971{col 73} 0.9133
{txt}secqoi39me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8419{col 45} 0.8018{col 59}   0.3982{col 73} 0.9137
{txt}secqoi40me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8134{col 45} 0.7678{col 59}   0.4036{col 73} 0.9154
{txt}staffqoi103~{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.4426{col 45} 0.3506{col 59}   0.4476{col 73} 0.9284
{txt}staffqoi104~{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.5054{col 45} 0.4221{col 59}   0.4423{col 73} 0.9269
{txt}staffqoi105~{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.6279{col 45} 0.5588{col 59}   0.4293{col 73} 0.9233
{txt}staffqoi109~{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.5850{col 45} 0.5107{col 59}   0.4351{col 73} 0.9249
{txt}staffqoi111~{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.4928{col 45} 0.4080{col 59}   0.4421{col 73} 0.9269
{txt}staffqoi112~{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.6899{col 45} 0.6283{col 59}   0.4229{col 73} 0.9214
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.4209{col 73} 0.9251
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. //Support for Students
. alpha parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mean_pooled staffqoi128mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~5mean_po~d{col 14}{c |}{res}{col 16} 414{col 24}+{col 31} 0.7753{col 45} 0.5316{col 59}   0.3678{col 73} 0.6357
{txt}parentqoi6~d{col 14}{c |}{res}{col 16} 411{col 24}+{col 31} 0.7366{col 45} 0.4709{col 59}   0.4057{col 73} 0.6719
{txt}staffqoi10m~{col 14}{c |}{res}{col 16} 593{col 24}+{col 31} 0.8167{col 45} 0.5028{col 59}   0.3732{col 73} 0.6411
{txt}staffqoi12~d{col 14}{c |}{res}{col 16} 587{col 24}+{col 31} 0.7867{col 45} 0.4976{col 59}   0.3684{col 73} 0.6364
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.3793{col 73} 0.7097
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. //Student Motivation
. alpha secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled secqoi34mean_pooled, std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
secqoi31me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8657{col 45} 0.7599{col 59}   0.7563{col 73} 0.9030
{txt}secqoi32me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.8041{col 45} 0.6609{col 59}   0.8295{col 73} 0.9359
{txt}secqoi33me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.9648{col 45} 0.9335{col 59}   0.6385{col 73} 0.8412
{txt}secqoi34me~d{col 14}{c |}{res}{col 16} 932{col 24}+{col 31} 0.9306{col 45} 0.8714{col 59}   0.6791{col 73} 0.8639
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.7259{col 73} 0.9137
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/alpha.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Apr 2022, 15:49:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}