-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/alpha.smcl
  log type:  smcl
 opened on:  31 Jul 2023, 21:45:34

. 
. /* Alpha for surveys  */
. 
. /* secondary */
. use $projdir/dta/buildanalysisdata/analysisready/secanalysisready, clear
(secondary pooled dataset ready for analysis with stats and response rate)

. 
. /* std: standardize items in the scale to mean 0, variance 1
> item: display item-test and item-rest correlations*/
. alpha *mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
qoi22mean_~d | 3385    +       0.6738        0.6343          0.6265      0.9679
qoi23mean_~d | 3385    +       0.8620        0.8429          0.6076      0.9654
qoi24mean_~d | 3384    +       0.8997        0.8854          0.6038      0.9648
qoi25mean_~d | 3385    +       0.7875        0.7599          0.6151      0.9664
qoi26mean_~d | 3385    +       0.8368        0.8146          0.6101      0.9657
qoi27mean_~d | 3276    +       0.5922        0.5458          0.6341      0.9689
qoi28mean_~d | 3276    +       0.8507        0.8303          0.6089      0.9656
qoi29mean_~d | 3276    +       0.8814        0.8649          0.6059      0.9651
qoi30mean_~d | 3276    +       0.8467        0.8258          0.6093      0.9656
qoi31mean_~d | 3385    +       0.7689        0.7392          0.6169      0.9667
qoi32mean_~d | 3383    +       0.6976        0.6603          0.6241      0.9676
qoi33mean_~d | 3385    +       0.7906        0.7630          0.6148      0.9664
qoi34mean_~d | 3384    +       0.7477        0.7155          0.6192      0.9670
qoi35mean_~d | 3385    +       0.7829        0.7546          0.6156      0.9665
qoi36mean_~d | 3385    +       0.8475        0.8265          0.6091      0.9656
qoi37mean_~d | 3385    +       0.7052        0.6689          0.6234      0.9675
qoi38mean_~d | 3383    +       0.8786        0.8618          0.6059      0.9651
qoi39mean_~d | 3385    +       0.8265        0.8032          0.6113      0.9659
qoi40mean_~d | 3385    +       0.8543        0.8343          0.6086      0.9655
-------------+-----------------------------------------------------------------
Test scale   |                                               0.6142      0.9680
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_sec", r
> eplace) replace
Note: File will be replaced when the first putexcel command is issued.

. 
. putexcel A1 = ("Secondary Survey QOI") A2 = ("Cronbach's Alpha") B2 = (r(alph
> a))
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. clear matrix

. 
. putexcel save

. 
. /* parent */
. use $projdir/dta/buildanalysisdata/analysisready/parentanalysisready, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. alpha *mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
qoi9mean_p~d | 2784    +       0.8602        0.8227          0.6303      0.9446
qoi15mean_~d | 2786    +       0.7725        0.7172          0.6488      0.9487
qoi16mean_~d | 2785    +       0.8919        0.8620          0.6229      0.9429
qoi17mean_~d | 2786    +       0.8675        0.8333          0.6288      0.9443
qoi27mean_~d | 2786    +       0.8459        0.8070          0.6335      0.9453
qoi30mean_~d | 2505    +       0.8782        0.8468          0.6272      0.9439
qoi31mean_~d | 2778    +       0.9034        0.8770          0.6211      0.9425
qoi32mean_~d | 2262    +       0.7757        0.7219          0.6452      0.9479
qoi33mean_~d | 2781    +       0.8114        0.7632          0.6403      0.9468
qoi34mean_~d | 2505    +       0.8733        0.8406          0.6280      0.9441
qoi64mean_~d | 2753    +       0.5423        0.4516          0.6961      0.9582
-------------+-----------------------------------------------------------------
Test scale   |                                               0.6384      0.9510
-------------------------------------------------------------------------------

. 
. // use the open option so that stata writes to working memory, otherwise ther
> e are problems with changes not saving 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_parent"
> , replace) modify open
Note: File will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("Parent Survey QOI") A2 = ("Cronbach's Alpha") B2= (r(alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. 
. /* staff */
. use $projdir/dta/buildanalysisdata/analysisready/staffanalysisready, clear
(weighted average staff qoi statistics pooled over years)

. alpha *mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
qoi10mean_~d | 4199    +       0.4790        0.3785          0.3317      0.8742
qoi20mean_~d | 4194    +       0.4674        0.3667          0.3327      0.8747
qoi24mean_~d | 3036    +       0.7494        0.6908          0.3064      0.8608
qoi41mean_~d | 4199    +       0.6354        0.5539          0.3148      0.8655
qoi44mean_~d | 4197    +       0.7226        0.6546          0.3049      0.8600
qoi64mean_~d | 3035    +       0.7287        0.6668          0.3080      0.8617
qoi87mean_~d | 3828    +       0.6760        0.6026          0.3108      0.8632
qoi98mean_~d | 4199    +       0.4812        0.3822          0.3306      0.8737
qoi103mean~d | 4197    +       0.5715        0.4810          0.3230      0.8698
qoi104mean~d | 4197    +       0.5793        0.4902          0.3220      0.8693
qoi105mean~d | 4197    +       0.6244        0.5413          0.3169      0.8666
qoi109mean~d | 4197    +       0.6118        0.5279          0.3184      0.8674
qoi111mean~d | 4197    +       0.6139        0.5298          0.3180      0.8672
qoi112mean~d | 4197    +       0.7455        0.6835          0.3040      0.8594
qoi128mean~d | 4058    +       0.4359        0.3274          0.3359      0.8763
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3185      0.8752
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_staff",
>  replace) modify open
Note: File will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("Staff Survey QOI") A2 = ("Cronbach's Alpha") B2 = (r(alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. /* Alpha for question classifications  */
. use $projdir/dta/allsvyfactor/allsvyqoimeans, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. 
. //School Climate
. alpha parentqoi9mean_pooled parentqoi16mean_pooled parentqoi17mean_pooled par
> entqoi27mean_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pool
> ed secqoi25mean_pooled secqoi26mean_pooled secqoi27mean_pooled secqoi28mean_p
> ooled secqoi29mean_pooled secqoi30mean_pooled staffqoi20mean_pooled staffqoi2
> 4mean_pooled staffqoi41mean_pooled staffqoi44mean_pooled staffqoi64mean_poole
> d staffqoi87mean_pooled staffqoi98mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
parentqoi9~d | 1263    +       0.5237        0.4636          0.4285      0.9344
p~6mean_po~d | 1262    +       0.5925        0.5389          0.4233      0.9331
parentqoi17~ | 1262    +       0.4740        0.4109          0.4325      0.9354
parentqoi2~d | 1262    +       0.5491        0.4915          0.4267      0.9340
secqoi22me~d | 1345    +       0.5189        0.4572          0.4300      0.9348
secqoi23me~d | 1345    +       0.7709        0.7349          0.4093      0.9294
secqoi24me~d | 1345    +       0.8006        0.7683          0.4067      0.9287
secqoi25me~d | 1345    +       0.7521        0.7130          0.4104      0.9297
secqoi26me~d | 1345    +       0.8399        0.8132          0.4036      0.9278
secqoi27me~d | 1321    +       0.7354        0.6961          0.4120      0.9301
secqoi28me~d | 1321    +       0.7660        0.7298          0.4095      0.9295
secqoi29me~d | 1321    +       0.8191        0.7903          0.4053      0.9283
secqoi30me~d | 1321    +       0.7962        0.7642          0.4072      0.9288
staffqoi20~d | 1339    +       0.2770        0.2005          0.4491      0.9393
staffqoi24~d | 1051    +       0.6599        0.6140          0.4174      0.9316
staffqoi41~d | 1343    +       0.6074        0.5527          0.4221      0.9328
staffqoi44~d | 1342    +       0.7440        0.7047          0.4113      0.9299
staffqoi64~d | 1051    +       0.7587        0.7238          0.4110      0.9299
staffqoi87~d | 1264    +       0.6763        0.6301          0.4165      0.9313
staffqoi98~d | 1343    +       0.6939        0.6484          0.4154      0.9310
-------------+-----------------------------------------------------------------
Test scale   |                                               0.4174      0.9348
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_school_
> climate", replace) modify open
Note: File will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("School Climate Questions") A2 = ("Cronbach's Alpha") B2 = (r(
> alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. //Teacher and Staff Quality
. alpha parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled pa
> rentqoi33mean_pooled parentqoi34mean_pooled secqoi35mean_pooled secqoi36mean_
> pooled secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled secqoi40me
> an_pooled staffqoi103mean_pooled staffqoi104mean_pooled staffqoi105mean_poole
> d staffqoi109mean_pooled staffqoi111mean_pooled staffqoi112mean_pooled, std i
> tem

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~0mean_po~d | 1148    +       0.6082        0.5394          0.3238      0.8846
p~1mean_po~d | 1258    +       0.5778        0.5028          0.3261      0.8856
p~2mean_po~d | 1033    +       0.5700        0.4977          0.3264      0.8857
p~3mean_po~d | 1259    +       0.5365        0.4565          0.3296      0.8872
parentqoi34~ | 1148    +       0.5477        0.4720          0.3285      0.8867
secqoi35me~d | 1345    +       0.7294        0.6739          0.3131      0.8794
secqoi36me~d | 1345    +       0.7555        0.7051          0.3108      0.8783
secqoi37me~d | 1345    +       0.7159        0.6598          0.3143      0.8800
secqoi38me~d | 1345    +       0.6871        0.6268          0.3170      0.8813
secqoi39me~d | 1345    +       0.7411        0.6882          0.3120      0.8789
secqoi40me~d | 1345    +       0.6886        0.6280          0.3169      0.8813
staffqoi103~ | 1342    +       0.4404        0.3507          0.3394      0.8916
staffqoi104~ | 1342    +       0.4652        0.3774          0.3371      0.8906
staffqoi105~ | 1342    +       0.5548        0.4762          0.3293      0.8871
staffqoi109~ | 1342    +       0.5065        0.4226          0.3332      0.8888
staffqoi111~ | 1342    +       0.4924        0.4074          0.3349      0.8896
staffqoi112~ | 1342    +       0.6361        0.5668          0.3218      0.8836
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3244      0.8909
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_teacher
> _quality", replace) modify open
Note: File will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("Teacher and Staff Quality Questions") A2 = ("Cronbach's Alpha
> ") B2 = (r(alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. //Support for Students
. alpha parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mean_pooled sta
> ffqoi128mean_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~5mean_po~d | 1263    +       0.7234        0.4519          0.3068      0.5704
parentqoi6~d | 1259    +       0.6484        0.3496          0.3796      0.6473
staffqoi10m~ | 1342    +       0.7415        0.4572          0.2982      0.5603
staffqoi12~d | 1319    +       0.7225        0.4533          0.3070      0.5706
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3231      0.6562
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_student
> _support", replace) modify open
Note: File will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("Student Support Questions") A2 = ("Cronbach's Alpha") B2 = (r
> (alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. 
. //Student Motivation
. alpha secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled secqoi34mea
> n_pooled, std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
secqoi31me~d | 1345    +       0.9400        0.8920          0.8322      0.9370
secqoi32me~d | 1345    +       0.8830        0.7954          0.9049      0.9661
secqoi33me~d | 1345    +       0.9671        0.9401          0.7986      0.9225
secqoi34me~d | 1344    +       0.9583        0.9238          0.8110      0.9279
-------------+-----------------------------------------------------------------
Test scale   |                                               0.8367      0.9535
-------------------------------------------------------------------------------

. 
. putexcel set $projdir/out/csv/factoranalysis/alpha.xlsx, sheet("alpha_student
> _motivation", replace) modify open
Note: File will be modified when putexcel save command is issued.

. 
. putexcel A1 = ("Student Motivation Questions") A2 = ("Cronbach's Alpha") B2 =
>  (r(alpha))

. putexcel A4=("Item") B4=("Item Test Correlation") C4=("Item Rest Correlation"
> ) ///
>   D4=("Inter-Item Correlation") E4=("Alpha Excluding Item")

. 
. //transpose the return matrices
. matrix item_test = r(ItemTestCorr)'

. matrix item_rest = r(ItemRestCorr)'

. matrix inter_item = r(MeanInterItemCorr)'

. matrix alpha_ex_item = r(Alpha)'

. 
. putexcel A5=matrix(item_test) ///
>   , rownames

. putexcel C5=matrix(item_rest) ///
>   D5=matrix(inter_item) ///
>   E5=matrix(alpha_ex_item)

. 
. clear matrix

. 
. 
. putexcel save
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/factoranalysis/a
> lpha.xlsx saved

. putexcel clear

. 
. 
. set trace off

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/alpha.smcl
  log type:  smcl
 closed on:  31 Jul 2023, 21:45:35
-------------------------------------------------------------------------------
