-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/indexhorserace.smcl
  log type:  smcl
 opened on:   7 Apr 2022, 14:57:52

. 
. /////////////////////////////////////////////////////////////////////////////
> ///
> /* complete case analysis  */
. 
. 
. use $projdir/dta/allsvyfactor/categoryindex/compcasecategoryindex, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. 
. //local macro for VA vars in z scores
. local vasdvars z_va_ela z_va_math z_va_enr z_va_enrela z_va_enrmath z_va_enrd
> k z_va_2yr z_va_2yrela z_va_2yrmath z_va_2yrdk z_va_4yr z_va_4yrela z_va_4yrm
> ath z_va_4yrdk

. 
. //local macro for z score index vars
. local indexsdvars z_climateindex z_qualityindex z_supportindex

. 
. // regress va vars on index vars
. foreach i of local vasdvars {
  2.   local append replace
  3. 
.   eststo: reg `i' `indexsdvars'
  4. 
.   local append append
  5. }

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      6.59
       Model |  18.0307781         3  6.01025938   Prob > F        =    0.0003
    Residual |  262.540536       288  .911599084   R-squared       =    0.0643
-------------+----------------------------------   Adj R-squared   =    0.0545
       Total |  280.571314       291  .964162592   Root MSE        =    .95478

------------------------------------------------------------------------------
    z_va_ela | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .2599395   .1354908     1.92   0.056    -.0067382    .5266172
z_qualityi~x |  -.0786621     .14348    -0.55   0.584    -.3610645    .2037403
z_supporti~x |   .0858614   .0764097     1.12   0.262    -.0645309    .2362536
       _cons |  -.0130516   .0561897    -0.23   0.816    -.1236462    .0975431
------------------------------------------------------------------------------
(est1 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =     15.36
       Model |  36.4889552         3  12.1629851   Prob > F        =    0.0000
    Residual |  228.070565       288  .791911683   R-squared       =    0.1379
-------------+----------------------------------   Adj R-squared   =    0.1289
       Total |   264.55952       291  .909139244   Root MSE        =    .88989

------------------------------------------------------------------------------
   z_va_math | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .4810994   .1262834     3.81   0.000      .232544    .7296547
z_qualityi~x |  -.1705954   .1337297    -1.28   0.203    -.4338069    .0926161
z_supporti~x |   .0394461   .0712172     0.55   0.580    -.1007261    .1796183
       _cons |   .0458346   .0523713     0.88   0.382    -.0572445    .1489136
------------------------------------------------------------------------------
(est2 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      7.96
       Model |  22.4679406         3  7.48931354   Prob > F        =    0.0000
    Residual |  271.072973       288  .941225602   R-squared       =    0.0765
-------------+----------------------------------   Adj R-squared   =    0.0669
       Total |  293.540914       291  1.00873166   Root MSE        =    .97017

------------------------------------------------------------------------------
    z_va_enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .4966697   .1376749     3.61   0.000     .2256932    .7676462
z_qualityi~x |  -.4961103   .1457929    -3.40   0.001     -.783065   -.2091556
z_supporti~x |   .1954197   .0776414     2.52   0.012     .0426032    .3482363
       _cons |   .1473192   .0570955     2.58   0.010     .0349418    .2596966
------------------------------------------------------------------------------
(est3 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      5.51
       Model |  16.9646204         3  5.65487348   Prob > F        =    0.0011
    Residual |  295.551244       288   1.0262196   R-squared       =    0.0543
-------------+----------------------------------   Adj R-squared   =    0.0444
       Total |  312.515864       291  1.07393768   Root MSE        =     1.013

------------------------------------------------------------------------------
 z_va_enrela | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .4610388   .1437566     3.21   0.001     .1780919    .7439857
z_qualityi~x |  -.4845089   .1522333    -3.18   0.002    -.7841398    -.184878
z_supporti~x |   .1650698   .0810712     2.04   0.043     .0055026     .324637
       _cons |   .1617525   .0596177     2.71   0.007     .0444108    .2790941
------------------------------------------------------------------------------
(est4 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      4.32
       Model |  12.6964435         3  4.23214782   Prob > F        =    0.0053
    Residual |  282.170463       288  .979758551   R-squared       =    0.0431
-------------+----------------------------------   Adj R-squared   =    0.0331
       Total |  294.866906       291  1.01328834   Root MSE        =    .98983

------------------------------------------------------------------------------
z_va_enrmath | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .3793902   .1404647     2.70   0.007     .1029226    .6558578
z_qualityi~x |  -.4627368   .1487473    -3.11   0.002    -.7555064   -.1699672
z_supporti~x |   .1683786   .0792147     2.13   0.034     .0124654    .3242919
       _cons |   .1490122   .0582525     2.56   0.011     .0343576    .2636669
------------------------------------------------------------------------------
(est5 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      4.30
       Model |  12.7033282         3  4.23444273   Prob > F        =    0.0055
    Residual |   283.63691       288  .984850382   R-squared       =    0.0429
-------------+----------------------------------   Adj R-squared   =    0.0329
       Total |  296.340238       291  1.01835133   Root MSE        =     .9924

------------------------------------------------------------------------------
  z_va_enrdk | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .3802284   .1408293     2.70   0.007     .1030433    .6574135
z_qualityi~x |  -.4636353   .1491333    -3.11   0.002    -.7571647   -.1701059
z_supporti~x |   .1679308   .0794203     2.11   0.035      .011613    .3242487
       _cons |   .1506894   .0584037     2.58   0.010     .0357372    .2656416
------------------------------------------------------------------------------
(est6 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      1.48
       Model |  3.99256914         3  1.33085638   Prob > F        =    0.2193
    Residual |  258.436929       288  .897350447   R-squared       =    0.0152
-------------+----------------------------------   Adj R-squared   =    0.0050
       Total |  262.429498       291  .901819581   Root MSE        =    .94729

------------------------------------------------------------------------------
    z_va_2yr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1142074   .1344277     0.85   0.396    -.1503779    .3787928
z_qualityi~x |   -.247196   .1423543    -1.74   0.084    -.5273827    .0329907
z_supporti~x |    .063542   .0758102     0.84   0.403    -.0856703    .2127542
       _cons |   .2409721   .0557489     4.32   0.000     .1312452     .350699
------------------------------------------------------------------------------
(est7 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      1.40
       Model |  3.76012904         3  1.25337635   Prob > F        =    0.2434
    Residual |  258.121779       288  .896256178   R-squared       =    0.0144
-------------+----------------------------------   Adj R-squared   =    0.0041
       Total |  261.881908       291  .899937829   Root MSE        =    .94671

------------------------------------------------------------------------------
 z_va_2yrela | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1222284   .1343457     0.91   0.364    -.1421956    .3866524
z_qualityi~x |  -.2448443   .1422674    -1.72   0.086    -.5248601    .0351715
z_supporti~x |   .0526548   .0757639     0.69   0.488    -.0964664    .2017761
       _cons |   .2418511   .0557149     4.34   0.000     .1321911    .3515111
------------------------------------------------------------------------------
(est8 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      1.28
       Model |  3.45068106         3  1.15022702   Prob > F        =    0.2824
    Residual |  259.388727       288  .900655302   R-squared       =    0.0131
-------------+----------------------------------   Adj R-squared   =    0.0028
       Total |  262.839408       291  .903228206   Root MSE        =    .94903

------------------------------------------------------------------------------
z_va_2yrmath | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1447285    .134675     1.07   0.283    -.1203437    .4098006
z_qualityi~x |  -.2528814   .1426162    -1.77   0.077    -.5335836    .0278207
z_supporti~x |    .054018   .0759497     0.71   0.478    -.0954687    .2035048
       _cons |   .2435374   .0558514     4.36   0.000     .1336086    .3534662
------------------------------------------------------------------------------
(est9 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      1.29
       Model |  3.49860967         3  1.16620322   Prob > F        =    0.2780
    Residual |  260.328096       288  .903916999   R-squared       =    0.0133
-------------+----------------------------------   Adj R-squared   =    0.0030
       Total |  263.826705       291  .906620981   Root MSE        =    .95075

------------------------------------------------------------------------------
  z_va_2yrdk | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1460207   .1349187     1.08   0.280     -.119531    .4115724
z_qualityi~x |  -.2542721   .1428742    -1.78   0.076    -.5354821    .0269379
z_supporti~x |   .0524085   .0760871     0.69   0.492    -.0973487    .2021657
       _cons |   .2467256   .0559525     4.41   0.000      .136598    .3568533
------------------------------------------------------------------------------
(est10 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      7.54
       Model |  16.8341975         3  5.61139916   Prob > F        =    0.0001
    Residual |  214.233195       288   .74386526   R-squared       =    0.0729
-------------+----------------------------------   Adj R-squared   =    0.0632
       Total |  231.067392       291  .794046022   Root MSE        =    .86248

------------------------------------------------------------------------------
    z_va_4yr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .3191957   .1223925     2.61   0.010     .0782984     .560093
z_qualityi~x |  -.2027695   .1296094    -1.56   0.119    -.4578713    .0523323
z_supporti~x |   .1255834    .069023     1.82   0.070      -.01027    .2614368
       _cons |  -.1287944   .0507577    -2.54   0.012    -.2286976   -.0288913
------------------------------------------------------------------------------
(est11 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      4.49
       Model |  10.9372472         3  3.64574906   Prob > F        =    0.0043
    Residual |  234.042213       288  .812646574   R-squared       =    0.0446
-------------+----------------------------------   Adj R-squared   =    0.0347
       Total |   244.97946       291  .841853816   Root MSE        =    .90147

------------------------------------------------------------------------------
 z_va_4yrela | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .2658283   .1279259     2.08   0.039       .01404    .5176167
z_qualityi~x |  -.1815165   .1354691    -1.34   0.181    -.4481516    .0851186
z_supporti~x |   .1072232   .0721435     1.49   0.138    -.0347722    .2492187
       _cons |  -.1266624   .0530525    -2.39   0.018    -.2310823   -.0222426
------------------------------------------------------------------------------
(est12 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      2.17
       Model |  5.26830943         3  1.75610314   Prob > F        =    0.0916
    Residual |  232.991383       288  .808997859   R-squared       =    0.0221
-------------+----------------------------------   Adj R-squared   =    0.0119
       Total |  238.259693       291  .818761831   Root MSE        =    .89944

------------------------------------------------------------------------------
z_va_4yrmath | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1603548   .1276384     1.26   0.210    -.0908677    .4115772
z_qualityi~x |  -.1403494   .1351647    -1.04   0.300    -.4063852    .1256864
z_supporti~x |    .108545   .0719814     1.51   0.133    -.0331313    .2502213
       _cons |  -.1498139   .0529333    -2.83   0.005     -.253999   -.0456288
------------------------------------------------------------------------------
(est13 stored)

      Source |       SS           df       MS      Number of obs   =       292
-------------+----------------------------------   F(3, 288)       =      2.23
       Model |  5.36305505         3  1.78768502   Prob > F        =    0.0851
    Residual |  231.088616       288  .802391027   R-squared       =    0.0227
-------------+----------------------------------   Adj R-squared   =    0.0125
       Total |  236.451671       291  .812548697   Root MSE        =    .89576

------------------------------------------------------------------------------
  z_va_4yrdk | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1601913   .1271162     1.26   0.209    -.0900032    .4103859
z_qualityi~x |  -.1400909   .1346116    -1.04   0.299    -.4050382    .1248564
z_supporti~x |   .1099075   .0716869     1.53   0.126    -.0311891    .2510041
       _cons |  -.1516327   .0527167    -2.88   0.004    -.2553916   -.0478739
------------------------------------------------------------------------------
(est14 stored)

. 
. esttab using $projdir/out/csv/factoranalysis/indexhorserace/compcasehorserace
> .csv, replace
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/fa
> ctoranalysis/indexhorserace/compcasehorserace.csv)

. 
. eststo clear

. 
. 
. 
. /////////////////////////////////////////////////////////////////////////////
> ///
> /* imputed data analysis  */
. 
. use $projdir/dta/allsvyfactor/categoryindex/imputedcategoryindex, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. 
. //local macro for VA vars in z scores
. local vasdvars z_va_ela z_va_math z_va_enr z_va_enrela z_va_enrmath z_va_enrd
> k z_va_2yr z_va_2yrela z_va_2yrmath z_va_2yrdk z_va_4yr z_va_4yrela z_va_4yrm
> ath z_va_4yrdk

. 
. //local macro for z score index vars
. local indexsdvars z_climateindex z_qualityindex z_supportindex

. 
. 
. // regress va vars on index vars
. foreach i of local vasdvars {
  2.   local append replace
  3. 
.   eststo: reg `i' `indexsdvars'
  4. 
.   local append append
  5. }

      Source |       SS           df       MS      Number of obs   =       918
-------------+----------------------------------   F(3, 914)       =     22.55
       Model |  63.1877118         3  21.0625706   Prob > F        =    0.0000
    Residual |  853.812286       914  .934149109   R-squared       =    0.0689
-------------+----------------------------------   Adj R-squared   =    0.0659
       Total |  916.999998       917  .999999997   Root MSE        =    .96651

------------------------------------------------------------------------------
    z_va_ela | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .4060284   .0608242     6.68   0.000      .286657    .5253998
z_qualityi~x |  -.2040856   .0663197    -3.08   0.002    -.3342422   -.0739291
z_supporti~x |   .0233842   .0408682     0.57   0.567    -.0568222    .1035905
       _cons |   .0036669   .0319105     0.11   0.909    -.0589595    .0662932
------------------------------------------------------------------------------
(est1 stored)

      Source |       SS           df       MS      Number of obs   =       918
-------------+----------------------------------   F(3, 914)       =     36.53
       Model |  98.1708303         3  32.7236101   Prob > F        =    0.0000
    Residual |  818.829173       914  .895874369   R-squared       =    0.1071
-------------+----------------------------------   Adj R-squared   =    0.1041
       Total |  917.000003       917           1   Root MSE        =    .94651

------------------------------------------------------------------------------
   z_va_math | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .4557205   .0595651     7.65   0.000     .3388202    .5726208
z_qualityi~x |  -.1347833   .0649468    -2.08   0.038    -.2622456   -.0073211
z_supporti~x |  -.0350571   .0400222    -0.88   0.381    -.1136031     .043489
       _cons |   .0056048   .0312499     0.18   0.858    -.0557251    .0669347
------------------------------------------------------------------------------
(est2 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =     17.55
       Model |  49.9504219         3  16.6501406   Prob > F        =    0.0000
    Residual |  866.049571       913  .948575653   R-squared       =    0.0545
-------------+----------------------------------   Adj R-squared   =    0.0514
       Total |  915.999993       916  .999999992   Root MSE        =    .97395

------------------------------------------------------------------------------
    z_va_enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .4097032   .0613002     6.68   0.000     .2893975    .5300089
z_qualityi~x |  -.2851863     .06683    -4.27   0.000    -.4163446    -.154028
z_supporti~x |   .0351074   .0411827     0.85   0.394    -.0457163    .1159312
       _cons |    .002111   .0321744     0.07   0.948    -.0610333    .0652553
------------------------------------------------------------------------------
(est3 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =     10.69
       Model |  31.0701743         3  10.3567248   Prob > F        =    0.0000
    Residual |  884.929828       913  .969255014   R-squared       =    0.0339
-------------+----------------------------------   Adj R-squared   =    0.0307
       Total |  916.000002       916           1   Root MSE        =    .98451

------------------------------------------------------------------------------
 z_va_enrela | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .3330795   .0619648     5.38   0.000     .2114695    .4546895
z_qualityi~x |  -.2436953   .0675546    -3.61   0.000    -.3762756    -.111115
z_supporti~x |   .0218751   .0416292     0.53   0.599    -.0598249     .103575
       _cons |   .0013168   .0325232     0.04   0.968     -.062512    .0651457
------------------------------------------------------------------------------
(est4 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =      7.80
       Model |  22.8933354         3   7.6311118   Prob > F        =    0.0000
    Residual |   893.10666       913  .978211019   R-squared       =    0.0250
-------------+----------------------------------   Adj R-squared   =    0.0218
       Total |  915.999996       916  .999999995   Root MSE        =    .98905

------------------------------------------------------------------------------
z_va_enrmath | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |    .293192   .0622504     4.71   0.000     .1710214    .4153625
z_qualityi~x |  -.2579007   .0678659    -3.80   0.000    -.3910921   -.1247093
z_supporti~x |   .0348401    .041821     0.83   0.405    -.0472365    .1169166
       _cons |   .0002695   .0326731     0.01   0.993    -.0638536    .0643925
------------------------------------------------------------------------------
(est5 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =      7.67
       Model |  22.5038364         3  7.50127881   Prob > F        =    0.0000
    Residual |  893.496162       913  .978637636   R-squared       =    0.0246
-------------+----------------------------------   Adj R-squared   =    0.0214
       Total |  915.999998       916  .999999998   Root MSE        =    .98926

------------------------------------------------------------------------------
  z_va_enrdk | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |    .290852    .062264     4.67   0.000     .1686549    .4130492
z_qualityi~x |   -.255567   .0678807    -3.76   0.000    -.3887874   -.1223466
z_supporti~x |   .0340431   .0418302     0.81   0.416    -.0480514    .1161376
       _cons |   .0002669   .0326802     0.01   0.993    -.0638701     .064404
------------------------------------------------------------------------------
(est6 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =      3.49
       Model |  10.3772144         3  3.45907145   Prob > F        =    0.0154
    Residual |  905.622784       913  .991919807   R-squared       =    0.0113
-------------+----------------------------------   Adj R-squared   =    0.0081
       Total |  915.999998       916  .999999998   Root MSE        =    .99595

------------------------------------------------------------------------------
    z_va_2yr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1228292   .0626851     1.96   0.050    -.0001944    .2458529
z_qualityi~x |  -.2019707   .0683398    -2.96   0.003    -.3360921   -.0678493
z_supporti~x |   .0144505   .0421131     0.34   0.732    -.0681992    .0971001
       _cons |  -.0022984   .0329012    -0.07   0.944    -.0668692    .0622725
------------------------------------------------------------------------------
(est7 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =      3.45
       Model |  10.2648988         3  3.42163293   Prob > F        =    0.0162
    Residual |  905.735102       913  .992042828   R-squared       =    0.0112
-------------+----------------------------------   Adj R-squared   =    0.0080
       Total |  916.000001       916           1   Root MSE        =    .99601

------------------------------------------------------------------------------
 z_va_2yrela | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1241794    .062689     1.98   0.048     .0011481    .2472106
z_qualityi~x |  -.1998511   .0683441    -2.92   0.004    -.3339808   -.0657213
z_supporti~x |    .010682   .0421157     0.25   0.800    -.0719728    .0933368
       _cons |  -.0022686   .0329033    -0.07   0.945    -.0668434    .0623063
------------------------------------------------------------------------------
(est8 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =      3.41
       Model |  10.1617529         3  3.38725097   Prob > F        =    0.0170
    Residual |  905.838248       913  .992155803   R-squared       =    0.0111
-------------+----------------------------------   Adj R-squared   =    0.0078
       Total |  916.000001       916           1   Root MSE        =    .99607

------------------------------------------------------------------------------
z_va_2yrmath | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1435104   .0626926     2.29   0.022     .0204721    .2665486
z_qualityi~x |  -.2054688    .068348    -3.01   0.003    -.3396062   -.0713315
z_supporti~x |   .0097091   .0421181     0.23   0.818    -.0729504    .0923686
       _cons |  -.0020056   .0329052    -0.06   0.951    -.0665841    .0625729
------------------------------------------------------------------------------
(est9 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =      3.28
       Model |  9.76290173         3  3.25430058   Prob > F        =    0.0205
    Residual |  906.237097       913  .992592658   R-squared       =    0.0107
-------------+----------------------------------   Adj R-squared   =    0.0074
       Total |  915.999999       916  .999999999   Root MSE        =    .99629

------------------------------------------------------------------------------
  z_va_2yrdk | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1371292   .0627064     2.19   0.029     .0140639    .2601946
z_qualityi~x |  -.1993448    .068363    -2.92   0.004    -.3335117   -.0651779
z_supporti~x |   .0076187   .0421274     0.18   0.857     -.075059    .0902964
       _cons |  -.0020174   .0329124    -0.06   0.951    -.0666102    .0625753
------------------------------------------------------------------------------
(est10 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =     12.54
       Model |  36.2364544         3  12.0788181   Prob > F        =    0.0000
    Residual |  879.763548       913  .963596438   R-squared       =    0.0396
-------------+----------------------------------   Adj R-squared   =    0.0364
       Total |  916.000002       916           1   Root MSE        =    .98163

------------------------------------------------------------------------------
    z_va_4yr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .2285464   .0617837     3.70   0.000     .1072919    .3498009
z_qualityi~x |  -.0444934   .0673571    -0.66   0.509    -.1766861    .0876993
z_supporti~x |   .0216935   .0415075     0.52   0.601    -.0597676    .1031547
       _cons |   .0041471   .0324281     0.13   0.898    -.0594952    .0677893
------------------------------------------------------------------------------
(est11 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =      7.11
       Model |  20.9049033         3  6.96830109   Prob > F        =    0.0001
    Residual |  895.095095       913  .980388932   R-squared       =    0.0228
-------------+----------------------------------   Adj R-squared   =    0.0196
       Total |  915.999998       916  .999999998   Root MSE        =    .99015

------------------------------------------------------------------------------
 z_va_4yrela | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .1486306   .0623197     2.38   0.017     .0263241    .2709371
z_qualityi~x |  -.0012805   .0679415    -0.02   0.985    -.1346201    .1320591
z_supporti~x |   .0141555   .0418676     0.34   0.735    -.0680124    .0963234
       _cons |    .003407   .0327094     0.10   0.917    -.0607874    .0676014
------------------------------------------------------------------------------
(est12 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =      3.18
       Model |  9.47216635         3  3.15738878   Prob > F        =    0.0234
    Residual |  906.527836       913  .992911102   R-squared       =    0.0103
-------------+----------------------------------   Adj R-squared   =    0.0071
       Total |  916.000003       916           1   Root MSE        =    .99645

------------------------------------------------------------------------------
z_va_4yrmath | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .0876496   .0627164     1.40   0.163    -.0354354    .2107347
z_qualityi~x |  -.0000668    .068374    -0.00   0.999    -.1342553    .1341216
z_supporti~x |   .0270754   .0421341     0.64   0.521    -.0556155    .1097664
       _cons |    .002295   .0329177     0.07   0.944    -.0623081    .0668981
------------------------------------------------------------------------------
(est13 stored)

      Source |       SS           df       MS      Number of obs   =       917
-------------+----------------------------------   F(3, 913)       =      3.32
       Model |  9.87506998         3  3.29168999   Prob > F        =    0.0194
    Residual |  906.124933       913  .992469806   R-squared       =    0.0108
-------------+----------------------------------   Adj R-squared   =    0.0075
       Total |  916.000003       916           1   Root MSE        =    .99623

------------------------------------------------------------------------------
  z_va_4yrdk | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z_climatei~x |   .0933456   .0627025     1.49   0.137    -.0297122    .2164033
z_qualityi~x |  -.0054509   .0683588    -0.08   0.936    -.1396095    .1287077
z_supporti~x |   .0287247   .0421247     0.68   0.495    -.0539478    .1113973
       _cons |   .0023046   .0329104     0.07   0.944    -.0622841    .0668934
------------------------------------------------------------------------------
(est14 stored)

. 
. esttab using $projdir/out/csv/factoranalysis/indexhorserace/imputedhorserace.
> csv, replace
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/fa
> ctoranalysis/indexhorserace/imputedhorserace.csv)

. 
. eststo clear

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/indexhorserace.smcl
  log type:  smcl
 closed on:   7 Apr 2022, 14:57:53
-------------------------------------------------------------------------------
