{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/indexalpha.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Dec 2024, 19:20:26
{txt}
{com}. 
. use $projdir/dta/allsvyfactor/categoryindex/compcasecategoryindex, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. 
. local climatevars parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27mean_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled secqoi26mean_pooled secqoi27mean_pooled  secqoi29mean_pooled
{txt}
{com}. local qualityvars parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled parentqoi33mean_pooled parentqoi34mean_pooled secqoi28mean_pooled secqoi35mean_pooled secqoi36mean_pooled secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled secqoi40mean_pooled staffqoi20mean_pooled staffqoi24mean_pooled staffqoi87mean_pooled
{txt}
{com}. local supportvars parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mean_pooled staffqoi128mean_pooled
{txt}
{com}. /* local motivationvars secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled secqoi34mean_pooled */
. /* Cronbach's alpha for the school climate index */
. alpha `climatevars', std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~6mean_po~d{col 14}{c |}{res}{col 16}2785{col 24}+{col 31} 0.7809{col 45} 0.6616{col 59}   0.5516{col 73} 0.9078
{txt}parentqoi17~{col 14}{c |}{res}{col 16}2786{col 24}+{col 31} 0.7619{col 45} 0.6498{col 59}   0.5612{col 73} 0.9110
{txt}parentqoi2~d{col 14}{c |}{res}{col 16}2786{col 24}+{col 31} 0.7792{col 45} 0.6632{col 59}   0.5538{col 73} 0.9085
{txt}secqoi22me~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.6945{col 45} 0.5796{col 59}   0.5702{col 73} 0.9139
{txt}secqoi23me~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8706{col 45} 0.8159{col 59}   0.5114{col 73} 0.8933
{txt}secqoi24me~d{col 14}{c |}{res}{col 16}3384{col 24}+{col 31} 0.9056{col 45} 0.8662{col 59}   0.5005{col 73} 0.8891
{txt}secqoi26me~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8695{col 45} 0.8109{col 59}   0.5090{col 73} 0.8924
{txt}secqoi27me~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.6521{col 45} 0.5258{col 59}   0.5715{col 73} 0.9143
{txt}secqoi29me~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.8641{col 45} 0.8055{col 59}   0.5114{col 73} 0.8933
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.5385{col 73} 0.9131
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. /* Cronbach's alpha for teacher and staff quality index */
. alpha `qualityvars', std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~0mean_po~d{col 14}{c |}{res}{col 16}2505{col 24}+{col 31} 0.7777{col 45} 0.7136{col 59}   0.4725{col 73} 0.9261
{txt}p~1mean_po~d{col 14}{c |}{res}{col 16}2778{col 24}+{col 31} 0.7469{col 45} 0.6642{col 59}   0.4751{col 73} 0.9269
{txt}p~2mean_po~d{col 14}{c |}{res}{col 16}2262{col 24}+{col 31} 0.6977{col 45} 0.6141{col 59}   0.4774{col 73} 0.9275
{txt}p~3mean_po~d{col 14}{c |}{res}{col 16}2781{col 24}+{col 31} 0.7187{col 45} 0.6271{col 59}   0.4791{col 73} 0.9279
{txt}parentqoi34~{col 14}{c |}{res}{col 16}2505{col 24}+{col 31} 0.7358{col 45} 0.6597{col 59}   0.4771{col 73} 0.9274
{txt}secqoi28me~d{col 14}{c |}{res}{col 16}3276{col 24}+{col 31} 0.7569{col 45} 0.6872{col 59}   0.4630{col 73} 0.9235
{txt}secqoi35me~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8558{col 45} 0.8152{col 59}   0.4515{col 73} 0.9201
{txt}secqoi36me~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8824{col 45} 0.8489{col 59}   0.4474{col 73} 0.9189
{txt}secqoi37me~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.7847{col 45} 0.7252{col 59}   0.4600{col 73} 0.9226
{txt}secqoi38me~d{col 14}{c |}{res}{col 16}3383{col 24}+{col 31} 0.8581{col 45} 0.8195{col 59}   0.4504{col 73} 0.9198
{txt}secqoi39me~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8608{col 45} 0.8214{col 59}   0.4503{col 73} 0.9198
{txt}secqoi40me~d{col 14}{c |}{res}{col 16}3385{col 24}+{col 31} 0.8634{col 45} 0.8246{col 59}   0.4511{col 73} 0.9200
{txt}staffqoi20~d{col 14}{c |}{res}{col 16}4194{col 24}+{col 31} 0.3567{col 45} 0.1600{col 59}   0.5414{col 73} 0.9430
{txt}staffqoi24~d{col 14}{c |}{res}{col 16}3036{col 24}+{col 31} 0.6389{col 45} 0.5121{col 59}   0.4860{col 73} 0.9298
{txt}staffqoi87~d{col 14}{c |}{res}{col 16}3828{col 24}+{col 31} 0.6288{col 45} 0.4677{col 59}   0.4890{col 73} 0.9306
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.4715{col 73} 0.9305
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. /* Cronbach's alpha for counseling support index */
. alpha `supportvars', std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~5mean_po~d{col 14}{c |}{res}{col 16}2786{col 24}+{col 31} 0.7511{col 45} 0.4898{col 59}   0.3341{col 73} 0.6008
{txt}parentqoi6~d{col 14}{c |}{res}{col 16}2753{col 24}+{col 31} 0.6947{col 45} 0.4102{col 59}   0.3875{col 73} 0.6549
{txt}staffqoi10m~{col 14}{c |}{res}{col 16}4199{col 24}+{col 31} 0.7973{col 45} 0.4715{col 59}   0.3108{col 73} 0.5750
{txt}staffqoi12~d{col 14}{c |}{res}{col 16}4058{col 24}+{col 31} 0.7842{col 45} 0.4730{col 59}   0.3242{col 73} 0.5901
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.3408{col 73} 0.6741
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/indexalpha.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}19 Dec 2024, 19:20:26
{txt}{.-}
{smcl}
{txt}{sf}{ul off}