-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/indexalpha.smcl
  log type:  smcl
 opened on:  31 Jul 2023, 21:45:35

. 
. use $projdir/dta/allsvyfactor/categoryindex/compcasecategoryindex, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. 
. local climatevars parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27me
> an_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled secqoi2
> 6mean_pooled secqoi27mean_pooled  secqoi29mean_pooled

. local qualityvars parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32me
> an_pooled parentqoi33mean_pooled parentqoi34mean_pooled secqoi28mean_pooled s
> ecqoi35mean_pooled secqoi36mean_pooled secqoi37mean_pooled secqoi38mean_poole
> d secqoi39mean_pooled secqoi40mean_pooled staffqoi20mean_pooled staffqoi24mea
> n_pooled staffqoi87mean_pooled

. local supportvars parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mea
> n_pooled staffqoi128mean_pooled

. /* local motivationvars secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_
> pooled secqoi34mean_pooled */
. /* Cronbach's alpha for the school climate index */
. alpha `climatevars', std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~6mean_po~d | 1262    +       0.6502        0.5453          0.4711      0.8769
parentqoi17~ | 1262    +       0.5577        0.4357          0.4918      0.8856
parentqoi2~d | 1262    +       0.6196        0.5085          0.4779      0.8798
secqoi22me~d | 1345    +       0.5868        0.4667          0.4878      0.8840
secqoi23me~d | 1345    +       0.8205        0.7566          0.4317      0.8587
secqoi24me~d | 1345    +       0.8502        0.7952          0.4244      0.8550
secqoi26me~d | 1345    +       0.8319        0.7688          0.4281      0.8569
secqoi27me~d | 1321    +       0.7082        0.6136          0.4572      0.8708
secqoi29me~d | 1321    +       0.8424        0.7843          0.4259      0.8558
-------------+-----------------------------------------------------------------
Test scale   |                                               0.4552      0.8826
-------------------------------------------------------------------------------

. 
. /* Cronbach's alpha for teacher and staff quality index */
. alpha `qualityvars', std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~0mean_po~d | 1148    +       0.6547        0.5894          0.4154      0.9087
p~1mean_po~d | 1258    +       0.6399        0.5685          0.4171      0.9092
p~2mean_po~d | 1033    +       0.6143        0.5451          0.4188      0.9098
p~3mean_po~d | 1259    +       0.5903        0.5129          0.4231      0.9112
parentqoi34~ | 1148    +       0.6009        0.5281          0.4207      0.9104
secqoi28me~d | 1321    +       0.7562        0.7011          0.4035      0.9045
secqoi35me~d | 1345    +       0.8217        0.7810          0.3970      0.9021
secqoi36me~d | 1345    +       0.8487        0.8143          0.3935      0.9008
secqoi37me~d | 1345    +       0.7707        0.7194          0.4013      0.9037
secqoi38me~d | 1345    +       0.8050        0.7628          0.3984      0.9027
secqoi39me~d | 1345    +       0.8287        0.7902          0.3959      0.9017
secqoi40me~d | 1345    +       0.8103        0.7689          0.3985      0.9027
staffqoi20~d | 1339    +       0.1527        0.0432          0.4748      0.9268
staffqoi24~d | 1051    +       0.5729        0.4964          0.4224      0.9110
staffqoi87~d | 1264    +       0.6016        0.5244          0.4213      0.9106
-------------+-----------------------------------------------------------------
Test scale   |                                               0.4135      0.9136
-------------------------------------------------------------------------------

. 
. /* Cronbach's alpha for counseling support index */
. alpha `supportvars', std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~5mean_po~d | 1263    +       0.7234        0.4519          0.3068      0.5704
parentqoi6~d | 1259    +       0.6484        0.3496          0.3796      0.6473
staffqoi10m~ | 1342    +       0.7415        0.4572          0.2982      0.5603
staffqoi12~d | 1319    +       0.7225        0.4533          0.3070      0.5706
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3231      0.6562
-------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/indexalpha.smcl
  log type:  smcl
 closed on:  31 Jul 2023, 21:45:35
-------------------------------------------------------------------------------
