{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/indexalpha.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}31 Jul 2023, 21:45:35
{txt}
{com}. 
. use $projdir/dta/allsvyfactor/categoryindex/compcasecategoryindex, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. 
. local climatevars parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27mean_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled secqoi26mean_pooled secqoi27mean_pooled  secqoi29mean_pooled
{txt}
{com}. local qualityvars parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled parentqoi33mean_pooled parentqoi34mean_pooled secqoi28mean_pooled secqoi35mean_pooled secqoi36mean_pooled secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled secqoi40mean_pooled staffqoi20mean_pooled staffqoi24mean_pooled staffqoi87mean_pooled
{txt}
{com}. local supportvars parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mean_pooled staffqoi128mean_pooled
{txt}
{com}. /* local motivationvars secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled secqoi34mean_pooled */
. /* Cronbach's alpha for the school climate index */
. alpha `climatevars', std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~6mean_po~d{col 14}{c |}{res}{col 16}1262{col 24}+{col 31} 0.6502{col 45} 0.5453{col 59}   0.4711{col 73} 0.8769
{txt}parentqoi17~{col 14}{c |}{res}{col 16}1262{col 24}+{col 31} 0.5577{col 45} 0.4357{col 59}   0.4918{col 73} 0.8856
{txt}parentqoi2~d{col 14}{c |}{res}{col 16}1262{col 24}+{col 31} 0.6196{col 45} 0.5085{col 59}   0.4779{col 73} 0.8798
{txt}secqoi22me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.5868{col 45} 0.4667{col 59}   0.4878{col 73} 0.8840
{txt}secqoi23me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8205{col 45} 0.7566{col 59}   0.4317{col 73} 0.8587
{txt}secqoi24me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8502{col 45} 0.7952{col 59}   0.4244{col 73} 0.8550
{txt}secqoi26me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8319{col 45} 0.7688{col 59}   0.4281{col 73} 0.8569
{txt}secqoi27me~d{col 14}{c |}{res}{col 16}1321{col 24}+{col 31} 0.7082{col 45} 0.6136{col 59}   0.4572{col 73} 0.8708
{txt}secqoi29me~d{col 14}{c |}{res}{col 16}1321{col 24}+{col 31} 0.8424{col 45} 0.7843{col 59}   0.4259{col 73} 0.8558
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.4552{col 73} 0.8826
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. /* Cronbach's alpha for teacher and staff quality index */
. alpha `qualityvars', std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~0mean_po~d{col 14}{c |}{res}{col 16}1148{col 24}+{col 31} 0.6547{col 45} 0.5894{col 59}   0.4154{col 73} 0.9087
{txt}p~1mean_po~d{col 14}{c |}{res}{col 16}1258{col 24}+{col 31} 0.6399{col 45} 0.5685{col 59}   0.4171{col 73} 0.9092
{txt}p~2mean_po~d{col 14}{c |}{res}{col 16}1033{col 24}+{col 31} 0.6143{col 45} 0.5451{col 59}   0.4188{col 73} 0.9098
{txt}p~3mean_po~d{col 14}{c |}{res}{col 16}1259{col 24}+{col 31} 0.5903{col 45} 0.5129{col 59}   0.4231{col 73} 0.9112
{txt}parentqoi34~{col 14}{c |}{res}{col 16}1148{col 24}+{col 31} 0.6009{col 45} 0.5281{col 59}   0.4207{col 73} 0.9104
{txt}secqoi28me~d{col 14}{c |}{res}{col 16}1321{col 24}+{col 31} 0.7562{col 45} 0.7011{col 59}   0.4035{col 73} 0.9045
{txt}secqoi35me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8217{col 45} 0.7810{col 59}   0.3970{col 73} 0.9021
{txt}secqoi36me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8487{col 45} 0.8143{col 59}   0.3935{col 73} 0.9008
{txt}secqoi37me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.7707{col 45} 0.7194{col 59}   0.4013{col 73} 0.9037
{txt}secqoi38me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8050{col 45} 0.7628{col 59}   0.3984{col 73} 0.9027
{txt}secqoi39me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8287{col 45} 0.7902{col 59}   0.3959{col 73} 0.9017
{txt}secqoi40me~d{col 14}{c |}{res}{col 16}1345{col 24}+{col 31} 0.8103{col 45} 0.7689{col 59}   0.3985{col 73} 0.9027
{txt}staffqoi20~d{col 14}{c |}{res}{col 16}1339{col 24}+{col 31} 0.1527{col 45} 0.0432{col 59}   0.4748{col 73} 0.9268
{txt}staffqoi24~d{col 14}{c |}{res}{col 16}1051{col 24}+{col 31} 0.5729{col 45} 0.4964{col 59}   0.4224{col 73} 0.9110
{txt}staffqoi87~d{col 14}{c |}{res}{col 16}1264{col 24}+{col 31} 0.6016{col 45} 0.5244{col 59}   0.4213{col 73} 0.9106
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.4135{col 73} 0.9136
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. /* Cronbach's alpha for counseling support index */
. alpha `supportvars', std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~5mean_po~d{col 14}{c |}{res}{col 16}1263{col 24}+{col 31} 0.7234{col 45} 0.4519{col 59}   0.3068{col 73} 0.5704
{txt}parentqoi6~d{col 14}{c |}{res}{col 16}1259{col 24}+{col 31} 0.6484{col 45} 0.3496{col 59}   0.3796{col 73} 0.6473
{txt}staffqoi10m~{col 14}{c |}{res}{col 16}1342{col 24}+{col 31} 0.7415{col 45} 0.4572{col 59}   0.2982{col 73} 0.5603
{txt}staffqoi12~d{col 14}{c |}{res}{col 16}1319{col 24}+{col 31} 0.7225{col 45} 0.4533{col 59}   0.3070{col 73} 0.5706
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.3231{col 73} 0.6562
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/indexalpha.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}31 Jul 2023, 21:45:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}