-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/indexalpha.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 18:13:29

. 
. use $projdir/dta/allsvyfactor/categoryindex/compcasecategoryindex, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. 
. local climatevars parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27me
> an_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled secqoi2
> 6mean_pooled secqoi27mean_pooled  secqoi29mean_pooled

. local qualityvars parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32me
> an_pooled parentqoi33mean_pooled parentqoi34mean_pooled secqoi28mean_pooled s
> ecqoi35mean_pooled secqoi36mean_pooled secqoi37mean_pooled secqoi38mean_poole
> d secqoi39mean_pooled secqoi40mean_pooled staffqoi20mean_pooled staffqoi24mea
> n_pooled staffqoi87mean_pooled

. local supportvars parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mea
> n_pooled staffqoi128mean_pooled

. /* local motivationvars secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_
> pooled secqoi34mean_pooled */
. /* Cronbach's alpha for the school climate index */
. alpha `climatevars', std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~6mean_po~d |  413    +       0.6834        0.5925          0.5713      0.9142
parentqoi17~ |  413    +       0.5954        0.4878          0.5843      0.9183
parentqoi2~d |  413    +       0.6459        0.5478          0.5769      0.9160
secqoi22me~d |  931    +       0.6687        0.5473          0.5978      0.9224
secqoi23me~d |  931    +       0.8689        0.8133          0.5254      0.8986
secqoi24me~d |  931    +       0.9037        0.8657          0.5150      0.8947
secqoi26me~d |  931    +       0.8755        0.8196          0.5217      0.8972
secqoi27me~d |  910    +       0.7954        0.7123          0.5459      0.9058
secqoi29me~d |  910    +       0.8265        0.7504          0.5341      0.9017
-------------+-----------------------------------------------------------------
Test scale   |                                               0.5537      0.9178
-------------------------------------------------------------------------------

. 
. /* Cronbach's alpha for teacher and staff quality index */
. alpha `qualityvars', std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~0mean_po~d |  368    +       0.6832        0.6283          0.5366      0.9419
p~1mean_po~d |  413    +       0.6255        0.5595          0.5423      0.9431
p~2mean_po~d |  333    +       0.7385        0.6911          0.5315      0.9408
p~3mean_po~d |  413    +       0.6843        0.6222          0.5367      0.9419
parentqoi34~ |  368    +       0.7072        0.6540          0.5346      0.9415
secqoi28me~d |  910    +       0.7004        0.6128          0.5326      0.9410
secqoi35me~d |  931    +       0.8706        0.8357          0.5092      0.9356
secqoi36me~d |  931    +       0.8902        0.8602          0.5060      0.9348
secqoi37me~d |  931    +       0.8313        0.7853          0.5158      0.9372
secqoi38me~d |  931    +       0.8959        0.8673          0.5053      0.9346
secqoi39me~d |  931    +       0.8807        0.8467          0.5077      0.9352
secqoi40me~d |  931    +       0.8707        0.8351          0.5101      0.9358
staffqoi20~d |  592    +       0.3891        0.2822          0.5769      0.9502
staffqoi24~d |  438    +       0.5876        0.5067          0.5466      0.9441
staffqoi87~d |  545    +       0.6181        0.5355          0.5469      0.9441
-------------+-----------------------------------------------------------------
Test scale   |                                               0.5297      0.9441
-------------------------------------------------------------------------------

. 
. /* Cronbach's alpha for counseling support index */
. alpha `supportvars', std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~5mean_po~d |  413    +       0.7746        0.5306          0.3685      0.6365
parentqoi6~d |  410    +       0.7359        0.4699          0.4066      0.6727
staffqoi10m~ |  592    +       0.8164        0.5021          0.3744      0.6423
staffqoi12~d |  586    +       0.7884        0.5000          0.3660      0.6340
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3795      0.7098
-------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/indexalpha.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 18:13:29
-------------------------------------------------------------------------------
