-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/indexalpha.smcl
  log type:  smcl
 opened on:  19 Dec 2024, 19:20:26

. 
. use $projdir/dta/allsvyfactor/categoryindex/compcasecategoryindex, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. 
. local climatevars parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27me
> an_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled secqoi2
> 6mean_pooled secqoi27mean_pooled  secqoi29mean_pooled

. local qualityvars parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32me
> an_pooled parentqoi33mean_pooled parentqoi34mean_pooled secqoi28mean_pooled s
> ecqoi35mean_pooled secqoi36mean_pooled secqoi37mean_pooled secqoi38mean_poole
> d secqoi39mean_pooled secqoi40mean_pooled staffqoi20mean_pooled staffqoi24mea
> n_pooled staffqoi87mean_pooled

. local supportvars parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mea
> n_pooled staffqoi128mean_pooled

. /* local motivationvars secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_
> pooled secqoi34mean_pooled */
. /* Cronbach's alpha for the school climate index */
. alpha `climatevars', std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~6mean_po~d | 2785    +       0.7809        0.6616          0.5516      0.9078
parentqoi17~ | 2786    +       0.7619        0.6498          0.5612      0.9110
parentqoi2~d | 2786    +       0.7792        0.6632          0.5538      0.9085
secqoi22me~d | 3385    +       0.6945        0.5796          0.5702      0.9139
secqoi23me~d | 3385    +       0.8706        0.8159          0.5114      0.8933
secqoi24me~d | 3384    +       0.9056        0.8662          0.5005      0.8891
secqoi26me~d | 3385    +       0.8695        0.8109          0.5090      0.8924
secqoi27me~d | 3276    +       0.6521        0.5258          0.5715      0.9143
secqoi29me~d | 3276    +       0.8641        0.8055          0.5114      0.8933
-------------+-----------------------------------------------------------------
Test scale   |                                               0.5385      0.9131
-------------------------------------------------------------------------------

. 
. /* Cronbach's alpha for teacher and staff quality index */
. alpha `qualityvars', std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~0mean_po~d | 2505    +       0.7777        0.7136          0.4725      0.9261
p~1mean_po~d | 2778    +       0.7469        0.6642          0.4751      0.9269
p~2mean_po~d | 2262    +       0.6977        0.6141          0.4774      0.9275
p~3mean_po~d | 2781    +       0.7187        0.6271          0.4791      0.9279
parentqoi34~ | 2505    +       0.7358        0.6597          0.4771      0.9274
secqoi28me~d | 3276    +       0.7569        0.6872          0.4630      0.9235
secqoi35me~d | 3385    +       0.8558        0.8152          0.4515      0.9201
secqoi36me~d | 3385    +       0.8824        0.8489          0.4474      0.9189
secqoi37me~d | 3385    +       0.7847        0.7252          0.4600      0.9226
secqoi38me~d | 3383    +       0.8581        0.8195          0.4504      0.9198
secqoi39me~d | 3385    +       0.8608        0.8214          0.4503      0.9198
secqoi40me~d | 3385    +       0.8634        0.8246          0.4511      0.9200
staffqoi20~d | 4194    +       0.3567        0.1600          0.5414      0.9430
staffqoi24~d | 3036    +       0.6389        0.5121          0.4860      0.9298
staffqoi87~d | 3828    +       0.6288        0.4677          0.4890      0.9306
-------------+-----------------------------------------------------------------
Test scale   |                                               0.4715      0.9305
-------------------------------------------------------------------------------

. 
. /* Cronbach's alpha for counseling support index */
. alpha `supportvars', std item

Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         |  Obs  Sign   correlation   correlation     correlation     alpha
-------------+-----------------------------------------------------------------
p~5mean_po~d | 2786    +       0.7511        0.4898          0.3341      0.6008
parentqoi6~d | 2753    +       0.6947        0.4102          0.3875      0.6549
staffqoi10m~ | 4199    +       0.7973        0.4715          0.3108      0.5750
staffqoi12~d | 4058    +       0.7842        0.4730          0.3242      0.5901
-------------+-----------------------------------------------------------------
Test scale   |                                               0.3408      0.6741
-------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/indexalpha.smcl
  log type:  smcl
 closed on:  19 Dec 2024, 19:20:26
-------------------------------------------------------------------------------
