{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/indexalpha.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Jul 2022, 18:13:29
{txt}
{com}. 
. use $projdir/dta/allsvyfactor/categoryindex/compcasecategoryindex, clear
{txt}(parent pooled (over years) dataset ready for analysis with stats and response ra)

{com}. 
. local climatevars parentqoi16mean_pooled parentqoi17mean_pooled parentqoi27mean_pooled secqoi22mean_pooled secqoi23mean_pooled secqoi24mean_pooled secqoi26mean_pooled secqoi27mean_pooled  secqoi29mean_pooled
{txt}
{com}. local qualityvars parentqoi30mean_pooled parentqoi31mean_pooled parentqoi32mean_pooled parentqoi33mean_pooled parentqoi34mean_pooled secqoi28mean_pooled secqoi35mean_pooled secqoi36mean_pooled secqoi37mean_pooled secqoi38mean_pooled secqoi39mean_pooled secqoi40mean_pooled staffqoi20mean_pooled staffqoi24mean_pooled staffqoi87mean_pooled
{txt}
{com}. local supportvars parentqoi15mean_pooled parentqoi64mean_pooled staffqoi10mean_pooled staffqoi128mean_pooled
{txt}
{com}. /* local motivationvars secqoi31mean_pooled secqoi32mean_pooled secqoi33mean_pooled secqoi34mean_pooled */
. /* Cronbach's alpha for the school climate index */
. alpha `climatevars', std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~6mean_po~d{col 14}{c |}{res}{col 16} 413{col 24}+{col 31} 0.6834{col 45} 0.5925{col 59}   0.5713{col 73} 0.9142
{txt}parentqoi17~{col 14}{c |}{res}{col 16} 413{col 24}+{col 31} 0.5954{col 45} 0.4878{col 59}   0.5843{col 73} 0.9183
{txt}parentqoi2~d{col 14}{c |}{res}{col 16} 413{col 24}+{col 31} 0.6459{col 45} 0.5478{col 59}   0.5769{col 73} 0.9160
{txt}secqoi22me~d{col 14}{c |}{res}{col 16} 931{col 24}+{col 31} 0.6687{col 45} 0.5473{col 59}   0.5978{col 73} 0.9224
{txt}secqoi23me~d{col 14}{c |}{res}{col 16} 931{col 24}+{col 31} 0.8689{col 45} 0.8133{col 59}   0.5254{col 73} 0.8986
{txt}secqoi24me~d{col 14}{c |}{res}{col 16} 931{col 24}+{col 31} 0.9037{col 45} 0.8657{col 59}   0.5150{col 73} 0.8947
{txt}secqoi26me~d{col 14}{c |}{res}{col 16} 931{col 24}+{col 31} 0.8755{col 45} 0.8196{col 59}   0.5217{col 73} 0.8972
{txt}secqoi27me~d{col 14}{c |}{res}{col 16} 910{col 24}+{col 31} 0.7954{col 45} 0.7123{col 59}   0.5459{col 73} 0.9058
{txt}secqoi29me~d{col 14}{c |}{res}{col 16} 910{col 24}+{col 31} 0.8265{col 45} 0.7504{col 59}   0.5341{col 73} 0.9017
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.5537{col 73} 0.9178
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. /* Cronbach's alpha for teacher and staff quality index */
. alpha `qualityvars', std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~0mean_po~d{col 14}{c |}{res}{col 16} 368{col 24}+{col 31} 0.6832{col 45} 0.6283{col 59}   0.5366{col 73} 0.9419
{txt}p~1mean_po~d{col 14}{c |}{res}{col 16} 413{col 24}+{col 31} 0.6255{col 45} 0.5595{col 59}   0.5423{col 73} 0.9431
{txt}p~2mean_po~d{col 14}{c |}{res}{col 16} 333{col 24}+{col 31} 0.7385{col 45} 0.6911{col 59}   0.5315{col 73} 0.9408
{txt}p~3mean_po~d{col 14}{c |}{res}{col 16} 413{col 24}+{col 31} 0.6843{col 45} 0.6222{col 59}   0.5367{col 73} 0.9419
{txt}parentqoi34~{col 14}{c |}{res}{col 16} 368{col 24}+{col 31} 0.7072{col 45} 0.6540{col 59}   0.5346{col 73} 0.9415
{txt}secqoi28me~d{col 14}{c |}{res}{col 16} 910{col 24}+{col 31} 0.7004{col 45} 0.6128{col 59}   0.5326{col 73} 0.9410
{txt}secqoi35me~d{col 14}{c |}{res}{col 16} 931{col 24}+{col 31} 0.8706{col 45} 0.8357{col 59}   0.5092{col 73} 0.9356
{txt}secqoi36me~d{col 14}{c |}{res}{col 16} 931{col 24}+{col 31} 0.8902{col 45} 0.8602{col 59}   0.5060{col 73} 0.9348
{txt}secqoi37me~d{col 14}{c |}{res}{col 16} 931{col 24}+{col 31} 0.8313{col 45} 0.7853{col 59}   0.5158{col 73} 0.9372
{txt}secqoi38me~d{col 14}{c |}{res}{col 16} 931{col 24}+{col 31} 0.8959{col 45} 0.8673{col 59}   0.5053{col 73} 0.9346
{txt}secqoi39me~d{col 14}{c |}{res}{col 16} 931{col 24}+{col 31} 0.8807{col 45} 0.8467{col 59}   0.5077{col 73} 0.9352
{txt}secqoi40me~d{col 14}{c |}{res}{col 16} 931{col 24}+{col 31} 0.8707{col 45} 0.8351{col 59}   0.5101{col 73} 0.9358
{txt}staffqoi20~d{col 14}{c |}{res}{col 16} 592{col 24}+{col 31} 0.3891{col 45} 0.2822{col 59}   0.5769{col 73} 0.9502
{txt}staffqoi24~d{col 14}{c |}{res}{col 16} 438{col 24}+{col 31} 0.5876{col 45} 0.5067{col 59}   0.5466{col 73} 0.9441
{txt}staffqoi87~d{col 14}{c |}{res}{col 16} 545{col 24}+{col 31} 0.6181{col 45} 0.5355{col 59}   0.5469{col 73} 0.9441
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.5297{col 73} 0.9441
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. /* Cronbach's alpha for counseling support index */
. alpha `supportvars', std item

{txt}Test scale = mean(standardized items)

                                                            Average
                             Item-test     Item-rest       interitem
Item         {c |}  Obs  Sign   correlation   correlation     correlation     alpha
{hline 13}{c +}{hline 65}
p~5mean_po~d{col 14}{c |}{res}{col 16} 413{col 24}+{col 31} 0.7746{col 45} 0.5306{col 59}   0.3685{col 73} 0.6365
{txt}parentqoi6~d{col 14}{c |}{res}{col 16} 410{col 24}+{col 31} 0.7359{col 45} 0.4699{col 59}   0.4066{col 73} 0.6727
{txt}staffqoi10m~{col 14}{c |}{res}{col 16} 592{col 24}+{col 31} 0.8164{col 45} 0.5021{col 59}   0.3744{col 73} 0.6423
{txt}staffqoi12~d{col 14}{c |}{res}{col 16} 586{col 24}+{col 31} 0.7884{col 45} 0.5000{col 59}   0.3660{col 73} 0.6340
{txt}{hline 13}{c +}{hline 65}
Test scale{col 14}{c |}{res}{col 59}   0.3795{col 73} 0.7098
{txt}{hline 13}{c BT}{hline 65}

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/indexalpha.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Jul 2022, 18:13:29
{txt}{.-}
{smcl}
{txt}{sf}{ul off}