{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/mattschlchar.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}31 Jul 2023, 21:43:16
{txt}
{com}. 
. // a macro toggle for cleaning the raw data from Matt's folder
. local clean = 0
{txt}
{com}. if `clean' == 1 {c -(}
.   use /home/research/ca_ed_lab/msnaven/common_core_va/data/sch_char, clear
. 
.   rename enr_total enrtotal
.   label var enrtotal "total enrollment"
. 
.   rename enr_minority_prop minorityenrprop
.   label var minorityenrprop "proportion of minority enrollment"
. 
.   rename enr_male_prop maleenrprop
.   label var maleenrprop "proportion of male enrollment"
. 
.   rename frpm_prop freemealprop
.   label var freemealprop "proportion eleigible for free or reduced price meals"
. 
.   drop el_prop
. 
.   rename male_prop maleteachprop
.   label var maleteachprop "proportion of male teachers"
. 
.   rename eth_minority_prop minoritystaffprop
.   label var minoritystaffprop "proportion of minority staff"
. 
.   rename new_teacher_prop newteachprop
.   label var newteachprop "proportion of teachers with less than or equal to 3 years experience"
. 
.   rename credential_full_prop fullcredprop
.   label var fullcredprop "proprotion of full credential"
. 
.   rename fte_teach fteteach
.   label var fteteach "number of FTE teachers"
. 
.   rename fte_admin fteadmin
.   label var fteadmin "number of FTE administrators"
. 
.   rename fte_pupil ftepupil
.   label var ftepupil "number of FTE pupils"
. 
.   rename fte_teach_pc fteteachperstudent
.   label var fteteachperstudent "FTE teacher per student"
. 
.   rename fte_admin_pc fteadminperstudent
.   label var fteadminperstudent "FTE admin per student"
. 
.   rename fte_pupil_pc fteserviceperstudent
.   label var fteserviceperstudent "FTE pupil service per student"
. 
.   label data "School Characterstics data by Matt Naven, cleaned by Che Sun"
. 
.   save $projdir/dta/schoolchar/mattschlchar, replace
. {c )-}
{txt}
{com}. 
. //create elprop by collapsing student test score data to avoid missing data problem in the CDE school level dataset
. use cdscode year limited_eng_prof all_students_sample ///
> if all_students_sample==1 & inrange(year, 2015, 2017) ///
> using $vaprojdir/data/restricted_access/clean/k12_test_scores/k12_test_scores_clean.dta, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. collapse elprop = limited_eng_prof, by(cdscode year)
{res}{txt}
{com}. collapse elprop, by(cdscode)
{res}{txt}
{com}. drop if missing(cdscode)
{txt}(1 observation deleted)

{com}. label var elprop "proportion of English Leaners"
{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. label data "Proportion of English Learners from collapsing student level test score dataset"
{txt}
{com}. save $projdir/dta/schoolchar/elprop, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/schoolchar/elprop.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. use $projdir/dta/schoolchar/mattschlchar, clear
{txt}(School Characterstics data by Matt Naven, cleaned by Che Sun)

{com}. 
. // keep observations from 14-15 to 16-17 to condition on the same year as VA estimates since year is the year of spring semester
. keep if inrange(year, 2015, 2017)
{txt}(294,324 observations deleted)

{com}. drop if missing(cdscode)
{txt}(2 observations deleted)

{com}. 
. drop enrtotal fteteach fteadmin ftepupil
{txt}
{com}. 
. collapse *prop fte*, by(cdscode)
{res}{txt}
{com}. 
. merge 1:1 cdscode using $projdir/dta/schoolchar/elprop
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           4,913
{txt}{col 9}from master{col 30}{res}           1,592{txt}  (_merge==1)
{col 9}from using{col 30}{res}           3,321{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          10,133{txt}  (_merge==3)
{col 5}{hline 41}

{com}. //keep only merged obs
. keep if _merge==3
{txt}(4,913 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. label data "Pooled average over 14-15 to 16-17 school characteristics data"
{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. save $projdir/dta/schoolchar/schlcharpooledmeans, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/schoolchar/schlcharpooledmeans.dta{rm}
saved
{p_end}

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factoranalysis/mattschlchar.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}31 Jul 2023, 21:43:32
{txt}{.-}
{smcl}
{txt}{sf}{ul off}