-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/mattschlchar.smcl
  log type:  smcl
 opened on:  19 Dec 2024, 19:17:52

. 
. // a macro toggle for cleaning the raw data from Matt's folder
. local clean = 0

. if `clean' == 1 {
.   use /home/research/ca_ed_lab/msnaven/common_core_va/data/sch_char, clear
. 
.   rename enr_total enrtotal
.   label var enrtotal "total enrollment"
. 
.   rename enr_minority_prop minorityenrprop
.   label var minorityenrprop "proportion of minority enrollment"
. 
.   rename enr_male_prop maleenrprop
.   label var maleenrprop "proportion of male enrollment"
. 
.   rename frpm_prop freemealprop
.   label var freemealprop "proportion eleigible for free or reduced price meal
> s"
. 
.   drop el_prop
. 
.   rename male_prop maleteachprop
.   label var maleteachprop "proportion of male teachers"
. 
.   rename eth_minority_prop minoritystaffprop
.   label var minoritystaffprop "proportion of minority staff"
. 
.   rename new_teacher_prop newteachprop
.   label var newteachprop "proportion of teachers with less than or equal to 3
>  years experience"
. 
.   rename credential_full_prop fullcredprop
.   label var fullcredprop "proprotion of full credential"
. 
.   rename fte_teach fteteach
.   label var fteteach "number of FTE teachers"
. 
.   rename fte_admin fteadmin
.   label var fteadmin "number of FTE administrators"
. 
.   rename fte_pupil ftepupil
.   label var ftepupil "number of FTE pupils"
. 
.   rename fte_teach_pc fteteachperstudent
.   label var fteteachperstudent "FTE teacher per student"
. 
.   rename fte_admin_pc fteadminperstudent
.   label var fteadminperstudent "FTE admin per student"
. 
.   rename fte_pupil_pc fteserviceperstudent
.   label var fteserviceperstudent "FTE pupil service per student"
. 
.   label data "School Characterstics data by Matt Naven, cleaned by Che Sun"
. 
.   save $projdir/dta/schoolchar/mattschlchar, replace
. }

. 
. //create elprop by collapsing student test score data to avoid missing data p
> roblem in the CDE school level dataset
. use cdscode year limited_eng_prof all_students_sample ///
> if all_students_sample==1 & inrange(year, 2015, 2017) ///
> using $vaprojdir/data/restricted_access/clean/k12_test_scores/k12_test_scores
> _clean.dta, clear
(CST/SBAC Student Test Score Samples)

. collapse elprop = limited_eng_prof, by(cdscode year)

. collapse elprop, by(cdscode)

. drop if missing(cdscode)
(1 observation deleted)

. label var elprop "proportion of English Leaners"

. compress
  (0 bytes saved)

. label data "Proportion of English Learners from collapsing student level test
>  score dataset"

. save $projdir/dta/schoolchar/elprop, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/schoolchar/elprop.d
    > ta saved

. 
. 
. 
. use $projdir/dta/schoolchar/mattschlchar, clear
(School Characterstics data by Matt Naven, cleaned by Che Sun)

. 
. // keep observations from 14-15 to 16-17 to condition on the same year as VA 
> estimates since year is the year of spring semester
. keep if inrange(year, 2015, 2017)
(294,324 observations deleted)

. drop if missing(cdscode)
(2 observations deleted)

. 
. drop enrtotal fteteach fteadmin ftepupil

. 
. collapse *prop fte*, by(cdscode)

. 
. merge 1:1 cdscode using $projdir/dta/schoolchar/elprop

    Result                      Number of obs
    -----------------------------------------
    Not matched                         4,913
        from master                     1,592  (_merge==1)
        from using                      3,321  (_merge==2)

    Matched                            10,133  (_merge==3)
    -----------------------------------------

. //keep only merged obs
. keep if _merge==3
(4,913 observations deleted)

. drop _merge

. 
. label data "Pooled average over 14-15 to 16-17 school characteristics data"

. compress
  (0 bytes saved)

. save $projdir/dta/schoolchar/schlcharpooledmeans, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/schoolchar/schlchar
    > pooledmeans.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/mattschlchar.smcl
  log type:  smcl
 closed on:  19 Dec 2024, 19:18:10
-------------------------------------------------------------------------------
