-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/pcascore.smcl
  log type:  smcl
 opened on:  19 Dec 2024, 19:20:26

. 
. /* creating pca compiste score for secondary survey */
. use $projdir/dta/buildanalysisdata/analysisready/secanalysisready, clear
(secondary pooled dataset ready for analysis with stats and response rate)

. 
. pca *mean_pooled

Principal components/correlation                 Number of obs    =      3,273
                                                 Number of comp.  =         19
                                                 Trace            =         19
    Rotation: (unrotated = principal)            Rho              =     1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      12.3279      9.96964             0.6488       0.6488
           Comp2 |      2.35828      1.28329             0.1241       0.7730
           Comp3 |      1.07499      .392058             0.0566       0.8295
           Comp4 |      .682931      .160544             0.0359       0.8655
           Comp5 |      .522387      .169876             0.0275       0.8930
           Comp6 |      .352511     .0795256             0.0186       0.9115
           Comp7 |      .272985     .0459703             0.0144       0.9259
           Comp8 |      .227015     .0465863             0.0119       0.9378
           Comp9 |      .180428     .0391184             0.0095       0.9473
          Comp10 |       .14131    .00925982             0.0074       0.9548
          Comp11 |       .13205    .00724168             0.0070       0.9617
          Comp12 |      .124809    .00898035             0.0066       0.9683
          Comp13 |      .115828    .00879322             0.0061       0.9744
          Comp14 |      .107035     .0191552             0.0056       0.9800
          Comp15 |     .0878798    .00651221             0.0046       0.9846
          Comp16 |     .0813676    .00142466             0.0043       0.9889
          Comp17 |     .0799429    .00655631             0.0042       0.9931
          Comp18 |     .0733866     .0164304             0.0039       0.9970
          Comp19 |     .0569563            .             0.0030       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6 
    -------------+------------------------------------------------------------
    qoi22mean_~d |   0.1925   -0.3041   -0.1671   -0.5510   -0.1362   -0.0715 
    qoi23mean_~d |   0.2484   -0.0786    0.1544   -0.2620    0.0041   -0.4250 
    qoi24mean_~d |   0.2586   -0.0721    0.0994   -0.3138   -0.0177   -0.2032 
    qoi25mean_~d |   0.2245    0.1846    0.3095    0.1856    0.0848   -0.3255 
    qoi26mean_~d |   0.2419    0.0793    0.2826   -0.3271    0.1946    0.1266 
    qoi27mean_~d |   0.1651    0.3163    0.4750   -0.0874    0.2456    0.4929 
    qoi28mean_~d |   0.2426   -0.0265    0.1021    0.2653   -0.5339    0.1519 
    qoi29mean_~d |   0.2514   -0.0816    0.1312    0.0055   -0.4405    0.0859 
    qoi30mean_~d |   0.2419    0.0742    0.2887    0.2284   -0.2931   -0.1613 
    qoi31mean_~d |   0.2229   -0.3339   -0.0135    0.0004    0.1754    0.2981 
    qoi32mean_~d |   0.2034   -0.2728    0.0239    0.4300    0.3459   -0.3077 
    qoi33mean_~d |   0.2291   -0.3229   -0.0227    0.1494    0.2445    0.0752 
    qoi34mean_~d |   0.2125   -0.3706   -0.0359    0.1512    0.1233    0.2920 
    qoi35mean_~d |   0.2237    0.2703   -0.2936   -0.0620    0.0349    0.0190 
    qoi36mean_~d |   0.2444    0.2076   -0.2512    0.0529    0.0027    0.0054 
    qoi37mean_~d |   0.2002    0.3516   -0.2015    0.0757    0.1100    0.0603 
    qoi38mean_~d |   0.2515    0.0415   -0.3031   -0.0134   -0.1452    0.2224 
    qoi39mean_~d |   0.2362    0.2544   -0.1588   -0.0412    0.2250   -0.1507 
    qoi40mean_~d |   0.2450    0.0954   -0.3413    0.1153   -0.0184   -0.0311 
    --------------------------------------------------------------------------

    --------------------------------------------------------------------------
        Variable |    Comp7     Comp8     Comp9    Comp10    Comp11    Comp12 
    -------------+------------------------------------------------------------
    qoi22mean_~d |   0.2047   -0.0526    0.2822    0.5079    0.2140   -0.0980 
    qoi23mean_~d |  -0.0799   -0.0289   -0.5059   -0.1869   -0.2253    0.2442 
    qoi24mean_~d |   0.0591    0.1932   -0.0622    0.0200   -0.1721    0.0905 
    qoi25mean_~d |  -0.5291   -0.0217    0.3860    0.2785   -0.0088    0.2179 
    qoi26mean_~d |  -0.0412    0.0749    0.0641   -0.3297    0.3081   -0.1279 
    qoi27mean_~d |   0.2936   -0.2729   -0.1273    0.2553   -0.1242    0.1075 
    qoi28mean_~d |   0.0230   -0.0208    0.0119    0.1526    0.2857    0.3756 
    qoi29mean_~d |   0.1978   -0.0023    0.1485   -0.4440    0.0012    0.1410 
    qoi30mean_~d |   0.0622    0.0784   -0.0427    0.0635   -0.1185   -0.7907 
    qoi31mean_~d |  -0.2953    0.0698   -0.0348    0.0073   -0.0231   -0.1648 
    qoi32mean_~d |   0.5095   -0.0824   -0.0309    0.1243    0.0690    0.0841 
    qoi33mean_~d |   0.0581    0.0923    0.1026   -0.0852   -0.1154    0.0227 
    qoi34mean_~d |  -0.2520    0.0902    0.0696   -0.1109   -0.0430    0.0298 
    qoi35mean_~d |   0.1806   -0.0528    0.5236   -0.2478   -0.4593    0.0396 
    qoi36mean_~d |  -0.0532   -0.0488   -0.0831    0.2377   -0.3026   -0.0055 
    qoi37mean_~d |   0.1426    0.7720   -0.1284    0.0816    0.2340    0.0732 
    qoi38mean_~d |  -0.2137   -0.0890   -0.3410    0.1730   -0.1697   -0.0340 
    qoi39mean_~d |  -0.1429   -0.2632    0.0492   -0.1569    0.4502   -0.1188 
    qoi40mean_~d |   0.0369   -0.4064   -0.1831   -0.1286    0.2419   -0.0562 
    --------------------------------------------------------------------------

    --------------------------------------------------------------------------
        Variable |   Comp13    Comp14    Comp15    Comp16    Comp17    Comp18 
    -------------+------------------------------------------------------------
    qoi22mean_~d |   0.0450    0.0306    0.0417   -0.0811    0.0430    0.2506 
    qoi23mean_~d |   0.1437    0.2039    0.2273   -0.0047   -0.1236    0.3484 
    qoi24mean_~d |   0.1571   -0.1014   -0.4366    0.1501    0.0091   -0.6684 
    qoi25mean_~d |   0.0244   -0.2019   -0.0158   -0.0209    0.2457    0.1193 
    qoi26mean_~d |  -0.3564   -0.4453    0.2230    0.0897   -0.2690   -0.0037 
    qoi27mean_~d |   0.1769    0.1077   -0.0884   -0.0544    0.0917    0.0703 
    qoi28mean_~d |   0.0595    0.1063    0.2130    0.1278   -0.4290   -0.1855 
    qoi29mean_~d |  -0.2713    0.1010   -0.2160   -0.1340    0.5102    0.1558 
    qoi30mean_~d |   0.1400    0.0378    0.0260   -0.0391   -0.0912    0.0355 
    qoi31mean_~d |  -0.0754    0.3075    0.1544    0.5481    0.2480   -0.0296 
    qoi32mean_~d |  -0.1987   -0.0633    0.1734    0.1617    0.1356   -0.0989 
    qoi33mean_~d |   0.0470   -0.0881   -0.0040   -0.5893   -0.1785   -0.0293 
    qoi34mean_~d |   0.2511    0.0338   -0.2872   -0.0712   -0.2165    0.1798 
    qoi35mean_~d |   0.2252    0.0488    0.3184    0.1750   -0.1168   -0.0208 
    qoi36mean_~d |  -0.6407    0.1020   -0.3542    0.0560   -0.3105    0.1553 
    qoi37mean_~d |   0.1365    0.0295   -0.0129    0.0024    0.1335    0.1913 
    qoi38mean_~d |  -0.0737   -0.2709    0.3900   -0.2971    0.3172   -0.2737 
    qoi39mean_~d |  -0.0044    0.5525   -0.0240   -0.2549    0.0068   -0.2578 
    qoi40mean_~d |   0.3183   -0.4169   -0.2990    0.2402    0.0436    0.2087 
    --------------------------------------------------------------------------

    --------------------------------------
        Variable |   Comp19 | Unexplained 
    -------------+----------+-------------
    qoi22mean_~d |   0.0405 |           0 
    qoi23mean_~d |  -0.0010 |           0 
    qoi24mean_~d |  -0.0063 |           0 
    qoi25mean_~d |  -0.0319 |           0 
    qoi26mean_~d |   0.0869 |           0 
    qoi27mean_~d |  -0.0077 |           0 
    qoi28mean_~d |  -0.0974 |           0 
    qoi29mean_~d |   0.0186 |           0 
    qoi30mean_~d |   0.0236 |           0 
    qoi31mean_~d |  -0.3335 |           0 
    qoi32mean_~d |   0.2487 |           0 
    qoi33mean_~d |  -0.5669 |           0 
    qoi34mean_~d |   0.6086 |           0 
    qoi35mean_~d |   0.0512 |           0 
    qoi36mean_~d |  -0.0313 |           0 
    qoi37mean_~d |  -0.0235 |           0 
    qoi38mean_~d |   0.2190 |           0 
    qoi39mean_~d |   0.0918 |           0 
    qoi40mean_~d |  -0.2319 |           0 
    --------------------------------------

. predict pc1, score
(18 components skipped)

Scoring coefficients 
    sum of squares(column-loading) = 1

    --------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6 
    -------------+------------------------------------------------------------
    qoi22mean_~d |   0.1925   -0.3041   -0.1671   -0.5510   -0.1362   -0.0715 
    qoi23mean_~d |   0.2484   -0.0786    0.1544   -0.2620    0.0041   -0.4250 
    qoi24mean_~d |   0.2586   -0.0721    0.0994   -0.3138   -0.0177   -0.2032 
    qoi25mean_~d |   0.2245    0.1846    0.3095    0.1856    0.0848   -0.3255 
    qoi26mean_~d |   0.2419    0.0793    0.2826   -0.3271    0.1946    0.1266 
    qoi27mean_~d |   0.1651    0.3163    0.4750   -0.0874    0.2456    0.4929 
    qoi28mean_~d |   0.2426   -0.0265    0.1021    0.2653   -0.5339    0.1519 
    qoi29mean_~d |   0.2514   -0.0816    0.1312    0.0055   -0.4405    0.0859 
    qoi30mean_~d |   0.2419    0.0742    0.2887    0.2284   -0.2931   -0.1613 
    qoi31mean_~d |   0.2229   -0.3339   -0.0135    0.0004    0.1754    0.2981 
    qoi32mean_~d |   0.2034   -0.2728    0.0239    0.4300    0.3459   -0.3077 
    qoi33mean_~d |   0.2291   -0.3229   -0.0227    0.1494    0.2445    0.0752 
    qoi34mean_~d |   0.2125   -0.3706   -0.0359    0.1512    0.1233    0.2920 
    qoi35mean_~d |   0.2237    0.2703   -0.2936   -0.0620    0.0349    0.0190 
    qoi36mean_~d |   0.2444    0.2076   -0.2512    0.0529    0.0027    0.0054 
    qoi37mean_~d |   0.2002    0.3516   -0.2015    0.0757    0.1100    0.0603 
    qoi38mean_~d |   0.2515    0.0415   -0.3031   -0.0134   -0.1452    0.2224 
    qoi39mean_~d |   0.2362    0.2544   -0.1588   -0.0412    0.2250   -0.1507 
    qoi40mean_~d |   0.2450    0.0954   -0.3413    0.1153   -0.0184   -0.0311 
    --------------------------------------------------------------------------

    --------------------------------------------------------------------------
        Variable |    Comp7     Comp8     Comp9    Comp10    Comp11    Comp12 
    -------------+------------------------------------------------------------
    qoi22mean_~d |   0.2047   -0.0526    0.2822    0.5079    0.2140   -0.0980 
    qoi23mean_~d |  -0.0799   -0.0289   -0.5059   -0.1869   -0.2253    0.2442 
    qoi24mean_~d |   0.0591    0.1932   -0.0622    0.0200   -0.1721    0.0905 
    qoi25mean_~d |  -0.5291   -0.0217    0.3860    0.2785   -0.0088    0.2179 
    qoi26mean_~d |  -0.0412    0.0749    0.0641   -0.3297    0.3081   -0.1279 
    qoi27mean_~d |   0.2936   -0.2729   -0.1273    0.2553   -0.1242    0.1075 
    qoi28mean_~d |   0.0230   -0.0208    0.0119    0.1526    0.2857    0.3756 
    qoi29mean_~d |   0.1978   -0.0023    0.1485   -0.4440    0.0012    0.1410 
    qoi30mean_~d |   0.0622    0.0784   -0.0427    0.0635   -0.1185   -0.7907 
    qoi31mean_~d |  -0.2953    0.0698   -0.0348    0.0073   -0.0231   -0.1648 
    qoi32mean_~d |   0.5095   -0.0824   -0.0309    0.1243    0.0690    0.0841 
    qoi33mean_~d |   0.0581    0.0923    0.1026   -0.0852   -0.1154    0.0227 
    qoi34mean_~d |  -0.2520    0.0902    0.0696   -0.1109   -0.0430    0.0298 
    qoi35mean_~d |   0.1806   -0.0528    0.5236   -0.2478   -0.4593    0.0396 
    qoi36mean_~d |  -0.0532   -0.0488   -0.0831    0.2377   -0.3026   -0.0055 
    qoi37mean_~d |   0.1426    0.7720   -0.1284    0.0816    0.2340    0.0732 
    qoi38mean_~d |  -0.2137   -0.0890   -0.3410    0.1730   -0.1697   -0.0340 
    qoi39mean_~d |  -0.1429   -0.2632    0.0492   -0.1569    0.4502   -0.1188 
    qoi40mean_~d |   0.0369   -0.4064   -0.1831   -0.1286    0.2419   -0.0562 
    --------------------------------------------------------------------------

    --------------------------------------------------------------------------
        Variable |   Comp13    Comp14    Comp15    Comp16    Comp17    Comp18 
    -------------+------------------------------------------------------------
    qoi22mean_~d |   0.0450    0.0306    0.0417   -0.0811    0.0430    0.2506 
    qoi23mean_~d |   0.1437    0.2039    0.2273   -0.0047   -0.1236    0.3484 
    qoi24mean_~d |   0.1571   -0.1014   -0.4366    0.1501    0.0091   -0.6684 
    qoi25mean_~d |   0.0244   -0.2019   -0.0158   -0.0209    0.2457    0.1193 
    qoi26mean_~d |  -0.3564   -0.4453    0.2230    0.0897   -0.2690   -0.0037 
    qoi27mean_~d |   0.1769    0.1077   -0.0884   -0.0544    0.0917    0.0703 
    qoi28mean_~d |   0.0595    0.1063    0.2130    0.1278   -0.4290   -0.1855 
    qoi29mean_~d |  -0.2713    0.1010   -0.2160   -0.1340    0.5102    0.1558 
    qoi30mean_~d |   0.1400    0.0378    0.0260   -0.0391   -0.0912    0.0355 
    qoi31mean_~d |  -0.0754    0.3075    0.1544    0.5481    0.2480   -0.0296 
    qoi32mean_~d |  -0.1987   -0.0633    0.1734    0.1617    0.1356   -0.0989 
    qoi33mean_~d |   0.0470   -0.0881   -0.0040   -0.5893   -0.1785   -0.0293 
    qoi34mean_~d |   0.2511    0.0338   -0.2872   -0.0712   -0.2165    0.1798 
    qoi35mean_~d |   0.2252    0.0488    0.3184    0.1750   -0.1168   -0.0208 
    qoi36mean_~d |  -0.6407    0.1020   -0.3542    0.0560   -0.3105    0.1553 
    qoi37mean_~d |   0.1365    0.0295   -0.0129    0.0024    0.1335    0.1913 
    qoi38mean_~d |  -0.0737   -0.2709    0.3900   -0.2971    0.3172   -0.2737 
    qoi39mean_~d |  -0.0044    0.5525   -0.0240   -0.2549    0.0068   -0.2578 
    qoi40mean_~d |   0.3183   -0.4169   -0.2990    0.2402    0.0436    0.2087 
    --------------------------------------------------------------------------

    ------------------------
        Variable |   Comp19 
    -------------+----------
    qoi22mean_~d |   0.0405 
    qoi23mean_~d |  -0.0010 
    qoi24mean_~d |  -0.0063 
    qoi25mean_~d |  -0.0319 
    qoi26mean_~d |   0.0869 
    qoi27mean_~d |  -0.0077 
    qoi28mean_~d |  -0.0974 
    qoi29mean_~d |   0.0186 
    qoi30mean_~d |   0.0236 
    qoi31mean_~d |  -0.3335 
    qoi32mean_~d |   0.2487 
    qoi33mean_~d |  -0.5669 
    qoi34mean_~d |   0.6086 
    qoi35mean_~d |   0.0512 
    qoi36mean_~d |  -0.0313 
    qoi37mean_~d |  -0.0235 
    qoi38mean_~d |   0.2190 
    qoi39mean_~d |   0.0918 
    qoi40mean_~d |  -0.2319 
    ------------------------

. histogram pc1, freq
(bin=35, start=-21.385639, width=1.1406883)

. graph export $projdir/out/graph/factoranalysis/pcascore/secpcascore.png, repl
> ace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/factoranalysi
    > s/pcascore/secpcascore.png saved as PNG format

. 
. 
. /* creating pca compiste score for parent survey */
. use $projdir/dta/buildanalysisdata/analysisready/parentanalysisready, clear
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

. 
. pca *mean_pooled

Principal components/correlation                 Number of obs    =      2,261
                                                 Number of comp.  =         11
                                                 Trace            =         11
    Rotation: (unrotated = principal)            Rho              =     1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      7.63029      6.60343             0.6937       0.6937
           Comp2 |      1.02686      .535881             0.0934       0.7870
           Comp3 |       .49098     .0780491             0.0446       0.8316
           Comp4 |      .412931     .0853554             0.0375       0.8692
           Comp5 |      .327576     .0457247             0.0298       0.8990
           Comp6 |      .281851       .05217             0.0256       0.9246
           Comp7 |      .229681     .0500268             0.0209       0.9455
           Comp8 |      .179654     .0303948             0.0163       0.9618
           Comp9 |      .149259    .00893883             0.0136       0.9754
          Comp10 |       .14032    .00971882             0.0128       0.9881
          Comp11 |      .130601            .             0.0119       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6 
    -------------+------------------------------------------------------------
    qoi9mean_p~d |   0.3148    0.0062   -0.1606   -0.1045   -0.5903   -0.2965 
    qoi15mean_~d |   0.2744    0.4598   -0.1053   -0.2390    0.4318   -0.5642 
    qoi16mean_~d |   0.3305   -0.0836   -0.0292   -0.2314    0.0392   -0.1470 
    qoi17mean_~d |   0.3194   -0.0215   -0.4577    0.0985    0.2201    0.2177 
    qoi27mean_~d |   0.3109   -0.1853   -0.4064    0.0786    0.3001    0.4085 
    qoi30mean_~d |   0.3216   -0.1069    0.3734   -0.2599   -0.0817    0.1468 
    qoi31mean_~d |   0.3324   -0.0418    0.0903   -0.3184   -0.0150    0.0761 
    qoi32mean_~d |   0.2809   -0.2572    0.5553    0.4628    0.3883   -0.1811 
    qoi33mean_~d |   0.2974   -0.2240   -0.1931    0.5415   -0.3299   -0.2968 
    qoi34mean_~d |   0.3219    0.0275    0.2812   -0.1692   -0.1980    0.3568 
    qoi64mean_~d |   0.1811    0.7852    0.1240    0.3971   -0.1391    0.2870 
    --------------------------------------------------------------------------

    ----------------------------------------------------------------
        Variable |    Comp7     Comp8     Comp9    Comp10    Comp11 
    -------------+--------------------------------------------------
    qoi9mean_p~d |   0.5057   -0.3463    0.1091    0.1508    0.1325 
    qoi15mean_~d |  -0.2756   -0.2171    0.1107   -0.0047    0.0701 
    qoi16mean_~d |   0.2996    0.4879   -0.1146   -0.6587   -0.1773 
    qoi17mean_~d |   0.0732    0.0089   -0.6661    0.1840    0.3155 
    qoi27mean_~d |   0.0823   -0.1572    0.6315   -0.0730   -0.0715 
    qoi30mean_~d |  -0.1934    0.3123    0.2213    0.1370    0.6688 
    qoi31mean_~d |  -0.0548    0.2494   -0.0502    0.5910   -0.5960 
    qoi32mean_~d |   0.3222   -0.1806   -0.0629    0.0839   -0.0381 
    qoi33mean_~d |  -0.5348    0.1906    0.0472   -0.0447   -0.0859 
    qoi34mean_~d |  -0.3389   -0.5433   -0.2364   -0.3565   -0.1686 
    qoi64mean_~d |   0.1463    0.2150    0.0815   -0.0034   -0.0409 
    ----------------------------------------------------------------

    ---------------------------
        Variable | Unexplained 
    -------------+-------------
    qoi9mean_p~d |           0 
    qoi15mean_~d |           0 
    qoi16mean_~d |           0 
    qoi17mean_~d |           0 
    qoi27mean_~d |           0 
    qoi30mean_~d |           0 
    qoi31mean_~d |           0 
    qoi32mean_~d |           0 
    qoi33mean_~d |           0 
    qoi34mean_~d |           0 
    qoi64mean_~d |           0 
    ---------------------------

. predict pc1, score
(10 components skipped)

Scoring coefficients 
    sum of squares(column-loading) = 1

    --------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6 
    -------------+------------------------------------------------------------
    qoi9mean_p~d |   0.3148    0.0062   -0.1606   -0.1045   -0.5903   -0.2965 
    qoi15mean_~d |   0.2744    0.4598   -0.1053   -0.2390    0.4318   -0.5642 
    qoi16mean_~d |   0.3305   -0.0836   -0.0292   -0.2314    0.0392   -0.1470 
    qoi17mean_~d |   0.3194   -0.0215   -0.4577    0.0985    0.2201    0.2177 
    qoi27mean_~d |   0.3109   -0.1853   -0.4064    0.0786    0.3001    0.4085 
    qoi30mean_~d |   0.3216   -0.1069    0.3734   -0.2599   -0.0817    0.1468 
    qoi31mean_~d |   0.3324   -0.0418    0.0903   -0.3184   -0.0150    0.0761 
    qoi32mean_~d |   0.2809   -0.2572    0.5553    0.4628    0.3883   -0.1811 
    qoi33mean_~d |   0.2974   -0.2240   -0.1931    0.5415   -0.3299   -0.2968 
    qoi34mean_~d |   0.3219    0.0275    0.2812   -0.1692   -0.1980    0.3568 
    qoi64mean_~d |   0.1811    0.7852    0.1240    0.3971   -0.1391    0.2870 
    --------------------------------------------------------------------------

    ----------------------------------------------------------------
        Variable |    Comp7     Comp8     Comp9    Comp10    Comp11 
    -------------+--------------------------------------------------
    qoi9mean_p~d |   0.5057   -0.3463    0.1091    0.1508    0.1325 
    qoi15mean_~d |  -0.2756   -0.2171    0.1107   -0.0047    0.0701 
    qoi16mean_~d |   0.2996    0.4879   -0.1146   -0.6587   -0.1773 
    qoi17mean_~d |   0.0732    0.0089   -0.6661    0.1840    0.3155 
    qoi27mean_~d |   0.0823   -0.1572    0.6315   -0.0730   -0.0715 
    qoi30mean_~d |  -0.1934    0.3123    0.2213    0.1370    0.6688 
    qoi31mean_~d |  -0.0548    0.2494   -0.0502    0.5910   -0.5960 
    qoi32mean_~d |   0.3222   -0.1806   -0.0629    0.0839   -0.0381 
    qoi33mean_~d |  -0.5348    0.1906    0.0472   -0.0447   -0.0859 
    qoi34mean_~d |  -0.3389   -0.5433   -0.2364   -0.3565   -0.1686 
    qoi64mean_~d |   0.1463    0.2150    0.0815   -0.0034   -0.0409 
    ----------------------------------------------------------------

. histogram pc1, freq
(bin=33, start=-14.856897, width=.67467912)

. graph export $projdir/out/graph/factoranalysis/pcascore/parentpcascore.png, r
> eplace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/factoranalysi
    > s/pcascore/parentpcascore.png saved as PNG format

. 
. 
. /* creating pca compiste score for staff survey */
. use $projdir/dta/buildanalysisdata/analysisready/staffanalysisready, clear
(weighted average staff qoi statistics pooled over years)

. 
. pca *mean_pooled

Principal components/correlation                 Number of obs    =      2,991
                                                 Number of comp.  =         15
                                                 Trace            =         15
    Rotation: (unrotated = principal)            Rho              =     1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      6.19319      3.76582             0.4129       0.4129
           Comp2 |      2.42736      .714888             0.1618       0.5747
           Comp3 |      1.71247      .891496             0.1142       0.6889
           Comp4 |      .820978     .0442968             0.0547       0.7436
           Comp5 |      .776681      .182328             0.0518       0.7954
           Comp6 |      .594354      .135197             0.0396       0.8350
           Comp7 |      .459156      .109416             0.0306       0.8656
           Comp8 |      .349741     .0285944             0.0233       0.8889
           Comp9 |      .321147     .0331354             0.0214       0.9103
          Comp10 |      .288011     .0210961             0.0192       0.9295
          Comp11 |      .266915      .041258             0.0178       0.9473
          Comp12 |      .225657     .0163799             0.0150       0.9624
          Comp13 |      .209277     .0109828             0.0140       0.9763
          Comp14 |      .198294     .0415301             0.0132       0.9895
          Comp15 |      .156764            .             0.0105       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6 
    -------------+------------------------------------------------------------
    qoi10mean_~d |   0.1656   -0.0598    0.6210   -0.1036    0.0953    0.0632 
    qoi20mean_~d |   0.1819   -0.0171    0.2866    0.8360    0.2338    0.0109 
    qoi24mean_~d |   0.3037   -0.2501   -0.0196    0.0774   -0.2019   -0.1556 
    qoi41mean_~d |   0.2768   -0.2443    0.0880   -0.0579   -0.4111   -0.4558 
    qoi44mean_~d |   0.3307   -0.2625   -0.0034   -0.0106   -0.1594   -0.1105 
    qoi64mean_~d |   0.2966   -0.2342   -0.1791    0.1707    0.1906    0.2934 
    qoi87mean_~d |   0.3010   -0.2399   -0.1697   -0.0494    0.0065    0.1146 
    qoi98mean_~d |   0.2327   -0.2540   -0.3742   -0.1392    0.2022    0.4289 
    qoi103mean~d |   0.2259    0.4095   -0.0000    0.0951   -0.3600    0.2644 
    qoi104mean~d |   0.2305    0.4005   -0.0308    0.0767   -0.3441    0.2615 
    qoi105mean~d |   0.2679    0.2987   -0.0589   -0.0375    0.3051   -0.2247 
    qoi109mean~d |   0.2550    0.3168   -0.0606   -0.0671   -0.1419    0.0668 
    qoi111mean~d |   0.2488    0.2774    0.0181   -0.2033    0.4839   -0.1697 
    qoi112mean~d |   0.3214    0.1443   -0.0933   -0.1437    0.1641   -0.3470 
    qoi128mean~d |   0.1497   -0.1127    0.5532   -0.3837    0.0392    0.3551 
    --------------------------------------------------------------------------

    --------------------------------------------------------------------------
        Variable |    Comp7     Comp8     Comp9    Comp10    Comp11    Comp12 
    -------------+------------------------------------------------------------
    qoi10mean_~d |  -0.0820    0.0873   -0.1293   -0.0075   -0.6170   -0.2405 
    qoi20mean_~d |  -0.0116    0.0344    0.2489    0.0711    0.2117   -0.0156 
    qoi24mean_~d |  -0.1615   -0.1890   -0.5589   -0.3511    0.3603   -0.2866 
    qoi41mean_~d |   0.0479    0.1198    0.1945    0.3109    0.0031    0.4254 
    qoi44mean_~d |  -0.0311    0.0232   -0.0447    0.0450   -0.1926    0.0652 
    qoi64mean_~d |  -0.0174   -0.2208   -0.3214    0.2221   -0.2013    0.2613 
    qoi87mean_~d |   0.0191    0.4172    0.4209   -0.5863   -0.0701   -0.1231 
    qoi98mean_~d |   0.0647    0.0049    0.1243    0.2788   -0.0013   -0.0706 
    qoi103mean~d |   0.1598    0.0923   -0.1362    0.0891   -0.1194   -0.1500 
    qoi104mean~d |   0.1832    0.2835   -0.1148    0.0073    0.1161    0.1202 
    qoi105mean~d |   0.4477   -0.3653   -0.0099   -0.3997   -0.1736    0.3492 
    qoi109mean~d |  -0.6760   -0.4490    0.3630   -0.0447   -0.0553    0.0160 
    qoi111mean~d |  -0.3731    0.4967   -0.2472    0.0949    0.1996    0.1996 
    qoi112mean~d |   0.2724   -0.1076    0.1677    0.3511    0.1073   -0.6071 
    qoi128mean~d |   0.1705   -0.1884    0.1430   -0.0003    0.4999    0.1364 
    --------------------------------------------------------------------------

    ----------------------------------------------------------
        Variable |   Comp13    Comp14    Comp15 | Unexplained 
    -------------+------------------------------+-------------
    qoi10mean_~d |   0.2309   -0.0603    0.1816 |           0 
    qoi20mean_~d |   0.0909    0.0911   -0.0294 |           0 
    qoi24mean_~d |   0.1744    0.0793    0.1666 |           0 
    qoi41mean_~d |   0.0473    0.0883    0.3656 |           0 
    qoi44mean_~d |  -0.0015    0.0796   -0.8549 |           0 
    qoi64mean_~d |  -0.4594   -0.3518    0.1682 |           0 
    qoi87mean_~d |  -0.2561   -0.0967    0.1310 |           0 
    qoi98mean_~d |   0.5316    0.3171    0.1075 |           0 
    qoi103mean~d |  -0.3694    0.5778    0.0718 |           0 
    qoi104mean~d |   0.3638   -0.5488   -0.0656 |           0 
    qoi105mean~d |   0.1632    0.1337    0.0160 |           0 
    qoi109mean~d |   0.0410   -0.0643    0.0190 |           0 
    qoi111mean~d |  -0.0591    0.1283   -0.0275 |           0 
    qoi112mean~d |  -0.1470   -0.2455    0.0003 |           0 
    qoi128mean~d |  -0.1561    0.0118   -0.0778 |           0 
    ----------------------------------------------------------

. predict pc1 pc2, score
(13 components skipped)

Scoring coefficients 
    sum of squares(column-loading) = 1

    --------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6 
    -------------+------------------------------------------------------------
    qoi10mean_~d |   0.1656   -0.0598    0.6210   -0.1036    0.0953    0.0632 
    qoi20mean_~d |   0.1819   -0.0171    0.2866    0.8360    0.2338    0.0109 
    qoi24mean_~d |   0.3037   -0.2501   -0.0196    0.0774   -0.2019   -0.1556 
    qoi41mean_~d |   0.2768   -0.2443    0.0880   -0.0579   -0.4111   -0.4558 
    qoi44mean_~d |   0.3307   -0.2625   -0.0034   -0.0106   -0.1594   -0.1105 
    qoi64mean_~d |   0.2966   -0.2342   -0.1791    0.1707    0.1906    0.2934 
    qoi87mean_~d |   0.3010   -0.2399   -0.1697   -0.0494    0.0065    0.1146 
    qoi98mean_~d |   0.2327   -0.2540   -0.3742   -0.1392    0.2022    0.4289 
    qoi103mean~d |   0.2259    0.4095   -0.0000    0.0951   -0.3600    0.2644 
    qoi104mean~d |   0.2305    0.4005   -0.0308    0.0767   -0.3441    0.2615 
    qoi105mean~d |   0.2679    0.2987   -0.0589   -0.0375    0.3051   -0.2247 
    qoi109mean~d |   0.2550    0.3168   -0.0606   -0.0671   -0.1419    0.0668 
    qoi111mean~d |   0.2488    0.2774    0.0181   -0.2033    0.4839   -0.1697 
    qoi112mean~d |   0.3214    0.1443   -0.0933   -0.1437    0.1641   -0.3470 
    qoi128mean~d |   0.1497   -0.1127    0.5532   -0.3837    0.0392    0.3551 
    --------------------------------------------------------------------------

    --------------------------------------------------------------------------
        Variable |    Comp7     Comp8     Comp9    Comp10    Comp11    Comp12 
    -------------+------------------------------------------------------------
    qoi10mean_~d |  -0.0820    0.0873   -0.1293   -0.0075   -0.6170   -0.2405 
    qoi20mean_~d |  -0.0116    0.0344    0.2489    0.0711    0.2117   -0.0156 
    qoi24mean_~d |  -0.1615   -0.1890   -0.5589   -0.3511    0.3603   -0.2866 
    qoi41mean_~d |   0.0479    0.1198    0.1945    0.3109    0.0031    0.4254 
    qoi44mean_~d |  -0.0311    0.0232   -0.0447    0.0450   -0.1926    0.0652 
    qoi64mean_~d |  -0.0174   -0.2208   -0.3214    0.2221   -0.2013    0.2613 
    qoi87mean_~d |   0.0191    0.4172    0.4209   -0.5863   -0.0701   -0.1231 
    qoi98mean_~d |   0.0647    0.0049    0.1243    0.2788   -0.0013   -0.0706 
    qoi103mean~d |   0.1598    0.0923   -0.1362    0.0891   -0.1194   -0.1500 
    qoi104mean~d |   0.1832    0.2835   -0.1148    0.0073    0.1161    0.1202 
    qoi105mean~d |   0.4477   -0.3653   -0.0099   -0.3997   -0.1736    0.3492 
    qoi109mean~d |  -0.6760   -0.4490    0.3630   -0.0447   -0.0553    0.0160 
    qoi111mean~d |  -0.3731    0.4967   -0.2472    0.0949    0.1996    0.1996 
    qoi112mean~d |   0.2724   -0.1076    0.1677    0.3511    0.1073   -0.6071 
    qoi128mean~d |   0.1705   -0.1884    0.1430   -0.0003    0.4999    0.1364 
    --------------------------------------------------------------------------

    --------------------------------------------
        Variable |   Comp13    Comp14    Comp15 
    -------------+------------------------------
    qoi10mean_~d |   0.2309   -0.0603    0.1816 
    qoi20mean_~d |   0.0909    0.0911   -0.0294 
    qoi24mean_~d |   0.1744    0.0793    0.1666 
    qoi41mean_~d |   0.0473    0.0883    0.3656 
    qoi44mean_~d |  -0.0015    0.0796   -0.8549 
    qoi64mean_~d |  -0.4594   -0.3518    0.1682 
    qoi87mean_~d |  -0.2561   -0.0967    0.1310 
    qoi98mean_~d |   0.5316    0.3171    0.1075 
    qoi103mean~d |  -0.3694    0.5778    0.0718 
    qoi104mean~d |   0.3638   -0.5488   -0.0656 
    qoi105mean~d |   0.1632    0.1337    0.0160 
    qoi109mean~d |   0.0410   -0.0643    0.0190 
    qoi111mean~d |  -0.0591    0.1283   -0.0275 
    qoi112mean~d |  -0.1470   -0.2455    0.0003 
    qoi128mean~d |  -0.1561    0.0118   -0.0778 
    --------------------------------------------

. histogram pc1, freq
(bin=34, start=-10.710596, width=.56375669)

. graph export $projdir/out/graph/factoranalysis/pcascore/staffpc1score.png, re
> place
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/factoranalysi
    > s/pcascore/staffpc1score.png saved as PNG format

. histogram pc1, freq
(bin=34, start=-10.710596, width=.56375669)

. graph export $projdir/out/graph/factoranalysis/pcascore/staffpc2score.png, re
> place
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/factoranalysi
    > s/pcascore/staffpc2score.png saved as PNG format

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/pcascore.smcl
  log type:  smcl
 closed on:  19 Dec 2024, 19:20:31
-------------------------------------------------------------------------------
