-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/testscore.smcl
  log type:  smcl
 opened on:  19 Dec 2024, 19:18:10

. 
. 
. // load up the subsample of students Matt is using. This includes grade 11 st
> udents in year 2015-2017 (year of the spring semester)
. use merge_id_k12_test_scores state_student_id dataset cdscode grade year all_
> scores_sample ///
> if grade==11 & dataset=="CAASPP" & inrange(year, 2015, 2017) & all_scores_sam
> ple==1 ///
> using $vaprojdir/data/restricted_access/clean/k12_test_scores/k12_test_scores
> _clean.dta, clear
(CST/SBAC Student Test Score Samples)

. 
. // merge with the lagged test score data
. merge 1:1 merge_id_k12_test_scores using $vaprojdir/data/restricted_access/cl
> ean/k12_test_scores/k12_lag_test_scores_clean.dta

    Result                      Number of obs
    -----------------------------------------
    Not matched                    76,779,668
        from master                         0  (_merge==1)
        from using                 76,779,668  (_merge==2)

    Matched                         1,431,423  (_merge==3)
    -----------------------------------------

. //only keep merged observations
. keep if _merge == 3
(76,779,668 observations deleted)

. drop _merge

. 
. /* use grade 7 ELA score for grade 8 in year 2017 due to missing data */
. gen prior_gr8_zscore = L3_cst_ela_z_score if inrange(year, 2015, 2016)
(639,784 missing values generated)

. replace prior_gr8_zscore = L4_cst_ela_z_score if year==2017
(386,845 real changes made)

. 
. //keep only the 6th grade math score (L5) and 8th grade (L3) ELA score
. keep state_student_id grade year cdscode merge_id_k12_test_scores dataset L5_
> cst_math_z_score prior_gr8_zscore

. 
. //collapse to get average test scores for each school per year
. collapse L5_cst_math_z_score prior_gr8_zscore, by (cdscode year)

. 
. //collapse again to average across years
. collapse avg_gr6math_zscore=L5_cst_math_z_score avg_gr8ela_zscore=prior_gr8_z
> score, by(cdscode)

. 
. label var avg_gr6math_zscore "pooled avg 6th grade math z score for 11th grad
> ers in 2014-15 to 2016-17 "

. label var avg_gr8ela_zscore "pooled avg 8th grade ELA z score for 11th grader
> s in 2014-15 to 2016-17"

. 
. drop if missing(cdscode)
(1 observation deleted)

. 
. label data "SBAC 6th grade math and 8th grade ELA test score for 11 graders i
> n 1415-1617"

. 
. save $projdir/dta/schoolchar/testscorecontrols, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/schoolchar/testscor
    > econtrols.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/factor
> analysis/testscore.smcl
  log type:  smcl
 closed on:  19 Dec 2024, 19:20:09
-------------------------------------------------------------------------------
