-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/prepar
> e/poolgr11enr.smcl
  log type:  smcl
 opened on:   7 Apr 2022, 14:57:25

. 
. /* append the datasets */
. use $projdir/dta/enrollment/schoollevel/enr1819, clear

. append using $projdir/dta/enrollment/schoollevel/enr1718
(variable gr1noethnicenr was byte, now int to accommodate using data's
       values)
(variable gr3blackenr was byte, now int to accommodate using data's values)
(variable gr6noethnicenr was byte, now int to accommodate using data's
       values)
(variable gr7noethnicenr was byte, now int to accommodate using data's
       values)
(variable gr8noethnicenr was byte, now int to accommodate using data's
       values)

. append using $projdir/dta/enrollment/schoollevel/enr1617
(variable gr5blackenr was byte, now int to accommodate using data's values)

. append using $projdir/dta/enrollment/schoollevel/enr1516

. append using $projdir/dta/enrollment/schoollevel/enr1415
(variable gr2noethnicenr was byte, now int to accommodate using data's
       values)
(variable gr3noethnicenr was byte, now int to accommodate using data's
       values)
(variable gr4noethnicenr was byte, now int to accommodate using data's
       values)
(variable gr5noethnicenr was byte, now int to accommodate using data's
       values)

. 
. /* collapse to get avg grade 11 enrollment over years */
. collapse (mean) gr11enr, by(cdscode)

. rename gr11enr gr11enr_mean

. label var gr11enr_mean "average grade 11 enrollment over years"

. 
. save $projdir/dta/enrollment/schoollevel/poolgr11enr, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/enrollment/schoolle
    > vel/poolgr11enr.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/prepar
> e/poolgr11enr.smcl
  log type:  smcl
 closed on:   7 Apr 2022, 14:57:25
-------------------------------------------------------------------------------
