-------------------------------------------------------------------------------
      name:  renamedata
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/prepar
> e/renamedata.smcl
  log type:  smcl
 opened on:  19 Dec 2024, 18:56:27

. 
. ************************** elementary CHKS surveys **************************
> ***
. 
. //14-15
. use "$rawdtadir/elementary/CHKS_1415_ElemData_AllDistricts_012916.dta", clear

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  variable nt was float now byte
  variable grade was float now byte
  variable edasm67 was float now byte
  variable edasm68 was float now byte
  variable esm67 was float now byte
  variable scandata was float now byte
  variable grade_orig was float now byte
  variable privateschl was float now byte
  variable scarec was float now byte
  variable scare_hi was float now byte
  variable shighc was float now byte
  variable shigh_hi was float now byte
  variable smeanc was float now byte
  variable smean_hi was float now byte
  variable hhighc was float now byte
  variable hhigh_hi was float now byte
  variable sallc was float now byte
  variable sall_hi was float now byte
  variable connectc was float now byte
  variable connect_hi was float now byte
  variable acadmotivc was float now byte
  variable acadmotiv_hi was float now byte
  variable empathyc was float now byte
  variable probsolvec was float now byte
  variable noatod was float now byte
  variable core was float now byte
  variable module_emot was float now byte
  variable module_health was float now byte
  variable module_dasm was float now byte
  variable module_gang was float now byte
  variable module_milit was float now byte
  variable module_clim was float now byte
  variable module_secemot was float now byte
  variable module_cust was float now byte
  variable county was str15 now str14
  variable district was str75 now str37
  variable custom was str16 now str10
  (10,476,690 bytes saved)

. save "$clndtadir/elementary/elem1415", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/elementary
    > /elem1415.dta saved

. 
. //15-16
. use "$rawdtadir/elementary/CHKS_1516_ElemData_AllDistricts_ID_032217.dta", cl
> ear

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/elementary/elem1516", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/elementary
    > /elem1516.dta saved

. 
. //16-17
. use "$rawdtadir/elementary/CHKS_1617_ElementaryData_Statewide_ID_081817.dta",
>  clear
(2016-17 Elementary CHKS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/elementary/elem1617", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/elementary
    > /elem1617.dta saved

. 
. //17-18
. use "$rawdtadir/elementary/CHKS_1718_ElementaryData_Statewide_ID_082818.dta",
>  clear
(2017-18 Elementary CHKS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/elementary/elem1718", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/elementary
    > /elem1718.dta saved

. 
. //18-19
. use "$rawdtadir/elementary/CHKS_1819_ElementaryData_Statewide_ID_091819.dta",
>  clear
(2018-19 Elementary CHKS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  variable district was str41 now str39
  (203,020 bytes saved)

. save "$clndtadir/elementary/elem1819", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/elementary
    > /elem1819.dta saved

. 
. 
. 
. 
. 
. ************************** Parent CSPS surveys ******************************
> ***
. /* csv does not have 13-14 and 14-15, whereas dta has them. the "csps 1314 al
> l.dta"
> does not have cds code*/
. 
. //14-15
. use "$rawdtadir/parent/csps1415 all.dta", clear
( )

. 
. tostring cnty dist schl, replace //convert numbers to strings for easier conc
> atenation
cnty was byte now str2
dist was long now str5
schl was long now str7

. 
. /* cnty is stored as long, so two digit county codes with leading zeros show 
> up as 1 digit,
> specifically there are three 1-digit cnty codes in the dataset, namely 2, 7, 
> and 9. Here I make
> the plausible assumption that these are 02, 07, and 09, which respecitively r
> epresent Alpine,
> Contra Costa, and El Dorado counties */
. replace cnty = strtrim(cnty) //remove leading and trailing blanks
(0 real changes made)

. replace cnty = stritrim(cnty) //collapse all internal consecutive blanks to o
> ne blank
(0 real changes made)

. replace cnty = "02" if cnty == "2" // reconstruct the correct cnty codes
(12 real changes made)

. replace cnty = "07" if cnty == "7"
(2,941 real changes made)

. replace cnty = "09" if cnty == "9"
(135 real changes made)

. 
. /* dist are all 5 digits, so safe for the following operations */
. replace dist = strtrim(dist) //remove leading and trailing blanks
(0 real changes made)

. replace cnty = stritrim(cnty) //collapse all internal consecutive blanks to o
> ne blank
(0 real changes made)

. 
. /* IMPORTANT NOTE 1: There are 2 school IDs that are single digit: 3 and 4, f
> or a total of 5 responses. Filling in leading zeros
> for the school code and searhc with the resulting cds code did not produce an
> y result in the California School Directory.
> Therefore I assume these are missing or incorrectly entered data and discard 
> them.  */
. /* IMPORTANT NOTE 2: There are also many school IDs that are 6 digits instead
>  of 7, and I fill in one leading 0 for them. Spot checks
> with the resulting cds code produces matches in the california school directo
> ry  */
. replace schl = strtrim(schl) //remove leading and trailing blanks
(0 real changes made)

. replace schl = stritrim(schl) //collapse all internal consecutive blanks to o
> ne blank
(0 real changes made)

. replace schl = "0" + schl if inrange(length(schl), 6, 6) // add leading zero 
> if schl code is 6 digits
(6,483 real changes made)

. 
. gen cdcode = cnty + dist //generate 7 digit county-district code

. label var cdcode "7 digit county-district code"

. gen cdscode = cdcode + schl //generate 14 digit cds code by combining cdcode 
> and school code

. save "$clndtadir/parent/parent1415", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/parent/par
    > ent1415.dta saved

. 
. //15-16
. use "$rawdtadir/parent/CSPS_1516_ParentData_AllDistricts_ID_103116", clear
(2015-16 Parent CSPS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/parent/parent1516", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/parent/par
    > ent1516.dta saved

. 
. //16-17
. use "$rawdtadir/parent/CSPS_1617_ParentData_Statewide_ID_102617", clear
(2016-17 Parent CSPS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/parent/parent1617", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/parent/par
    > ent1617.dta saved

. 
. //17-18
. use "$rawdtadir/parent/CSPS_1718_ParentData_Statewide_ID_082818", clear
(2017-18 Parent CSPS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/parent/parent1718", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/parent/par
    > ent1718.dta saved

. 
. //18-19
. use "$rawdtadir/parent/CSPS_1819_ParentData_Statewide_ID_102819", clear
(2018-19 Parent CSPS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/parent/parent1819", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/parent/par
    > ent1819.dta saved

. 
. 
. 
. ************************** Secondary CHKS surveys ***************************
> **
. 
. /* NOte: Stata codebooks exist for 11-12 and 12-13 but no dta files, only csv
>  files
> for these years. Following code will make corresponding dta files from csv fi
> les */
. 
. // IMPORTANT: When importing CSV FILES, need to convert cdscode to string, ot
> herwise information is lost
. 
. //11-12
. import delimited "$rawcsvdir/secondary/CHKS_1112_SecData_Statewide_School_ID_
> 1213Var_110414.csv", clear
(encoding automatically selected: ISO-8859-1)
(402 vars, 447,874 obs)

. tostring cdscode, replace format("%15.0f") //apply a number format to enable 
> string conversion
cdscode was double now str14

. save "$clndtadir/secondary/sec1112", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/
    > sec1112.dta saved

. 
. //12-13
. import delimited "$rawcsvdir/secondary/CHKS_1213_SecData_Statewide_School_ID_
> 111114.csv", clear
(encoding automatically selected: ISO-8859-1)
(434 vars, 353,236 obs)

. tostring cdscode, replace format("%15.0f") //apply a number format to enable 
> string conversion
cdscode was double now str14

. save "$clndtadir/secondary/sec1213", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/
    > sec1213.dta saved

. 
. //13-14
. use "$rawdtadir/secondary/CHKS_1314_SecData_AllDistricts_050718.dta", clear

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  variable grade_orig was float now byte
  (1,656,552 bytes saved)

. save "$clndtadir/secondary/sec1314", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/
    > sec1314.dta saved

. 
. //14-15
. use "$rawdtadir/secondary/CHKS_1415_SecData_AllDistricts_012916.dta", clear

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/secondary/sec1415", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/
    > sec1415.dta saved

. 
. //15-16
. use "$rawdtadir/secondary/CHKS_1516_SecData_AllDistricts_ID_032817.dta", clea
> r
(2015-16 secondary CHKS data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/secondary/sec1516", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/
    > sec1516.dta saved

. 
. //16-17
. use "$rawdtadir/secondary/CHKS_1617_SecondaryData_Statewide_ID_110917.dta", c
> lear
(2016-17 Secondary CHKS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/secondary/sec1617", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/
    > sec1617.dta saved

. 
. //17-18
. use "$rawdtadir/secondary/CHKS_1718_SecondaryData_Statewide_ID_011619b.dta", 
> clear
(2017-18 Secondary CHKS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/secondary/sec1718", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/
    > sec1718.dta saved

. 
. //18-19
. use "$rawdtadir/secondary/CHKS_1819_SecondaryData_Statewide_ID_091619.dta", c
> lear
(2018-19 Secondary CHKS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/secondary/sec1819", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/
    > sec1819.dta saved

. 
. 
. 
. 
. ************************** Staff CSSS surveys *****************************
. 
. //04-14
. use "$rawdtadir/staff/CSSS_0405to1314_15var_ID_100219", clear
(2004-2014 CSSS Staff Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/staff/staff0414", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staf
    > f0414.dta saved

. 
. //14-15
. use "$rawdtadir/staff/CSSS_1415_StaffData_AllDistricts_ID_082315", clear
(2014-15 Staff CSSS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/staff/staff1415", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staf
    > f1415.dta saved

. 
. //15-16
. use "$rawdtadir/staff/CSSS_1516_StaffData_AllDistricts_ID_092616", clear
(2015-16 Staff CSSS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/staff/staff1516", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staf
    > f1516.dta saved

. 
. //16-17
. use "$rawdtadir/staff/CSSS_1617_StaffData_Statewide_ID_081817", clear
(2016-17 Staff CSSS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/staff/staff1617", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staf
    > f1617.dta saved

. 
. //17-18
. use "$rawdtadir/staff/CSSS_1718_StaffData_Statewide_ID_082918", clear
(2017-18 Staff CSSS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/staff/staff1718", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staf
    > f1718.dta saved

. 
. //18-19
. use "$rawdtadir/staff/CSSS_1819_StaffData_Statewide_ID_090319", clear
(2018-19 Staff CSSS Data)

. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
(0 real changes made)

. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blank
> s to one blank
(0 real changes made)

. compress
  (0 bytes saved)

. save "$clndtadir/staff/staff1819", replace
file
    /home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staf
    > f1819.dta saved

. 
. 
. log close renamedata //close log file
      name:  renamedata
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/prepar
> e/renamedata.smcl
  log type:  smcl
 closed on:  19 Dec 2024, 18:59:11
-------------------------------------------------------------------------------
