{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}renamedata
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/prepare/renamedata.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Dec 2024, 18:56:27
{txt}
{com}. 
. ************************** elementary CHKS surveys *****************************
. 
. //14-15
. use "$rawdtadir/elementary/CHKS_1415_ElemData_AllDistricts_012916.dta", clear
{txt}
{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
  {txt}variable {bf}{res}nt{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}grade{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}edasm67{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}edasm68{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}esm67{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}scandata{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}grade_orig{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}privateschl{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}scarec{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}scare_hi{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}shighc{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}shigh_hi{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}smeanc{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}smean_hi{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}hhighc{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}hhigh_hi{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}sallc{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}sall_hi{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}connectc{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}connect_hi{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}acadmotivc{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}acadmotiv_hi{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}empathyc{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}probsolvec{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}noatod{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}core{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}module_emot{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}module_health{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}module_dasm{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}module_gang{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}module_milit{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}module_clim{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}module_secemot{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}module_cust{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}county{sf}{txt} was {bf}{res}str15{sf}{txt} now {bf}{res}str14{sf}
  {txt}variable {bf}{res}district{sf}{txt} was {bf}{res}str75{sf}{txt} now {bf}{res}str37{sf}
  {txt}variable {bf}{res}custom{sf}{txt} was {bf}{res}str16{sf}{txt} now {bf}{res}str10{sf}
{txt}  (10,476,690 bytes saved)

{com}. save "$clndtadir/elementary/elem1415", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/elementary/elem1415.dta{rm}
saved
{p_end}

{com}. 
. //15-16
. use "$rawdtadir/elementary/CHKS_1516_ElemData_AllDistricts_ID_032217.dta", clear
{txt}
{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/elementary/elem1516", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/elementary/elem1516.dta{rm}
saved
{p_end}

{com}. 
. //16-17
. use "$rawdtadir/elementary/CHKS_1617_ElementaryData_Statewide_ID_081817.dta", clear
{txt}(2016-17 Elementary CHKS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/elementary/elem1617", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/elementary/elem1617.dta{rm}
saved
{p_end}

{com}. 
. //17-18
. use "$rawdtadir/elementary/CHKS_1718_ElementaryData_Statewide_ID_082818.dta", clear
{txt}(2017-18 Elementary CHKS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/elementary/elem1718", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/elementary/elem1718.dta{rm}
saved
{p_end}

{com}. 
. //18-19
. use "$rawdtadir/elementary/CHKS_1819_ElementaryData_Statewide_ID_091819.dta", clear
{txt}(2018-19 Elementary CHKS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
  {txt}variable {bf}{res}district{sf}{txt} was {bf}{res}str41{sf}{txt} now {bf}{res}str39{sf}
{txt}  (203,020 bytes saved)

{com}. save "$clndtadir/elementary/elem1819", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/elementary/elem1819.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. ************************** Parent CSPS surveys *********************************
. /* csv does not have 13-14 and 14-15, whereas dta has them. the "csps 1314 all.dta"
> does not have cds code*/
. 
. //14-15
. use "$rawdtadir/parent/csps1415 all.dta", clear
{txt}( )

{com}. 
. tostring cnty dist schl, replace //convert numbers to strings for easier concatenation
{txt}cnty was {res:byte} now {res:str2}
dist was {res:long} now {res:str5}
schl was {res:long} now {res:str7}

{com}. 
. /* cnty is stored as long, so two digit county codes with leading zeros show up as 1 digit,
> specifically there are three 1-digit cnty codes in the dataset, namely 2, 7, and 9. Here I make
> the plausible assumption that these are 02, 07, and 09, which respecitively represent Alpine,
> Contra Costa, and El Dorado counties */
. replace cnty = strtrim(cnty) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cnty = stritrim(cnty) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. replace cnty = "02" if cnty == "2" // reconstruct the correct cnty codes
{txt}(12 real changes made)

{com}. replace cnty = "07" if cnty == "7"
{txt}(2,941 real changes made)

{com}. replace cnty = "09" if cnty == "9"
{txt}(135 real changes made)

{com}. 
. /* dist are all 5 digits, so safe for the following operations */
. replace dist = strtrim(dist) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cnty = stritrim(cnty) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. 
. /* IMPORTANT NOTE 1: There are 2 school IDs that are single digit: 3 and 4, for a total of 5 responses. Filling in leading zeros
> for the school code and searhc with the resulting cds code did not produce any result in the California School Directory.
> Therefore I assume these are missing or incorrectly entered data and discard them.  */
. /* IMPORTANT NOTE 2: There are also many school IDs that are 6 digits instead of 7, and I fill in one leading 0 for them. Spot checks
> with the resulting cds code produces matches in the california school directory  */
. replace schl = strtrim(schl) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace schl = stritrim(schl) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. replace schl = "0" + schl if inrange(length(schl), 6, 6) // add leading zero if schl code is 6 digits
{txt}(6,483 real changes made)

{com}. 
. gen cdcode = cnty + dist //generate 7 digit county-district code
{txt}
{com}. label var cdcode "7 digit county-district code"
{txt}
{com}. gen cdscode = cdcode + schl //generate 14 digit cds code by combining cdcode and school code
{txt}
{com}. save "$clndtadir/parent/parent1415", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/parent/parent1415.dta{rm}
saved
{p_end}

{com}. 
. //15-16
. use "$rawdtadir/parent/CSPS_1516_ParentData_AllDistricts_ID_103116", clear
{txt}(2015-16 Parent CSPS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/parent/parent1516", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/parent/parent1516.dta{rm}
saved
{p_end}

{com}. 
. //16-17
. use "$rawdtadir/parent/CSPS_1617_ParentData_Statewide_ID_102617", clear
{txt}(2016-17 Parent CSPS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/parent/parent1617", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/parent/parent1617.dta{rm}
saved
{p_end}

{com}. 
. //17-18
. use "$rawdtadir/parent/CSPS_1718_ParentData_Statewide_ID_082818", clear
{txt}(2017-18 Parent CSPS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/parent/parent1718", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/parent/parent1718.dta{rm}
saved
{p_end}

{com}. 
. //18-19
. use "$rawdtadir/parent/CSPS_1819_ParentData_Statewide_ID_102819", clear
{txt}(2018-19 Parent CSPS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/parent/parent1819", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/parent/parent1819.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ************************** Secondary CHKS surveys *****************************
. 
. /* NOte: Stata codebooks exist for 11-12 and 12-13 but no dta files, only csv files
> for these years. Following code will make corresponding dta files from csv files */
. 
. // IMPORTANT: When importing CSV FILES, need to convert cdscode to string, otherwise information is lost
. 
. //11-12
. import delimited "$rawcsvdir/secondary/CHKS_1112_SecData_Statewide_School_ID_1213Var_110414.csv", clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(402 vars, 447,874 obs)

{com}. tostring cdscode, replace format("%15.0f") //apply a number format to enable string conversion
{txt}cdscode was {res:double} now {res:str14}

{com}. save "$clndtadir/secondary/sec1112", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/sec1112.dta{rm}
saved
{p_end}

{com}. 
. //12-13
. import delimited "$rawcsvdir/secondary/CHKS_1213_SecData_Statewide_School_ID_111114.csv", clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(434 vars, 353,236 obs)

{com}. tostring cdscode, replace format("%15.0f") //apply a number format to enable string conversion
{txt}cdscode was {res:double} now {res:str14}

{com}. save "$clndtadir/secondary/sec1213", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/sec1213.dta{rm}
saved
{p_end}

{com}. 
. //13-14
. use "$rawdtadir/secondary/CHKS_1314_SecData_AllDistricts_050718.dta", clear
{txt}
{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
  {txt}variable {bf}{res}grade_orig{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (1,656,552 bytes saved)

{com}. save "$clndtadir/secondary/sec1314", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/sec1314.dta{rm}
saved
{p_end}

{com}. 
. //14-15
. use "$rawdtadir/secondary/CHKS_1415_SecData_AllDistricts_012916.dta", clear
{txt}
{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/secondary/sec1415", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/sec1415.dta{rm}
saved
{p_end}

{com}. 
. //15-16
. use "$rawdtadir/secondary/CHKS_1516_SecData_AllDistricts_ID_032817.dta", clear
{txt}(2015-16 secondary CHKS data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/secondary/sec1516", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/sec1516.dta{rm}
saved
{p_end}

{com}. 
. //16-17
. use "$rawdtadir/secondary/CHKS_1617_SecondaryData_Statewide_ID_110917.dta", clear
{txt}(2016-17 Secondary CHKS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/secondary/sec1617", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/sec1617.dta{rm}
saved
{p_end}

{com}. 
. //17-18
. use "$rawdtadir/secondary/CHKS_1718_SecondaryData_Statewide_ID_011619b.dta", clear
{txt}(2017-18 Secondary CHKS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/secondary/sec1718", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/sec1718.dta{rm}
saved
{p_end}

{com}. 
. //18-19
. use "$rawdtadir/secondary/CHKS_1819_SecondaryData_Statewide_ID_091619.dta", clear
{txt}(2018-19 Secondary CHKS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/secondary/sec1819", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/secondary/sec1819.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. ************************** Staff CSSS surveys *****************************
. 
. //04-14
. use "$rawdtadir/staff/CSSS_0405to1314_15var_ID_100219", clear
{txt}(2004-2014 CSSS Staff Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/staff/staff0414", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staff0414.dta{rm}
saved
{p_end}

{com}. 
. //14-15
. use "$rawdtadir/staff/CSSS_1415_StaffData_AllDistricts_ID_082315", clear
{txt}(2014-15 Staff CSSS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/staff/staff1415", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staff1415.dta{rm}
saved
{p_end}

{com}. 
. //15-16
. use "$rawdtadir/staff/CSSS_1516_StaffData_AllDistricts_ID_092616", clear
{txt}(2015-16 Staff CSSS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/staff/staff1516", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staff1516.dta{rm}
saved
{p_end}

{com}. 
. //16-17
. use "$rawdtadir/staff/CSSS_1617_StaffData_Statewide_ID_081817", clear
{txt}(2016-17 Staff CSSS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/staff/staff1617", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staff1617.dta{rm}
saved
{p_end}

{com}. 
. //17-18
. use "$rawdtadir/staff/CSSS_1718_StaffData_Statewide_ID_082918", clear
{txt}(2017-18 Staff CSSS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/staff/staff1718", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staff1718.dta{rm}
saved
{p_end}

{com}. 
. //18-19
. use "$rawdtadir/staff/CSSS_1819_StaffData_Statewide_ID_090319", clear
{txt}(2018-19 Staff CSSS Data)

{com}. replace cdscode = strtrim(cdscode) //remove leading and trailing blanks
{txt}(0 real changes made)

{com}. replace cdscode = stritrim(cdscode) //collapse all internal consecutive blanks to one blank
{txt}(0 real changes made)

{com}. compress
{txt}  (0 bytes saved)

{com}. save "$clndtadir/staff/staff1819", replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/data/restricted_access/clean/calschls/staff/staff1819.dta{rm}
saved
{p_end}

{com}. 
. 
. log close renamedata //close log file
      {txt}name:  {res}renamedata
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/prepare/renamedata.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}19 Dec 2024, 18:59:11
{txt}{.-}
{smcl}
{txt}{sf}{ul off}