-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/builda
> nalysisdata/responserate/parentresponserate.smcl
  log type:  smcl
 opened on:  19 Dec 2024, 19:14:04

. 
. use $projdir/dta/buildanalysisdata/demotrim/parent/trimparentdemo1415, replac
> e
(trimmed parent demographics 1415 including only survey responses and enrollmen
> t )

. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/demotrim/parent/trimpa
> rentdemo1516

    Result                      Number of obs
    -----------------------------------------
    Not matched                           952
        from master                       389  (_merge==1)
        from using                        563  (_merge==2)

    Matched                               346  (_merge==3)
    -----------------------------------------

. /* matched: 346. not matched: 952 (from master: 389, from using: 363) */
. 
. drop _merge

. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/demotrim/parent/trimpa
> rentdemo1617

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,278
        from master                       739  (_merge==1)
        from using                        539  (_merge==2)

    Matched                               559  (_merge==3)
    -----------------------------------------

. /* matched: 559. not matched: 1278 (from master: 739, from using: 539) */
. 
. drop _merge

. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/demotrim/parent/trimpa
> rentdemo1718

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,426
        from master                       882  (_merge==1)
        from using                        544  (_merge==2)

    Matched                               955  (_merge==3)
    -----------------------------------------

. /* matched: 955. not matched: 1426 (from master: 882, from using: 544) */
. 
. drop _merge

. merge 1:1 cdscode using $projdir/dta/buildanalysisdata/demotrim/parent/trimpa
> rentdemo1819

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,285
        from master                     1,115  (_merge==1)
        from using                        170  (_merge==2)

    Matched                             1,266  (_merge==3)
    -----------------------------------------

. /* matched: 1266. not matched: 1285 (from master: 1115, from using: 170) */
. 
. drop _merge

. 
. local grades `" "1" "2" "3" "4" "5" "6" "7" "8" "9" "10" "11" "12" "' //local
>  macro for grades

. //recode the missing values for survey response as 0 since unmatched means th
> ere were no responses for that year
. foreach i of local grades {
  2.   replace svygr`i'_1415 = 0 if svygr`i'_1415 == .
  3.   replace svygr`i'_1516 = 0 if svygr`i'_1516 == .
  4.   replace svygr`i'_1617 = 0 if svygr`i'_1617 == .
  5.   replace svygr`i'_1718 = 0 if svygr`i'_1718 == .
  6.   replace svygr`i'_1819 = 0 if svygr`i'_1819 == .
  7. }
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)
(1,816 real changes made)
(1,642 real changes made)
(1,453 real changes made)
(1,052 real changes made)
(1,115 real changes made)

. 
. 
. /* generate indicators for which year each school had survey responses */
. local years `" "1415" "1516" "1617" "1718" "1819" "' //local macro for survey
>  years

. //generate total survey responses for grades 1-12
. foreach year of local years {
  2.   gen svy`year' = svygr1_`year' + svygr2_`year' + svygr3_`year' + svygr4_`
> year' + svygr5_`year' + svygr6_`year' ///
>   + svygr7_`year' + svygr8_`year' + svygr9_`year' + svygr10_`year' + svygr11_
> `year' + svygr12_`year'
  3.   label var svy`year' "total survey response for grades 1-12 households in
>  year `year'"
  4. }

. //generate total enrollment for grades 1-12
. foreach year of local years {
  2.   gen enr`year' = enrgr1_`year' + enrgr2_`year' + enrgr3_`year' + enrgr4_`
> year' + enrgr5_`year' + enrgr6_`year' ///
>   + enrgr7_`year' + enrgr8_`year' + enrgr9_`year' + enrgr10_`year' + enrgr11_
> `year' + enrgr12_`year'
  3.   label var enr`year' "total enrollment in grades 1-12 in year `year'"
  4. }
(1,816 missing values generated)
(1,642 missing values generated)
(1,453 missing values generated)
(1,052 missing values generated)
(1,115 missing values generated)

. //generate indicators for which years the school has survey responses
. foreach year of local years {
  2.   gen has`year' = 0
  3.   replace has`year' = 1 if svy`year' > 0
  4.   label var has`year' "has survey response in year `year'"
  5. }
(710 real changes made)
(869 real changes made)
(1,070 real changes made)
(1,460 real changes made)
(1,393 real changes made)

. 
. //generate overall response rate for each school including only years with su
> rvey responses
. gen denomtemp = 0 //generate a temp var for the denominator of response rate

. gen numertemp = 0 //generate a temp var for the numerator of response rate

. //add up the number of survey responses and enrollment from all years with su
> rvey response
. foreach year of local years {
  2.   replace denomtemp = denomtemp + enr`year' if has`year' == 1
  3.   replace numertemp = numertemp + svy`year' if has`year' == 1
  4. }
(710 real changes made)
(710 real changes made)
(869 real changes made)
(869 real changes made)
(1,070 real changes made)
(1,070 real changes made)
(1,460 real changes made)
(1,460 real changes made)
(1,393 real changes made)
(1,393 real changes made)

. //generate the pooled response rate only including years with responses
. gen pooledrr = numertemp/denomtemp
(56 missing values generated)

. label var pooledrr "pooled response rate for grades 1-12"

. drop denomtemp numertemp

. 
. //generate pooled response rate for grades 9 and 11 for each school including
>  only years with survey responses
. gen denomtemp = 0 //generate a temp var for the denominator of response rate

. gen numertemp = 0 //generate a temp var for the numerator of response rate

. //add up the number of survey responses in grades 9 and 11 and enrollment for
>  grades 9 and 11 from all years with survey response
. foreach year of local years {
  2.   replace denomtemp = denomtemp + enrgr9_`year' + enrgr11_`year' if has`ye
> ar' == 1
  3.   replace numertemp = numertemp + svygr9_`year' + svygr11_`year' if has`ye
> ar' == 1
  4. }
(154 real changes made)
(162 real changes made)
(212 real changes made)
(223 real changes made)
(267 real changes made)
(296 real changes made)
(345 real changes made)
(414 real changes made)
(316 real changes made)
(409 real changes made)

. //generate the pooled response rate only including years with responses
. gen pooledrr_gr9and11 = numertemp/denomtemp
(1,929 missing values generated)

. label var pooledrr_gr9and11 "pooled response rate for grades 9 and 11"

. drop denomtemp numertemp

. 
. label data "parent survey response numbers by grade year with pooled response
>  rates"

. compress
  variable svy1415 was float now int
  variable svy1516 was float now int
  variable svy1617 was float now int
  variable svy1718 was float now int
  variable svy1819 was float now int
  variable enr1415 was float now int
  variable enr1516 was float now int
  variable enr1617 was float now int
  variable enr1718 was float now int
  variable enr1819 was float now int
  variable has1415 was float now byte
  variable has1516 was float now byte
  variable has1617 was float now byte
  variable has1718 was float now byte
  variable has1819 was float now byte
  (89,285 bytes saved)

. save $projdir/dta/buildanalysisdata/responserate/parentresponserate, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/r
    > esponserate/parentresponserate.dta saved

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/builda
> nalysisdata/responserate/parentresponserate.smcl
  log type:  smcl
 closed on:  19 Dec 2024, 19:14:04
-------------------------------------------------------------------------------
