{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/buildanalysisdata/responserate/trimsecdemo.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Apr 2022, 14:56:14
{txt}
{com}. 
. ********************************************************************************
. /* rename variables in the secondary demographics datasets to indicate year, keep only vars needed to calculate response rates */
. local grades `" "9" "10" "11" "12" "' //local macro for grades
{txt}
{com}. 
. use $projdir/dta/demographics/secondary/secdemo1415, replace
{txt}
{com}. keep cdscode svygr9 svygr10 svygr11 svygr12 gr9enr gr10enr gr11enr gr12enr
{txt}
{com}. //renaming vars to indicate the year of the dataset to prepare for merging with other years later
. foreach i of local grades {c -(}
{txt}  2{com}.   rename svygr`i' svygr`i'_1415
{txt}  3{com}.   rename gr`i'enr enrgr`i'_1415
{txt}  4{com}.   label var svygr`i'_1415 "number of grade `i' responses in 1415"
{txt}  5{com}.   label var enrgr`i'_1415 "grade `i' enrollment in 1415"
{txt}  6{com}. {c )-}
{res}{txt}
{com}. label data "trimmed secondary demographics 1415 including only survey response and enrollment for grades 9-12"
{txt}note: label truncated to 80 characters

{com}. compress
{txt}  (0 bytes saved)

{com}. save $projdir/dta/buildanalysisdata/demotrim/secondary/trimsecdemo1415, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/demotrim/secondary/trimsecdemo1415.dta{rm}
saved
{p_end}

{com}. 
. 
. use $projdir/dta/demographics/secondary/secdemo1516, replace
{txt}(2015-16 secondary CHKS data)

{com}. keep cdscode svygr9 svygr10 svygr11 svygr12 gr9enr gr10enr gr11enr gr12enr
{txt}
{com}. foreach i of local grades {c -(}
{txt}  2{com}.   rename svygr`i' svygr`i'_1516
{txt}  3{com}.   rename gr`i'enr enrgr`i'_1516
{txt}  4{com}.   label var svygr`i'_1516 "number of grade `i' responses in 1516"
{txt}  5{com}.   label var enrgr`i'_1516 "grade `i' enrollment in 1516"
{txt}  6{com}. {c )-}
{res}{txt}
{com}. label data "trimmed secondary demographics 1516 including only survey response and enrollment for grades 9-12"
{txt}note: label truncated to 80 characters

{com}. compress
{txt}  (0 bytes saved)

{com}. save $projdir/dta/buildanalysisdata/demotrim/secondary/trimsecdemo1516, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/demotrim/secondary/trimsecdemo1516.dta{rm}
saved
{p_end}

{com}. 
. 
. use $projdir/dta/demographics/secondary/secdemo1617, replace
{txt}(2016-17 Secondary CHKS Data)

{com}. keep cdscode svygr9 svygr10 svygr11 svygr12 gr9enr gr10enr gr11enr gr12enr
{txt}
{com}. foreach i of local grades {c -(}
{txt}  2{com}.   rename svygr`i' svygr`i'_1617
{txt}  3{com}.   rename gr`i'enr enrgr`i'_1617
{txt}  4{com}.   label var svygr`i'_1617 "number of grade `i' responses in 1617"
{txt}  5{com}.   label var enrgr`i'_1617 "grade `i' enrollment in 1617"
{txt}  6{com}. {c )-}
{res}{txt}
{com}. label data "trimmed secondary demographics 1617 including only survey response and enrollment for grades 9-12"
{txt}note: label truncated to 80 characters

{com}. compress
{txt}  (0 bytes saved)

{com}. save $projdir/dta/buildanalysisdata/demotrim/secondary/trimsecdemo1617, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/demotrim/secondary/trimsecdemo1617.dta{rm}
saved
{p_end}

{com}. 
. 
. use $projdir/dta/demographics/secondary/secdemo1718, replace
{txt}(2017-18 Secondary CHKS Data)

{com}. keep cdscode svygr9 svygr10 svygr11 svygr12 gr9enr gr10enr gr11enr gr12enr
{txt}
{com}. foreach i of local grades {c -(}
{txt}  2{com}.   rename svygr`i' svygr`i'_1718
{txt}  3{com}.   rename gr`i'enr enrgr`i'_1718
{txt}  4{com}.   label var svygr`i'_1718 "number of grade `i' responses in 1718"
{txt}  5{com}.   label var enrgr`i'_1718 "grade `i' enrollment in 1718"
{txt}  6{com}. {c )-}
{res}{txt}
{com}. label data "trimmed secondary demographics 1718 including only survey response and enrollment for grades 9-12"
{txt}note: label truncated to 80 characters

{com}. compress
{txt}  (0 bytes saved)

{com}. save $projdir/dta/buildanalysisdata/demotrim/secondary/trimsecdemo1718, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/demotrim/secondary/trimsecdemo1718.dta{rm}
saved
{p_end}

{com}. 
. 
. use $projdir/dta/demographics/secondary/secdemo1819, replace
{txt}(2018-19 Secondary CHKS Data)

{com}. keep cdscode svygr9 svygr10 svygr11 svygr12 gr9enr gr10enr gr11enr gr12enr
{txt}
{com}. foreach i of local grades {c -(}
{txt}  2{com}.   rename svygr`i' svygr`i'_1819
{txt}  3{com}.   rename gr`i'enr enrgr`i'_1819
{txt}  4{com}.   label var svygr`i'_1819 "number of grade `i' responses in 1819"
{txt}  5{com}.   label var enrgr`i'_1819 "grade `i' enrollment in 1819"
{txt}  6{com}. {c )-}
{res}{txt}
{com}. label data "trimmed secondary demographics 1819 including only survey response and enrollment for grades 9-12"
{txt}note: label truncated to 80 characters

{com}. compress
{txt}  (0 bytes saved)

{com}. save $projdir/dta/buildanalysisdata/demotrim/secondary/trimsecdemo1819, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/demotrim/secondary/trimsecdemo1819.dta{rm}
saved
{p_end}

{com}. ********************************************************************************
. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/buildanalysisdata/responserate/trimsecdemo.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Apr 2022, 14:56:14
{txt}{.-}
{smcl}
{txt}{sf}{ul off}