{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/sample/pooledparentdiagnostics.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Dec 2024, 19:13:59
{txt}
{com}. 
. use $projdir/dta/demographics/pooled/paneldata/parentdemopanel, replace
{txt}( )

{com}. 
. /* gen gr9resprate = svygr9/gr9enr
> gen gr11reprate = svygr11/gr11enr
> label var gr9resprate "grade 9 response rate"
> label var gr11resprate "grade 11 response rate" */
. 
. /* combine grades  */
. gen svytotal = svygr9 + svygr11
{txt}
{com}. gen enrtotal = gr9enr + gr11enr
{txt}
{com}. 
. 
. //combine across years by collapse dataset
. collapse (sum) svytotal enrtotal svygr9 svygr11 gr9enr gr11enr, by(cdscode)
{res}{txt}
{com}. 
. label var svytotal "total number of parents surveyed in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var enrtotal "total number of student enrollment in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. 
. rename svygr9 svygr9total
{res}{txt}
{com}. rename svygr11 svygr11total
{res}{txt}
{com}. label var svygr9total "total numeber of parents surveyed in grade 9 from 1415 to 1819"
{txt}
{com}. label var svygr11total "total numeber of parents surveyed in grade 11 from 1415 to 1819"
{txt}
{com}. 
. rename gr9enr enrgr9total
{res}{txt}
{com}. rename gr11enr enrgr11total
{res}{txt}
{com}. label var enrgr9total "total number of student enrollment in grade 9 from 1415 to 1819"
{txt}
{com}. label var enrgr11total "total number of student enrollment in grade 11 from 1415 to 1819"
{txt}
{com}. 
. 
. gen pooledrr = svytotal/enrtotal
{txt}(1,914 missing values generated)

{com}. label var pooledrr "overall response rate pooling across grades and years"
{txt}
{com}. 
. gen pooledgr9rr = svygr9total/enrgr9total
{txt}(2,005 missing values generated)

{com}. label var pooledgr9rr "pooled response rate for grade 9 across years"
{txt}
{com}. gen pooledgr11rr = svygr11total/enrgr11total
{txt}(1,930 missing values generated)

{com}. label var pooledgr11rr "pooled response rate for grade 11 across years"
{txt}
{com}. 
. compress
  {txt}variable {bf}{res}svytotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrtotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}svygr9total{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}svygr11total{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrgr9total{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrgr11total{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
{txt}  (91,836 bytes saved)

{com}. label data "Parent demographics diagnostics pooled across grade 9 and 11 across all 5 years"
{txt}
{com}. save $projdir/dta/demographics/pooled/pooledparentdiagnostics, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/demographics/pooled/pooledparentdiagnostics.dta{rm}
saved
{p_end}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/sample/pooledparentdiagnostics.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}19 Dec 2024, 19:13:59
{txt}{.-}
{smcl}
{txt}{sf}{ul off}