-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/sample
> /pooledparentdiagnostics.smcl
  log type:  smcl
 opened on:   7 Apr 2022, 14:56:13

. 
. use $projdir/dta/demographics/pooled/paneldata/parentdemopanel, replace
( )

. 
. /* gen gr9resprate = svygr9/gr9enr
> gen gr11reprate = svygr11/gr11enr
> label var gr9resprate "grade 9 response rate"
> label var gr11resprate "grade 11 response rate" */
. 
. /* combine grades  */
. gen svytotal = svygr9 + svygr11

. gen enrtotal = gr9enr + gr11enr

. 
. 
. //combine across years by collapse dataset
. collapse (sum) svytotal enrtotal svygr9 svygr11 gr9enr gr11enr, by(cdscode)

. 
. label var svytotal "total number of parents surveyed in grade 9 and 11 from 1
> 415 to 1819"

. label var enrtotal "total number of student enrollment in grade 9 and 11 from
>  1415 to 1819"

. 
. rename svygr9 svygr9total

. rename svygr11 svygr11total

. label var svygr9total "total numeber of parents surveyed in grade 9 from 1415
>  to 1819"

. label var svygr11total "total numeber of parents surveyed in grade 11 from 14
> 15 to 1819"

. 
. rename gr9enr enrgr9total

. rename gr11enr enrgr11total

. label var enrgr9total "total number of student enrollment in grade 9 from 141
> 5 to 1819"

. label var enrgr11total "total number of student enrollment in grade 11 from 1
> 415 to 1819"

. 
. 
. gen pooledrr = svytotal/enrtotal
(1,914 missing values generated)

. label var pooledrr "overall response rate pooling across grades and years"

. 
. gen pooledgr9rr = svygr9total/enrgr9total
(2,005 missing values generated)

. label var pooledgr9rr "pooled response rate for grade 9 across years"

. gen pooledgr11rr = svygr11total/enrgr11total
(1,930 missing values generated)

. label var pooledgr11rr "pooled response rate for grade 11 across years"

. 
. compress
  variable svytotal was double now int
  variable enrtotal was double now int
  variable svygr9total was double now int
  variable svygr11total was double now int
  variable enrgr9total was double now int
  variable enrgr11total was double now int
  (91,836 bytes saved)

. label data "Parent demographics diagnostics pooled across grade 9 and 11 acro
> ss all 5 years"

. save $projdir/dta/demographics/pooled/pooledparentdiagnostics, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/demographics/pooled
    > /pooledparentdiagnostics.dta saved

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/sample
> /pooledparentdiagnostics.smcl
  log type:  smcl
 closed on:   7 Apr 2022, 14:56:13
-------------------------------------------------------------------------------
