{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/sample/pooledsecdiagnostics.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Jul 2022, 18:09:39
{txt}
{com}. 
. use $projdir/dta/demographics/pooled/paneldata/secdemopanel, replace
{txt}
{com}. 
. /* gen gr9resprate = svygr9/gr9enr
> gen gr11reprate = svygr11/gr11enr
> label var gr9resprate "grade 9 response rate"
> label var gr11resprate "grade 11 response rate" */
. 
. /* combine grades  */
. gen svytotal = svygr9 + svygr11
{txt}
{com}. gen svyfemaletotal = svyfemalegr9 + svyfemalegr11
{txt}
{com}. gen svymaletotal = svymalegr9 + svymalegr11
{txt}
{com}. gen svyhispanictotal = svyhispanicgr9 + svyhispanicgr11
{txt}
{com}. gen svyasiantotal = svyasiangr9 + svyasiangr11
{txt}
{com}. gen svyblacktotal = svyblackgr9 + svyblackgr11
{txt}
{com}. gen svywhitetotal = svywhitegr9 + svywhitegr11
{txt}
{com}. 
. gen enrtotal = gr9enr + gr11enr
{txt}
{com}. gen enrfemaletotal = gr9femaleenr + gr11femaleenr
{txt}
{com}. gen enrmaletotal = gr9maleenr + gr11maleenr
{txt}
{com}. gen enrhispanictotal = gr9hispanicenr + gr11hispanicenr
{txt}
{com}. gen enrasiantotal = gr9asianenr + gr11asianenr
{txt}
{com}. gen enrblacktotal = gr9blackenr + gr11blackenr
{txt}
{com}. gen enrwhitetotal = gr9whiteenr + gr11whiteenr
{txt}
{com}. 
. //combine across years by collapse dataset
. collapse (sum) svytotal svygr9 svygr11 svyfemaletotal svymaletotal svyhispanictotal svyasiantotal svyblacktotal svywhitetotal ///
>               enrtotal gr9enr gr11enr enrfemaletotal enrmaletotal enrhispanictotal enrasiantotal enrblacktotal enrwhitetotal, by(cdscode)
{res}{txt}
{com}. 
. rename svygr9 svygr9total
{res}{txt}
{com}. rename svygr11 svygr11total
{res}{txt}
{com}. label var svytotal "total number of students surveyed in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var svygr9total "total numeber of students surveyed in grade 9 from 1415 to 1819"
{txt}
{com}. label var svygr11total "total numeber of students surveyed in grade 11 from 1415 to 1819"
{txt}
{com}. label var svyfemaletotal "total number of females surveyed in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var svymaletotal "total number of males surveyed in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var svyhispanictotal "total number of hispanics surveyed in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var svyasiantotal "total number of asians surveyed in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var svyblacktotal "total number of blacks surveyed in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var svywhitetotal "total number of whites surveyed in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. 
. rename gr9enr enrgr9total
{res}{txt}
{com}. rename gr11enr enrgr11total
{res}{txt}
{com}. label var enrtotal "total numeber of student enrollment in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var enrgr9total "total number of student enrollment in grade 9 from 1415 to 1819"
{txt}
{com}. label var enrgr11total "total number of student enrollment in grade 11 from 1415 to 1819"
{txt}
{com}. label var enrfemaletotal "total female enrollment in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var enrmaletotal "total male enrollment in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var enrhispanictotal "total hispanic enrollment in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var enrasiantotal "total asian enrollment in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var enrblacktotal "total black enrollment in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. label var enrwhitetotal "total white enrollment in grade 9 and 11 from 1415 to 1819"
{txt}
{com}. 
. gen pooledrr = svytotal/enrtotal
{txt}(1,565 missing values generated)

{com}. label var pooledrr "overall response rate pooling across grades and years"
{txt}
{com}. 
. gen pooledgr9rr = svygr9total/enrgr9total
{txt}(1,766 missing values generated)

{com}. label var pooledgr9rr "pooled response rate for grade 9 across years"
{txt}
{com}. gen pooledgr11rr = svygr11total/enrgr11total
{txt}(1,610 missing values generated)

{com}. label var pooledgr11rr "pooled response rate for grade 11 across years"
{txt}
{com}. 
. /* note: denominator might be 0, causing missing entries */
. gen pooledfemalerr = svyfemaletotal/enrfemaletotal
{txt}(1,595 missing values generated)

{com}. label var pooledfemalerr "overall female response rate pooling across grades and years"
{txt}
{com}. 
. gen pooledmalerr = svymaletotal/enrmaletotal
{txt}(1,575 missing values generated)

{com}. label var pooledmalerr "overall male response rate pooling across grades and years"
{txt}
{com}. 
. gen pooledhispanicrr = svyhispanictotal/enrhispanictotal
{txt}(1,595 missing values generated)

{com}. label var pooledhispanicrr "overall hispanic response rate pooling across grades and years"
{txt}
{com}. 
. gen pooledasianrr = svyasiantotal/enrasiantotal
{txt}(1,915 missing values generated)

{com}. label var pooledasianrr "overall asian response rate pooling across grades and years"
{txt}
{com}. 
. gen pooledblackrr = svyblacktotal/enrblacktotal
{txt}(1,834 missing values generated)

{com}. label var pooledblackrr "overall black response rate pooling across grades and years"
{txt}
{com}. 
. gen pooledwhiterr = svywhitetotal/enrwhitetotal
{txt}(1,619 missing values generated)

{com}. label var pooledwhiterr "overall white response rate pooling across grades and years"
{txt}
{com}. 
. compress
  {txt}variable {bf}{res}svytotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}svygr9total{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}svygr11total{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}svyfemaletotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}svymaletotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}svyhispanictotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}svyasiantotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}svyblacktotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}svywhitetotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrtotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrgr9total{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrgr11total{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrfemaletotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrmaletotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrhispanictotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrasiantotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrblacktotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}enrwhitetotal{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
{txt}  (329,508 bytes saved)

{com}. label data "Secondary demographics diagnostics pooled across grade 9 and 11 across all 5 years"
{txt}note: label truncated to 80 characters

{com}. save $projdir/dta/demographics/pooled/pooledsecdiagnostics, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/demographics/pooled/pooledsecdiagnostics.dta{rm}
saved
{p_end}

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/sample/pooledsecdiagnostics.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Jul 2022, 18:09:39
{txt}{.-}
{smcl}
{txt}{sf}{ul off}