-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build//build
> analysisdata/clean_va.smcl
  log type:  smcl
 opened on:  19 Dec 2024, 19:15:33

. 
. 
. 
. 
. local date1_va_scatter_plot = c(current_date)

. local time1_va_scatter_plot = c(current_time)

. 
. 
. //---------------------------------------------------------------------------
> ---
. // collapse VA estimates to school level mean over the years 2015-2018
. //---------------------------------------------------------------------------
> ---
. 
. foreach va_outcome in ela math enr enr_2year enr_4year {
  2.   use $vaprojdir/estimates/va_cfr_all_v1/va_est_dta/va_`va_outcome'_all.dt
> a, clear
  3.   collapse (mean) va*, by(cdscode)
  4. 
.   tempfile va_`va_outcome'
  5.   save `va_`va_outcome''
  6. }
(ela estimates from all sample and control combinations)
file /home/tmp/St269807.000001 saved as .dta format
(math estimates from all sample and control combinations)
file /home/tmp/St269807.000002 saved as .dta format
(enr estimates from all sample and control combinations)
file /home/tmp/St269807.000003 saved as .dta format
(enr_2year estimates from all sample and control combinations)
file /home/tmp/St269807.000004 saved as .dta format
(enr_4year estimates from all sample and control combinations)
file /home/tmp/St269807.000005 saved as .dta format

. 
. //---------------------------------------------------------------------------
> ---
. // merge collapsed VA estimates
. //---------------------------------------------------------------------------
> ---
. 
. // use a macro to store the command to initialize the data for merge
. local merge_command use

. local merge_options clear

. 
. foreach va_outcome in ela math enr enr_2year enr_4year {
  2.   `merge_command' `va_`va_outcome'', `merge_options'
  3.   local merge_command "merge 1:1 cdscode using"
  4.   local merge_options nogen
  5. }
(ela estimates from all sample and control combinations)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             4
        from master                         3  
        from using                          1  

    Matched                             1,366  
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                            14
        from master                         4  
        from using                         10  

    Matched                             1,366  
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             4
        from master                         4  
        from using                          0  

    Matched                             1,376  
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             4
        from master                         4  
        from using                          0  

    Matched                             1,376  
    -----------------------------------------

. 
. label data "Pooled  School Level VA mean estimates for all test scores and en
> rollment over 2015-2018"
note: label truncated to 80 characters

. save $projdir/dta/buildanalysisdata/va/va_pooled_all.dta, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/v
    > a/va_pooled_all.dta saved

. 
. 
. 
. //---------------------------------------------------------------------------
> ---
. // merge collapsed VA estimates onto survey data
. //---------------------------------------------------------------------------
> ---
. foreach svyname in sec parent staff {
  2.   use $projdir/dta/buildanalysisdata/analysisready/`svyname'analysisready,
>  clear
  3.   merge 1:1 cdscode using $projdir/dta/buildanalysisdata/va/va_pooled_all.
> dta, keep(1 3) nogen
  4. 
.   save, replace
  5. }
(secondary pooled dataset ready for analysis with stats and response rate)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,454
        from master                     2,454  
        from using                          0  

    Matched                               931  
    -----------------------------------------
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/a
    > nalysisready/secanalysisready.dta saved
(parent pooled (over years) dataset ready for analysis with stats and response 
> ra)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,569
        from master                     2,569  
        from using                          0  

    Matched                               427  
    -----------------------------------------
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/a
    > nalysisready/parentanalysisready.dta saved
(weighted average staff qoi statistics pooled over years)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,619
        from master                     3,619  
        from using                          0  

    Matched                               593  
    -----------------------------------------
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/a
    > nalysisready/staffanalysisready.dta saved

. 
. 
. 
. 
. 
. local date2_va_scatter_plot = c(current_date)

. local time2_va_scatter_plot = c(current_time)

. 
. di "Do file clean_va.do start date time: `date1_va_scatter_plot' `time1_va_sc
> atter_plot'"
Do file clean_va.do start date time: 19 Dec 2024 19:15:33

. di "End date time: `date2_va_scatter_plot' `time2_va_scatter_plot'"
End date time: 19 Dec 2024 19:15:34

. 
. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build//build
> analysisdata/clean_va.smcl
  log type:  smcl
 closed on:  19 Dec 2024, 19:15:34
-------------------------------------------------------------------------------
