{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/createvasample.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Dec 2021, 16:43:52
{txt}
{com}. 
. 
. //run the do helper file to set the local macros
. include `mattdofiles'/macros_va.doh
{txt}
{com}. #delimit ;
{txt}delimiter now ;
{com}. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2019
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. //set a timer for this do file to see how long it runs
. timer on 1
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
.     ** this creates the full VA sample
.    //run the do helper file to create the VA sample
.    include `mattdofiles'/create_va_sample.doh
{txt}
{com}. **************** Create VA Dataset
. use merge_id_k12_test_scores all_students_sample first_scores_sample ///
>         dataset test cdscode school_id state_student_id year grade ///
>         cohort_size ///
>         sbac_ela_z_score sbac_math_z_score ///
>         `va_control_vars' ///
>         /*if substr(cdscode, 1, 7)=="3768338"*/ ///
>         using `k12_test_scores'/k12_test_scores_clean.dta, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. merge 1:1 merge_id_k12_test_scores using data/sbac/va_samples.dta ///
>         , nogen keepusing(touse_*)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       2,160,685
{txt}{col 9}from master{col 30}{res}       2,160,685{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}      76,461,458{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to lagged scores
. merge 1:1 merge_id_k12_test_scores using `k12_test_scores'/k12_lag_test_scores_clean.dta, nogen keep(1 3) ///
>         keepusing( ///
>                 L3_cst_ela_z_score ///
>                 L3_sbac_ela_z_score ///
>                 L4_cst_ela_z_score ///
>                 L3_sbac_math_z_score ///
>                 L4_sbac_math_z_score ///
>                 L5_cst_math_z_score ///
>                 L6_cst_math_z_score ///
>         )
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to peer scores
. merge 1:1 merge_id_k12_test_scores using `k12_test_scores'/k12_peer_test_scores_clean.dta, nogen keep(1 3) ///
>         keepusing( ///
>                 `peer_demographic_controls' ///
>                 peer_L3_cst_ela_z_score ///
>                 peer_L3_sbac_ela_z_score ///
>                 peer_L4_cst_ela_z_score ///
>                 peer_L3_sbac_math_z_score ///
>                 peer_L4_sbac_math_z_score ///
>                 peer_L5_cst_math_z_score ///
>                 peer_L6_cst_math_z_score ///
>         )
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to school grade spans
. merge m:1 cdscode year using `k12_test_scores_public'/k12_diff_school_prop_schyr.dta ///
>         , gen(merge_grade_span) keepusing(gr11_*_diff_school_prop) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         445,910
{txt}{col 9}from master{col 30}{res}         445,910{txt}  (merge_grade_span==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_grade_span==2)

{col 5}Matched{col 30}{res}      78,176,233{txt}  (merge_grade_span==3)
{col 5}{hline 41}

{com}. 
. * Merge to median cohort sizes
. merge m:1 cdscode using `k12_test_scores_public'/k12_cohort_size_sch.dta ///
>         , gen(merge_cohort_size) keepusing(med_cohort_size_first_scores) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  (merge_cohort_size==3)
{col 5}{hline 41}

{com}. 
. * Keep conventional schools
. merge m:1 cdscode using `k12_public_schools'/k12_public_schools_clean.dta ///
>         , gen(merge_public_schools) keepusing(conventional_school) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       1,432,257
{txt}{col 9}from master{col 30}{res}       1,432,257{txt}  (merge_public_schools==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_public_schools==2)

{col 5}Matched{col 30}{res}      77,189,886{txt}  (merge_public_schools==3)
{col 5}{hline 41}

{com}. keep if conventional_school==1
{txt}(3,908,486 observations deleted)

{com}. 
. * Exclude schools where more than 25 percent of students are receiving special education services
. 
. * Drop if a student is receiving instruction at home, in a hospital, or in a school serving disabled students solely
. 
. * Drop if 10 or fewer students per school
. drop if cohort_size<=10
{txt}(474,064 observations deleted)

{com}. {txt}
{com}. 
.    //Save it as a temporary dataset
.    compress
  {txt}variable {bf}{res}cohort_size{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (148,479,186 bytes saved)

{com}.    tempfile va_dataset
{txt}
{com}.    save `va_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St202036.000001{rm}
saved
as .dta format
{p_end}

{com}. 
.    save $projdir/dta/common_core_va/va_dataset, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
.   ********************************************************************************
.   **create the VA dataset for the VA CFR regressions (score VA)
.   ** use onoy 11th Grade (8th Grade ELA Controls, 6th Grade Math Controls)
.   include `mattdofiles'/create_va_g11_sample.doh
{txt}
{com}. /* this file uses the va_dataset temp file, and produces the va_g11_dataset temp file  */
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
{txt}
{com}. use if grade==11 & dataset=="CAASPP" & inrange(year, `test_score_min_year', `test_score_max_year') using `va_dataset', clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. 
. gen diff_school_prop = gr11_L3_diff_school_prop if year!=2017
{txt}(473,149 missing values generated)

{com}. replace diff_school_prop = gr11_L4_diff_school_prop if year==2017
{txt}(472,961 real changes made)

{com}. keep if diff_school_prop>=0.95
{txt}(133,638 observations deleted)

{com}. 
. **************** Prior Scores
. ******** ELA
. gen prior_ela_z_score = L3_cst_ela_z_score if inrange(year, `star_min_year' + 3, `star_max_year' + 3) & year!=2017
{txt}(1,750,042 missing values generated)

{com}. replace prior_ela_z_score = L3_sbac_ela_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3) & year!=2017
{txt}(689,809 real changes made)

{com}. replace prior_ela_z_score = L4_cst_ela_z_score if year==2017
{txt}(333,419 real changes made)

{com}. label var prior_ela_z_score "Prior ELA Z-Score"
{txt}
{com}. gen peer_prior_ela_z_score = peer_L3_cst_ela_z_score if inrange(year, `star_min_year' + 3, `star_max_year' + 3) & year!=2017
{txt}(1,613,485 missing values generated)

{com}. replace peer_prior_ela_z_score = peer_L3_sbac_ela_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3) & year!=2017
{txt}(1,162,536 real changes made)

{com}. replace peer_prior_ela_z_score = peer_L4_cst_ela_z_score if year==2017
{txt}(450,528 real changes made)

{com}. label var peer_prior_ela_z_score "Peer Avg. Prior ELA Z-Score"
{txt}
{com}. 
. ******** Math
. gen prior_math_z_score = L5_cst_math_z_score if inrange(year, `star_min_year' + 5, `star_max_year' + 5) & !inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(1,435,644 missing values generated)

{com}. replace prior_math_z_score = L3_sbac_math_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(691,571 real changes made)

{com}. label var prior_math_z_score "Prior Math Z-Score"
{txt}
{com}. gen peer_prior_math_z_score = peer_L5_cst_math_z_score if inrange(year, `star_min_year' + 5, `star_max_year' + 5) & !inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(1,162,957 missing values generated)

{com}. replace peer_prior_math_z_score = peer_L3_sbac_math_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(1,162,536 real changes made)

{com}. label var peer_prior_math_z_score "Peer Avg. Prior Math Z-Score"
{txt}
{com}. 
. 
. * Save temporary dataset
. compress
{txt}  (0 bytes saved)

{com}. tempfile va_g11_dataset
{txt}
{com}. save `va_g11_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St202036.000002{rm}
saved
as .dta format
{p_end}

{com}. {txt}
{com}. 
.   **the above steps create the VA dataset for the VA CFR regressions (score VA)
.   compress
{txt}  (0 bytes saved)

{com}.   save $projdir/dta/common_core_va/va_g11_dataset, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset.dta{rm}
saved
{p_end}

{com}. 
.   //erase the tempfile to avoid name conflict
.   erase `va_dataset'
{txt}
{com}. 
. 
. 
.   ********************************************************************************
.   *** This merges the entire k12 test score sample onto postsecondary outcomes
.   //the output dataset is used in siblingoutxwalk.do
.   use merge_id_k12_test_scores all_students_sample first_scores_sample ///
>         dataset test cdscode school_id state_student_id year grade ///
>         cohort_size ///
>         using `k12_test_scores'/k12_test_scores_clean.dta, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}.   // merge on postsecondary Outcomes
.   do `mattdofiles'/merge_k12_postsecondary.doh enr_only
{txt}
{com}. version 16.1
{txt}
{com}. 
. *****************************************************
. * First created by Matthew Naven on June 11, 2018 *
. *adapted by Che Sun Dec 13, 2021, changed crosswalks file path 
. *****************************************************
. 
. local crosswalks "/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks"
{txt}
{com}. 
. ***************
. * Description *
. ***************
. /*
> This file merges the K-12 data to the postsecondary data.
> */
. 
. 
. **********
. * Macros *
. **********
. args enr_only
{txt}
{com}. 
. local min_nsc_hs_grad_year "2010"
{txt}
{com}. local max_nsc_hs_grad_year "2019"
{txt}
{com}. 
. local min_nsc_enr_year "2010"
{txt}
{com}. local max_nsc_enr_year "2020"
{txt}
{com}. 
. local min_nsc_deg_year "2011"
{txt}
{com}. local max_nsc_deg_year "2020"
{txt}
{com}. 
. local min_ccc_enr_year "1993"
{txt}
{com}. local max_ccc_enr_year "2017"
{txt}
{com}. 
. local min_ccc_deg_year "1993"
{txt}
{com}. local max_ccc_deg_year "2016"
{txt}
{com}. 
. local min_csu_app_year "2002"
{txt}
{com}. local max_csu_app_year "2017"
{txt}
{com}. 
. local min_csu_enr_year "2002"
{txt}
{com}. local max_csu_enr_year "2017"
{txt}
{com}. 
. local min_csu_deg_year "2002"
{txt}
{com}. local max_csu_deg_year "2016"
{txt}
{com}. 
. 
. *****************
. * Begin Do File *
. *****************
. **** K-12 Variables
. gen year_grad_hs = year + (12 - grade)
{txt}(446,511 missing values generated)

{com}. gen year_college = year + (13 - grade)
{txt}(446,511 missing values generated)

{com}. 
. 
. 
. 
. **** Merge to K-12/NSC crosswalk
. gen k12_nsc_match = 0
{txt}
{com}. gen k12_nsc_2010_2017_match = 0
{txt}
{com}. /*gen k12_nsc_2010_2018_match = 0*/
. gen k12_nsc_2018cde_match = 0
{txt}
{com}. gen k12_nsc_2019cde_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}year_grad_hs{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}year_college{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}k12_nsc_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2010_2017_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2018cde_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2019cde_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (1,257,954,288 bytes saved)

{com}. 
. 
. ** NSC
. merge m:1 state_student_id ///
>         using `crosswalks'/nsc_outcomes_crosswalk_ssid.dta ///
>         , gen(merge_k12_nsc_ssid) keep(1 3 4 5) update
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      47,294,051
{txt}{col 9}from master{col 30}{res}      47,294,051{txt}  (merge_k12_nsc_ssid==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==2)

{col 5}Matched{col 30}{res}      31,328,092
{txt}{col 9}not updated{col 30}{res}      31,328,092{txt}  (merge_k12_nsc_ssid==3)
{col 9}missing updated{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==4)
{col 9}nonmissing conflict{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==5)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                      Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007       2008 {c |}     Total
{hline 11}{c +}{hline 66}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418    489,091 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513    477,271 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048    482,271 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481    476,433 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892    480,302 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594    498,879 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243    490,985 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034    522,733 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734    495,999 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021    472,617 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 66}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978  4,886,581 {txt}{c |}{res}78,175,632 


           {txt}{c |}                      Year of Spring Semester
     Grade {c |}      2009       2010       2011       2012       2013       2015 {c |}     Total
{hline 11}{c +}{hline 66}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   481,092    477,606    483,618    485,135    488,956      2,210 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,639    473,733    471,973    476,890    480,152    490,476 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   478,382    474,542    477,792    474,382    480,484    478,478 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   472,137    468,559    474,646    468,929    467,252    943,465 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   471,630    468,325    466,779    471,619    466,351    471,558 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   490,793    482,145    478,291    474,153    479,024    467,291 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   488,058    480,471    473,610    469,747    467,499    930,621 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   526,190    518,632    510,690    498,467    493,701      1,184 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   498,203    499,817    497,097    488,589    481,578    939,516 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   474,154    478,165    480,215    477,126    475,645    479,654 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 66}{c +}{hline 10}
     Total {c |}{res} 4,861,278  4,821,995  4,814,711  4,785,037  4,780,642  5,204,453 {txt}{c |}{res}78,175,632 


           {txt}{c |}           Year of Spring Semester
     Grade {c |}      2016       2017       2018       2019 {c |}     Total
{hline 11}{c +}{hline 44}{c +}{hline 10}
         0 {c |}{res}         1          4          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         1          2          0          2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}     2,935      2,171      1,372         11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,279    470,945    446,465    469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   495,656    476,253    470,521    460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   968,084    976,692    938,837    941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,305    479,849    495,306    479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,180    477,981    480,533    495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   942,422    946,953    943,694    960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}    10,064      2,695     13,213      6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   494,522    401,916     17,389     34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   488,163    527,563    617,543    748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}     2,863     74,250    481,842    333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 44}{c +}{hline 10}
     Total {c |}{res} 4,844,475  4,837,274  4,906,715  4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. replace k12_nsc_match = 1 if merge_k12_nsc_2010_2017_ssid==3
{err}merge_k12_nsc_2010_2017_ssid not found
{txt}{search r(111), local:r(111);}

end of do-file
{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/createvasample.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 Dec 2021, 16:57:08
{txt}{.-}
{smcl}
{txt}{sf}{ul off}