{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/createvasample.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Dec 2021, 10:41:06
{txt}
{com}. 
. 
. //run the do helper file to set the local macros
. include `mattdofiles'/macros_va.doh
{txt}
{com}. #delimit ;
{txt}delimiter now ;
{com}. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2019
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. //set a timer for this do file to see how long it runs
. timer on 1
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
.     ** this creates the full VA sample
.    //run the do helper file to create the VA sample
.    include `mattdofiles'/create_va_sample.doh
{txt}
{com}. **************** Create VA Dataset
. use merge_id_k12_test_scores all_students_sample first_scores_sample ///
>         dataset test cdscode school_id state_student_id year grade ///
>         cohort_size ///
>         sbac_ela_z_score sbac_math_z_score ///
>         `va_control_vars' ///
>         /*if substr(cdscode, 1, 7)=="3768338"*/ ///
>         using `k12_test_scores'/k12_test_scores_clean.dta, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. merge 1:1 merge_id_k12_test_scores using data/sbac/va_samples.dta ///
>         , nogen keepusing(touse_*)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       2,160,685
{txt}{col 9}from master{col 30}{res}       2,160,685{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}      76,461,458{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to lagged scores
. merge 1:1 merge_id_k12_test_scores using `k12_test_scores'/k12_lag_test_scores_clean.dta, nogen keep(1 3) ///
>         keepusing( ///
>                 L3_cst_ela_z_score ///
>                 L3_sbac_ela_z_score ///
>                 L4_cst_ela_z_score ///
>                 L3_sbac_math_z_score ///
>                 L4_sbac_math_z_score ///
>                 L5_cst_math_z_score ///
>                 L6_cst_math_z_score ///
>         )
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to peer scores
. merge 1:1 merge_id_k12_test_scores using `k12_test_scores'/k12_peer_test_scores_clean.dta, nogen keep(1 3) ///
>         keepusing( ///
>                 `peer_demographic_controls' ///
>                 peer_L3_cst_ela_z_score ///
>                 peer_L3_sbac_ela_z_score ///
>                 peer_L4_cst_ela_z_score ///
>                 peer_L3_sbac_math_z_score ///
>                 peer_L4_sbac_math_z_score ///
>                 peer_L5_cst_math_z_score ///
>                 peer_L6_cst_math_z_score ///
>         )
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to school grade spans
. merge m:1 cdscode year using `k12_test_scores_public'/k12_diff_school_prop_schyr.dta ///
>         , gen(merge_grade_span) keepusing(gr11_*_diff_school_prop) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         445,910
{txt}{col 9}from master{col 30}{res}         445,910{txt}  (merge_grade_span==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_grade_span==2)

{col 5}Matched{col 30}{res}      78,176,233{txt}  (merge_grade_span==3)
{col 5}{hline 41}

{com}. 
. * Merge to median cohort sizes
. merge m:1 cdscode using `k12_test_scores_public'/k12_cohort_size_sch.dta ///
>         , gen(merge_cohort_size) keepusing(med_cohort_size_first_scores) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  (merge_cohort_size==3)
{col 5}{hline 41}

{com}. 
. * Keep conventional schools
. merge m:1 cdscode using `k12_public_schools'/k12_public_schools_clean.dta ///
>         , gen(merge_public_schools) keepusing(conventional_school) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       1,432,257
{txt}{col 9}from master{col 30}{res}       1,432,257{txt}  (merge_public_schools==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_public_schools==2)

{col 5}Matched{col 30}{res}      77,189,886{txt}  (merge_public_schools==3)
{col 5}{hline 41}

{com}. keep if conventional_school==1
{txt}(3,908,486 observations deleted)

{com}. 
. * Exclude schools where more than 25 percent of students are receiving special education services
. 
. * Drop if a student is receiving instruction at home, in a hospital, or in a school serving disabled students solely
. 
. * Drop if 10 or fewer students per school
. drop if cohort_size<=10
{txt}(474,064 observations deleted)

{com}. {txt}
{com}. 
.    //Save it as a temporary dataset
.    compress
  {txt}variable {bf}{res}cohort_size{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (148,479,186 bytes saved)

{com}.    tempfile va_dataset
{txt}
{com}.    save `va_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St233715.000001{rm}
saved
as .dta format
{p_end}

{com}. 
.    save $projdir/dta/common_core_va/va_dataset, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
.   ********************************************************************************
.   **create the VA dataset for the VA CFR regressions (score VA)
.   ** use onoy 11th Grade (8th Grade ELA Controls, 6th Grade Math Controls)
.   include `mattdofiles'/create_va_g11_sample.doh
{txt}
{com}. /* this file uses the va_dataset temp file, and produces the va_g11_dataset temp file  */
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
{txt}
{com}. use if grade==11 & dataset=="CAASPP" & inrange(year, `test_score_min_year', `test_score_max_year') using `va_dataset', clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. 
. gen diff_school_prop = gr11_L3_diff_school_prop if year!=2017
{txt}(473,149 missing values generated)

{com}. replace diff_school_prop = gr11_L4_diff_school_prop if year==2017
{txt}(472,961 real changes made)

{com}. keep if diff_school_prop>=0.95
{txt}(133,638 observations deleted)

{com}. 
. **************** Prior Scores
. ******** ELA
. gen prior_ela_z_score = L3_cst_ela_z_score if inrange(year, `star_min_year' + 3, `star_max_year' + 3) & year!=2017
{txt}(1,750,042 missing values generated)

{com}. replace prior_ela_z_score = L3_sbac_ela_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3) & year!=2017
{txt}(689,809 real changes made)

{com}. replace prior_ela_z_score = L4_cst_ela_z_score if year==2017
{txt}(333,419 real changes made)

{com}. label var prior_ela_z_score "Prior ELA Z-Score"
{txt}
{com}. gen peer_prior_ela_z_score = peer_L3_cst_ela_z_score if inrange(year, `star_min_year' + 3, `star_max_year' + 3) & year!=2017
{txt}(1,613,485 missing values generated)

{com}. replace peer_prior_ela_z_score = peer_L3_sbac_ela_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3) & year!=2017
{txt}(1,162,536 real changes made)

{com}. replace peer_prior_ela_z_score = peer_L4_cst_ela_z_score if year==2017
{txt}(450,528 real changes made)

{com}. label var peer_prior_ela_z_score "Peer Avg. Prior ELA Z-Score"
{txt}
{com}. 
. ******** Math
. gen prior_math_z_score = L5_cst_math_z_score if inrange(year, `star_min_year' + 5, `star_max_year' + 5) & !inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(1,435,644 missing values generated)

{com}. replace prior_math_z_score = L3_sbac_math_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(691,571 real changes made)

{com}. label var prior_math_z_score "Prior Math Z-Score"
{txt}
{com}. gen peer_prior_math_z_score = peer_L5_cst_math_z_score if inrange(year, `star_min_year' + 5, `star_max_year' + 5) & !inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(1,162,957 missing values generated)

{com}. replace peer_prior_math_z_score = peer_L3_sbac_math_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(1,162,536 real changes made)

{com}. label var peer_prior_math_z_score "Peer Avg. Prior Math Z-Score"
{txt}
{com}. 
. 
. * Save temporary dataset
. compress
{txt}  (0 bytes saved)

{com}. tempfile va_g11_dataset
{txt}
{com}. save `va_g11_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St233715.000002{rm}
saved
as .dta format
{p_end}

{com}. {txt}
{com}. 
.   **the above steps create the VA dataset for the VA CFR regressions (score VA)
.   compress
{txt}  (0 bytes saved)

{com}.   save $projdir/dta/common_core_va/va_g11_dataset, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset.dta{rm}
saved
{p_end}

{com}. 
.   //erase the tempfile to avoid name conflict
.   erase `va_dataset'
{txt}
{com}. 
. 
. 
.   ********************************************************************************
.   *** This merges the entire k12 test score sample onto postsecondary outcomes
.   //the output dataset is used in siblingoutxwalk.do
.   use merge_id_k12_test_scores all_students_sample first_scores_sample ///
>         dataset test cdscode school_id state_student_id year grade ///
>         cohort_size ///
>         using `k12_test_scores'/k12_test_scores_clean.dta, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}.   // merge on postsecondary Outcomes
.   do `mattdofiles'/merge_k12_postsecondary.doh enr_only
{txt}
{com}. version 16.1
{txt}
{com}. 
. *****************************************************
. * First created by Matthew Naven on June 11, 2018 *
. *adapted by Che Sun Dec 13, 2021, changed crosswalks file path
. *****************************************************
. 
. local crosswalks "/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks"
{txt}
{com}. 
. ***************
. * Description *
. ***************
. /*
> This file merges the K-12 data to the postsecondary data.
> */
. 
. 
. **********
. * Macros *
. **********
. args enr_only
{txt}
{com}. 
. local min_nsc_hs_grad_year "2010"
{txt}
{com}. local max_nsc_hs_grad_year "2019"
{txt}
{com}. 
. local min_nsc_enr_year "2010"
{txt}
{com}. local max_nsc_enr_year "2020"
{txt}
{com}. 
. local min_nsc_deg_year "2011"
{txt}
{com}. local max_nsc_deg_year "2020"
{txt}
{com}. 
. local min_ccc_enr_year "1993"
{txt}
{com}. local max_ccc_enr_year "2017"
{txt}
{com}. 
. local min_ccc_deg_year "1993"
{txt}
{com}. local max_ccc_deg_year "2016"
{txt}
{com}. 
. local min_csu_app_year "2002"
{txt}
{com}. local max_csu_app_year "2017"
{txt}
{com}. 
. local min_csu_enr_year "2002"
{txt}
{com}. local max_csu_enr_year "2017"
{txt}
{com}. 
. local min_csu_deg_year "2002"
{txt}
{com}. local max_csu_deg_year "2016"
{txt}
{com}. 
. 
. *****************
. * Begin Do File *
. *****************
. **** K-12 Variables
. gen year_grad_hs = year + (12 - grade)
{txt}(446,511 missing values generated)

{com}. gen year_college = year + (13 - grade)
{txt}(446,511 missing values generated)

{com}. 
. 
. 
. 
. **** Merge to K-12/NSC crosswalk
. gen k12_nsc_match = 0
{txt}
{com}. gen k12_nsc_2010_2017_match = 0
{txt}
{com}. /*gen k12_nsc_2010_2018_match = 0*/
. gen k12_nsc_2018cde_match = 0
{txt}
{com}. gen k12_nsc_2019cde_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}year_grad_hs{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}year_college{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}k12_nsc_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2010_2017_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2018cde_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2019cde_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (1,257,954,288 bytes saved)

{com}. 
. 
. ** NSC
. /* changed the generated merge id to be consistent with the code  */
. merge m:1 state_student_id ///
>         using `crosswalks'/nsc_outcomes_crosswalk_ssid.dta ///
>         , gen(merge_k12_nsc_ssid) keep(1 3 4 5) update
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      47,294,051
{txt}{col 9}from master{col 30}{res}      47,294,051{txt}  (merge_k12_nsc_ssid==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==2)

{col 5}Matched{col 30}{res}      31,328,092
{txt}{col 9}not updated{col 30}{res}      31,328,092{txt}  (merge_k12_nsc_ssid==3)
{col 9}missing updated{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==4)
{col 9}nonmissing conflict{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==5)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. replace k12_nsc_match = 1 if inlist(merge_k12_nsc_ssid, 3, 4, 5)
{txt}(31,328,092 real changes made)

{com}. drop merge_k12_nsc_ssid
{txt}
{com}. 
. ** NSC 2010-2017
. /*merge m:1 state_student_id ///
>         using `crosswalks'/nsc_2010_2017_outcomes_crosswalk_ssid.dta ///
>         , gen(merge_k12_nsc_2010_2017_ssid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2010_2017_ssid==3
> replace k12_nsc_2010_2017_match = 1 if merge_k12_nsc_2010_2017_ssid==3
> drop merge_k12_nsc_2010_2017_ssid
> 
> /*merge m:1 cdscode local_student_id ///
>         using `crosswalks'/nsc_2010_2017_outcomes_crosswalk_lsid.dta ///
>         , gen(merge_k12_nsc_2010_2017_lsid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2010_2017_lsid==3
> replace k12_nsc_2010_2017_match = 1 if merge_k12_nsc_2010_2017_lsid==3
> drop merge_k12_nsc_2010_2017_lsid*/
> 
> 
> ** NSC 2018
> merge m:1 state_student_id ///
>         using `crosswalks'/nsc_2018cde_outcomes_crosswalk_ssid.dta ///
>         , gen(merge_k12_nsc_2018cde_ssid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2018cde_ssid==3
> replace k12_nsc_2018cde_match = 1 if merge_k12_nsc_2018cde_ssid==3
> drop merge_k12_nsc_2018cde_ssid
> 
> /*merge m:1 cdscode local_student_id ///
>         using `crosswalks'/nsc_2018cde_outcomes_crosswalk_lsid.dta ///
>         , gen(merge_k12_nsc_2018cde_lsid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2018cde_lsid==3
> replace k12_nsc_2018cde_match = 1 if merge_k12_nsc_2018cde_lsid==3
> drop merge_k12_nsc_2018cde_lsid*/
> 
> 
> ** NSC 2019
> merge m:1 state_student_id ///
>         using `crosswalks'/nsc_2019cde_provisional_outcomes_crosswalk_ssid.dta ///
>         , gen(merge_k12_nsc_2019cde_ssid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2019cde_ssid==3
> replace k12_nsc_2019cde_match = 1 if merge_k12_nsc_2019cde_ssid==3
> drop merge_k12_nsc_2019cde_ssid
> 
> /*merge m:1 cdscode local_student_id ///
>         using `crosswalks'/nsc_2019cde_provisional_outcomes_crosswalk_lsid.dta ///
>         , gen(merge_k12_nsc_2019cde_lsid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2019cde_lsid==3
> replace k12_nsc_2019cde_match = 1 if merge_k12_nsc_2019cde_lsid==3
> drop merge_k12_nsc_2019cde_lsid*/
> */
. 
. ** Edit NSC Variables
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist "nsc_enr nsc_enr_lt2year nsc_enr_2year nsc_enr_4year nsc_enr_ontime nsc_enr_ontime_lt2year nsc_enr_ontime_2year nsc_enr_ontime_4year"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist "nsc_*"
. {c )-}
{txt}
{com}. * Replace NSC variables with missing if no chance of matching to the NSC data
. foreach v of varlist `varlist' {c -(}
{txt}  2{com}.         replace `v' = . if k12_nsc_match==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         * Replace NSC persistence variables with missing if never enrolled
.         foreach v of varlist nsc_persist_year2 nsc_persist_year3 nsc_persist_year4 {c -(}
{txt}  2{com}.                 replace `v' = . if nsc_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 4 {c -(}
{txt}  2{com}.                 * Replace NSC persistence variables with 0 if they could have matched to the NSC data but didn't
.                 replace nsc_persist_year`t' = 0 if nsc_enr==1 & nsc_persist_year`t'!=1 & k12_nsc_match==1 & year_grad_hs + (`t' - 1)<=`max_nsc_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC persistence variables with missing if they could not have matched to the NSC data
.                 replace nsc_persist_year`t' = . if nsc_enr==1 & /*nsc_persist_year`t'!=1 &*/ k12_nsc_match==1 & year_grad_hs + (`t' - 1)>`max_nsc_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_lt2year {c -(}
{txt}  2{com}.                 * Replace NSC less-than-2-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 2<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC less-than-2-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 2>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_2year {c -(}
{txt}  2{com}.                 * Replace NSC 2-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 3<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC 2-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 3>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_4year {c -(}
{txt}  2{com}.                 * Replace NSC 4-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 6<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC 4-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 6>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * NSC degree receipt conditional on enrollment
.         gen nsc_enr_deg_lt2year = nsc_deg_lt2year if nsc_enr_lt2year==1
.         gen nsc_enr_deg_2year = nsc_deg_2year if nsc_enr_2year==1
.         gen nsc_enr_deg_4year = nsc_deg_4year if nsc_enr_4year==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. 
. 
. **** Merge to K-12/CCC crosswalk
. gen k12_ccc_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}nsc_enr_n_4year{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}nsc_enr_n_2year{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_ccc_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (393,110,715 bytes saved)

{com}. 
. merge m:1 state_student_id ///
>         using `crosswalks'/k12_ccc_crosswalk.dta ///
>         , gen(merge_k12_ccc) keep(1 3) keepusing(student_id)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      58,447,747
{txt}{col 9}from master{col 30}{res}      58,447,747{txt}  (merge_k12_ccc==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_ccc==2)

{col 5}Matched{col 30}{res}      20,174,396{txt}  (merge_k12_ccc==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. replace k12_ccc_match = 1 if merge_k12_ccc==3
{txt}(20,174,396 real changes made)

{com}. drop merge_k12_ccc
{txt}
{com}. 
. 
. **** Merge to CCC data
. count if !mi(student_id)
  {res}20,174,396
{txt}
{com}. 
. merge m:1 student_id ///
>         using `crosswalks'/ccc_outcomes_crosswalk.dta ///
>         , gen(merge_k12_ccc) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      63,124,201
{txt}{col 9}from master{col 30}{res}      63,124,201{txt}  (merge_k12_ccc==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_ccc==2)

{col 5}Matched{col 30}{res}      15,497,942{txt}  (merge_k12_ccc==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. ** Edit CCC Variables
. foreach v of varlist ccc_enr {c -(}
{txt}  2{com}.         * Replace CCC enrollment with 0 if could have matched to the CCC data but didn't
.         replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_ccc_enr_year', `max_ccc_enr_year')
{txt}  3{com}.         * Replace CCC enrollment with missing if could not have matched to the CCC data
.         replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_ccc_enr_year', `max_ccc_enr_year')
{txt}  4{com}. {c )-}
{txt}(34,923,079 real changes made)
(5,008,197 real changes made, 5,008,197 to missing)

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. * CCC on-time enrollment
. gen ccc_enr_ontime = 1 if ccc_enr==1 ///
>         & (ccc_enr_start_year==year_grad_hs & inlist(ccc_enr_start_term, 5, 6, 7, 8)) ///
>         | (ccc_enr_start_year==year_grad_hs + 1 & inlist(ccc_enr_start_term, 1, 2, 3, 4))
{txt}(73,900,307 missing values generated)

{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         * Replace CCC remediation and persistence variables with missing if never enrolled
.         foreach v of varlist ccc_remediation ccc_ela_remediation ccc_math_remediation ///
>                 ccc_persist_year2 ccc_persist_year3 ///
>                 ccc_deg ccc_deg_c ccc_deg_a ccc_deg_b {c -(}
{txt}  2{com}.                 replace `v' = . if ccc_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 3 {c -(}
{txt}  2{com}.                 * Replace CCC persistence variables with 0 if they could have matched to the CCC data but didn't
.                 replace ccc_persist_year`t' = 0 if ccc_enr==1 & ccc_persist_year`t'!=1 & k12_ccc_match==1 & year_grad_hs + (`t' - 1)<=`max_ccc_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace CCC persistence variables with missing if they could not have matched to the CCC data
.                 replace ccc_persist_year`t' = . if ccc_enr==1 & /*ccc_persist_year`t'!=1 &*/ k12_ccc_match==1 & year_grad_hs + (`t' - 1)>`max_ccc_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist ccc_deg ccc_deg_c ccc_deg_a ccc_deg_b {c -(}
{txt}  2{com}.                 * Replace CCC degree variable with 0 if they could have matched to the CCC data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs + 3, `min_ccc_deg_year', `max_ccc_deg_year')
{txt}  3{com}.                 * Replace CCC degree variable with missing if they could not have matched to the CCC data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs + 3, `min_ccc_deg_year', `max_ccc_deg_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. 
. 
. **** Merge to K-12/CSU crosswalk
. gen k12_csu_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}ccc_enr_year{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}ccc_enr_ontime{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_csu_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (550,355,001 bytes saved)

{com}. 
. merge m:1 state_student_id ///
>         using `crosswalks'/k12_csu_crosswalk.dta ///
>         , gen(merge_k12_csu) keep(1 3) keepusing(idunique)
{res}{txt}(label {bf:{txt}male} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      70,021,720
{txt}{col 9}from master{col 30}{res}      70,021,720{txt}  (merge_k12_csu==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_csu==2)

{col 5}Matched{col 30}{res}       8,600,423{txt}  (merge_k12_csu==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. replace k12_csu_match = 1 if merge_k12_csu==3
{txt}(8,600,423 real changes made)

{com}. drop merge_k12_csu
{txt}
{com}. 
. 
. **** Merge to CSU data
. count if !mi(idunique)
  {res}8,600,423
{txt}
{com}. 
. merge m:1 idunique ///
>         using `crosswalks'/csu_outcomes_crosswalk.dta ///
>         , gen(merge_k12_csu) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      70,021,720
{txt}{col 9}from master{col 30}{res}      70,021,720{txt}  (merge_k12_csu==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_csu==2)

{col 5}Matched{col 30}{res}       8,600,423{txt}  (merge_k12_csu==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. ** Edit CSU Variables
. foreach v of varlist csu_enr {c -(}
{txt}  2{com}.         * Replace CSU enrollment with 0 if could have matched to the CSU data but didn't
.         replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_csu_enr_year', `max_csu_enr_year')
{txt}  3{com}.         * Replace CSU enrollment with missing if could not have matched to the CSU data
.         replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_csu_enr_year', `max_csu_enr_year')
{txt}  4{com}. {c )-}
{txt}(36,886,821 real changes made)
(74,420 real changes made, 74,420 to missing)

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. * CSU on-time enrollment
. gen csu_enr_ontime = 1 if csu_enr==1 ///
>         & (csu_enr_start_year==year_grad_hs & inlist(csu_enr_start_term, 3, 4)) ///
>         | (csu_enr_start_year==year_grad_hs + 1 & inlist(csu_enr_start_term, 1, 2))
{txt}(75,940,909 missing values generated)

{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         foreach v of varlist csu_applied csu_applied_multiple csu_accepted {c -(}
{txt}  2{com}.                 * Replace CSU application with 0 if could have matched to the CSU data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_csu_app_year', `max_csu_app_year')
{txt}  3{com}.                 * Replace CSU application with missing if could not have matched to the CSU data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_csu_app_year', `max_csu_app_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * Replace CSU acceptance with missing if never applied
.         foreach v of varlist csu_accepted {c -(}
{txt}  2{com}.                 replace `v' = . if csu_applied!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         * Replace CSU remediation and persistence variables with missing if never enrolled
.         foreach v of varlist ///
>                 csu_eng_remediation csu_math_remediation csu_first_maj_stem csu_first_maj_other csu_first_maj_undecided ///
>                 csu_persist_year2 csu_persist_year3 csu_persist_year4 ///
>                 csu_deg csu_deg_stem csu_deg_other {c -(}
{txt}  2{com}.                 replace `v' = . if csu_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 4 {c -(}
{txt}  2{com}.                 * Replace CSU persistence variables with 0 if they could have matched to the CSU data but didn't
.                 replace csu_persist_year`t' = 0 if csu_enr==1 & csu_persist_year`t'!=1 & k12_csu_match==1 & year_grad_hs + (`t' - 1)<=`max_csu_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace CSU persistence variables with missing if they could not have matched to the CSU data
.                 replace csu_persist_year`t' = . if csu_enr==1 & /*csu_persist_year`t'!=1 &*/ k12_csu_match==1 & year_grad_hs + (`t' - 1)>`max_csu_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist csu_deg csu_deg_stem csu_deg_other {c -(}
{txt}  2{com}.                 * Replace CSU degree variable with 0 if they could have matched to the CSU data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs + 6, `min_csu_deg_year', `max_csu_deg_year')
{txt}  3{com}.                 * Replace CSU degree variable with missing if they could not have matched to the CSU data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs + 6, `min_csu_deg_year', `max_csu_deg_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * CSU degree receipt conditional on STEM major
.         gen csu_maj_stem_deg_stem = csu_deg_stem if csu_first_maj_stem==1
.         gen csu_maj_stem_deg_other = csu_deg_other if csu_first_maj_stem==1
. 
.         * Replace CSU degree receipt conditional on STEM major with missing if never enrolled
.         foreach v of varlist ///
>                 csu_maj_stem_deg_stem csu_maj_stem_deg_other {c -(}
{txt}  2{com}.                 replace `v' = . if csu_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. {c )-}
{txt}
{com}. 
. 
. 
. 
. **** Drop observations that had no chance of matching to CCC/CSU data
. compress
  {txt}variable {bf}{res}csu_enr_ontime{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (235,866,429 bytes saved)

{com}. merge m:1 state_student_id ///
>         using `crosswalks'/k12_unique_crosswalk.dta ///
>         , gen(merge_k12_unique) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       9,212,150
{txt}{col 9}from master{col 30}{res}       9,212,150{txt}  (merge_k12_unique==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_unique==2)

{col 5}Matched{col 30}{res}      69,409,993{txt}  (merge_k12_unique==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist_ccc "ccc_enr_*"
.         local varlist_csu "csu_enr_*"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist_ccc "ccc_*"
.         local varlist_csu "csu_*"
. {c )-}
{txt}
{com}. * Replace CCC variables with missing if could not have matched to the CCC data due to non-unique name/birth date/sex
. foreach v of varlist `varlist_ccc' {c -(}
{txt}  2{com}.         replace `v' = . if k12_ccc_match==0 & uniq_first_last_bday_sex==0
{txt}  3{com}.         replace `v' = . if k12_ccc_match==0 & uniq_first3_last3_bday_sex==0 & inrange(year_grad_hs, 1993, 2011)
{txt}  4{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist_ccc
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. * Replace CSU variables with missing if could not have matched to the CSU data due to non-unique name/birth date/sex
. foreach v of varlist `varlist_csu' {c -(}
{txt}  2{com}.         replace `v' = . if k12_csu_match==0 & uniq_first_last_bday_sex_middle==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist_csu
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. 
. 
. **** All college outcomes
. * Enrollment
. gen enr = 1 if nsc_enr==1 /*| ccc_enr==1 | csu_enr==1*/
{txt}(57,447,437 missing values generated)

{com}. replace enr = 0 if nsc_enr==0 & ccc_enr!=1 & csu_enr!=1
{txt}(8,871,245 real changes made)

{com}. label var enr "Enrolled at a Postsecondary Institution"
{txt}
{com}. 
. gen enr_ontime = 1 if nsc_enr_ontime==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(57,842,759 missing values generated)

{com}. replace enr_ontime = 0 if nsc_enr_ontime==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(12,160,510 real changes made)

{com}. label var enr_ontime "Enrolled at a Postsecondary Institution"
{txt}
{com}. 
. gen enr_2year = 1 if nsc_enr_2year==1 | nsc_enr_lt2year==1 | ccc_enr==1
{txt}(60,305,803 missing values generated)

{com}. replace enr_2year = 0 if nsc_enr_2year==0 & nsc_enr_lt2year==0 & ccc_enr!=1
{txt}(15,750,705 real changes made)

{com}. label var enr_2year "Enrolled at a 2-Year College"
{txt}
{com}. 
. gen enr_ontime_2year = 1 if nsc_enr_ontime_2year==1 | nsc_enr_ontime_lt2year==1 | ccc_enr_ontime==1
{txt}(67,442,780 missing values generated)

{com}. replace enr_ontime_2year = 0 if nsc_enr_ontime_2year==0 & nsc_enr_ontime_lt2year==0 & ccc_enr_ontime!=1
{txt}(21,317,664 real changes made)

{com}. label var enr_ontime_2year "Enrolled at a 2-Year College"
{txt}
{com}. 
. gen enr_4year = 1 if nsc_enr_4year==1 | csu_enr==1
{txt}(68,660,149 missing values generated)

{com}. replace enr_4year = 0 if nsc_enr_4year==0 & csu_enr!=1
{txt}(22,309,769 real changes made)

{com}. label var enr_4year "Enrolled at a 4-Year University"
{txt}
{com}. 
. replace enr_2year = 0 if enr_4year==1
{txt}(5,887,965 real changes made)

{com}. 
. gen enr_ontime_4year = 1 if nsc_enr_ontime_4year==1 | csu_enr_ontime==1
{txt}(71,155,210 missing values generated)

{com}. replace enr_ontime_4year = 0 if nsc_enr_ontime_4year==0 & csu_enr_ontime!=1
{txt}(24,318,320 real changes made)

{com}. label var enr_ontime_4year "Enrolled at a 4-Year University"
{txt}
{com}. 
. replace enr_ontime_2year = 0 if enr_ontime_4year==1
{txt}(914,574 real changes made)

{com}. 
. gen enr_pub = 1 if nsc_enr_pub==1 | ccc_enr==1 | csu_enr==1
{txt}(54,130,335 missing values generated)

{com}. replace enr_pub = 0 if nsc_enr_pub==0 & ccc_enr!=1 & csu_enr!=1
{txt}(10,119,578 real changes made)

{com}. label var enr_pub "Enrolled at a Public Institution"
{txt}
{com}. 
. gen enr_ontime_pub = 1 if nsc_enr_ontime_pub==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(59,494,228 missing values generated)

{com}. replace enr_ontime_pub = 0 if nsc_enr_ontime_pub==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(13,811,979 real changes made)

{com}. label var enr_ontime_pub "Enrolled at a Public Institution"
{txt}
{com}. 
. gen enr_priv = 1 if nsc_enr_priv==1
{txt}(75,875,406 missing values generated)

{com}. replace enr_priv = 0 if nsc_enr_priv==0
{txt}(28,581,355 real changes made)

{com}. label var enr_priv "Enrolled at a Private Institution"
{txt}
{com}. 
. replace enr_pub = 0 if enr_priv==1
{txt}(1,499,435 real changes made)

{com}. 
. gen enr_ontime_priv = 1 if nsc_enr_ontime_priv==1
{txt}(76,836,430 missing values generated)

{com}. replace enr_ontime_priv = 0 if nsc_enr_ontime_priv==0
{txt}(29,542,379 real changes made)

{com}. label var enr_ontime_priv "Enrolled at a Private Institution"
{txt}
{com}. 
. replace enr_ontime_pub = 0 if enr_ontime_priv==1
{txt}(134,244 real changes made)

{com}. 
. gen enr_instate = 1 if nsc_enr_instate==1 | ccc_enr==1 | csu_enr==1
{txt}(54,343,701 missing values generated)

{com}. replace enr_instate = 0 if nsc_enr_instate==0 & ccc_enr!=1 & csu_enr!=1
{txt}(10,332,944 real changes made)

{com}. label var enr_instate "Enrolled at a CA Institution"
{txt}
{com}. 
. gen enr_ontime_instate = 1 if nsc_enr_ontime_instate==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(59,612,538 missing values generated)

{com}. replace enr_ontime_instate = 0 if nsc_enr_ontime_instate==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(13,930,289 real changes made)

{com}. label var enr_ontime_instate "Enrolled at a CA Institution"
{txt}
{com}. 
. gen enr_outstate = 1 if nsc_enr_outstate==1
{txt}(75,768,483 missing values generated)

{com}. replace enr_outstate = 0 if nsc_enr_outstate==0
{txt}(28,474,432 real changes made)

{com}. label var enr_outstate "Enrolled at an Out-of-State Institution"
{txt}
{com}. 
. replace enr_instate = 0 if enr_outstate==1
{txt}(1,392,054 real changes made)

{com}. 
. gen enr_ontime_outstate = 1 if nsc_enr_ontime_outstate==1
{txt}(76,722,834 missing values generated)

{com}. replace enr_ontime_outstate = 0 if nsc_enr_ontime_outstate==0
{txt}(29,428,783 real changes made)

{com}. label var enr_ontime_outstate "Enrolled at an Out-of-State Institution"
{txt}
{com}. 
. replace enr_ontime_instate = 0 if enr_ontime_outstate==1
{txt}(129,591 real changes made)

{com}. 
. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. * Persistence
. if "`enr_only'"!="enr_only" {c -(}
.         gen persist_year2 = 1 if nsc_persist_year2==1 | ccc_persist_year2==1 | csu_persist_year2==1
.         replace persist_year2 = 0 if nsc_persist_year2==0 & ccc_persist_year2!=1 & csu_persist_year2!=1
.         label var persist_year2 "Persisted to Year 2"
. 
.         gen persist_year3 = 1 if nsc_persist_year3==1 | ccc_persist_year3==1 | csu_persist_year3==1
.         replace persist_year3 = 0 if nsc_persist_year3==0 & ccc_persist_year3!=1 & csu_persist_year3!=1
.         label var persist_year3 "Persisted to Year 3"
. 
.         gen persist_year4 = 1 if nsc_persist_year4==1 /*| ccc_persist_year4==1*/ | csu_persist_year4==1
.         replace persist_year4 = 0 if nsc_persist_year4==0 /*& ccc_persist_year4!=1*/ & csu_persist_year4!=1
.         label var persist_year4 "Persisted to Year 4"
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. * Degree
. if "`enr_only'"!="enr_only" {c -(}
.         gen deg = 1 if nsc_deg==1 | ccc_deg==1 | csu_deg==1
.         replace deg = 0 if nsc_deg==0 & ccc_deg!=1 & csu_deg!=1
.         label var deg "Received a College Degree"
. 
.         gen deg_2year = 1 if nsc_deg_2year==1 | ccc_deg==1
.         replace deg_2year = 0 if nsc_deg_2year==0 & ccc_deg!=1
.         label var deg_2year "Received a 2-Year College Degree"
. 
.         gen deg_4year = 1 if nsc_deg_4year==1 | csu_deg==1
.         replace deg_4year = 0 if nsc_deg_4year==0 & csu_deg!=1
.         label var deg_4year "Received a 4-Year College Degree"
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. * Use only NSC sample + values of 1 from other samples
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist "enr enr_2year enr_4year enr_pub enr_priv enr_instate enr_outstate enr_ontime enr_ontime_2year enr_ontime_4year enr_ontime_pub enr_ontime_priv enr_ontime_instate enr_ontime_outstate"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist "enr enr_2year enr_4year enr_pub enr_priv enr_instate enr_outstate enr_ontime enr_ontime_2year enr_ontime_4year enr_ontime_pub enr_ontime_priv enr_ontime_instate enr_ontime_outstate deg deg_2year deg_4year"
. {c )-}
{txt}
{com}. foreach v of varlist `varlist' {c -(}
{txt}  2{com}.         replace `v' = . if /*`v'==0 &*/ k12_nsc_match==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(3,283,294 real changes made, 3,283,294 to missing)
(943,671 real changes made, 943,671 to missing)
(3,283,294 real changes made, 3,283,294 to missing)
(0 real changes made)
(3,283,294 real changes made, 3,283,294 to missing)
(0 real changes made)
(1,611,802 real changes made, 1,611,802 to missing)
(1,611,802 real changes made, 1,611,802 to missing)
(457,161 real changes made, 457,161 to missing)
(1,611,802 real changes made, 1,611,802 to missing)
(0 real changes made)
(1,611,802 real changes made, 1,611,802 to missing)
(0 real changes made)

{com}. macro drop _varlist
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. * CCC
. if "`enr_only'"!="enr_only" {c -(}
.         gen ccc_transfer_4year = 1 if ccc_enr==1 & enr_4year==1
.         replace ccc_transfer_4year = 0 if ccc_enr==1 & enr_4year==0
.         replace ccc_transfer_4year = . ///
>                 if (inlist(ccc_enr_start_year, `max_ccc_enr_year') & inlist(ccc_enr_start_term, 7, 8)) ///
>                 | (inlist(ccc_enr_start_year, `max_ccc_enr_year' + 1) & inlist(ccc_enr_start_term, 1, 2, 3, 4, 5, 6))
.         label var ccc_transfer_4year "Transfered to 4-Year University"
. 
.         replace ccc_persist_year2 = 1 if ccc_persist_year2==0 & ccc_transfer_4year==1
.         replace ccc_persist_year3 = 1 if ccc_persist_year3==0 & ccc_transfer_4year==1
.         replace ccc_deg = 1 if ccc_deg==0 & ccc_transfer_4year==1
.         replace ccc_deg_a = 1 if ccc_deg_a==0 & ccc_transfer_4year==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. * CSU
. if "`enr_only'"!="enr_only" {c -(}
.         gen csu_transfer_uc = 1 if csu_enr==1 & nsc_enr_uc==1
.         replace csu_transfer_uc = 0 if csu_enr==1 & nsc_enr_uc==0
.         replace csu_transfer_uc = . ///
>                 if (inlist(csu_enr_start_year, `max_csu_enr_year') & inlist(csu_enr_start_term, 4)) ///
>                 | (inlist(csu_enr_start_year, `max_csu_enr_year' + 1) & inlist(csu_enr_start_term, 1, 2, 3))
.         label var csu_transfer_uc "Transfered to a University of California"
. 
.         gen csu_transfer_ucplus = 1 if csu_enr==1 & nsc_enr_ucplus==1
.         replace csu_transfer_ucplus = 0 if csu_enr==1 & nsc_enr_ucplus==0
.         replace csu_transfer_ucplus = . ///
>                 if (inlist(csu_enr_start_year, `max_csu_enr_year') & inlist(csu_enr_start_term, 4)) ///
>                 | (inlist(csu_enr_start_year, `max_csu_enr_year' + 1) & inlist(csu_enr_start_term, 1, 2, 3))
.         label var csu_transfer_ucplus "Transfered to a University of California +"
. 
.         replace csu_persist_year2 = 1 if csu_persist_year2==0 & csu_transfer_ucplus==1
.         replace csu_persist_year3 = 1 if csu_persist_year3==0 & csu_transfer_ucplus==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
{txt}end of do-file

{com}.   drop enr enr_2year enr_4year
{txt}
{com}.   rename enr_ontime enr
{res}{txt}
{com}.   rename enr_ontime_2year enr_2year
{res}{txt}
{com}.   rename enr_ontime_4year enr_4year
{res}{txt}
{com}.   drop if missing(state_student_id)
{txt}(7,559,373 observations deleted)

{com}. 
.   //save the merged k12 to postsecondary outcome dataset that has the largest student sample in order to calculate sibling outcomes
.   compress
  {txt}variable {bf}{res}enr{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_2year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_4year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_pub{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_pub{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_priv{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_priv{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_instate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_instate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_outstate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_outstate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (2,345,071,410 bytes saved)

{com}.   label data "Full K-12 test scores merged to postsecondary outcomes"
{txt}
{com}.   save $projdir/dta/common_core_va/k12_postsecondary_out_merge, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
.   ********************************************************************************
.   ** create the VA dataset for the long term outcome VA regressions
.   use $projdir/dta/common_core_va/va_dataset, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}.   // merge on postsecondary Outcomes
.   do `mattdofiles'/merge_k12_postsecondary.doh enr_only
{txt}
{com}. version 16.1
{txt}
{com}. 
. *****************************************************
. * First created by Matthew Naven on June 11, 2018 *
. *adapted by Che Sun Dec 13, 2021, changed crosswalks file path
. *****************************************************
. 
. local crosswalks "/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks"
{txt}
{com}. 
. ***************
. * Description *
. ***************
. /*
> This file merges the K-12 data to the postsecondary data.
> */
. 
. 
. **********
. * Macros *
. **********
. args enr_only
{txt}
{com}. 
. local min_nsc_hs_grad_year "2010"
{txt}
{com}. local max_nsc_hs_grad_year "2019"
{txt}
{com}. 
. local min_nsc_enr_year "2010"
{txt}
{com}. local max_nsc_enr_year "2020"
{txt}
{com}. 
. local min_nsc_deg_year "2011"
{txt}
{com}. local max_nsc_deg_year "2020"
{txt}
{com}. 
. local min_ccc_enr_year "1993"
{txt}
{com}. local max_ccc_enr_year "2017"
{txt}
{com}. 
. local min_ccc_deg_year "1993"
{txt}
{com}. local max_ccc_deg_year "2016"
{txt}
{com}. 
. local min_csu_app_year "2002"
{txt}
{com}. local max_csu_app_year "2017"
{txt}
{com}. 
. local min_csu_enr_year "2002"
{txt}
{com}. local max_csu_enr_year "2017"
{txt}
{com}. 
. local min_csu_deg_year "2002"
{txt}
{com}. local max_csu_deg_year "2016"
{txt}
{com}. 
. 
. *****************
. * Begin Do File *
. *****************
. **** K-12 Variables
. gen year_grad_hs = year + (12 - grade)
{txt}(315 missing values generated)

{com}. gen year_college = year + (13 - grade)
{txt}(315 missing values generated)

{com}. 
. 
. 
. 
. **** Merge to K-12/NSC crosswalk
. gen k12_nsc_match = 0
{txt}
{com}. gen k12_nsc_2010_2017_match = 0
{txt}
{com}. /*gen k12_nsc_2010_2018_match = 0*/
. gen k12_nsc_2018cde_match = 0
{txt}
{com}. gen k12_nsc_2019cde_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}year_grad_hs{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}year_college{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}k12_nsc_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2010_2017_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2018cde_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2019cde_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (1,187,833,488 bytes saved)

{com}. 
. 
. ** NSC
. /* changed the generated merge id to be consistent with the code  */
. merge m:1 state_student_id ///
>         using `crosswalks'/nsc_outcomes_crosswalk_ssid.dta ///
>         , gen(merge_k12_nsc_ssid) keep(1 3 4 5) update
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      44,632,739
{txt}{col 9}from master{col 30}{res}      44,632,739{txt}  (merge_k12_nsc_ssid==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==2)

{col 5}Matched{col 30}{res}      29,606,854
{txt}{col 9}not updated{col 30}{res}      29,606,854{txt}  (merge_k12_nsc_ssid==3)
{col 9}missing updated{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==4)
{col 9}nonmissing conflict{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==5)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. replace k12_nsc_match = 1 if inlist(merge_k12_nsc_ssid, 3, 4, 5)
{txt}(29,606,854 real changes made)

{com}. drop merge_k12_nsc_ssid
{txt}
{com}. 
. ** NSC 2010-2017
. /*merge m:1 state_student_id ///
>         using `crosswalks'/nsc_2010_2017_outcomes_crosswalk_ssid.dta ///
>         , gen(merge_k12_nsc_2010_2017_ssid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2010_2017_ssid==3
> replace k12_nsc_2010_2017_match = 1 if merge_k12_nsc_2010_2017_ssid==3
> drop merge_k12_nsc_2010_2017_ssid
> 
> /*merge m:1 cdscode local_student_id ///
>         using `crosswalks'/nsc_2010_2017_outcomes_crosswalk_lsid.dta ///
>         , gen(merge_k12_nsc_2010_2017_lsid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2010_2017_lsid==3
> replace k12_nsc_2010_2017_match = 1 if merge_k12_nsc_2010_2017_lsid==3
> drop merge_k12_nsc_2010_2017_lsid*/
> 
> 
> ** NSC 2018
> merge m:1 state_student_id ///
>         using `crosswalks'/nsc_2018cde_outcomes_crosswalk_ssid.dta ///
>         , gen(merge_k12_nsc_2018cde_ssid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2018cde_ssid==3
> replace k12_nsc_2018cde_match = 1 if merge_k12_nsc_2018cde_ssid==3
> drop merge_k12_nsc_2018cde_ssid
> 
> /*merge m:1 cdscode local_student_id ///
>         using `crosswalks'/nsc_2018cde_outcomes_crosswalk_lsid.dta ///
>         , gen(merge_k12_nsc_2018cde_lsid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2018cde_lsid==3
> replace k12_nsc_2018cde_match = 1 if merge_k12_nsc_2018cde_lsid==3
> drop merge_k12_nsc_2018cde_lsid*/
> 
> 
> ** NSC 2019
> merge m:1 state_student_id ///
>         using `crosswalks'/nsc_2019cde_provisional_outcomes_crosswalk_ssid.dta ///
>         , gen(merge_k12_nsc_2019cde_ssid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2019cde_ssid==3
> replace k12_nsc_2019cde_match = 1 if merge_k12_nsc_2019cde_ssid==3
> drop merge_k12_nsc_2019cde_ssid
> 
> /*merge m:1 cdscode local_student_id ///
>         using `crosswalks'/nsc_2019cde_provisional_outcomes_crosswalk_lsid.dta ///
>         , gen(merge_k12_nsc_2019cde_lsid) keep(1 3 4 5) update
> tab grade year
> replace k12_nsc_match = 1 if merge_k12_nsc_2019cde_lsid==3
> replace k12_nsc_2019cde_match = 1 if merge_k12_nsc_2019cde_lsid==3
> drop merge_k12_nsc_2019cde_lsid*/
> */
. 
. ** Edit NSC Variables
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist "nsc_enr nsc_enr_lt2year nsc_enr_2year nsc_enr_4year nsc_enr_ontime nsc_enr_ontime_lt2year nsc_enr_ontime_2year nsc_enr_ontime_4year"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist "nsc_*"
. {c )-}
{txt}
{com}. * Replace NSC variables with missing if no chance of matching to the NSC data
. foreach v of varlist `varlist' {c -(}
{txt}  2{com}.         replace `v' = . if k12_nsc_match==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         * Replace NSC persistence variables with missing if never enrolled
.         foreach v of varlist nsc_persist_year2 nsc_persist_year3 nsc_persist_year4 {c -(}
{txt}  2{com}.                 replace `v' = . if nsc_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 4 {c -(}
{txt}  2{com}.                 * Replace NSC persistence variables with 0 if they could have matched to the NSC data but didn't
.                 replace nsc_persist_year`t' = 0 if nsc_enr==1 & nsc_persist_year`t'!=1 & k12_nsc_match==1 & year_grad_hs + (`t' - 1)<=`max_nsc_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC persistence variables with missing if they could not have matched to the NSC data
.                 replace nsc_persist_year`t' = . if nsc_enr==1 & /*nsc_persist_year`t'!=1 &*/ k12_nsc_match==1 & year_grad_hs + (`t' - 1)>`max_nsc_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_lt2year {c -(}
{txt}  2{com}.                 * Replace NSC less-than-2-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 2<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC less-than-2-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 2>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_2year {c -(}
{txt}  2{com}.                 * Replace NSC 2-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 3<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC 2-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 3>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_4year {c -(}
{txt}  2{com}.                 * Replace NSC 4-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 6<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC 4-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 6>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * NSC degree receipt conditional on enrollment
.         gen nsc_enr_deg_lt2year = nsc_deg_lt2year if nsc_enr_lt2year==1
.         gen nsc_enr_deg_2year = nsc_deg_2year if nsc_enr_2year==1
.         gen nsc_enr_deg_4year = nsc_deg_4year if nsc_enr_4year==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}           Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006 {c |}     Total
{hline 11}{c +}{hline 44}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 44}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990 {txt}{c |}{res}74,239,278 


           {txt}{c |}           Year of Spring Semester
     Grade {c |}      2007       2008       2009       2010 {c |}     Total
{hline 11}{c +}{hline 44}{c +}{hline 10}
         2 {c |}{res}   472,732    477,138    471,803    468,225 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   469,706    465,335    470,950    464,136 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   474,474    469,522    468,175    464,429 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   465,856    463,911    461,713    458,422 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   472,029    467,563    461,410    457,935 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   484,293    481,488    476,277    468,446 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   470,862    471,279    470,585    463,630 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   488,685    486,983    493,813    486,854 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   455,470    452,290    456,653    458,680 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   407,531    409,660    413,852    416,821 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 44}{c +}{hline 10}
     Total {c |}{res} 4,661,638  4,645,169  4,645,231  4,607,578 {txt}{c |}{res}74,239,278 


           {txt}{c |}           Year of Spring Semester
     Grade {c |}      2011       2012       2013       2015 {c |}     Total
{hline 11}{c +}{hline 44}{c +}{hline 10}
         2 {c |}{res}   474,331    477,197    481,090      1,799 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   462,446    468,679    472,196    484,890 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   467,777    465,428    471,815    472,830 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   464,569    459,999    458,379    930,800 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   456,870    462,429    457,254    465,708 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   464,799    462,900    468,092    459,829 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   458,037    456,362    454,971    912,429 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   481,172    472,798    470,427        927 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   457,268    451,871    447,194    428,898 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,677    419,140    420,513    424,011 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 44}{c +}{hline 10}
     Total {c |}{res} 4,607,946  4,596,803  4,601,931  4,582,121 {txt}{c |}{res}74,239,278 


           {txt}{c |}           Year of Spring Semester
     Grade {c |}      2016       2017       2018       2019 {c |}     Total
{hline 11}{c +}{hline 44}{c +}{hline 10}
         2 {c |}{res}     2,079      1,649      1,138          0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   473,760    465,059    440,204    459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   488,694    469,686    464,003    450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   953,631    963,455    925,930    923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   472,998    472,987    488,487    469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   470,667    469,722    472,367    483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   921,699    927,937    925,351    934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,027      2,231     12,167      6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   463,043    389,735     16,548     31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   428,138    472,994    557,079    673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}     1,847     35,091    426,103    288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 44}{c +}{hline 10}
     Total {c |}{res} 4,682,583  4,670,546  4,729,377  4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. 
. 
. **** Merge to K-12/CCC crosswalk
. gen k12_ccc_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}nsc_enr_n_4year{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}nsc_enr_n_2year{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_ccc_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (371,197,965 bytes saved)

{com}. 
. merge m:1 state_student_id ///
>         using `crosswalks'/k12_ccc_crosswalk.dta ///
>         , gen(merge_k12_ccc) keep(1 3) keepusing(student_id)
{res}{txt}(label {bf:{txt}male} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      55,226,385
{txt}{col 9}from master{col 30}{res}      55,226,385{txt}  (merge_k12_ccc==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_ccc==2)

{col 5}Matched{col 30}{res}      19,013,208{txt}  (merge_k12_ccc==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. replace k12_ccc_match = 1 if merge_k12_ccc==3
{txt}(19,013,208 real changes made)

{com}. drop merge_k12_ccc
{txt}
{com}. 
. 
. **** Merge to CCC data
. count if !mi(student_id)
  {res}19,013,208
{txt}
{com}. 
. merge m:1 student_id ///
>         using `crosswalks'/ccc_outcomes_crosswalk.dta ///
>         , gen(merge_k12_ccc) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      59,602,683
{txt}{col 9}from master{col 30}{res}      59,602,683{txt}  (merge_k12_ccc==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_ccc==2)

{col 5}Matched{col 30}{res}      14,636,910{txt}  (merge_k12_ccc==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. ** Edit CCC Variables
. foreach v of varlist ccc_enr {c -(}
{txt}  2{com}.         * Replace CCC enrollment with 0 if could have matched to the CCC data but didn't
.         replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_ccc_enr_year', `max_ccc_enr_year')
{txt}  3{com}.         * Replace CCC enrollment with missing if could not have matched to the CCC data
.         replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_ccc_enr_year', `max_ccc_enr_year')
{txt}  4{com}. {c )-}
{txt}(32,480,670 real changes made)
(4,773,803 real changes made, 4,773,803 to missing)

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. * CCC on-time enrollment
. gen ccc_enr_ontime = 1 if ccc_enr==1 ///
>         & (ccc_enr_start_year==year_grad_hs & inlist(ccc_enr_start_term, 5, 6, 7, 8)) ///
>         | (ccc_enr_start_year==year_grad_hs + 1 & inlist(ccc_enr_start_term, 1, 2, 3, 4))
{txt}(69,729,820 missing values generated)

{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         * Replace CCC remediation and persistence variables with missing if never enrolled
.         foreach v of varlist ccc_remediation ccc_ela_remediation ccc_math_remediation ///
>                 ccc_persist_year2 ccc_persist_year3 ///
>                 ccc_deg ccc_deg_c ccc_deg_a ccc_deg_b {c -(}
{txt}  2{com}.                 replace `v' = . if ccc_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 3 {c -(}
{txt}  2{com}.                 * Replace CCC persistence variables with 0 if they could have matched to the CCC data but didn't
.                 replace ccc_persist_year`t' = 0 if ccc_enr==1 & ccc_persist_year`t'!=1 & k12_ccc_match==1 & year_grad_hs + (`t' - 1)<=`max_ccc_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace CCC persistence variables with missing if they could not have matched to the CCC data
.                 replace ccc_persist_year`t' = . if ccc_enr==1 & /*ccc_persist_year`t'!=1 &*/ k12_ccc_match==1 & year_grad_hs + (`t' - 1)>`max_ccc_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist ccc_deg ccc_deg_c ccc_deg_a ccc_deg_b {c -(}
{txt}  2{com}.                 * Replace CCC degree variable with 0 if they could have matched to the CCC data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs + 3, `min_ccc_deg_year', `max_ccc_deg_year')
{txt}  3{com}.                 * Replace CCC degree variable with missing if they could not have matched to the CCC data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs + 3, `min_ccc_deg_year', `max_ccc_deg_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. 
. 
. **** Merge to K-12/CSU crosswalk
. gen k12_csu_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}ccc_enr_year{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}ccc_enr_ontime{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_csu_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (519,677,151 bytes saved)

{com}. 
. merge m:1 state_student_id ///
>         using `crosswalks'/k12_csu_crosswalk.dta ///
>         , gen(merge_k12_csu) keep(1 3) keepusing(idunique)
{res}{txt}(label {bf:{txt}male} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      65,945,290
{txt}{col 9}from master{col 30}{res}      65,945,290{txt}  (merge_k12_csu==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_csu==2)

{col 5}Matched{col 30}{res}       8,294,303{txt}  (merge_k12_csu==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. replace k12_csu_match = 1 if merge_k12_csu==3
{txt}(8,294,303 real changes made)

{com}. drop merge_k12_csu
{txt}
{com}. 
. 
. **** Merge to CSU data
. count if !mi(idunique)
  {res}8,294,303
{txt}
{com}. 
. merge m:1 idunique ///
>         using `crosswalks'/csu_outcomes_crosswalk.dta ///
>         , gen(merge_k12_csu) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      65,945,290
{txt}{col 9}from master{col 30}{res}      65,945,290{txt}  (merge_k12_csu==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_csu==2)

{col 5}Matched{col 30}{res}       8,294,303{txt}  (merge_k12_csu==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. ** Edit CSU Variables
. foreach v of varlist csu_enr {c -(}
{txt}  2{com}.         * Replace CSU enrollment with 0 if could have matched to the CSU data but didn't
.         replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_csu_enr_year', `max_csu_enr_year')
{txt}  3{com}.         * Replace CSU enrollment with missing if could not have matched to the CSU data
.         replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_csu_enr_year', `max_csu_enr_year')
{txt}  4{com}. {c )-}
{txt}(34,066,226 real changes made)
(16,752 real changes made, 16,752 to missing)

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. * CSU on-time enrollment
. gen csu_enr_ontime = 1 if csu_enr==1 ///
>         & (csu_enr_start_year==year_grad_hs & inlist(csu_enr_start_term, 3, 4)) ///
>         | (csu_enr_start_year==year_grad_hs + 1 & inlist(csu_enr_start_term, 1, 2))
{txt}(71,630,260 missing values generated)

{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         foreach v of varlist csu_applied csu_applied_multiple csu_accepted {c -(}
{txt}  2{com}.                 * Replace CSU application with 0 if could have matched to the CSU data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_csu_app_year', `max_csu_app_year')
{txt}  3{com}.                 * Replace CSU application with missing if could not have matched to the CSU data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_csu_app_year', `max_csu_app_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * Replace CSU acceptance with missing if never applied
.         foreach v of varlist csu_accepted {c -(}
{txt}  2{com}.                 replace `v' = . if csu_applied!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         * Replace CSU remediation and persistence variables with missing if never enrolled
.         foreach v of varlist ///
>                 csu_eng_remediation csu_math_remediation csu_first_maj_stem csu_first_maj_other csu_first_maj_undecided ///
>                 csu_persist_year2 csu_persist_year3 csu_persist_year4 ///
>                 csu_deg csu_deg_stem csu_deg_other {c -(}
{txt}  2{com}.                 replace `v' = . if csu_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 4 {c -(}
{txt}  2{com}.                 * Replace CSU persistence variables with 0 if they could have matched to the CSU data but didn't
.                 replace csu_persist_year`t' = 0 if csu_enr==1 & csu_persist_year`t'!=1 & k12_csu_match==1 & year_grad_hs + (`t' - 1)<=`max_csu_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace CSU persistence variables with missing if they could not have matched to the CSU data
.                 replace csu_persist_year`t' = . if csu_enr==1 & /*csu_persist_year`t'!=1 &*/ k12_csu_match==1 & year_grad_hs + (`t' - 1)>`max_csu_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist csu_deg csu_deg_stem csu_deg_other {c -(}
{txt}  2{com}.                 * Replace CSU degree variable with 0 if they could have matched to the CSU data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs + 6, `min_csu_deg_year', `max_csu_deg_year')
{txt}  3{com}.                 * Replace CSU degree variable with missing if they could not have matched to the CSU data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs + 6, `min_csu_deg_year', `max_csu_deg_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * CSU degree receipt conditional on STEM major
.         gen csu_maj_stem_deg_stem = csu_deg_stem if csu_first_maj_stem==1
.         gen csu_maj_stem_deg_other = csu_deg_other if csu_first_maj_stem==1
. 
.         * Replace CSU degree receipt conditional on STEM major with missing if never enrolled
.         foreach v of varlist ///
>                 csu_maj_stem_deg_stem csu_maj_stem_deg_other {c -(}
{txt}  2{com}.                 replace `v' = . if csu_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. {c )-}
{txt}
{com}. 
. 
. 
. 
. **** Drop observations that had no chance of matching to CCC/CSU data
. compress
  {txt}variable {bf}{res}csu_enr_ontime{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (222,718,779 bytes saved)

{com}. merge m:1 state_student_id ///
>         using `crosswalks'/k12_unique_crosswalk.dta ///
>         , gen(merge_k12_unique) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       8,542,396
{txt}{col 9}from master{col 30}{res}       8,542,396{txt}  (merge_k12_unique==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_unique==2)

{col 5}Matched{col 30}{res}      65,697,197{txt}  (merge_k12_unique==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist_ccc "ccc_enr_*"
.         local varlist_csu "csu_enr_*"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist_ccc "ccc_*"
.         local varlist_csu "csu_*"
. {c )-}
{txt}
{com}. * Replace CCC variables with missing if could not have matched to the CCC data due to non-unique name/birth date/sex
. foreach v of varlist `varlist_ccc' {c -(}
{txt}  2{com}.         replace `v' = . if k12_ccc_match==0 & uniq_first_last_bday_sex==0
{txt}  3{com}.         replace `v' = . if k12_ccc_match==0 & uniq_first3_last3_bday_sex==0 & inrange(year_grad_hs, 1993, 2011)
{txt}  4{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist_ccc
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. * Replace CSU variables with missing if could not have matched to the CSU data due to non-unique name/birth date/sex
. foreach v of varlist `varlist_csu' {c -(}
{txt}  2{com}.         replace `v' = . if k12_csu_match==0 & uniq_first_last_bday_sex_middle==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist_csu
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. 
. 
. **** All college outcomes
. * Enrollment
. gen enr = 1 if nsc_enr==1 /*| ccc_enr==1 | csu_enr==1*/
{txt}(53,978,195 missing values generated)

{com}. replace enr = 0 if nsc_enr==0 & ccc_enr!=1 & csu_enr!=1
{txt}(8,127,379 real changes made)

{com}. label var enr "Enrolled at a Postsecondary Institution"
{txt}
{com}. 
. gen enr_ontime = 1 if nsc_enr_ontime==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(54,360,882 missing values generated)

{com}. replace enr_ontime = 0 if nsc_enr_ontime==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(11,241,447 real changes made)

{com}. label var enr_ontime "Enrolled at a Postsecondary Institution"
{txt}
{com}. 
. gen enr_2year = 1 if nsc_enr_2year==1 | nsc_enr_lt2year==1 | ccc_enr==1
{txt}(56,941,184 missing values generated)

{com}. replace enr_2year = 0 if nsc_enr_2year==0 & nsc_enr_lt2year==0 & ccc_enr!=1
{txt}(14,768,674 real changes made)

{com}. label var enr_2year "Enrolled at a 2-Year College"
{txt}
{com}. 
. gen enr_ontime_2year = 1 if nsc_enr_ontime_2year==1 | nsc_enr_ontime_lt2year==1 | ccc_enr_ontime==1
{txt}(63,622,171 missing values generated)

{com}. replace enr_ontime_2year = 0 if nsc_enr_ontime_2year==0 & nsc_enr_ontime_lt2year==0 & ccc_enr_ontime!=1
{txt}(20,079,116 real changes made)

{com}. label var enr_ontime_2year "Enrolled at a 2-Year College"
{txt}
{com}. 
. gen enr_4year = 1 if nsc_enr_4year==1 | csu_enr==1
{txt}(64,654,351 missing values generated)

{com}. replace enr_4year = 0 if nsc_enr_4year==0 & csu_enr!=1
{txt}(20,918,682 real changes made)

{com}. label var enr_4year "Enrolled at a 4-Year University"
{txt}
{com}. 
. replace enr_2year = 0 if enr_4year==1
{txt}(5,683,294 real changes made)

{com}. 
. gen enr_ontime_4year = 1 if nsc_enr_ontime_4year==1 | csu_enr_ontime==1
{txt}(67,075,285 missing values generated)

{com}. replace enr_ontime_4year = 0 if nsc_enr_ontime_4year==0 & csu_enr_ontime!=1
{txt}(22,880,182 real changes made)

{com}. label var enr_ontime_4year "Enrolled at a 4-Year University"
{txt}
{com}. 
. replace enr_ontime_2year = 0 if enr_ontime_4year==1
{txt}(876,089 real changes made)

{com}. 
. gen enr_pub = 1 if nsc_enr_pub==1 | ccc_enr==1 | csu_enr==1
{txt}(50,974,831 missing values generated)

{com}. replace enr_pub = 0 if nsc_enr_pub==0 & ccc_enr!=1 & csu_enr!=1
{txt}(9,321,942 real changes made)

{com}. label var enr_pub "Enrolled at a Public Institution"
{txt}
{com}. 
. gen enr_ontime_pub = 1 if nsc_enr_ontime_pub==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(55,945,493 missing values generated)

{com}. replace enr_ontime_pub = 0 if nsc_enr_ontime_pub==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(12,826,058 real changes made)

{com}. label var enr_ontime_pub "Enrolled at a Public Institution"
{txt}
{com}. 
. gen enr_priv = 1 if nsc_enr_priv==1
{txt}(71,593,082 missing values generated)

{com}. replace enr_priv = 0 if nsc_enr_priv==0
{txt}(26,960,343 real changes made)

{com}. label var enr_priv "Enrolled at a Private Institution"
{txt}
{com}. 
. replace enr_pub = 0 if enr_priv==1
{txt}(1,452,818 real changes made)

{com}. 
. gen enr_ontime_priv = 1 if nsc_enr_ontime_priv==1
{txt}(72,526,577 missing values generated)

{com}. replace enr_ontime_priv = 0 if nsc_enr_ontime_priv==0
{txt}(27,893,838 real changes made)

{com}. label var enr_ontime_priv "Enrolled at a Private Institution"
{txt}
{com}. 
. replace enr_ontime_pub = 0 if enr_ontime_priv==1
{txt}(128,405 real changes made)

{com}. 
. gen enr_instate = 1 if nsc_enr_instate==1 | ccc_enr==1 | csu_enr==1
{txt}(51,177,059 missing values generated)

{com}. replace enr_instate = 0 if nsc_enr_instate==0 & ccc_enr!=1 & csu_enr!=1
{txt}(9,524,170 real changes made)

{com}. label var enr_instate "Enrolled at a CA Institution"
{txt}
{com}. 
. gen enr_ontime_instate = 1 if nsc_enr_ontime_instate==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(56,054,671 missing values generated)

{com}. replace enr_ontime_instate = 0 if nsc_enr_ontime_instate==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(12,935,236 real changes made)

{com}. label var enr_ontime_instate "Enrolled at a CA Institution"
{txt}
{com}. 
. gen enr_outstate = 1 if nsc_enr_outstate==1
{txt}(71,499,348 missing values generated)

{com}. replace enr_outstate = 0 if nsc_enr_outstate==0
{txt}(26,866,609 real changes made)

{com}. label var enr_outstate "Enrolled at an Out-of-State Institution"
{txt}
{com}. 
. replace enr_instate = 0 if enr_outstate==1
{txt}(1,343,544 real changes made)

{com}. 
. gen enr_ontime_outstate = 1 if nsc_enr_ontime_outstate==1
{txt}(72,421,971 missing values generated)

{com}. replace enr_ontime_outstate = 0 if nsc_enr_ontime_outstate==0
{txt}(27,789,232 real changes made)

{com}. label var enr_ontime_outstate "Enrolled at an Out-of-State Institution"
{txt}
{com}. 
. replace enr_ontime_instate = 0 if enr_ontime_outstate==1
{txt}(123,891 real changes made)

{com}. 
. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. * Persistence
. if "`enr_only'"!="enr_only" {c -(}
.         gen persist_year2 = 1 if nsc_persist_year2==1 | ccc_persist_year2==1 | csu_persist_year2==1
.         replace persist_year2 = 0 if nsc_persist_year2==0 & ccc_persist_year2!=1 & csu_persist_year2!=1
.         label var persist_year2 "Persisted to Year 2"
. 
.         gen persist_year3 = 1 if nsc_persist_year3==1 | ccc_persist_year3==1 | csu_persist_year3==1
.         replace persist_year3 = 0 if nsc_persist_year3==0 & ccc_persist_year3!=1 & csu_persist_year3!=1
.         label var persist_year3 "Persisted to Year 3"
. 
.         gen persist_year4 = 1 if nsc_persist_year4==1 /*| ccc_persist_year4==1*/ | csu_persist_year4==1
.         replace persist_year4 = 0 if nsc_persist_year4==0 /*& ccc_persist_year4!=1*/ & csu_persist_year4!=1
.         label var persist_year4 "Persisted to Year 4"
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. * Degree
. if "`enr_only'"!="enr_only" {c -(}
.         gen deg = 1 if nsc_deg==1 | ccc_deg==1 | csu_deg==1
.         replace deg = 0 if nsc_deg==0 & ccc_deg!=1 & csu_deg!=1
.         label var deg "Received a College Degree"
. 
.         gen deg_2year = 1 if nsc_deg_2year==1 | ccc_deg==1
.         replace deg_2year = 0 if nsc_deg_2year==0 & ccc_deg!=1
.         label var deg_2year "Received a 2-Year College Degree"
. 
.         gen deg_4year = 1 if nsc_deg_4year==1 | csu_deg==1
.         replace deg_4year = 0 if nsc_deg_4year==0 & csu_deg!=1
.         label var deg_4year "Received a 4-Year College Degree"
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. * Use only NSC sample + values of 1 from other samples
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist "enr enr_2year enr_4year enr_pub enr_priv enr_instate enr_outstate enr_ontime enr_ontime_2year enr_ontime_4year enr_ontime_pub enr_ontime_priv enr_ontime_instate enr_ontime_outstate"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist "enr enr_2year enr_4year enr_pub enr_priv enr_instate enr_outstate enr_ontime enr_ontime_2year enr_ontime_4year enr_ontime_pub enr_ontime_priv enr_ontime_instate enr_ontime_outstate deg deg_2year deg_4year"
. {c )-}
{txt}
{com}. foreach v of varlist `varlist' {c -(}
{txt}  2{com}.         replace `v' = . if /*`v'==0 &*/ k12_nsc_match==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(2,979,850 real changes made, 2,979,850 to missing)
(897,070 real changes made, 897,070 to missing)
(2,979,850 real changes made, 2,979,850 to missing)
(0 real changes made)
(2,979,850 real changes made, 2,979,850 to missing)
(0 real changes made)
(1,513,304 real changes made, 1,513,304 to missing)
(1,513,304 real changes made, 1,513,304 to missing)
(437,636 real changes made, 437,636 to missing)
(1,513,304 real changes made, 1,513,304 to missing)
(0 real changes made)
(1,513,304 real changes made, 1,513,304 to missing)
(0 real changes made)

{com}. macro drop _varlist
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. * CCC
. if "`enr_only'"!="enr_only" {c -(}
.         gen ccc_transfer_4year = 1 if ccc_enr==1 & enr_4year==1
.         replace ccc_transfer_4year = 0 if ccc_enr==1 & enr_4year==0
.         replace ccc_transfer_4year = . ///
>                 if (inlist(ccc_enr_start_year, `max_ccc_enr_year') & inlist(ccc_enr_start_term, 7, 8)) ///
>                 | (inlist(ccc_enr_start_year, `max_ccc_enr_year' + 1) & inlist(ccc_enr_start_term, 1, 2, 3, 4, 5, 6))
.         label var ccc_transfer_4year "Transfered to 4-Year University"
. 
.         replace ccc_persist_year2 = 1 if ccc_persist_year2==0 & ccc_transfer_4year==1
.         replace ccc_persist_year3 = 1 if ccc_persist_year3==0 & ccc_transfer_4year==1
.         replace ccc_deg = 1 if ccc_deg==0 & ccc_transfer_4year==1
.         replace ccc_deg_a = 1 if ccc_deg_a==0 & ccc_transfer_4year==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. * CSU
. if "`enr_only'"!="enr_only" {c -(}
.         gen csu_transfer_uc = 1 if csu_enr==1 & nsc_enr_uc==1
.         replace csu_transfer_uc = 0 if csu_enr==1 & nsc_enr_uc==0
.         replace csu_transfer_uc = . ///
>                 if (inlist(csu_enr_start_year, `max_csu_enr_year') & inlist(csu_enr_start_term, 4)) ///
>                 | (inlist(csu_enr_start_year, `max_csu_enr_year' + 1) & inlist(csu_enr_start_term, 1, 2, 3))
.         label var csu_transfer_uc "Transfered to a University of California"
. 
.         gen csu_transfer_ucplus = 1 if csu_enr==1 & nsc_enr_ucplus==1
.         replace csu_transfer_ucplus = 0 if csu_enr==1 & nsc_enr_ucplus==0
.         replace csu_transfer_ucplus = . ///
>                 if (inlist(csu_enr_start_year, `max_csu_enr_year') & inlist(csu_enr_start_term, 4)) ///
>                 | (inlist(csu_enr_start_year, `max_csu_enr_year' + 1) & inlist(csu_enr_start_term, 1, 2, 3))
.         label var csu_transfer_ucplus "Transfered to a University of California +"
. 
.         replace csu_persist_year2 = 1 if csu_persist_year2==0 & csu_transfer_ucplus==1
.         replace csu_persist_year3 = 1 if csu_persist_year3==0 & csu_transfer_ucplus==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
{txt}end of do-file

{com}.   drop enr enr_2year enr_4year
{txt}
{com}.   rename enr_ontime enr
{res}{txt}
{com}.   rename enr_ontime_2year enr_2year
{res}{txt}
{com}.   rename enr_ontime_4year enr_4year
{res}{txt}
{com}. 
. 
. 
.   * Save temporary dataset
.   compress
  {txt}variable {bf}{res}enr{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_2year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_4year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_pub{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_pub{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_priv{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_priv{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_instate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_instate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_outstate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_outstate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (2,449,906,569 bytes saved)

{com}.   tempfile va_dataset
{txt}
{com}.   save `va_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St233715.000003{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
.   ** need to create grade 11 sample for long term outcome VA, use create_va_g11_sample.doh
. 
.   // use only 11th Grade (8th Grade ELA Controls, 6th Grade Math Controls)
.   include `mattdofiles'/create_va_g11_out_sample.doh
{txt}
{com}. local drift_limit = max(`outcome_max_year' - `outcome_min_year' - 1, 1)
{txt}
{com}. use if grade==11 & dataset=="CAASPP" & inrange(year, `outcome_min_year', `outcome_max_year') using `va_dataset', clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. 
. gen diff_school_prop = gr11_L3_diff_school_prop if year!=2017
{txt}(473,128 missing values generated)

{com}. replace diff_school_prop = gr11_L4_diff_school_prop if year==2017
{txt}(472,961 real changes made)

{com}. keep if diff_school_prop>=0.95
{txt}(97,358 observations deleted)

{com}. 
. **************** Prior Scores
. ******** ELA
. gen prior_ela_z_score = L3_cst_ela_z_score if inrange(year, `star_min_year' + 3, `star_max_year' + 3) & year!=2017
{txt}(1,113,021 missing values generated)

{com}. replace prior_ela_z_score = L3_sbac_ela_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3) & year!=2017
{txt}(344,053 real changes made)

{com}. replace prior_ela_z_score = L4_cst_ela_z_score if year==2017
{txt}(333,419 real changes made)

{com}. label var prior_ela_z_score "Prior ELA Z-Score"
{txt}
{com}. gen peer_prior_ela_z_score = peer_L3_cst_ela_z_score if inrange(year, `star_min_year' + 3, `star_max_year' + 3) & year!=2017
{txt}(976,464 missing values generated)

{com}. replace peer_prior_ela_z_score = peer_L3_sbac_ela_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3) & year!=2017
{txt}(525,703 real changes made)

{com}. replace peer_prior_ela_z_score = peer_L4_cst_ela_z_score if year==2017
{txt}(450,528 real changes made)

{com}. label var peer_prior_ela_z_score "Peer Avg. Prior ELA Z-Score"
{txt}
{com}. 
. ******** Math
. gen prior_math_z_score = L5_cst_math_z_score if inrange(year, `star_min_year' + 5, `star_max_year' + 5) & !inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(798,623 missing values generated)

{com}. replace prior_math_z_score = L3_sbac_math_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(344,849 real changes made)

{com}. label var prior_math_z_score "Prior Math Z-Score"
{txt}
{com}. gen peer_prior_math_z_score = peer_L5_cst_math_z_score if inrange(year, `star_min_year' + 5, `star_max_year' + 5) & !inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(525,936 missing values generated)

{com}. replace peer_prior_math_z_score = peer_L3_sbac_math_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(525,703 real changes made)

{com}. label var peer_prior_math_z_score "Peer Avg. Prior Math Z-Score"
{txt}
{com}. 
. 
. * Save temporary dataset
. compress
{txt}  (0 bytes saved)

{com}. tempfile va_g11_dataset
{txt}
{com}. save `va_g11_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St233715.000004{rm}
saved
as .dta format
{p_end}

{com}. {txt}
{com}. 
.   ** this creates the VA dataset for the long term outcome VA regressions
.   compress
{txt}  (0 bytes saved)

{com}.   save $projdir/dta/common_core_va/va_g11_out_dataset, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:   6962.29 /        1 =    6962.2910
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/createvasample.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}16 Dec 2021, 12:37:08
{txt}{.-}
{smcl}
{txt}{sf}{ul off}