{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/reg_out_va_sib_acs_fig.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 May 2022, 18:41:24
{txt}
{com}. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative file paths  */
. cd $vaprojdir
{res}/home/research/ca_ed_lab/projects/common_core_va
{txt}
{com}. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh
{txt}
{com}. ********************************************************************************
. /* Macros for common core VA project folder file paths, and relevant datasets to make it possible
> to use Matt's doh files  */
. ********************************************************************************
. ********************************************************************************
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"
{txt}
{com}. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"
{txt}
{com}. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"
{txt}
{com}. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"
{txt}
{com}. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"
{txt}
{com}. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"
{txt}
{com}. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecondary_out_merge"
{txt}
{com}. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"
{txt}
{com}. {txt}
{com}. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. macro list
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_both_str:{space 6}{res}{res}Original + Census + Sibling
{p_end}
{txt}{p 0 16}
_sib_str:{space 7}{res}{res}Original + Sibling
{p_end}
{txt}{p 0 16}
_acs_str:{space 7}{res}{res}Original + Census
{p_end}
{txt}{p 0 16}
_og_str:{space 8}{res}{res}Original Specification
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}
{com}. 
. //startomg timer
. timer on 1
{txt}
{com}. 
. 
. ********************************************************************************
. * begin main code
. 
. ********** assign outcome on test score VA regression coefficients to scalars
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   di "LHS = `outcome'"
{txt}  3{com}. 
.   foreach subject in ela math {c -(}
{txt}  4{com}.     di "RHS VA subject = `subject'"
{txt}  5{com}. 
.     foreach control in og acs sib both {c -(}
{txt}  6{com}.       di "RHS VA control = `control'"
{txt}  7{com}. 
.       // pull the regression estimates from regressing outcome on only one subject VA
.       estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_`outcome'_va_`subject'_`control'.ster
{txt}  8{com}. 
.       // assign a tempname to a local macro name
.       tempname `outcome'_va_`subject'_`control'
{txt}  9{com}.       // assign the coefficient value from the regression to a scalar
.       scalar ``outcome'_va_`subject'_`control'' = _b[va_`subject'_`control']
{txt} 10{com}. 
.     {c )-}
{txt} 11{com}.   {c )-}
{txt} 12{com}. 
. 
.   foreach control in og acs sib both {c -(}
{txt} 13{com}.     // pull the regression estimates from regressing outcome on both subject VAs
.     estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_`outcome'_va_ela_math_`control'.ster
{txt} 14{com}. 
.     //assign tempname
.     // naming convention: coefficient of outcome on both va (with specified controls) regression, coefficient on ela term
.     tempname `outcome'_va_both_`control'_ela
{txt} 15{com}.     tempname `outcome'_va_both_`control'_math
{txt} 16{com}.     //assign the coefficient value to scalar with the name
.     scalar ``outcome'_va_both_`control'_ela' = _b[va_ela_`control']
{txt} 17{com}.     scalar ``outcome'_va_both_`control'_math' = _b[va_math_`control']
{txt} 18{com}. 
.   {c )-}
{txt} 19{com}. {c )-}
LHS = enr
RHS VA subject = ela
RHS VA control = og
{res}RHS VA control = acs
RHS VA control = sib
RHS VA control = both
RHS VA subject = math
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both
LHS = enr_2year
RHS VA subject = ela
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both
RHS VA subject = math
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both
LHS = enr_4year
RHS VA subject = ela
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both
RHS VA subject = math
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both
{txt}
{com}. 
. 
. ********** make figures for prior score heterogeneity regressions
. 
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   di "LHS = `outcome'"
{txt}  3{com}. 
.   // regression of outcome on single test score VA interacted with prior score decile by prior subject
.   // 3 outcomes, 2 subject VAs, 2 prior scores, 4 VA specifications = 48 regressions
. 
.   foreach subject in ela math {c -(}
{txt}  4{com}.     di "VA Subject = `subject'"
{txt}  5{com}. 
.     foreach control in og acs sib both {c -(}
{txt}  6{com}.       di "`subject' test score VA with `control' controls"
{txt}  7{com}. 
.       foreach prior_subject in ela math {c -(}
{txt}  8{com}.         di "interaction with prior `prior_subject' score deciles"
{txt}  9{com}. 
.         // pull the estimates from regression of outcome on single subject VA interacted with single prior subject score decile
.         estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/het_reg_`outcome'_va_`subject'_`control'_x_prior_`prior_subject'.ster
{txt} 10{com}.         // convert estimation results into a dataset
.         parmest, norestore
{txt} 11{com}.         // keep only the interaction parameters
.         keep if strpos(parm, "prior_`prior_subject'_z_score_xtile#c.va_`subject'_`control'") != 0
{txt} 12{com}.         // generate a var that is the decile number of the prior score, from 1 to 10
.         gen xtile = subinstr(substr(parm, 1, strpos(parm, ".")), "b", "", .)
{txt} 13{com}.         // convert xtile var into a numeric var
.         destring xtile, replace
{txt} 14{com}. 
.         // twoway graph 1) bar graph of coefficient estimates 2) rcap for 90% CI
.         // draw horizontal yline at the coefficient estimate from regression with only the subject VA, no interaction
.         twoway ///
>           (bar estimate xtile) ///
>           (rcap min95 max95 xtile) ///
>           , yline(`=``outcome'_va_`subject'_`control''') ///
>           legend(off) ///
>           ytitle("Coefficient Estimate") ///
>           xtitle("Prior ``prior_subject'_str' Score Decile") ///
>           title("LHS = ``outcome'_str'; RHS = ``subject'_str' VA w/ ``control'_str' Controls # Prior ``prior_subject'_str' Decile" ///
>           , size(vsmall))
{txt} 15{com}. 
. 
.         graph export $vaprojdir/figures/va_sib_acs/het_reg_prior_score/het_reg_`outcome'_va_`subject'_`control'_x_prior_`prior_subject'.pdf, replace
{txt} 16{com}.         graph export $projdir/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_`outcome'_va_`subject'_`control'_x_prior_`prior_subject'.pdf, replace
{txt} 17{com}. 
.         // redraw the graph to be used for combining into panels
.         twoway ///
>           (bar estimate xtile) ///
>           (rcap min95 max95 xtile) ///
>           , yline(`=``outcome'_va_`subject'_`control''') ///
>           legend(off) ///
>           ytitle("Coefficient Estimate") ///
>           xtitle("Prior ``prior_subject'_str' Score Decile") ///
>           title("Restricted Sample, ``control'_str' Controls", size(vsmall)) ///
>           saving($vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'_va_`subject'_`control'_x_prior_`prior_subject', replace)
{txt} 18{com}.       {c )-}
{txt} 19{com}.     {c )-}
{txt} 20{com}.   {c )-}
{txt} 21{com}. 
. 
.   // regression of outcome on both test score VAs interacted with prior score decile by prior subject
.   // 3 outcomes, 2 prior subjects, 4 specifications = 24 regressions
.   foreach control in og acs sib both {c -(}
{txt} 22{com}.     di "`subject' test score VA with `control' controls"
{txt} 23{com}. 
.     foreach prior_subject in ela math {c -(}
{txt} 24{com}.       di "interaction with prior `prior_subject' score deciles"
{txt} 25{com}. 
.       // pull the regression estimates
.       estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/het_reg_`outcome'_va_ela_math_`control'_x_prior_`prior_subject'.ster
{txt} 26{com}.       // convert to dataset
.       parmest, norestore
{txt} 27{com}.       // keep only interaction parameters
.       keep if strpos(parm, "prior_`prior_subject'_z_score_xtile#c.va_ela_`control'")!=0 | strpos(parm, "prior_`prior_subject'_z_score_xtile#c.va_math_`control'")!=0
{txt} 28{com}.       // create a var that is the decile number of the prior score, from 1 to 10
.       gen xtile = subinstr(substr(parm, 1, strpos(parm, ".")), "b", "", .)
{txt} 29{com}.       // convert xtile var into a numeric var
.       destring xtile, replace
{txt} 30{com}. 
.       // two way graph
.       // yline 1: coefficient estimate of ELA VA from regression with both subject VA without interactions
.       // yline 2: coefficient estimate of Math VA from regression with both subject VA without interactions
.       twoway ///
>         (bar estimate xtile) ///
>         (rcap min95 max95 xtile) ///
>         , yline(`=``outcome'_va_both_`control'_ela'')  ///
>         yline(`=``outcome'_va_both_`control'_math'') ///
>         legend(off) ///
>         ytitle(Coefficient Estimate) ///
>         xtitle("Prior ``prior_subject'_str' Score Decile") ///
>         title("LHS = ``outcome'_str'; RHS = Both VA w/ ``control'_str' Controls # Prior ``prior_subject'_str' Decile" ///
>         , size(vsmall))
{txt} 31{com}. 
.       graph export $vaprojdir/figures/va_sib_acs/het_reg_prior_score/het_reg_`outcome'_va_both_`control'_x_prior_`prior_subject'.pdf, replace
{txt} 32{com}.       graph export $projdir/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_`outcome'_va_both_`control'_x_prior_`prior_subject'.pdf, replace
{txt} 33{com}.     {c )-}
{txt} 34{com}.   {c )-}
{txt} 35{com}. 
. 
. {c )-}
LHS = enr
VA Subject = ela
ela test score VA with og controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_og_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_og_x_prior_math.gph} saved
ela test score VA with acs controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_acs_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_acs_x_prior_math.gph} saved
ela test score VA with sib controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_sib_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_sib_x_prior_math.gph} saved
ela test score VA with both controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_both_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_ela_both_x_prior_math.gph} saved
VA Subject = math
math test score VA with og controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_og_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_og_x_prior_math.gph} saved
math test score VA with acs controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_acs_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_acs_x_prior_math.gph} saved
math test score VA with sib controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_sib_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_sib_x_prior_math.gph} saved
math test score VA with both controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_both_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_va_math_both_x_prior_math.gph} saved
 test score VA with og controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_both_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_both_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
 test score VA with acs controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_both_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_both_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
 test score VA with sib controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_both_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_both_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
 test score VA with both controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_both_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_va_both_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
LHS = enr_2year
VA Subject = ela
ela test score VA with og controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_math.gph} saved
ela test score VA with acs controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_math.gph} saved
ela test score VA with sib controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_math.gph} saved
ela test score VA with both controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_math.gph} saved
VA Subject = math
math test score VA with og controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_math.gph} saved
math test score VA with acs controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_math.gph} saved
math test score VA with sib controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_math.gph} saved
math test score VA with both controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_math.gph} saved
 test score VA with og controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_both_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_both_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_both_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_both_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
 test score VA with acs controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_both_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_both_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_both_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_both_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
 test score VA with sib controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_both_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_both_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_both_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_both_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
 test score VA with both controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_both_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_both_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_2year_va_both_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_va_both_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
LHS = enr_4year
VA Subject = ela
ela test score VA with og controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_math.gph} saved
ela test score VA with acs controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_math.gph} saved
ela test score VA with sib controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_math.gph} saved
ela test score VA with both controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_math.gph} saved
VA Subject = math
math test score VA with og controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_math.gph} saved
math test score VA with acs controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_math.gph} saved
math test score VA with sib controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_math.gph} saved
math test score VA with both controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_ela.gph} saved
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_math.gph} saved
 test score VA with og controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_both_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_both_og_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_both_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_both_og_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
 test score VA with acs controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_both_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_both_acs_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_both_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_both_acs_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
 test score VA with sib controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_both_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_both_sib_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_both_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_both_sib_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
 test score VA with both controls
interaction with prior ela score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_both_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_both_both_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}(46 observations deleted)
xtile: all characters numeric; {res}replaced {txt}as {res}byte
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_reg_prior_score/het_reg_enr_4year_va_both_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_va_both_both_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. 
. 
. ********** combine figures into panels
. /* Original sample,
> restricted sample with original controls,
> restricted sample with sibling controls,
> restricted sample with both sibling and census controls: 4 graphs in one panel */
. 
. // 3 outcomes, 2 VA subjects, 2 prior subjects = 12 panels
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   di "LHS outcome = `outcome'"
{txt}  3{com}. 
.   foreach subject in ela math {c -(}
{txt}  4{com}.     di "VA Subject = `subject'"
{txt}  5{com}. 
.     foreach prior_subject in ela math {c -(}
{txt}  6{com}.       di "interaction with prior `prior_subject' score deciles"
{txt}  7{com}. 
.       graph combine ///
>         $vaprojdir/gph_files/sbac/reg_`outcome'_va_`subject'_hetero_prior_`prior_subject'.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'_va_`subject'_og_x_prior_`prior_subject'.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'_va_`subject'_sib_x_prior_`prior_subject'.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'_va_`subject'_both_x_prior_`prior_subject'.gph ///
>         , xcommon ycommon ///
>         title("Regression of ``outcome'_str' on ``subject'_str' VA Interacted with Prior ``prior_subject'_str' Decile", size(small))
{txt}  8{com}. 
.       graph export $vaprojdir/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_`outcome'_va_`subject'_x_prior_`prior_subject'.pdf, replace
{txt}  9{com}.       graph export $projdir/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_`outcome'_va_`subject'_x_prior_`prior_subject'.pdf, replace
{txt} 10{com}. 
. 
. 
. 
.     {c )-}
{txt} 11{com}.   {c )-}
{txt} 12{com}. {c )-}
LHS outcome = enr
VA Subject = ela
interaction with prior ela score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_va_ela_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_va_ela_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_va_ela_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_va_ela_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
VA Subject = math
interaction with prior ela score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_va_math_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_va_math_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_va_math_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_va_math_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
LHS outcome = enr_2year
VA Subject = ela
interaction with prior ela score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_2year_va_ela_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_2year_va_ela_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_2year_va_ela_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_2year_va_ela_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
VA Subject = math
interaction with prior ela score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_2year_va_math_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_2year_va_math_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_2year_va_math_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_2year_va_math_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
LHS outcome = enr_4year
VA Subject = ela
interaction with prior ela score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_4year_va_ela_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_4year_va_ela_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_4year_va_ela_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_4year_va_ela_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
VA Subject = math
interaction with prior ela score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_4year_va_math_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_4year_va_math_x_prior_ela.pdf{rm}
saved as
PDF
format
{p_end}
interaction with prior math score deciles
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combined_panels/het_reg_prior_score/het_reg_enr_4year_va_math_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvaregs/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het_reg_enr_4year_va_math_x_prior_math.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:     38.31 /        1 =      38.3150
{txt}
{com}. 
. cd $projdir
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{txt}
{com}. set trace off
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/reg_out_va_sib_acs_fig.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 May 2022, 18:42:03
{txt}{.-}
{smcl}
{txt}{sf}{ul off}