-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/reg_out_va_sib_acs_dk.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 22:28:39

. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative fil
> e paths  */
. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;

. local acs_str
>         "Original + Census"
>         ;

. local sib_str
>         "Original + Sibling"
>         ;

. local both_str
>         "Original + Census + Sibling"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. macro list
T_gm_fix_span:  0
S_4:            .0020413479904597
S_2:            300
S_3:            .0136102212476191
S_1:            epanechnikov
S_6:            .7098361624622439
S_5:            4
ReS_jv2:        __000006 __000007 __000008 __000009 __00000A __00000B __00000C
                __00000D __00000E __00000F __00000G __00000H __00000I __00000J
                __00000K
dropv:          _cdscode_x
n_offset:       0
sort:           0
dots:           nois _dots 5 0
dotss:          nois _dots 0, title(Survey results being calculated)
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_both_str:      Original + Census + Sibling
_sib_str:       Original + Sibling
_acs_str:       Original + Census
_og_str:        Original Specification
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. //startomg timer
. timer on 1

. 
. 
. *****************************************************************************
> ***
. * begin main code
. 
. // load the resctricted outcome sample with sibling and acs controls
. use $vaprojdir/data/va_samples/va_sib_acs_out_restr_smp.dta, clear
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)

. 
. // merge in dk VA dataset
. foreach outcome in enr enr_2year enr_4year {
  2.   //merge to test score VA estimates dataset
.   merge m:1 cdscode year using ///
>    $vaprojdir/data/sib_acs_restr_smp/outcome_va/va_`outcome'_sib_acs_dk.dta /
> //
>    , nogen keep(1 3) keepusing(va_*)
  3.  // standardize the VA estimates into z scores
.  foreach va of varlist va_* {
  4.    sum `va'
  5.    replace `va' = `va' - r(mean)
  6.    replace `va' = `va' / r(sd)
  7.  }
  8. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,375
        from master                     2,375  
        from using                          0  

    Matched                           524,215  
    -----------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   va_ela_og |    524,355   -.0003008    .1103539  -.5653322   .4399461
(524,355 real changes made)
(524,355 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_acs |    524,355   -.0004137    .1079718  -.5234845   .4466909
(524,355 real changes made)
(524,355 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_sib |    524,355   -.0003117    .1102268  -.5661247   .4382679
(524,355 real changes made)
(524,355 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_ela_both |    524,355   -.0004225    .1078434  -.5241211   .4465778
(524,355 real changes made)
(524,355 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_math_og |    524,510    .0000169    .1196981  -.5020869   .5799825
(524,510 real changes made)
(524,510 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_acs |    524,510   -.0003327    .1097855  -.4349537   .6038504
(524,510 real changes made)
(524,510 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_sib |    524,510   -7.31e-07    .1194357  -.5044312    .579555
(524,510 real changes made)
(524,510 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_math_both |    524,510   -.0003464    .1095459  -.4363886   .6035805
(524,510 real changes made)
(524,510 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_og_dk |    524,106    .0003124    .0576111  -.2945378     .16056
(524,106 real changes made)
(524,106 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_acs~k |    524,106    .0002348    .0534997  -.2829293   .1528576
(524,106 real changes made)
(524,106 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_sib~k |    524,106    .0002869    .0574832  -.2929264   .1613358
(524,106 real changes made)
(524,106 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_bot~k |    524,106    .0002092    .0532788  -.2809609   .1535083
(524,106 real changes made)
(524,106 real changes made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,375
        from master                     2,375  
        from using                          0  

    Matched                           524,215  
    -----------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   va_ela_og |    524,355    9.23e-09           1  -5.120179   3.989411
(107,520 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_acs |    524,355    8.44e-09           1  -4.844512   4.140937
(109,940 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_sib |    524,355    6.76e-09           1  -5.133172   3.978884
(54,823 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_ela_both |    524,355   -1.33e-09           1  -4.856104   4.144903
(10,448 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_math_og |    524,510    6.30e-09           1  -4.194752   4.845238
(52,144 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_acs |    524,510    6.40e-09           1   -3.95882   5.503305
(48,889 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_sib |    524,510   -3.16e-09           1  -4.223447   4.852448
(27,746 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_math_both |    524,510    3.32e-09           1  -3.980452   5.513002
(26,337 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_og_dk |    524,106    1.06e-08           1  -5.117942   2.781541
(100,088 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_acs~k |    524,106    1.03e-08           1  -5.292817   2.852779
(114,090 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_sib~k |    524,106   -8.80e-09           1  -5.100853   2.801669
(97,610 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_bot~k |    524,106    3.24e-09           1  -5.277339   2.877301
(31,917 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_~ar_og_dk |    524,106   -.0003769    .0872828  -.2900306   .3539995
(524,106 real changes made)
(524,106 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va~ar_acs_dk |    524,106   -.0001428     .075567  -.2575441   .3079081
(524,106 real changes made)
(524,106 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va~ar_sib_dk |    524,106   -.0003227    .0855073  -.2865819   .3490734
(524,106 real changes made)
(524,106 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
v~ar_both_dk |    524,106   -.0001001    .0740374  -.2545528   .3053207
(524,106 real changes made)
(524,106 real changes made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,375
        from master                     2,375  
        from using                          0  

    Matched                           524,215  
    -----------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   va_ela_og |    524,355    6.92e-09           1  -5.120179   3.989411
(55,023 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_acs |    524,355    6.06e-09           1  -4.844512   4.140937
(54,182 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_sib |    524,355    5.99e-09           1  -5.133172   3.978884
(54,823 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_ela_both |    524,355   -1.30e-09           1  -4.856104   4.144903
(10,448 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_math_og |    524,510    5.59e-09           1  -4.194752   4.845238
(52,144 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_acs |    524,510    5.74e-09           1   -3.95882   5.503305
(48,889 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_sib |    524,510   -2.98e-09           1  -4.223447   4.852448
(27,746 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_math_both |    524,510    3.13e-09           1  -3.980452   5.513002
(26,337 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_og_dk |    524,106    8.29e-09           1  -5.117942   2.781541
(100,088 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_acs~k |    524,106    7.65e-09           1  -5.292817   2.852779
(114,090 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_sib~k |    524,106   -6.68e-09           1  -5.100853   2.801669
(48,368 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_bot~k |    524,106    3.03e-09           1  -5.277339   2.877301
(31,917 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
~2year_og_dk |    524,106    7.48e-09           1  -3.318565   4.060092
(86,845 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_2ye.. |    524,106   -6.63e-09           1  -3.406266   4.076526
(49,935 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_2ye.. |    524,106   -8.35e-09           1  -3.347777   4.086155
(87,934 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_2ye.. |    524,106    1.06e-08           1  -3.436815   4.125225
(95,787 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
~4year_og_dk |    524,106    .0003779    .0716596  -.3105927   .3296734
(524,106 real changes made)
(524,106 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_4ye.. |    524,106    .0002488    .0626663  -.2542077   .3048882
(524,106 real changes made)
(524,106 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_4ye.. |    524,106    .0003338    .0695076  -.3016264   .3183354
(524,106 real changes made)
(524,106 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_4ye.. |    524,106    .0002031    .0607906  -.2471639   .2970739
(524,106 real changes made)
(524,106 real changes made)

. 
. ********** regress enrollment outcomes on all 3 deep knowledge outcome value 
> added
. /* no tfx, no peer effects */
. 
. foreach outcome in enr enr_2year enr_4year {
  2.   di "LHS = `outcome', RHS = All 3 enrollment outcomes"
  3. 
.   //regressing on all 3 outcome VA's
.   foreach control in og acs sib both {
  4.     di "Deep Knowledge VA with `control' controls"
  5. 
.     reg `outcome' va_enr_`control'_dk va_enr_2year_`control'_dk va_enr_4year_
> `control'_dk ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       if touse_enr_dk==1 & touse_enr_2year_dk==1 & touse_enr_4year_dk==1 ///
>       , cluster(school_id)
  6.     //add mean of yvar to stored results
.     estadd ysumm, mean
  7.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_
> `outcome'_va_allenr_`control'_dk.ster, replace
  8.   }
  9. }
LHS = enr, RHS = All 3 enrollment outcomes
Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =     692.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1377
                                                Root MSE          =     .41325

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .0419197   .0038048    11.02   0.000     .0344551    .0493844
~2year_og_dk |   .0309411   .0052461     5.90   0.000     .0206488    .0412334
~4year_og_dk |   .0263044   .0044032     5.97   0.000     .0176658    .0349431
             |
        year |
       2016  |   .0095579   .0041449     2.31   0.021     .0014261    .0176897
       2017  |  -.0190622   .0038953    -4.89   0.000    -.0267043   -.0114202
       2018  |  -.0293888   .0044531    -6.60   0.000    -.0381252   -.0206524
             |
         age |  -.0001462   5.68e-06   -25.75   0.000    -.0001573   -.0001351
             |
        male |
       Male  |  -.0689981   .0019265   -35.81   0.000    -.0727778   -.0652185
 1.eth_asian |   .0509586   .0032864    15.51   0.000      .044511    .0574062
1.eth_hisp~c |  -.0202523   .0027671    -7.32   0.000     -.025681   -.0148236
 1.eth_black |   .0130024   .0048581     2.68   0.008     .0034714    .0225334
 1.eth_other |   -.009573   .0038825    -2.47   0.014      -.01719   -.0019561
             |
econ_disad~e |
Economic ..  |  -.0540278   .0021644   -24.96   0.000    -.0582741   -.0497815
             |
limited_en~f |
Limited E..  |  -.0550907   .0044161   -12.47   0.000    -.0637546   -.0464268
             |
    disabled |
   Disabled  |  -.0233389   .0042049    -5.55   0.000    -.0315883   -.0150894
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0757099   .0028623    26.45   0.000     .0700944    .0813254
       2016  |   .0676024   .0026878    25.15   0.000     .0623292    .0728757
       2017  |   .0718932   .0028555    25.18   0.000     .0662911    .0774954
       2018  |   .0675051   .0037404    18.05   0.000     .0601668    .0748435
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0173626    .001525   -11.39   0.000    -.0203544   -.0143708
       2016  |  -.0216353   .0014084   -15.36   0.000    -.0243983   -.0188723
       2017  |   -.011524   .0015441    -7.46   0.000    -.0145534   -.0084946
       2018  |  -.0128843   .0015461    -8.33   0.000    -.0159175   -.0098511
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006563   .0005832    -1.13   0.261    -.0018004    .0004878
       2016  |   .0011511   .0005242     2.20   0.028     .0001226    .0021796
       2017  |  -.0018717   .0005306    -3.53   0.000    -.0029127   -.0008308
       2018  |  -.0046488   .0009253    -5.02   0.000    -.0064641   -.0028335
             |
        year#|
          c. |
prior_math~e |
       2015  |    .053819   .0025798    20.86   0.000     .0487578    .0588803
       2016  |   .0584372   .0026629    21.95   0.000      .053213    .0636614
       2017  |   .0554509   .0028176    19.68   0.000     .0499232    .0609786
       2018  |   .0833777   .0038066    21.90   0.000     .0759095    .0908459
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0098342   .0018765    -5.24   0.000    -.0135157   -.0061527
       2016  |  -.0139102   .0016788    -8.29   0.000    -.0172038   -.0106167
       2017  |  -.0121696   .0018892    -6.44   0.000     -.015876   -.0084632
       2018  |  -.0027044   .0015924    -1.70   0.090    -.0058286    .0004197
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0006225   .0006586    -0.95   0.345    -.0019145    .0006696
       2016  |    .000646   .0006788     0.95   0.341    -.0006857    .0019777
       2017  |   3.14e-06    .000705     0.00   0.996      -.00138    .0013863
       2018  |   -.005939   .0009388    -6.33   0.000    -.0077809   -.0040972
             |
       _cons |   1.691253   .0339864    49.76   0.000     1.624576    1.757931
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794891
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_og_dk.ster saved
Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =     615.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1357
                                                Root MSE          =     .41373

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .0388265   .0041412     9.38   0.000      .030702    .0469511
va_enr_2ye.. |   .0274191   .0053722     5.10   0.000     .0168794    .0379587
va_enr_4ye.. |   .0217342   .0045821     4.74   0.000     .0127446    .0307237
             |
        year |
       2016  |   .0094265   .0041381     2.28   0.023      .001308    .0175451
       2017  |  -.0185136   .0038672    -4.79   0.000    -.0261006   -.0109266
       2018  |  -.0293422   .0044074    -6.66   0.000     -.037989   -.0206955
             |
         age |  -.0001449   5.77e-06   -25.12   0.000    -.0001563   -.0001336
             |
        male |
       Male  |  -.0687488   .0019318   -35.59   0.000    -.0725388   -.0649588
 1.eth_asian |    .055836   .0036728    15.20   0.000     .0486305    .0630416
1.eth_hisp~c |  -.0264031   .0029008    -9.10   0.000    -.0320943    -.020712
 1.eth_black |   .0082162   .0049613     1.66   0.098    -.0015174    .0179498
 1.eth_other |  -.0093735   .0039555    -2.37   0.018    -.0171338   -.0016133
             |
econ_disad~e |
Economic ..  |  -.0618683   .0022759   -27.18   0.000    -.0663334   -.0574033
             |
limited_en~f |
Limited E..  |  -.0530926   .0045228   -11.74   0.000    -.0619658   -.0442193
             |
    disabled |
   Disabled  |   -.020025    .004265    -4.70   0.000    -.0283925   -.0116574
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0775541   .0028527    27.19   0.000     .0719575    .0831507
       2016  |   .0690457   .0026928    25.64   0.000     .0637627    .0743288
       2017  |   .0738198   .0028624    25.79   0.000     .0682042    .0794354
       2018  |    .068709   .0037395    18.37   0.000     .0613726    .0760454
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0175231   .0015318   -11.44   0.000    -.0205283    -.014518
       2016  |  -.0217397   .0014113   -15.40   0.000    -.0245085   -.0189708
       2017  |  -.0116608   .0015465    -7.54   0.000    -.0146949   -.0086268
       2018  |  -.0131402   .0015487    -8.48   0.000    -.0161786   -.0101018
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.000657   .0005831    -1.13   0.260     -.001801    .0004871
       2016  |   .0011958   .0005291     2.26   0.024     .0001577    .0022338
       2017  |  -.0018944   .0005319    -3.56   0.000    -.0029379   -.0008508
       2018  |  -.0046172   .0009276    -4.98   0.000    -.0064371   -.0027972
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0541939   .0025812    21.00   0.000     .0491299    .0592578
       2016  |   .0590961   .0026763    22.08   0.000     .0538456    .0643467
       2017  |   .0557321   .0028295    19.70   0.000     .0501809    .0612834
       2018  |    .084307   .0038204    22.07   0.000     .0768118    .0918022
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100799   .0018808    -5.36   0.000    -.0137698   -.0063899
       2016  |  -.0142065   .0016839    -8.44   0.000    -.0175102   -.0109028
       2017  |  -.0122125   .0018932    -6.45   0.000    -.0159267   -.0084984
       2018  |  -.0024675   .0015909    -1.55   0.121    -.0055886    .0006536
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0005102   .0006584    -0.77   0.439    -.0018018    .0007815
       2016  |   .0007486   .0006808     1.10   0.272    -.0005871    .0020843
       2017  |   .0000629   .0007066     0.09   0.929    -.0013234    .0014493
       2018  |  -.0058088   .0009412    -6.17   0.000    -.0076553   -.0039623
             |
       _cons |   1.689412   .0343826    49.14   0.000     1.621957    1.756866
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794891
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_acs_dk.ster saved
Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =     693.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1377
                                                Root MSE          =     .41326

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .0415579   .0039098    10.63   0.000     .0338874    .0492284
va_enr_2ye.. |   .0308676    .005324     5.80   0.000     .0204226    .0413126
va_enr_4ye.. |   .0263473   .0044399     5.93   0.000     .0176367    .0350579
             |
        year |
       2016  |   .0094984   .0041505     2.29   0.022     .0013555    .0176412
       2017  |  -.0190923   .0038941    -4.90   0.000    -.0267321   -.0114525
       2018  |  -.0294345   .0044522    -6.61   0.000    -.0381693   -.0206997
             |
         age |  -.0001461   5.68e-06   -25.70   0.000    -.0001573    -.000135
             |
        male |
       Male  |  -.0690016    .001926   -35.83   0.000    -.0727802   -.0652229
 1.eth_asian |   .0509147   .0032843    15.50   0.000     .0444713     .057358
1.eth_hisp~c |   -.020203   .0027646    -7.31   0.000    -.0256269   -.0147791
 1.eth_black |   .0129616   .0048591     2.67   0.008     .0034286    .0224945
 1.eth_other |  -.0096164   .0038814    -2.48   0.013    -.0172312   -.0020017
             |
econ_disad~e |
Economic ..  |  -.0538564    .002164   -24.89   0.000     -.058102   -.0496108
             |
limited_en~f |
Limited E..  |  -.0550171   .0044202   -12.45   0.000    -.0636891   -.0463451
             |
    disabled |
   Disabled  |  -.0234323   .0042032    -5.57   0.000    -.0316786   -.0151861
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0756936   .0028654    26.42   0.000     .0700721    .0813151
       2016  |    .067551   .0026875    25.14   0.000     .0622784    .0728235
       2017  |   .0718678   .0028558    25.17   0.000     .0662651    .0774705
       2018  |   .0675196   .0037408    18.05   0.000     .0601806    .0748586
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0173736   .0015249   -11.39   0.000    -.0203653   -.0143819
       2016  |  -.0216661   .0014083   -15.38   0.000     -.024429   -.0189032
       2017  |  -.0115364   .0015438    -7.47   0.000    -.0145652   -.0085077
       2018  |  -.0128824   .0015455    -8.34   0.000    -.0159145   -.0098503
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006555   .0005831    -1.12   0.261    -.0017996    .0004885
       2016  |   .0011556   .0005241     2.20   0.028     .0001274    .0021839
       2017  |  -.0018722   .0005306    -3.53   0.000    -.0029131   -.0008313
       2018  |  -.0046542   .0009249    -5.03   0.000    -.0064688   -.0028396
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538264    .002582    20.85   0.000     .0487609    .0588919
       2016  |   .0584608   .0026647    21.94   0.000      .053233    .0636887
       2017  |   .0554806   .0028181    19.69   0.000     .0499518    .0610094
       2018  |   .0833623   .0038066    21.90   0.000     .0758942    .0908304
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0098597   .0018769    -5.25   0.000     -.013542   -.0061773
       2016  |  -.0139151   .0016786    -8.29   0.000    -.0172084   -.0106219
       2017  |  -.0121946   .0018898    -6.45   0.000    -.0159022   -.0084871
       2018  |  -.0027513   .0015924    -1.73   0.084    -.0058754    .0003727
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0006211   .0006586    -0.94   0.346    -.0019132     .000671
       2016  |   .0006392   .0006787     0.94   0.347    -.0006925    .0019708
       2017  |   4.34e-06   .0007052     0.01   0.995    -.0013792    .0013879
       2018  |   -.005957   .0009389    -6.34   0.000    -.0077991   -.0041149
             |
       _cons |   1.690618   .0340215    49.69   0.000     1.623871    1.757364
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794891
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_sib_dk.ster saved
Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =     617.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1357
                                                Root MSE          =     .41374

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .0386787   .0042566     9.09   0.000     .0303278    .0470296
va_enr_2ye.. |   .0271557   .0054568     4.98   0.000       .01645    .0378614
va_enr_4ye.. |   .0216369   .0046265     4.68   0.000     .0125601    .0307137
             |
        year |
       2016  |   .0093719   .0041443     2.26   0.024     .0012412    .0175025
       2017  |  -.0185462   .0038668    -4.80   0.000    -.0261324   -.0109601
       2018  |  -.0293913   .0044073    -6.67   0.000    -.0380379   -.0207447
             |
         age |  -.0001448   5.78e-06   -25.08   0.000    -.0001562   -.0001335
             |
        male |
       Male  |  -.0687519   .0019315   -35.60   0.000    -.0725412   -.0649626
 1.eth_asian |   .0558657   .0036683    15.23   0.000     .0486688    .0630625
1.eth_hisp~c |  -.0263869    .002898    -9.11   0.000    -.0320725   -.0207013
 1.eth_black |   .0081922    .004962     1.65   0.099    -.0015427    .0179271
 1.eth_other |  -.0093902   .0039554    -2.37   0.018    -.0171502   -.0016301
             |
econ_disad~e |
Economic ..  |  -.0617045   .0022746   -27.13   0.000     -.066167    -.057242
             |
limited_en~f |
Limited E..  |  -.0530147   .0045275   -11.71   0.000    -.0618972   -.0441321
             |
    disabled |
   Disabled  |  -.0200987   .0042636    -4.71   0.000    -.0284634    -.011734
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0775471   .0028554    27.16   0.000     .0719451    .0831491
       2016  |   .0689987   .0026922    25.63   0.000     .0637168    .0742806
       2017  |   .0738039   .0028627    25.78   0.000     .0681876    .0794201
       2018  |   .0687175   .0037398    18.37   0.000     .0613804    .0760546
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0175342   .0015318   -11.45   0.000    -.0205394   -.0145291
       2016  |  -.0217697   .0014112   -15.43   0.000    -.0245384    -.019001
       2017  |  -.0116727   .0015461    -7.55   0.000     -.014706   -.0086394
       2018  |  -.0131402   .0015482    -8.49   0.000    -.0161775   -.0101028
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006566   .0005831    -1.13   0.260    -.0018006    .0004875
       2016  |   .0012003    .000529     2.27   0.023     .0001625     .002238
       2017  |   -.001895   .0005319    -3.56   0.000    -.0029385   -.0008514
       2018  |  -.0046218   .0009274    -4.98   0.000    -.0064411   -.0028024
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0541997   .0025834    20.98   0.000     .0491314     .059268
       2016  |   .0591206   .0026778    22.08   0.000     .0538671     .064374
       2017  |   .0557549   .0028302    19.70   0.000     .0502024    .0613073
       2018  |   .0842963   .0038202    22.07   0.000     .0768015    .0917911
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.010103   .0018812    -5.37   0.000    -.0137938   -.0064123
       2016  |   -.014211   .0016838    -8.44   0.000    -.0175143   -.0109076
       2017  |  -.0122352   .0018938    -6.46   0.000    -.0159506   -.0085199
       2018  |  -.0025086   .0015907    -1.58   0.115    -.0056294    .0006122
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0005084   .0006584    -0.77   0.440    -.0018002    .0007833
       2016  |   .0007422   .0006808     1.09   0.276    -.0005935    .0020778
       2017  |   .0000645   .0007068     0.09   0.927    -.0013222    .0014512
       2018  |  -.0058235   .0009411    -6.19   0.000    -.0076698   -.0039772
             |
       _cons |   1.688842   .0344116    49.08   0.000     1.621331    1.756354
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794891
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_both_dk.ster saved
LHS = enr_2year, RHS = All 3 enrollment outcomes
Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =     627.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0878
                                                Root MSE          =     .45867

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |    .032447   .0045168     7.18   0.000     .0235856    .0413083
~2year_og_dk |    .049072   .0062916     7.80   0.000     .0367285    .0614154
~4year_og_dk |  -.0355968      .0052    -6.85   0.000    -.0457986    -.025395
             |
        year |
       2016  |  -.0068947   .0046281    -1.49   0.137    -.0159746    .0021851
       2017  |  -.0370754    .004194    -8.84   0.000    -.0453035   -.0288474
       2018  |  -.0088148   .0048144    -1.83   0.067    -.0182601    .0006306
             |
         age |  -.0000685   5.64e-06   -12.14   0.000    -.0000795   -.0000574
             |
        male |
       Male  |   .0205836   .0019956    10.31   0.000     .0166684    .0244988
 1.eth_asian |  -.0230756   .0033803    -6.83   0.000    -.0297074   -.0164439
1.eth_hisp~c |    .010727   .0027117     3.96   0.000      .005407    .0160469
 1.eth_black |  -.0144743   .0047446    -3.05   0.002    -.0237827   -.0051659
 1.eth_other |  -.0005528   .0045609    -0.12   0.904    -.0095007    .0083951
             |
econ_disad~e |
Economic ..  |   -.011039   .0021297    -5.18   0.000    -.0152172   -.0068607
             |
limited_en~f |
Limited E..  |  -.0356294   .0044014    -8.10   0.000    -.0442644   -.0269944
             |
    disabled |
   Disabled  |    .030765   .0048483     6.35   0.000     .0212532    .0402768
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0649644    .003194   -20.34   0.000    -.0712307   -.0586982
       2016  |  -.0598783   .0029408   -20.36   0.000    -.0656477   -.0541089
       2017  |  -.0521397   .0031254   -16.68   0.000    -.0582714   -.0460079
       2018  |  -.0291943   .0039055    -7.48   0.000    -.0368565    -.021532
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0391654   .0015879   -24.67   0.000    -.0422807   -.0360502
       2016  |  -.0376686    .001568   -24.02   0.000    -.0407449   -.0345924
       2017  |  -.0279984   .0016159   -17.33   0.000    -.0311685   -.0248282
       2018  |  -.0310377    .001611   -19.27   0.000    -.0341983    -.027877
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |     .01057   .0006242    16.93   0.000     .0093453    .0117946
       2016  |   .0106085   .0005225    20.30   0.000     .0095834    .0116336
       2017  |   .0078118   .0005659    13.80   0.000     .0067016    .0089221
       2018  |   .0045207   .0010247     4.41   0.000     .0025103    .0065312
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0663293   .0031539   -21.03   0.000    -.0725168   -.0601418
       2016  |  -.0682717   .0033518   -20.37   0.000    -.0748475   -.0616959
       2017  |  -.0679344   .0034051   -19.95   0.000    -.0746148   -.0612539
       2018  |  -.0588722   .0042675   -13.80   0.000    -.0672445      -.0505
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0256267   .0020236   -12.66   0.000    -.0295969   -.0216566
       2016  |  -.0308863   .0019246   -16.05   0.000     -.034662   -.0271105
       2017  |  -.0240203   .0020229   -11.87   0.000    -.0279889   -.0200516
       2018  |  -.0338409   .0016836   -20.10   0.000     -.037144   -.0305378
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090235   .0007299    12.36   0.000     .0075916    .0104554
       2016  |   .0109512   .0007794    14.05   0.000     .0094221    .0124802
       2017  |   .0086331   .0007941    10.87   0.000     .0070751    .0101911
       2018  |   .0034488    .001064     3.24   0.001     .0013613    .0055363
             |
       _cons |   .8585389   .0346146    24.80   0.000      .790629    .9264488
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070008
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_og_dk.ster saved
Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =     397.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0841
                                                Root MSE          =     .45958

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .0317545   .0048331     6.57   0.000     .0222725    .0412365
va_enr_2ye.. |   .0422815   .0063887     6.62   0.000     .0297475    .0548155
va_enr_4ye.. |  -.0388648   .0053002    -7.33   0.000    -.0492631   -.0284664
             |
        year |
       2016  |  -.0070194   .0046609    -1.51   0.132    -.0161635    .0021248
       2017  |  -.0369578   .0042442    -8.71   0.000    -.0452844   -.0286313
       2018  |   -.008732   .0048459    -1.80   0.072     -.018239     .000775
             |
         age |  -.0000692   5.74e-06   -12.05   0.000    -.0000804   -.0000579
             |
        male |
       Male  |   .0209112   .0019955    10.48   0.000     .0169961    .0248262
 1.eth_asian |  -.0156865   .0038014    -4.13   0.000    -.0231443   -.0082286
1.eth_hisp~c |   .0032842   .0030513     1.08   0.282     -.002702    .0092704
 1.eth_black |  -.0232275    .004928    -4.71   0.000    -.0328957   -.0135593
 1.eth_other |   .0005467   .0046017     0.12   0.905    -.0084815    .0095748
             |
econ_disad~e |
Economic ..  |  -.0127268   .0022373    -5.69   0.000    -.0171162   -.0083374
             |
limited_en~f |
Limited E..  |  -.0326981   .0046162    -7.08   0.000    -.0417547   -.0236416
             |
    disabled |
   Disabled  |   .0323699   .0048461     6.68   0.000     .0228624    .0418774
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0633818    .003199   -19.81   0.000    -.0696578   -.0571058
       2016  |  -.0580847   .0029649   -19.59   0.000    -.0639015   -.0522678
       2017  |  -.0511424   .0031801   -16.08   0.000    -.0573813   -.0449035
       2018  |  -.0288193   .0039408    -7.31   0.000    -.0365508   -.0210879
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0400704   .0015874   -25.24   0.000    -.0431847   -.0369562
       2016  |  -.0384583   .0015735   -24.44   0.000    -.0415454   -.0353712
       2017  |  -.0289411   .0016209   -17.85   0.000    -.0321211   -.0257611
       2018  |  -.0316753   .0016178   -19.58   0.000    -.0348493   -.0285012
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0106031   .0006258    16.94   0.000     .0093753    .0118308
       2016  |   .0106141   .0005262    20.17   0.000     .0095818    .0116463
       2017  |   .0079182   .0005681    13.94   0.000     .0068037    .0090327
       2018  |   .0045068   .0010252     4.40   0.000     .0024954    .0065182
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0665058   .0031635   -21.02   0.000    -.0727122   -.0602994
       2016  |  -.0683541   .0033905   -20.16   0.000    -.0750058   -.0617023
       2017  |  -.0683061   .0034329   -19.90   0.000     -.075041   -.0615712
       2018  |    -.05745   .0043379   -13.24   0.000    -.0659605   -.0489396
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0268312   .0020297   -13.22   0.000    -.0308131   -.0228492
       2016  |  -.0320055   .0019335   -16.55   0.000    -.0357988   -.0282121
       2017  |  -.0246575    .002035   -12.12   0.000    -.0286498   -.0206651
       2018  |  -.0346277   .0016895   -20.50   0.000    -.0379424    -.031313
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0092678   .0007318    12.66   0.000      .007832    .0107035
       2016  |   .0111648   .0007847    14.23   0.000     .0096252    .0127044
       2017  |   .0087277   .0007979    10.94   0.000     .0071623    .0102931
       2018  |   .0031786   .0010605     3.00   0.003      .001098    .0052592
             |
       _cons |   .8675568    .035178    24.66   0.000     .7985416     .936572
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070008
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_acs_dk.ster saved
Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =     617.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0877
                                                Root MSE          =     .45869

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .0331628   .0046903     7.07   0.000      .023961    .0423646
va_enr_2ye.. |   .0481845   .0064396     7.48   0.000     .0355508    .0608182
va_enr_4ye.. |  -.0362553   .0052809    -6.87   0.000    -.0466157   -.0258948
             |
        year |
       2016  |  -.0068962   .0046434    -1.49   0.138     -.016006    .0022135
       2017  |  -.0370862   .0041964    -8.84   0.000    -.0453191   -.0288533
       2018  |  -.0088322   .0048145    -1.83   0.067    -.0182777    .0006134
             |
         age |  -.0000685   5.64e-06   -12.15   0.000    -.0000795   -.0000574
             |
        male |
       Male  |   .0205801   .0019959    10.31   0.000     .0166643    .0244958
 1.eth_asian |  -.0229555   .0033822    -6.79   0.000    -.0295909     -.01632
1.eth_hisp~c |   .0107229   .0027062     3.96   0.000     .0054137    .0160321
 1.eth_black |  -.0144973   .0047483    -3.05   0.002     -.023813   -.0051817
 1.eth_other |   -.000363   .0045561    -0.08   0.937    -.0093015    .0085755
             |
econ_disad~e |
Economic ..  |  -.0110007   .0021309    -5.16   0.000    -.0151812   -.0068202
             |
limited_en~f |
Limited E..  |  -.0355732   .0044068    -8.07   0.000    -.0442188   -.0269276
             |
    disabled |
   Disabled  |    .030784   .0048483     6.35   0.000     .0212722    .0402958
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0649506   .0031961   -20.32   0.000    -.0712209   -.0586803
       2016  |  -.0599102   .0029392   -20.38   0.000    -.0656766   -.0541439
       2017  |  -.0522362   .0031269   -16.71   0.000    -.0583708   -.0461016
       2018  |  -.0292447   .0039048    -7.49   0.000    -.0369055    -.021584
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.039164   .0015883   -24.66   0.000    -.0422802   -.0360479
       2016  |  -.0376721   .0015678   -24.03   0.000     -.040748   -.0345963
       2017  |  -.0280009   .0016157   -17.33   0.000    -.0311707    -.024831
       2018  |  -.0310478   .0016109   -19.27   0.000    -.0342082   -.0278873
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0105663   .0006244    16.92   0.000     .0093412    .0117913
       2016  |   .0106128   .0005224    20.32   0.000     .0095879    .0116376
       2017  |   .0078217   .0005659    13.82   0.000     .0067114    .0089319
       2018  |   .0045287   .0010243     4.42   0.000     .0025191    .0065383
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0663472   .0031561   -21.02   0.000    -.0725392   -.0601553
       2016  |  -.0683049   .0033534   -20.37   0.000    -.0748839   -.0617258
       2017  |   -.067973   .0034052   -19.96   0.000    -.0746537   -.0612923
       2018  |  -.0588567   .0042672   -13.79   0.000    -.0672286   -.0504849
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0256394   .0020253   -12.66   0.000    -.0296128   -.0216659
       2016  |  -.0308949   .0019257   -16.04   0.000    -.0346728   -.0271169
       2017  |  -.0240355   .0020234   -11.88   0.000    -.0280052   -.0200657
       2018  |  -.0338369   .0016843   -20.09   0.000    -.0371413   -.0305325
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090307   .0007304    12.36   0.000     .0075977    .0104636
       2016  |   .0109521   .0007798    14.04   0.000     .0094222    .0124819
       2017  |   .0086404   .0007946    10.87   0.000     .0070816    .0101992
       2018  |   .0034484   .0010645     3.24   0.001       .00136    .0055367
             |
       _cons |   .8586532   .0345991    24.82   0.000     .7907737    .9265328
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070008
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_sib_dk.ster saved
Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =     398.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0841
                                                Root MSE          =      .4596

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .0324966   .0050026     6.50   0.000     .0226821     .042311
va_enr_2ye.. |   .0414014   .0065402     6.33   0.000     .0285703    .0542325
va_enr_4ye.. |  -.0395469    .005381    -7.35   0.000    -.0501038   -.0289901
             |
        year |
       2016  |  -.0070191   .0046767    -1.50   0.134    -.0161942    .0021561
       2017  |  -.0369586   .0042472    -8.70   0.000    -.0452911   -.0286262
       2018  |   -.008747   .0048461    -1.80   0.071    -.0182544    .0007605
             |
         age |  -.0000691   5.74e-06   -12.06   0.000    -.0000804   -.0000579
             |
        male |
       Male  |   .0209088   .0019959    10.48   0.000     .0169932    .0248245
 1.eth_asian |  -.0156708   .0037876    -4.14   0.000    -.0231017   -.0082399
1.eth_hisp~c |   .0032518   .0030409     1.07   0.285    -.0027141    .0092176
 1.eth_black |  -.0232919   .0049334    -4.72   0.000    -.0329708   -.0136131
 1.eth_other |   .0007088   .0045961     0.15   0.877    -.0083083    .0097258
             |
econ_disad~e |
Economic ..  |  -.0127559   .0022356    -5.71   0.000    -.0171419     -.00837
             |
limited_en~f |
Limited E..  |  -.0326524   .0046207    -7.07   0.000    -.0417177    -.023587
             |
    disabled |
   Disabled  |   .0324167   .0048473     6.69   0.000     .0229069    .0419265
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0633579   .0032011   -19.79   0.000    -.0696381   -.0570777
       2016  |  -.0581024   .0029629   -19.61   0.000    -.0639153   -.0522894
       2017  |  -.0512309   .0031815   -16.10   0.000    -.0574725   -.0449892
       2018  |  -.0288615   .0039397    -7.33   0.000    -.0365906   -.0211323
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.040065   .0015881   -25.23   0.000    -.0431808   -.0369493
       2016  |  -.0384566   .0015734   -24.44   0.000    -.0415434   -.0353699
       2017  |  -.0289391   .0016206   -17.86   0.000    -.0321185   -.0257597
       2018  |  -.0316843   .0016177   -19.59   0.000     -.034858   -.0285105
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0105987   .0006261    16.93   0.000     .0093705     .011827
       2016  |    .010618    .000526    20.18   0.000      .009586    .0116501
       2017  |   .0079275   .0005681    13.96   0.000     .0068131     .009042
       2018  |   .0045154   .0010248     4.41   0.000     .0025049    .0065259
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0665205   .0031661   -21.01   0.000    -.0727321   -.0603089
       2016  |  -.0683817   .0033921   -20.16   0.000    -.0750366   -.0617269
       2017  |  -.0683403   .0034333   -19.91   0.000     -.075076   -.0616046
       2018  |  -.0574264    .004337   -13.24   0.000    -.0659351   -.0489177
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0268402   .0020315   -13.21   0.000    -.0308257   -.0228547
       2016  |  -.0320109   .0019347   -16.55   0.000    -.0358065   -.0282153
       2017  |  -.0246708   .0020356   -12.12   0.000    -.0286644   -.0206772
       2018  |  -.0346161   .0016902   -20.48   0.000     -.037932   -.0313001
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0092745   .0007324    12.66   0.000     .0078377    .0107114
       2016  |   .0111653   .0007851    14.22   0.000     .0096249    .0127057
       2017  |   .0087346   .0007984    10.94   0.000     .0071683    .0103009
       2018  |   .0031793   .0010609     3.00   0.003      .001098    .0052607
             |
       _cons |   .8675806   .0351521    24.68   0.000     .7986162     .936545
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070008
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_both_dk.ster saved
LHS = enr_4year, RHS = All 3 enrollment outcomes
Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =    2183.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2646
                                                Root MSE          =     .41342

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .0094728   .0045039     2.10   0.036     .0006367    .0183088
~2year_og_dk |  -.0181309   .0060135    -3.02   0.003    -.0299287    -.006333
~4year_og_dk |   .0619012   .0052124    11.88   0.000      .051675    .0721274
             |
        year |
       2016  |   .0164526   .0032649     5.04   0.000     .0100472     .022858
       2017  |   .0180132    .003659     4.92   0.000     .0108346    .0251918
       2018  |  -.0205741   .0039463    -5.21   0.000    -.0283162   -.0128319
             |
         age |  -.0000777   5.02e-06   -15.47   0.000    -.0000876   -.0000679
             |
        male |
       Male  |  -.0895818   .0017039   -52.57   0.000    -.0929246   -.0862389
 1.eth_asian |   .0740343   .0041964    17.64   0.000     .0658013    .0822672
1.eth_hisp~c |  -.0309793   .0030767   -10.07   0.000    -.0370154   -.0249432
 1.eth_black |   .0274767   .0052214     5.26   0.000     .0172329    .0377205
 1.eth_other |  -.0090202   .0044866    -2.01   0.045    -.0178225   -.0002179
             |
econ_disad~e |
Economic ..  |  -.0429889   .0025948   -16.57   0.000    -.0480795   -.0378982
             |
limited_en~f |
Limited E..  |  -.0194614    .002794    -6.97   0.000    -.0249429   -.0139799
             |
    disabled |
   Disabled  |  -.0541039   .0033416   -16.19   0.000    -.0606598    -.047548
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1406743   .0026842    52.41   0.000     .1354082    .1459404
       2016  |   .1274807   .0026733    47.69   0.000      .122236    .1327255
       2017  |   .1240329   .0028482    43.55   0.000     .1184451    .1296207
       2018  |   .0966994    .003536    27.35   0.000     .0897621    .1036367
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0218028   .0011903    18.32   0.000     .0194675    .0241381
       2016  |   .0160333   .0012277    13.06   0.000     .0136247     .018442
       2017  |   .0164743   .0011653    14.14   0.000     .0141882    .0187605
       2018  |   .0181534   .0013025    13.94   0.000     .0155981    .0207087
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112262   .0005178   -21.68   0.000    -.0122421   -.0102104
       2016  |  -.0094574   .0004839   -19.54   0.000    -.0104068    -.008508
       2017  |  -.0096836   .0005014   -19.31   0.000    -.0106673   -.0086998
       2018  |  -.0091696   .0008242   -11.13   0.000    -.0107865   -.0075526
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1201483   .0027868    43.11   0.000     .1146809    .1256158
       2016  |   .1267089   .0029042    43.63   0.000     .1210113    .1324065
       2017  |   .1233853   .0030797    40.06   0.000     .1173432    .1294273
       2018  |   .1422499   .0036748    38.71   0.000     .1350405    .1494594
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0157925   .0014957    10.56   0.000     .0128581     .018727
       2016  |    .016976   .0014095    12.04   0.000     .0142107    .0197413
       2017  |   .0118507   .0015172     7.81   0.000     .0088742    .0148272
       2018  |   .0311365   .0012362    25.19   0.000     .0287112    .0335617
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.009646   .0006098   -15.82   0.000    -.0108424   -.0084496
       2016  |  -.0103052   .0006662   -15.47   0.000    -.0116122   -.0089981
       2017  |    -.00863   .0007097   -12.16   0.000    -.0100224   -.0072376
       2018  |  -.0093879   .0008548   -10.98   0.000    -.0110648   -.0077109
             |
       _cons |   .8327145   .0302457    27.53   0.000     .7733758    .8920531
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724883
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_og_dk.ster saved
Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =    2164.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2620
                                                Root MSE          =     .41415

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |    .007072   .0048828     1.45   0.148    -.0025075    .0166516
va_enr_2ye.. |  -.0148624    .006193    -2.40   0.017    -.0270125   -.0027124
va_enr_4ye.. |   .0605989   .0054605    11.10   0.000      .049886    .0713119
             |
        year |
       2016  |   .0164459   .0033374     4.93   0.000     .0098983    .0229935
       2017  |   .0184442   .0036762     5.02   0.000      .011232    .0256564
       2018  |  -.0206103   .0039446    -5.22   0.000    -.0283491   -.0128714
             |
         age |  -.0000758   5.27e-06   -14.38   0.000    -.0000861   -.0000654
             |
        male |
       Male  |    -.08966   .0017068   -52.53   0.000    -.0930084   -.0863115
 1.eth_asian |   .0715225   .0047732    14.98   0.000      .062158     .080887
1.eth_hisp~c |  -.0296874   .0034472    -8.61   0.000    -.0364504   -.0229244
 1.eth_black |   .0314437   .0053712     5.85   0.000     .0209061    .0419813
 1.eth_other |  -.0099202   .0046287    -2.14   0.032    -.0190011   -.0008393
             |
econ_disad~e |
Economic ..  |  -.0491415    .002829   -17.37   0.000    -.0546917   -.0435913
             |
limited_en~f |
Limited E..  |  -.0203944   .0028316    -7.20   0.000    -.0259498   -.0148391
             |
    disabled |
   Disabled  |  -.0523948   .0032801   -15.97   0.000    -.0588301   -.0459596
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1409359   .0026795    52.60   0.000      .135679    .1461928
       2016  |   .1271304   .0026855    47.34   0.000     .1218618     .132399
       2017  |   .1249622   .0028712    43.52   0.000     .1193292    .1305953
       2018  |   .0975284   .0035744    27.29   0.000     .0905158    .1045409
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0225473   .0011786    19.13   0.000     .0202351    .0248595
       2016  |   .0167186   .0012185    13.72   0.000      .014328    .0191092
       2017  |   .0172803   .0011562    14.95   0.000     .0150119    .0195487
       2018  |    .018535   .0013017    14.24   0.000     .0159814    .0210887
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    -.01126   .0005187   -21.71   0.000    -.0122777   -.0102423
       2016  |  -.0094183   .0004848   -19.43   0.000    -.0103695   -.0084671
       2017  |  -.0098126   .0005011   -19.58   0.000    -.0107957   -.0088295
       2018  |   -.009124   .0008221   -11.10   0.000    -.0107368   -.0075112
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1206996   .0027868    43.31   0.000     .1152322    .1261671
       2016  |   .1274502   .0029487    43.22   0.000     .1216653    .1332351
       2017  |   .1240382   .0030869    40.18   0.000      .117982    .1300944
       2018  |   .1417571   .0037469    37.83   0.000     .1344062     .149108
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0167513   .0014996    11.17   0.000     .0138092    .0196934
       2016  |    .017799   .0014122    12.60   0.000     .0150284    .0205695
       2017  |   .0124449   .0015169     8.20   0.000     .0094689    .0154209
       2018  |   .0321602   .0012427    25.88   0.000     .0297222    .0345982
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097779   .0006106   -16.01   0.000    -.0109759   -.0085799
       2016  |  -.0104162   .0006693   -15.56   0.000    -.0117292   -.0091032
       2017  |  -.0086648   .0007114   -12.18   0.000    -.0100604   -.0072691
       2018  |  -.0089874   .0008475   -10.60   0.000    -.0106501   -.0073246
             |
       _cons |   .8218548   .0312596    26.29   0.000      .760527    .8831825
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724883
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_acs_dk.ster saved
Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =    2210.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2644
                                                Root MSE          =     .41345

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .0083951   .0046892     1.79   0.074    -.0008045    .0175947
va_enr_2ye.. |  -.0173169   .0061863    -2.80   0.005    -.0294537   -.0051801
va_enr_4ye.. |   .0626026   .0053195    11.77   0.000     .0521662    .0730389
             |
        year |
       2016  |   .0163946   .0032824     4.99   0.000     .0099549    .0228343
       2017  |   .0179939   .0036644     4.91   0.000     .0108048     .025183
       2018  |  -.0206023   .0039476    -5.22   0.000     -.028347   -.0128577
             |
         age |  -.0000776   5.03e-06   -15.43   0.000    -.0000875   -.0000677
             |
        male |
       Male  |  -.0895817   .0017038   -52.58   0.000    -.0929244   -.0862389
 1.eth_asian |   .0738701   .0041898    17.63   0.000     .0656501    .0820901
1.eth_hisp~c |  -.0309259   .0030774   -10.05   0.000    -.0369635   -.0248884
 1.eth_black |   .0274589   .0052357     5.24   0.000      .017187    .0377308
 1.eth_other |  -.0092534   .0044733    -2.07   0.039    -.0180296   -.0004773
             |
econ_disad~e |
Economic ..  |  -.0428557   .0025987   -16.49   0.000    -.0479541   -.0377573
             |
limited_en~f |
Limited E..  |  -.0194439   .0028028    -6.94   0.000    -.0249428   -.0139451
             |
    disabled |
   Disabled  |  -.0542163    .003346   -16.20   0.000    -.0607808   -.0476518
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1406442   .0026854    52.37   0.000     .1353757    .1459127
       2016  |   .1274612   .0026716    47.71   0.000     .1222199    .1327025
       2017  |    .124104   .0028505    43.54   0.000     .1185117    .1296963
       2018  |   .0967643   .0035373    27.36   0.000     .0898245    .1037042
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0217904    .001189    18.33   0.000     .0194578    .0241231
       2016  |    .016006    .001229    13.02   0.000     .0135949    .0184171
       2017  |   .0164645   .0011661    14.12   0.000     .0141768    .0187521
       2018  |   .0181654   .0013032    13.94   0.000     .0156086    .0207222
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112218   .0005174   -21.69   0.000    -.0122368   -.0102067
       2016  |  -.0094571   .0004843   -19.53   0.000    -.0104073   -.0085069
       2017  |  -.0096939   .0005016   -19.33   0.000    -.0106779   -.0087098
       2018  |  -.0091829   .0008244   -11.14   0.000    -.0108002   -.0075656
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1201737   .0027909    43.06   0.000     .1146983     .125649
       2016  |   .1267657   .0029091    43.58   0.000     .1210585    .1324729
       2017  |   .1234536   .0030799    40.08   0.000     .1174113    .1294959
       2018  |   .1422191   .0036734    38.72   0.000     .1350122    .1494259
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0157797   .0014977    10.54   0.000     .0128413    .0187181
       2016  |   .0169797   .0014102    12.04   0.000     .0142131    .0197463
       2017  |   .0118408   .0015167     7.81   0.000     .0088652    .0148164
       2018  |   .0310855   .0012375    25.12   0.000     .0286576    .0335134
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0096518   .0006101   -15.82   0.000    -.0108488   -.0084547
       2016  |  -.0103129   .0006664   -15.48   0.000    -.0116203   -.0090055
       2017  |  -.0086361   .0007101   -12.16   0.000    -.0100293   -.0072429
       2018  |  -.0094054   .0008553   -11.00   0.000    -.0110833   -.0077275
             |
       _cons |   .8319643   .0302718    27.48   0.000     .7725745    .8913542
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724883
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_sib_dk.ster saved
Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,838
                                                F(39, 1236)       =    2176.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2619
                                                Root MSE          =     .41417

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .0061821   .0050751     1.22   0.223    -.0037746    .0161388
va_enr_2ye.. |  -.0142457   .0063845    -2.23   0.026    -.0267714     -.00172
va_enr_4ye.. |   .0611838   .0055738    10.98   0.000     .0502487    .0721189
             |
        year |
       2016  |    .016391   .0033559     4.88   0.000     .0098071    .0229748
       2017  |   .0184124   .0036806     5.00   0.000     .0111915    .0256333
       2018  |  -.0206443   .0039473    -5.23   0.000    -.0283884   -.0129002
             |
         age |  -.0000757   5.27e-06   -14.35   0.000     -.000086   -.0000654
             |
        male |
       Male  |  -.0896607   .0017066   -52.54   0.000     -.093009   -.0863125
 1.eth_asian |   .0715364   .0047464    15.07   0.000     .0622246    .0808483
1.eth_hisp~c |  -.0296387   .0034431    -8.61   0.000    -.0363937   -.0228837
 1.eth_black |   .0314841   .0053814     5.85   0.000     .0209265    .0420418
 1.eth_other |  -.0100989   .0046143    -2.19   0.029    -.0191517   -.0010462
             |
econ_disad~e |
Economic ..  |  -.0489485   .0028274   -17.31   0.000    -.0544956   -.0434015
             |
limited_en~f |
Limited E..  |  -.0203623   .0028399    -7.17   0.000    -.0259339   -.0147907
             |
    disabled |
   Disabled  |  -.0525154   .0032847   -15.99   0.000    -.0589595   -.0460713
             |
        year#|
          c. |
prior_ela_~e |
       2015  |    .140905   .0026805    52.57   0.000     .1356461    .1461639
       2016  |   .1271011   .0026826    47.38   0.000      .121838    .1323641
       2017  |   .1250348   .0028729    43.52   0.000     .1193984    .1306711
       2018  |    .097579   .0035749    27.30   0.000     .0905655    .1045925
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0225308   .0011776    19.13   0.000     .0202206     .024841
       2016  |   .0166869   .0012198    13.68   0.000     .0142938      .01908
       2017  |   .0172663   .0011568    14.93   0.000     .0149968    .0195358
       2018  |   .0185441   .0013024    14.24   0.000     .0159889    .0210993
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112553   .0005184   -21.71   0.000    -.0122722   -.0102383
       2016  |  -.0094178   .0004852   -19.41   0.000    -.0103697   -.0084659
       2017  |  -.0098225   .0005012   -19.60   0.000    -.0108059   -.0088391
       2018  |  -.0091372   .0008222   -11.11   0.000    -.0107503    -.007524
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1207202   .0027913    43.25   0.000      .115244    .1261964
       2016  |   .1275023   .0029529    43.18   0.000     .1217089    .1332956
       2017  |   .1240952   .0030873    40.20   0.000     .1180383    .1301521
       2018  |   .1417227   .0037443    37.85   0.000     .1343768    .1490685
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0167371   .0015014    11.15   0.000     .0137916    .0196827
       2016  |      .0178   .0014128    12.60   0.000     .0150283    .0205716
       2017  |   .0124355   .0015164     8.20   0.000     .0094605    .0154106
       2018  |   .0321075   .0012437    25.82   0.000     .0296676    .0345474
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.009783    .000611   -16.01   0.000    -.0109816   -.0085843
       2016  |  -.0104231   .0006694   -15.57   0.000    -.0117363   -.0091099
       2017  |  -.0086701   .0007118   -12.18   0.000    -.0100665   -.0072737
       2018  |  -.0090028   .0008476   -10.62   0.000    -.0106657     -.00734
             |
       _cons |   .8212618   .0312681    26.27   0.000     .7599174    .8826062
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724883
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_both_dk.ster saved

. 
. 
. ********** regress enrollment outcomes on deep knowledge VA, matching outcome
> s on LHS and RHS
. /* no tfx, no peer effects */
. 
. foreach outcome in enr enr_2year enr_4year {
  2.   di "LHS = `outcome'"
  3. 
.   foreach control in og acs sib both {
  4.         di "RHS: Deep Knowledge VA with `control' controls"
  5. 
.         reg `outcome' va_`outcome'_`control'_dk ///
>           i.year ///
>           `school_controls' ///
>           `demographic_controls' ///
>           `ela_score_controls' ///
>           `math_score_controls' ///
>           if touse_`outcome'_dk==1 ///
>           , cluster(school_id)
  6.         //add mean of yvar to stored results
.         estadd ysumm, mean
  7.         estimates save $vaprojdir/estimates/sib_acs_restr_smp/persistence/
> reg_`outcome'_va_`outcome'_`control'_dk.ster, replace
  8.   }
  9. }
LHS = enr
RHS: Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =     720.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1374
                                                Root MSE          =     .41332

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .0640005   .0015605    41.01   0.000     .0609389    .0670621
             |
        year |
       2016  |   .0101378   .0041695     2.43   0.015     .0019578    .0183178
       2017  |  -.0181422   .0038812    -4.67   0.000    -.0257567   -.0105278
       2018  |  -.0282181   .0044075    -6.40   0.000    -.0368652    -.019571
             |
         age |  -.0001465   5.70e-06   -25.70   0.000    -.0001577   -.0001354
             |
        male |
       Male  |  -.0689824   .0019237   -35.86   0.000    -.0727564   -.0652083
 1.eth_asian |   .0509467   .0032872    15.50   0.000     .0444976    .0573958
1.eth_hisp~c |  -.0198919   .0027738    -7.17   0.000    -.0253337   -.0144501
 1.eth_black |   .0132247   .0048626     2.72   0.007     .0036847    .0227646
 1.eth_other |  -.0095817   .0038813    -2.47   0.014    -.0171964    -.001967
             |
econ_disad~e |
Economic ..  |  -.0540731    .002157   -25.07   0.000    -.0583048   -.0498413
             |
limited_en~f |
Limited E..  |  -.0551146   .0044167   -12.48   0.000    -.0637798   -.0464495
             |
    disabled |
   Disabled  |  -.0234638   .0042111    -5.57   0.000    -.0317255    -.015202
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0763827   .0028653    26.66   0.000     .0707614     .082004
       2016  |   .0669009   .0026699    25.06   0.000     .0616629     .072139
       2017  |   .0725969   .0028579    25.40   0.000     .0669901    .0782037
       2018  |   .0676527   .0037449    18.07   0.000     .0603057    .0749998
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0172946   .0015254   -11.34   0.000    -.0202872   -.0143021
       2016  |  -.0218622   .0014029   -15.58   0.000    -.0246146   -.0191098
       2017  |  -.0114337   .0015427    -7.41   0.000    -.0144602   -.0084071
       2018  |  -.0128349   .0015443    -8.31   0.000    -.0158645   -.0098052
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006912   .0005826    -1.19   0.236    -.0018342    .0004519
       2016  |   .0012378   .0005208     2.38   0.018     .0002161    .0022595
       2017  |  -.0019355   .0005308    -3.65   0.000    -.0029769   -.0008941
       2018  |  -.0046737   .0009263    -5.05   0.000    -.0064909   -.0028565
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0537981   .0025763    20.88   0.000     .0487436    .0588526
       2016  |   .0584932   .0026506    22.07   0.000      .053293    .0636934
       2017  |   .0554323   .0028302    19.59   0.000     .0498797     .060985
       2018  |   .0830115   .0038106    21.78   0.000     .0755355    .0904874
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097808   .0018731    -5.22   0.000    -.0134557    -.006106
       2016  |  -.0139488   .0016778    -8.31   0.000    -.0172406   -.0106571
       2017  |  -.0122189   .0018907    -6.46   0.000    -.0159283   -.0085094
       2018  |  -.0028726   .0015895    -1.81   0.071     -.005991    .0002459
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0006268   .0006578    -0.95   0.341    -.0019173    .0006636
       2016  |   .0006319   .0006785     0.93   0.352    -.0006992    .0019631
       2017  |   .0000352   .0007056     0.05   0.960    -.0013492    .0014196
       2018  |  -.0059741   .0009383    -6.37   0.000    -.0078149   -.0041334
             |
       _cons |   1.692533   .0341143    49.61   0.000     1.625605    1.759462
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794891
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_enr_og_dk.ster saved
RHS: Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =     641.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1355
                                                Root MSE          =     .41378

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .0591989   .0016822    35.19   0.000     .0558987    .0624992
             |
        year |
       2016  |   .0098817   .0041584     2.38   0.018     .0017234      .01804
       2017  |  -.0178501   .0038497    -4.64   0.000    -.0254028   -.0102974
       2018  |  -.0284341   .0043736    -6.50   0.000    -.0370147   -.0198536
             |
         age |  -.0001452   5.79e-06   -25.11   0.000    -.0001566   -.0001339
             |
        male |
       Male  |  -.0687363   .0019298   -35.62   0.000    -.0725224   -.0649502
 1.eth_asian |   .0559252   .0036824    15.19   0.000     .0487007    .0631496
1.eth_hisp~c |  -.0262467   .0028985    -9.06   0.000    -.0319333   -.0205602
 1.eth_black |   .0082371   .0049638     1.66   0.097    -.0015012    .0179755
 1.eth_other |  -.0093024   .0039609    -2.35   0.019    -.0170732   -.0015316
             |
econ_disad~e |
Economic ..  |  -.0619738   .0022572   -27.46   0.000    -.0664022   -.0575454
             |
limited_en~f |
Limited E..  |  -.0530213   .0045282   -11.71   0.000    -.0619052   -.0441374
             |
    disabled |
   Disabled  |  -.0202729   .0042697    -4.75   0.000    -.0286495   -.0118963
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0780639   .0028555    27.34   0.000     .0724617    .0836661
       2016  |   .0684245   .0026735    25.59   0.000     .0631794    .0736697
       2017  |   .0743982   .0028667    25.95   0.000     .0687741    .0800224
       2018  |   .0687999   .0037441    18.38   0.000     .0614545    .0761453
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.017507   .0015334   -11.42   0.000    -.0205155   -.0144986
       2016  |  -.0219557   .0014058   -15.62   0.000    -.0247137   -.0191976
       2017  |  -.0116111    .001546    -7.51   0.000    -.0146441   -.0085781
       2018  |  -.0131169   .0015475    -8.48   0.000    -.0161529   -.0100809
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006783    .000583    -1.16   0.245    -.0018221    .0004654
       2016  |   .0012668   .0005258     2.41   0.016     .0002352    .0022984
       2017  |   -.001943   .0005325    -3.65   0.000    -.0029876   -.0008983
       2018  |  -.0046435   .0009284    -5.00   0.000     -.006465    -.002822
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0541612   .0025796    21.00   0.000     .0491004     .059222
       2016  |   .0591108   .0026648    22.18   0.000     .0538828    .0643388
       2017  |   .0557133   .0028395    19.62   0.000     .0501426     .061284
       2018  |   .0839565   .0038217    21.97   0.000     .0764586    .0914543
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100754   .0018774    -5.37   0.000    -.0137587   -.0063922
       2016  |  -.0142531   .0016836    -8.47   0.000    -.0175562   -.0109501
       2017  |  -.0122618   .0018949    -6.47   0.000    -.0159795   -.0085442
       2018  |  -.0026255   .0015896    -1.65   0.099    -.0057441     .000493
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0005088   .0006579    -0.77   0.439    -.0017995    .0007819
       2016  |   .0007462   .0006808     1.10   0.273    -.0005896    .0020819
       2017  |   .0001006    .000707     0.14   0.887    -.0012864    .0014876
       2018  |   -.005837   .0009399    -6.21   0.000     -.007681   -.0039929
             |
       _cons |   1.690856    .034477    49.04   0.000     1.623216    1.758496
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794891
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_enr_acs_dk.ster saved
RHS: Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =     723.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1374
                                                Root MSE          =     .41332

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .0640138   .0015659    40.88   0.000     .0609417    .0670859
             |
        year |
       2016  |   .0100687   .0041724     2.41   0.016      .001883    .0182545
       2017  |  -.0181918   .0038827    -4.69   0.000    -.0258093   -.0105743
       2018  |  -.0282973   .0044094    -6.42   0.000     -.036948   -.0196465
             |
         age |  -.0001464   5.71e-06   -25.64   0.000    -.0001576   -.0001352
             |
        male |
       Male  |  -.0689882   .0019232   -35.87   0.000    -.0727614    -.065215
 1.eth_asian |   .0508691   .0032865    15.48   0.000     .0444213    .0573168
1.eth_hisp~c |  -.0198212   .0027696    -7.16   0.000    -.0252549   -.0143876
 1.eth_black |   .0132365   .0048615     2.72   0.007     .0036988    .0227742
 1.eth_other |  -.0096346   .0038797    -2.48   0.013     -.017246   -.0020231
             |
econ_disad~e |
Economic ..  |   -.053891   .0021578   -24.98   0.000    -.0581243   -.0496577
             |
limited_en~f |
Limited E..  |  -.0550741   .0044203   -12.46   0.000    -.0637462    -.046402
             |
    disabled |
   Disabled  |  -.0235273   .0042093    -5.59   0.000    -.0317854   -.0152691
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0763576   .0028676    26.63   0.000     .0707318    .0819834
       2016  |   .0668662   .0026705    25.04   0.000      .061627    .0721054
       2017  |   .0725507   .0028568    25.40   0.000      .066946    .0781555
       2018  |   .0676516   .0037455    18.06   0.000     .0603033    .0749999
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0172983   .0015254   -11.34   0.000     -.020291   -.0143056
       2016  |  -.0218749    .001403   -15.59   0.000    -.0246274   -.0191224
       2017  |  -.0114363   .0015421    -7.42   0.000    -.0144617   -.0084108
       2018  |  -.0128268   .0015437    -8.31   0.000    -.0158553   -.0097982
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006924   .0005826    -1.19   0.235    -.0018353    .0004505
       2016  |   .0012388   .0005208     2.38   0.018     .0002171    .0022604
       2017  |  -.0019364   .0005306    -3.65   0.000    -.0029774   -.0008955
       2018  |  -.0046754    .000926    -5.05   0.000    -.0064921   -.0028586
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538087    .002579    20.86   0.000     .0487491    .0588683
       2016  |    .058528   .0026525    22.07   0.000     .0533241     .063732
       2017  |   .0554534   .0028311    19.59   0.000     .0498992    .0610076
       2018  |   .0830202   .0038109    21.78   0.000     .0755436    .0904968
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097956   .0018738    -5.23   0.000    -.0134717   -.0061195
       2016  |  -.0139435   .0016776    -8.31   0.000    -.0172349   -.0106522
       2017  |  -.0122365   .0018913    -6.47   0.000     -.015947    -.008526
       2018  |  -.0028996   .0015898    -1.82   0.068    -.0060186    .0002193
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0006279   .0006578    -0.95   0.340    -.0019184    .0006626
       2016  |   .0006232   .0006785     0.92   0.359     -.000708    .0019544
       2017  |    .000033   .0007059     0.05   0.963     -.001352     .001418
       2018  |  -.0059884   .0009383    -6.38   0.000    -.0078293   -.0041476
             |
       _cons |   1.691723    .034155    49.53   0.000     1.624715    1.758731
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794891
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_enr_sib_dk.ster saved
RHS: Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =     644.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1355
                                                Root MSE          =     .41378

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .0592113   .0016806    35.23   0.000     .0559141    .0625084
             |
        year |
       2016  |   .0098165   .0041626     2.36   0.019     .0016499     .017983
       2017  |  -.0179007   .0038514    -4.65   0.000    -.0254568   -.0103446
       2018  |  -.0285122   .0043762    -6.52   0.000    -.0370978   -.0199265
             |
         age |  -.0001451   5.79e-06   -25.06   0.000    -.0001565   -.0001338
             |
        male |
       Male  |  -.0687415   .0019294   -35.63   0.000    -.0725268   -.0649561
 1.eth_asian |   .0559316    .003677    15.21   0.000     .0487179    .0631454
1.eth_hisp~c |  -.0262167   .0028941    -9.06   0.000    -.0318945    -.020539
 1.eth_black |    .008246   .0049628     1.66   0.097    -.0014905    .0179825
 1.eth_other |  -.0093298   .0039596    -2.36   0.019    -.0170981   -.0015614
             |
econ_disad~e |
Economic ..  |  -.0617753   .0022559   -27.38   0.000    -.0662012   -.0573494
             |
limited_en~f |
Limited E..  |  -.0529704   .0045321   -11.69   0.000    -.0618619   -.0440788
             |
    disabled |
   Disabled  |  -.0203241    .004268    -4.76   0.000    -.0286974   -.0119508
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0780449   .0028576    27.31   0.000     .0724387    .0836511
       2016  |   .0683977   .0026739    25.58   0.000     .0631519    .0736435
       2017  |   .0743605    .002866    25.95   0.000     .0687378    .0799832
       2018  |   .0687934   .0037446    18.37   0.000     .0614469    .0761398
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0175135   .0015335   -11.42   0.000     -.020522   -.0145051
       2016  |    -.02197   .0014059   -15.63   0.000    -.0247283   -.0192118
       2017  |  -.0116175   .0015454    -7.52   0.000    -.0146495   -.0085856
       2018  |  -.0131128    .001547    -8.48   0.000    -.0161477   -.0100778
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006795   .0005829    -1.17   0.244    -.0018231    .0004641
       2016  |   .0012676   .0005258     2.41   0.016     .0002361    .0022991
       2017  |  -.0019437   .0005323    -3.65   0.000    -.0029879   -.0008994
       2018  |  -.0046451   .0009282    -5.00   0.000    -.0064662    -.002824
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0541688   .0025822    20.98   0.000     .0491029    .0592348
       2016  |   .0591434   .0026665    22.18   0.000     .0539121    .0643748
       2017  |   .0557278   .0028402    19.62   0.000     .0501556       .0613
       2018  |   .0839698    .003822    21.97   0.000     .0764715     .091468
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100921    .001878    -5.37   0.000    -.0137765   -.0064077
       2016  |  -.0142507   .0016834    -8.47   0.000    -.0175533   -.0109482
       2017  |  -.0122797   .0018955    -6.48   0.000    -.0159985   -.0085609
       2018  |  -.0026532   .0015897    -1.67   0.095     -.005772    .0004655
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.000509   .0006579    -0.77   0.439    -.0017998    .0007818
       2016  |   .0007382   .0006808     1.08   0.278    -.0005975    .0020739
       2017  |   .0000988   .0007072     0.14   0.889    -.0012888    .0014863
       2018  |  -.0058502   .0009398    -6.22   0.000     -.007694   -.0040064
             |
       _cons |   1.690128   .0345081    48.98   0.000     1.622427    1.757829
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794891
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_enr_both_dk.ster saved
LHS = enr_2year
RHS: Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =     562.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0873
                                                Root MSE          =     .45879

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
~2year_og_dk |   .0910521   .0008784   103.66   0.000     .0893288    .0927753
             |
        year |
       2016  |  -.0077598   .0048351    -1.60   0.109    -.0172457     .001726
       2017  |  -.0382163   .0039769    -9.61   0.000    -.0460185    -.030414
       2018  |  -.0104053   .0048947    -2.13   0.034    -.0200081   -.0008025
             |
         age |   -.000068   5.66e-06   -12.02   0.000    -.0000792   -.0000569
             |
        male |
       Male  |   .0206056   .0019997    10.30   0.000     .0166825    .0245288
 1.eth_asian |  -.0228878    .003399    -6.73   0.000    -.0295562   -.0162195
1.eth_hisp~c |   .0098516   .0027267     3.61   0.000     .0045021     .015201
 1.eth_black |  -.0152918    .004749    -3.22   0.001    -.0246088   -.0059748
 1.eth_other |  -.0006365   .0045511    -0.14   0.889    -.0095653    .0082924
             |
econ_disad~e |
Economic ..  |  -.0115432   .0021233    -5.44   0.000    -.0157089   -.0073776
             |
limited_en~f |
Limited E..  |  -.0354254   .0044227    -8.01   0.000    -.0441022   -.0267487
             |
    disabled |
   Disabled  |   .0311499   .0048584     6.41   0.000     .0216182    .0406817
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0656814   .0032184   -20.41   0.000    -.0719955   -.0593673
       2016  |  -.0587247   .0029517   -19.90   0.000    -.0645156   -.0529338
       2017  |  -.0530329   .0031371   -16.91   0.000    -.0591876   -.0468783
       2018  |  -.0292541   .0039216    -7.46   0.000    -.0369478   -.0215603
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0392954   .0015977   -24.59   0.000    -.0424299   -.0361609
       2016  |  -.0373916    .001574   -23.76   0.000    -.0404795   -.0343036
       2017  |  -.0281386    .001618   -17.39   0.000    -.0313129   -.0249643
       2018  |  -.0311196   .0016142   -19.28   0.000    -.0342865   -.0279528
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0106211   .0006267    16.95   0.000     .0093916    .0118506
       2016  |   .0104901   .0005236    20.03   0.000     .0094628    .0115174
       2017  |   .0079009   .0005671    13.93   0.000     .0067884    .0090134
       2018  |   .0045489   .0010254     4.44   0.000     .0025371    .0065607
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0661999   .0031706   -20.88   0.000    -.0724203   -.0599795
       2016  |  -.0681785   .0033474   -20.37   0.000    -.0747458   -.0616112
       2017  |  -.0678019   .0034079   -19.90   0.000    -.0744878    -.061116
       2018  |  -.0581515   .0042902   -13.55   0.000    -.0665683   -.0497347
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0257677   .0020282   -12.70   0.000    -.0297468   -.0217887
       2016  |  -.0308907   .0019256   -16.04   0.000    -.0346684   -.0271129
       2017  |  -.0239874   .0020208   -11.87   0.000     -.027952   -.0200228
       2018  |  -.0336112   .0016842   -19.96   0.000    -.0369155   -.0303069
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090339   .0007313    12.35   0.000     .0075991    .0104687
       2016  |   .0109697   .0007788    14.09   0.000     .0094419    .0124976
       2017  |   .0085846   .0007948    10.80   0.000     .0070253    .0101439
       2018  |   .0034606   .0010662     3.25   0.001     .0013689    .0055523
             |
       _cons |   .8575248   .0347489    24.68   0.000     .7893515     .925698
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070008
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_enr_2year_og_dk.ster saved
RHS: Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =     408.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0836
                                                Root MSE          =     .45971

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye.. |   .0850593   .0012827    66.31   0.000     .0825429    .0875758
             |
        year |
       2016  |  -.0077723   .0048797    -1.59   0.111    -.0173458    .0018012
       2017  |  -.0382008   .0040256    -9.49   0.000    -.0460986    -.030303
       2018  |  -.0103714   .0049252    -2.11   0.035     -.020034   -.0007088
             |
         age |  -.0000687   5.76e-06   -11.94   0.000      -.00008   -.0000574
             |
        male |
       Male  |   .0208981   .0019996    10.45   0.000      .016975    .0248211
 1.eth_asian |   -.015478   .0038216    -4.05   0.000    -.0229756   -.0079805
1.eth_hisp~c |   .0026029   .0030885     0.84   0.400    -.0034563    .0086621
 1.eth_black |  -.0236633   .0049386    -4.79   0.000    -.0333522   -.0139743
 1.eth_other |    .000721   .0045999     0.16   0.875    -.0083034    .0097454
             |
econ_disad~e |
Economic ..  |  -.0129386   .0022478    -5.76   0.000    -.0173485   -.0085287
             |
limited_en~f |
Limited E..  |  -.0325269   .0046009    -7.07   0.000    -.0415534   -.0235005
             |
    disabled |
   Disabled  |    .032441   .0048393     6.70   0.000     .0229468    .0419352
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0642678   .0032202   -19.96   0.000    -.0705855     -.05795
       2016  |  -.0571766   .0029765   -19.21   0.000    -.0630161    -.051337
       2017  |  -.0521515   .0031922   -16.34   0.000    -.0584142   -.0458888
       2018  |  -.0290015   .0039665    -7.31   0.000    -.0367834   -.0212196
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0401781   .0015915   -25.25   0.000    -.0433004   -.0370558
       2016  |  -.0382119   .0015789   -24.20   0.000    -.0413095   -.0351144
       2017  |  -.0291586   .0016211   -17.99   0.000     -.032339   -.0259782
       2018  |   -.031748   .0016211   -19.58   0.000    -.0349284   -.0285677
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0106577   .0006274    16.99   0.000     .0094269    .0118885
       2016  |   .0105104   .0005271    19.94   0.000     .0094763    .0115445
       2017  |   .0080237   .0005686    14.11   0.000     .0069083    .0091392
       2018  |   .0045449   .0010264     4.43   0.000     .0025313    .0065585
             |
        year#|
          c. |
prior_math~e |
       2015  |   -.066577   .0031749   -20.97   0.000    -.0728058   -.0603482
       2016  |  -.0685144   .0033913   -20.20   0.000    -.0751678    -.061861
       2017  |  -.0683498   .0034312   -19.92   0.000    -.0750815   -.0616181
       2018  |  -.0571535   .0043654   -13.09   0.000    -.0657179   -.0485891
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0269112   .0020293   -13.26   0.000    -.0308926   -.0229299
       2016  |   -.031962   .0019324   -16.54   0.000    -.0357531   -.0281708
       2017  |  -.0246311   .0020321   -12.12   0.000    -.0286178   -.0206445
       2018  |  -.0344573   .0016906   -20.38   0.000    -.0377741   -.0311404
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0092958    .000732    12.70   0.000     .0078597    .0107318
       2016  |   .0112011   .0007832    14.30   0.000     .0096645    .0127377
       2017  |   .0087075   .0007981    10.91   0.000     .0071417    .0102732
       2018  |   .0032448   .0010639     3.05   0.002     .0011576    .0053319
             |
       _cons |   .8662322   .0352839    24.55   0.000     .7970092    .9354553
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070008
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_enr_2year_acs_dk.ster saved
RHS: Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =     553.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0872
                                                Root MSE          =     .45881

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye.. |   .0909698   .0008904   102.16   0.000     .0892228    .0927167
             |
        year |
       2016  |  -.0077468   .0048489    -1.60   0.110    -.0172598    .0017662
       2017  |  -.0382361   .0039695    -9.63   0.000    -.0460237   -.0304484
       2018  |  -.0103995   .0048894    -2.13   0.034     -.019992    -.000807
             |
         age |  -.0000681   5.66e-06   -12.03   0.000    -.0000792    -.000057
             |
        male |
       Male  |   .0205968   .0019997    10.30   0.000     .0166736      .02452
 1.eth_asian |  -.0227665   .0034046    -6.69   0.000    -.0294459   -.0160872
1.eth_hisp~c |   .0098929   .0027239     3.63   0.000      .004549    .0152368
 1.eth_black |  -.0152773   .0047522    -3.21   0.001    -.0246006    -.005954
 1.eth_other |  -.0004259   .0045482    -0.09   0.925     -.009349    .0084971
             |
econ_disad~e |
Economic ..  |  -.0114247   .0021256    -5.37   0.000    -.0155948   -.0072545
             |
limited_en~f |
Limited E..  |  -.0353674   .0044238    -7.99   0.000    -.0440464   -.0266884
             |
    disabled |
   Disabled  |   .0311105   .0048563     6.41   0.000      .021583     .040638
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0657054   .0032206   -20.40   0.000     -.072024   -.0593869
       2016  |  -.0587933   .0029501   -19.93   0.000    -.0645809   -.0530056
       2017  |  -.0531248   .0031389   -16.92   0.000    -.0592829   -.0469667
       2018  |  -.0293093   .0039206    -7.48   0.000     -.037001   -.0216176
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0392943   .0015975   -24.60   0.000    -.0424285   -.0361602
       2016  |  -.0374024    .001573   -23.78   0.000    -.0404885   -.0343164
       2017  |   -.028147   .0016178   -17.40   0.000    -.0313209   -.0249731
       2018  |  -.0311351   .0016141   -19.29   0.000    -.0343017   -.0279685
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0106197   .0006268    16.94   0.000     .0093899    .0118494
       2016  |   .0104968   .0005235    20.05   0.000     .0094698    .0115238
       2017  |   .0079115    .000567    13.95   0.000      .006799    .0090239
       2018  |   .0045538    .001025     4.44   0.000     .0025428    .0065647
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0662348   .0031721   -20.88   0.000    -.0724581   -.0600114
       2016  |  -.0682541   .0033488   -20.38   0.000     -.074824   -.0616841
       2017  |  -.0678441   .0034074   -19.91   0.000     -.074529   -.0611593
       2018  |  -.0581916   .0042909   -13.56   0.000    -.0666099   -.0497734
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0257788   .0020289   -12.71   0.000    -.0297594   -.0217983
       2016  |  -.0308991   .0019268   -16.04   0.000    -.0346793   -.0271189
       2017  |  -.0240014   .0020214   -11.87   0.000    -.0279671   -.0200357
       2018  |  -.0336237   .0016847   -19.96   0.000    -.0369288   -.0303185
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090425   .0007317    12.36   0.000     .0076069     .010478
       2016  |   .0109726   .0007792    14.08   0.000     .0094439    .0125014
       2017  |   .0085952   .0007952    10.81   0.000      .007035    .0101553
       2018  |   .0034633   .0010668     3.25   0.001     .0013704    .0055563
             |
       _cons |   .8576796   .0347202    24.70   0.000     .7895624    .9257967
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070008
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_enr_2year_sib_dk.ster saved
RHS: Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =     406.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0835
                                                Root MSE          =     .45973

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye.. |   .0849463   .0012908    65.81   0.000     .0824138    .0874788
             |
        year |
       2016  |  -.0077642   .0048927    -1.59   0.113    -.0173631    .0018348
       2017  |  -.0382157   .0040199    -9.51   0.000    -.0461023   -.0303291
       2018  |  -.0103758   .0049188    -2.11   0.035    -.0200258   -.0007257
             |
         age |  -.0000687   5.75e-06   -11.95   0.000      -.00008   -.0000574
             |
        male |
       Male  |   .0208918   .0019998    10.45   0.000     .0169685    .0248152
 1.eth_asian |  -.0154327   .0038126    -4.05   0.000    -.0229126   -.0079528
1.eth_hisp~c |   .0025835   .0030822     0.84   0.402    -.0034634    .0086304
 1.eth_black |  -.0237063    .004945    -4.79   0.000    -.0334078   -.0140048
 1.eth_other |    .000898   .0045971     0.20   0.845     -.008121    .0099169
             |
econ_disad~e |
Economic ..  |  -.0129468   .0022477    -5.76   0.000    -.0173566    -.008537
             |
limited_en~f |
Limited E..  |  -.0324622   .0046011    -7.06   0.000    -.0414891   -.0234353
             |
    disabled |
   Disabled  |    .032444   .0048391     6.70   0.000     .0229503    .0419378
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0642705   .0032223   -19.95   0.000    -.0705923   -.0579487
       2016  |  -.0572293   .0029746   -19.24   0.000    -.0630652   -.0513934
       2017  |  -.0522195   .0031938   -16.35   0.000    -.0584854   -.0459536
       2018  |  -.0290366   .0039653    -7.32   0.000    -.0368161    -.021257
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0401741   .0015915   -25.24   0.000    -.0432964   -.0370517
       2016  |  -.0382214   .0015779   -24.22   0.000     -.041317   -.0351259
       2017  |  -.0291626   .0016208   -17.99   0.000    -.0323425   -.0259827
       2018  |  -.0317622   .0016209   -19.60   0.000    -.0349423   -.0285822
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    .010656   .0006275    16.98   0.000     .0094248    .0118871
       2016  |   .0105177   .0005269    19.96   0.000     .0094839    .0115515
       2017  |   .0080332   .0005685    14.13   0.000     .0069178    .0091486
       2018  |     .00455   .0010259     4.43   0.000     .0025372    .0065628
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0666051   .0031769   -20.97   0.000    -.0728378   -.0603725
       2016  |  -.0685762   .0033925   -20.21   0.000    -.0752318   -.0619205
       2017  |  -.0683822   .0034312   -19.93   0.000    -.0751138   -.0616505
       2018  |  -.0571858   .0043655   -13.10   0.000    -.0657504   -.0486213
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0269192   .0020302   -13.26   0.000    -.0309022   -.0229362
       2016  |  -.0319671   .0019336   -16.53   0.000    -.0357606   -.0281736
       2017  |  -.0246435   .0020328   -12.12   0.000    -.0286316   -.0206554
       2018  |  -.0344611    .001691   -20.38   0.000    -.0377787   -.0311435
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0093044   .0007324    12.70   0.000     .0078676    .0107413
       2016  |   .0112037   .0007837    14.30   0.000     .0096662    .0127413
       2017  |   .0087185   .0007985    10.92   0.000     .0071518    .0102851
       2018  |   .0032505   .0010645     3.05   0.002      .001162    .0053389
             |
       _cons |    .866229   .0352494    24.57   0.000     .7970737    .9353843
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070008
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_enr_2year_both_dk.ster saved
LHS = enr_4year
RHS: Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =    2299.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2644
                                                Root MSE          =     .41345

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
~4year_og_dk |    .075963   .0014533    52.27   0.000     .0731119    .0788141
             |
        year |
       2016  |   .0162358   .0031887     5.09   0.000       .00998    .0224917
       2017  |   .0173937    .003817     4.56   0.000     .0099052    .0248822
       2018  |  -.0211921   .0040322    -5.26   0.000    -.0291028   -.0132813
             |
         age |  -.0000774   5.01e-06   -15.46   0.000    -.0000873   -.0000676
             |
        male |
       Male  |  -.0896548   .0017052   -52.58   0.000    -.0930002   -.0863094
 1.eth_asian |   .0736609   .0042102    17.50   0.000     .0654011    .0819208
1.eth_hisp~c |  -.0305077   .0030522   -10.00   0.000    -.0364958   -.0245196
 1.eth_black |   .0282542   .0051885     5.45   0.000      .018075    .0384335
 1.eth_other |  -.0089788   .0044946    -2.00   0.046    -.0177968   -.0001608
             |
econ_disad~e |
Economic ..  |  -.0421921   .0025759   -16.38   0.000    -.0472457   -.0371386
             |
limited_en~f |
Limited E..  |   -.019783   .0027883    -7.10   0.000    -.0252533   -.0143127
             |
    disabled |
   Disabled  |  -.0542061   .0033628   -16.12   0.000    -.0608035   -.0476088
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1400404   .0026735    52.38   0.000     .1347952    .1452855
       2016  |   .1276197   .0026761    47.69   0.000     .1223695    .1328699
       2017  |   .1235866   .0028413    43.50   0.000     .1180122    .1291609
       2018  |   .0964455   .0035322    27.30   0.000     .0895158    .1033752
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0218536   .0011854    18.44   0.000     .0195281    .0241791
       2016  |   .0162475   .0012288    13.22   0.000     .0138368    .0186582
       2017  |    .016501   .0011637    14.18   0.000      .014218     .018784
       2018  |   .0181628   .0013028    13.94   0.000     .0156069    .0207187
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112178   .0005183   -21.64   0.000    -.0122347    -.010201
       2016  |  -.0095082    .000486   -19.56   0.000    -.0104616   -.0085547
       2017  |  -.0096608   .0005004   -19.31   0.000    -.0106426   -.0086791
       2018  |  -.0091455   .0008234   -11.11   0.000    -.0107609     -.00753
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1200645   .0027816    43.16   0.000     .1146074    .1255217
       2016  |   .1264928   .0029172    43.36   0.000     .1207697     .132216
       2017  |    .123279   .0030776    40.06   0.000     .1172411    .1293169
       2018  |    .142212   .0036605    38.85   0.000     .1350304    .1493936
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0158966   .0014948    10.63   0.000      .012964    .0188291
       2016  |   .0171018   .0014112    12.12   0.000     .0143332    .0198704
       2017  |   .0119527   .0015169     7.88   0.000     .0089767    .0149288
       2018  |   .0312737   .0012331    25.36   0.000     .0288546    .0336929
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0096606   .0006098   -15.84   0.000    -.0108569   -.0084643
       2016  |  -.0103074   .0006672   -15.45   0.000    -.0116164   -.0089984
       2017  |  -.0086531   .0007089   -12.21   0.000    -.0100439   -.0072623
       2018  |  -.0093155   .0008484   -10.98   0.000    -.0109801    -.007651
             |
       _cons |   .8304799    .030171    27.53   0.000      .771288    .8896719
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724883
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_enr_4year_og_dk.ster saved
RHS: Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =    2234.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2618
                                                Root MSE          =     .41418

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye.. |   .0717896   .0016475    43.57   0.000     .0685573    .0750219
             |
        year |
       2016  |   .0163238   .0032772     4.98   0.000     .0098944    .0227532
       2017  |   .0179509   .0038021     4.72   0.000     .0104917    .0254102
       2018  |  -.0210798   .0040138    -5.25   0.000    -.0289544   -.0132052
             |
         age |  -.0000755   5.27e-06   -14.33   0.000    -.0000858   -.0000651
             |
        male |
       Male  |  -.0897263   .0017042   -52.65   0.000    -.0930696   -.0863829
 1.eth_asian |   .0714553   .0048218    14.82   0.000     .0619954    .0809152
1.eth_hisp~c |  -.0294638    .003438    -8.57   0.000    -.0362087   -.0227189
 1.eth_black |   .0320567   .0053486     5.99   0.000     .0215632    .0425501
 1.eth_other |  -.0098196   .0046475    -2.11   0.035    -.0189374   -.0007017
             |
econ_disad~e |
Economic ..  |  -.0485952   .0027965   -17.38   0.000    -.0540816   -.0431087
             |
limited_en~f |
Limited E..  |  -.0206328   .0028334    -7.28   0.000    -.0261916   -.0150741
             |
    disabled |
   Disabled  |  -.0523672   .0032921   -15.91   0.000    -.0588261   -.0459084
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1404487   .0026639    52.72   0.000     .1352223     .145675
       2016  |   .1272291   .0026884    47.32   0.000     .1219547    .1325035
       2017  |   .1246819    .002867    43.49   0.000     .1190572    .1303065
       2018  |   .0973215   .0035708    27.25   0.000      .090316     .104327
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0226034   .0011756    19.23   0.000     .0202971    .0249097
       2016  |   .0168975   .0012199    13.85   0.000     .0145043    .0192907
       2017  |   .0172945   .0011545    14.98   0.000     .0150295    .0195595
       2018  |   .0185355   .0013016    14.24   0.000     .0159819    .0210891
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112574   .0005198   -21.66   0.000    -.0122771   -.0102376
       2016  |  -.0094546    .000487   -19.41   0.000    -.0104101   -.0084991
       2017  |  -.0097959   .0005003   -19.58   0.000    -.0107775   -.0088143
       2018  |  -.0090976   .0008211   -11.08   0.000    -.0107085   -.0074867
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1205869    .002783    43.33   0.000     .1151268    .1260469
       2016  |   .1272137   .0029555    43.04   0.000     .1214152    .1330121
       2017  |   .1238942   .0030822    40.20   0.000     .1178472    .1299412
       2018  |   .1416602   .0037298    37.98   0.000     .1343428    .1489776
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0168606   .0015007    11.24   0.000     .0139165    .0198047
       2016  |   .0179079   .0014154    12.65   0.000     .0151309    .0206848
       2017  |   .0125363   .0015189     8.25   0.000     .0095563    .0155163
       2018  |   .0322731   .0012424    25.98   0.000     .0298356    .0347107
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097833   .0006108   -16.02   0.000    -.0109816   -.0085849
       2016  |  -.0104115   .0006701   -15.54   0.000    -.0117262   -.0090967
       2017  |  -.0086779   .0007104   -12.21   0.000    -.0100717   -.0072841
       2018  |  -.0089035   .0008395   -10.61   0.000    -.0105504   -.0072566
             |
       _cons |   .8195497   .0312413    26.23   0.000     .7582578    .8808416
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724883
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_enr_4year_acs_dk.ster saved
RHS: Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =    2326.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2643
                                                Root MSE          =     .41349

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye.. |    .075786    .001468    51.62   0.000     .0729059    .0786661
             |
        year |
       2016  |   .0162193   .0032145     5.05   0.000     .0099129    .0225257
       2017  |   .0173864   .0038141     4.56   0.000     .0099036    .0248691
       2018  |  -.0211653    .004029    -5.25   0.000    -.0290697   -.0132608
             |
         age |  -.0000773   5.01e-06   -15.42   0.000    -.0000871   -.0000675
             |
        male |
       Male  |  -.0896666   .0017051   -52.59   0.000    -.0930117   -.0863214
 1.eth_asian |   .0734379   .0042054    17.46   0.000     .0651874    .0816884
1.eth_hisp~c |  -.0303156   .0030551    -9.92   0.000    -.0363093   -.0243218
 1.eth_black |    .028398   .0052054     5.46   0.000     .0181856    .0386105
 1.eth_other |  -.0091956   .0044816    -2.05   0.040    -.0179881   -.0004031
             |
econ_disad~e |
Economic ..  |  -.0418963   .0025823   -16.22   0.000    -.0469626   -.0368301
             |
limited_en~f |
Limited E..  |  -.0198131   .0027959    -7.09   0.000    -.0252982   -.0143279
             |
    disabled |
   Disabled  |  -.0543795   .0033687   -16.14   0.000    -.0609885   -.0477704
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1399799   .0026751    52.33   0.000     .1347317     .145228
       2016  |   .1275152   .0026747    47.67   0.000     .1222677    .1327627
       2017  |   .1236735   .0028432    43.50   0.000     .1180955    .1292514
       2018  |   .0964856   .0035347    27.30   0.000     .0895509    .1034204
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0218567   .0011842    18.46   0.000     .0195334    .0241801
       2016  |   .0162204   .0012303    13.18   0.000     .0138067    .0186341
       2017  |   .0165032   .0011644    14.17   0.000     .0142188    .0187876
       2018  |   .0181804   .0013035    13.95   0.000      .015623    .0207378
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112156    .000518   -21.65   0.000    -.0122319   -.0101994
       2016  |  -.0095037   .0004864   -19.54   0.000    -.0104579   -.0085495
       2017  |   -.009675   .0005006   -19.33   0.000     -.010657    -.008693
       2018  |  -.0091593   .0008237   -11.12   0.000    -.0107753   -.0075434
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1200666   .0027869    43.08   0.000     .1145989    .1255342
       2016  |   .1265065   .0029231    43.28   0.000     .1207717    .1322414
       2017  |   .1233264   .0030791    40.05   0.000     .1172856    .1293673
       2018  |   .1421061   .0036605    38.82   0.000     .1349247    .1492875
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0159055   .0014968    10.63   0.000      .012969    .0188421
       2016  |   .0171201   .0014116    12.13   0.000     .0143508    .0198894
       2017  |   .0119512   .0015163     7.88   0.000     .0089765    .0149259
       2018  |   .0312141   .0012344    25.29   0.000     .0287923    .0336359
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0096684   .0006101   -15.85   0.000    -.0108654   -.0084715
       2016  |  -.0103168   .0006673   -15.46   0.000     -.011626   -.0090076
       2017  |  -.0086572   .0007093   -12.21   0.000    -.0100487   -.0072657
       2018  |  -.0093258   .0008487   -10.99   0.000    -.0109908   -.0076608
             |
       _cons |   .8295235   .0301926    27.47   0.000      .770289     .888758
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724883
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_enr_4year_sib_dk.ster saved
RHS: Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,838
                                                F(37, 1236)       =    2246.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2618
                                                Root MSE          =     .41421

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye.. |   .0716623   .0016548    43.30   0.000     .0684157    .0749089
             |
        year |
       2016  |   .0162986   .0033016     4.94   0.000     .0098213    .0227759
       2017  |   .0179237   .0037998     4.72   0.000      .010469    .0253785
       2018  |  -.0210767   .0040126    -5.25   0.000    -.0289489   -.0132045
             |
         age |  -.0000753   5.27e-06   -14.30   0.000    -.0000857    -.000065
             |
        male |
       Male  |  -.0897356    .001704   -52.66   0.000    -.0930787   -.0863924
 1.eth_asian |    .071467   .0048007    14.89   0.000     .0620486    .0808854
1.eth_hisp~c |  -.0293536   .0034357    -8.54   0.000    -.0360942   -.0226131
 1.eth_black |   .0321921    .005361     6.00   0.000     .0216744    .0427099
 1.eth_other |   -.009981   .0046345    -2.15   0.031    -.0190733   -.0008886
             |
econ_disad~e |
Economic ..  |  -.0483195   .0027978   -17.27   0.000    -.0538084   -.0428305
             |
limited_en~f |
Limited E..  |  -.0206235   .0028426    -7.26   0.000    -.0262004   -.0150466
             |
    disabled |
   Disabled  |  -.0525106   .0032978   -15.92   0.000    -.0589804   -.0460408
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1404026   .0026655    52.67   0.000     .1351733    .1456319
       2016  |   .1271425   .0026864    47.33   0.000     .1218722    .1324129
       2017  |   .1247811   .0028683    43.50   0.000     .1191539    .1304083
       2018  |   .0973576   .0035723    27.25   0.000     .0903493     .104366
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0225977   .0011749    19.23   0.000     .0202926    .0249027
       2016  |   .0168662   .0012216    13.81   0.000     .0144695    .0192629
       2017  |   .0172899   .0011549    14.97   0.000      .015024    .0195557
       2018  |   .0185464   .0013024    14.24   0.000     .0159912    .0211016
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112545   .0005195   -21.66   0.000    -.0122737   -.0102352
       2016  |  -.0094508   .0004875   -19.39   0.000    -.0104071   -.0084944
       2017  |  -.0098091   .0005004   -19.60   0.000    -.0107909   -.0088273
       2018  |  -.0091108   .0008213   -11.09   0.000    -.0107221   -.0074994
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1205908   .0027886    43.24   0.000     .1151199    .1260618
       2016  |   .1272337   .0029611    42.97   0.000     .1214244    .1330429
       2017  |   .1239346   .0030839    40.19   0.000     .1178843    .1299848
       2018  |   .1415741   .0037285    37.97   0.000     .1342592    .1488891
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |    .016862   .0015024    11.22   0.000     .0139145    .0198096
       2016  |   .0179187   .0014158    12.66   0.000      .015141    .0206963
       2017  |   .0125342   .0015183     8.26   0.000     .0095554    .0155129
       2018  |   .0322163   .0012435    25.91   0.000     .0297768    .0346559
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097891   .0006112   -16.02   0.000    -.0109882   -.0085901
       2016  |  -.0104188   .0006702   -15.54   0.000    -.0117338   -.0091039
       2017  |  -.0086812   .0007108   -12.21   0.000    -.0100757   -.0072867
       2018  |  -.0089113   .0008394   -10.62   0.000    -.0105582   -.0072644
             |
       _cons |   .8187457   .0312545    26.20   0.000     .7574279    .8800635
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724883
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_enr_4year_both_dk.ster saved

. 
. 
. 
. 
. ********** regress enrollment outcomes on dk va interacted with prior score d
> eciles
. /* no tfx, no peer effects, matching outcome on LHS and RHS */
. 
. //merge on prior score quantiles
. merge m:1 state_student_id using ///
>   $vaprojdir/data/sbac/prior_decile_original_sample.dta, keep(1 3)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           526,590  (_merge==3)
    -----------------------------------------

. 
. // 3 outcomes, 4 DK VA specifications, 2 prior subjects = 24 regressions
. foreach outcome in enr enr_2year enr_4year {
  2.     di "LHS = `outcome'"
  3. 
.     foreach control in og acs sib both {
  4.       di "RHS DK VA: Deep Knowledge VA with `control' controls"
  5. 
.       foreach prior_subject in ela math {
  6.         di "interaction with prior `prior_subject' score deciles "
  7. 
.         reg `outcome' c.va_`outcome'_`control'_dk#i.prior_`prior_subject'_z_s
> core_xtile ///
>           i.year ///
>           `school_controls' ///
>           `demographic_controls' ///
>           `ela_score_controls' ///
>           `math_score_controls' ///
>           if touse_`outcome'_dk==1 ///
>           , cluster(cdscode)
  8.         estadd ysumm, mean
  9. 
.         estimates save $vaprojdir/estimates/sib_acs_restr_smp/persistence/het
> _reg_`outcome'_va_`outcome'_`control'_dk_x_prior_`prior_subject'.ster, replac
> e
 10. 
.       }
 11.     }
 12. }
LHS = enr
RHS DK VA: Deep Knowledge VA with og controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =     910.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1387
                                                Root MSE          =     .41301

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_og_dk |
          1  |   .0772016   .0026985    28.61   0.000     .0719074    .0824958
          2  |   .0816691   .0024933    32.76   0.000     .0767777    .0865606
          3  |   .0771923   .0027292    28.28   0.000      .071838    .0825465
          4  |   .0741145   .0027656    26.80   0.000     .0686887    .0795402
          5  |   .0691631   .0025979    26.62   0.000     .0640664    .0742599
          6  |    .064995   .0027617    23.53   0.000      .059577    .0704131
          7  |   .0620893   .0023003    26.99   0.000     .0575764    .0666023
          8  |   .0518389   .0023277    22.27   0.000     .0472722    .0564057
          9  |   .0414306   .0025443    16.28   0.000      .036439    .0464222
         10  |   .0232047   .0020867    11.12   0.000     .0191109    .0272985
             |
        year |
       2016  |   .0102976   .0042543     2.42   0.016     .0019512     .018644
       2017  |  -.0184542   .0038989    -4.73   0.000    -.0261034    -.010805
       2018  |  -.0280989   .0044549    -6.31   0.000    -.0368389    -.019359
             |
         age |  -.0001445   5.70e-06   -25.33   0.000    -.0001557   -.0001333
             |
        male |
       Male  |  -.0693596   .0019204   -36.12   0.000    -.0731273   -.0655919
 1.eth_asian |   .0502302   .0032014    15.69   0.000     .0439495     .056511
1.eth_hisp~c |  -.0206852   .0027856    -7.43   0.000    -.0261501   -.0152202
 1.eth_black |   .0125512   .0048386     2.59   0.010     .0030584    .0220439
 1.eth_other |  -.0098529   .0038566    -2.55   0.011     -.017419   -.0022867
             |
econ_disad~e |
Economic ..  |  -.0541819   .0021202   -25.56   0.000    -.0583414   -.0500224
             |
limited_en~f |
Limited E..  |  -.0555996    .004281   -12.99   0.000    -.0639984   -.0472008
             |
    disabled |
   Disabled  |  -.0254523   .0041929    -6.07   0.000    -.0336782   -.0172264
             |
        year#|
          c. |
prior_ela~re |
       2015  |    .077348   .0028604    27.04   0.000     .0717362    .0829599
       2016  |   .0678649   .0026631    25.48   0.000     .0626402    .0730895
       2017  |   .0744703   .0027766    26.82   0.000      .069023    .0799176
       2018  |   .0677795   .0037401    18.12   0.000     .0604418    .0751171
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0154428   .0015368   -10.05   0.000    -.0184578   -.0124277
       2016  |  -.0200471   .0014104   -14.21   0.000    -.0228141   -.0172802
       2017  |  -.0099618   .0015328    -6.50   0.000    -.0129691   -.0069545
       2018  |   -.011082   .0015442    -7.18   0.000    -.0141115   -.0080524
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0008674   .0005767    -1.50   0.133    -.0019987    .0002639
       2016  |   .0009971   .0005077     1.96   0.050     1.09e-06    .0019931
       2017  |  -.0022046   .0005239    -4.21   0.000    -.0032325   -.0011767
       2018  |  -.0042982   .0009259    -4.64   0.000    -.0061148   -.0024817
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0536036   .0025727    20.84   0.000     .0485562    .0586511
       2016  |   .0581938   .0026528    21.94   0.000     .0529894    .0633983
       2017  |   .0553775   .0028288    19.58   0.000     .0498278    .0609272
       2018  |   .0828781   .0037935    21.85   0.000     .0754357    .0903205
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |    -.00908   .0018663    -4.87   0.000    -.0127415   -.0054184
       2016  |  -.0130303   .0016694    -7.81   0.000    -.0163055    -.009755
       2017  |  -.0115456   .0018867    -6.12   0.000    -.0152472   -.0078441
       2018  |  -.0022513   .0015802    -1.42   0.154    -.0053514    .0008488
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   -.000847   .0006548    -1.29   0.196    -.0021316    .0004375
       2016  |   .0004407   .0006761     0.65   0.515    -.0008857    .0017672
       2017  |  -.0001724   .0007061    -0.24   0.807    -.0015578    .0012129
       2018  |  -.0059238    .000938    -6.32   0.000    -.0077642   -.0040835
             |
       _cons |   1.681255    .034135    49.25   0.000     1.614286    1.748224
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .7279527
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_og_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =     906.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1386
                                                Root MSE          =     .41305

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_og_dk |
          1  |   .0759287   .0025303    30.01   0.000     .0709646    .0808929
          2  |   .0797262   .0024858    32.07   0.000     .0748494    .0846031
          3  |   .0802465   .0028336    28.32   0.000     .0746873    .0858057
          4  |   .0731638   .0027108    26.99   0.000     .0678455    .0784822
          5  |   .0699126   .0026456    26.43   0.000     .0647223     .075103
          6  |   .0679446   .0026432    25.71   0.000     .0627591    .0731302
          7  |   .0603442   .0025417    23.74   0.000     .0553577    .0653307
          8  |   .0520982   .0023421    22.24   0.000     .0475032    .0566931
          9  |   .0415056   .0022058    18.82   0.000     .0371781     .045833
         10  |   .0292996   .0021199    13.82   0.000     .0251406    .0334586
             |
        year |
       2016  |   .0103823   .0042419     2.45   0.015     .0020602    .0187044
       2017  |  -.0183037   .0038989    -4.69   0.000    -.0259529   -.0106545
       2018  |  -.0275804   .0044555    -6.19   0.000    -.0363216   -.0188392
             |
         age |  -.0001445   5.70e-06   -25.35   0.000    -.0001557   -.0001333
             |
        male |
       Male  |  -.0692105   .0019219   -36.01   0.000    -.0729811     -.06544
 1.eth_asian |   .0507716   .0032005    15.86   0.000     .0444925    .0570506
1.eth_hisp~c |  -.0207148   .0027823    -7.45   0.000    -.0261734   -.0152562
 1.eth_black |   .0129224   .0048334     2.67   0.008     .0034399    .0224048
 1.eth_other |  -.0096457   .0038718    -2.49   0.013    -.0172417   -.0020497
             |
econ_disad~e |
Economic ..  |  -.0541227   .0021198   -25.53   0.000    -.0582814   -.0499639
             |
limited_en~f |
Limited E..  |  -.0554787   .0042956   -12.92   0.000    -.0639063   -.0470512
             |
    disabled |
   Disabled  |  -.0253824   .0041928    -6.05   0.000    -.0336082   -.0171565
             |
        year#|
          c. |
prior_ela~re |
       2015  |    .076035   .0028625    26.56   0.000     .0704191    .0816509
       2016  |   .0669589   .0026599    25.17   0.000     .0617405    .0721773
       2017  |   .0724676   .0028522    25.41   0.000     .0668718    .0780633
       2018  |   .0671011    .003742    17.93   0.000     .0597598    .0744424
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0164813   .0015334   -10.75   0.000    -.0194896   -.0134731
       2016  |  -.0209985   .0014039   -14.96   0.000    -.0237527   -.0182443
       2017  |  -.0109021   .0015299    -7.13   0.000    -.0139035   -.0079006
       2018  |  -.0123401   .0015375    -8.03   0.000    -.0153565   -.0093238
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   -.000727   .0005778    -1.26   0.209    -.0018607    .0004066
       2016  |   .0011022   .0005147     2.14   0.032     .0000924    .0021121
       2017  |  -.0019968   .0005264    -3.79   0.000    -.0030295   -.0009642
       2018  |   -.004608   .0009226    -4.99   0.000     -.006418    -.002798
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0544959   .0025513    21.36   0.000     .0494906    .0595012
       2016  |   .0587308   .0025723    22.83   0.000     .0536842    .0637774
       2017  |   .0570362   .0028265    20.18   0.000     .0514908    .0625815
       2018  |   .0840182   .0037582    22.36   0.000      .076645    .0913913
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0082608   .0018777    -4.40   0.000    -.0119446   -.0045769
       2016  |  -.0123563   .0016822    -7.35   0.000    -.0156566   -.0090559
       2017  |  -.0108136   .0018768    -5.76   0.000    -.0144957   -.0071315
       2018  |  -.0014452    .001587    -0.91   0.363    -.0045588    .0016684
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0010157   .0006585    -1.54   0.123    -.0023076    .0002763
       2016  |   .0003406   .0006741     0.51   0.614     -.000982    .0016632
       2017  |  -.0003809   .0006988    -0.55   0.586    -.0017518    .0009901
       2018  |  -.0058639   .0009435    -6.22   0.000    -.0077149   -.0040128
             |
       _cons |   1.680969   .0341204    49.27   0.000     1.614029    1.747909
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794765
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_og_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with acs controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =     771.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1366
                                                Root MSE          =     .41352

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_acs~k |
          1  |   .0715915   .0026489    27.03   0.000     .0663947    .0767883
          2  |   .0761424   .0025606    29.74   0.000     .0711188    .0811659
          3  |   .0717457   .0027547    26.04   0.000     .0663413    .0771501
          4  |   .0685779   .0028269    24.26   0.000     .0630318     .074124
          5  |   .0637257   .0026754    23.82   0.000     .0584768    .0689745
          6  |   .0600468   .0028943    20.75   0.000     .0543686    .0657251
          7  |   .0573528   .0024016    23.88   0.000     .0526411    .0620644
          8  |    .047695   .0024493    19.47   0.000     .0428897    .0525003
          9  |   .0387903   .0026058    14.89   0.000     .0336781    .0439025
         10  |   .0235414   .0019871    11.85   0.000     .0196431    .0274398
             |
        year |
       2016  |   .0100095   .0042417     2.36   0.018     .0016877    .0183312
       2017  |  -.0181807   .0038641    -4.70   0.000    -.0257617   -.0105997
       2018  |  -.0282931   .0044191    -6.40   0.000    -.0369628   -.0196234
             |
         age |  -.0001432   5.78e-06   -24.78   0.000    -.0001546   -.0001319
             |
        male |
       Male  |  -.0689783   .0019286   -35.77   0.000    -.0727621   -.0651946
 1.eth_asian |   .0541145   .0034846    15.53   0.000     .0472781    .0609508
1.eth_hisp~c |  -.0270665   .0029098    -9.30   0.000    -.0327751   -.0213579
 1.eth_black |    .007761    .004937     1.57   0.116    -.0019248    .0174469
 1.eth_other |   -.009658   .0039184    -2.46   0.014    -.0173455   -.0019706
             |
econ_disad~e |
Economic ..  |  -.0616301   .0022146   -27.83   0.000    -.0659748   -.0572854
             |
limited_en~f |
Limited E..  |  -.0532967   .0043996   -12.11   0.000    -.0619282   -.0446653
             |
    disabled |
   Disabled  |  -.0213428    .004256    -5.01   0.000    -.0296925   -.0129931
             |
        year#|
          c. |
prior_ela~re |
       2015  |    .078722   .0028622    27.50   0.000     .0731068    .0843373
       2016  |   .0690904   .0026893    25.69   0.000     .0638143    .0743665
       2017  |    .075742   .0028059    26.99   0.000     .0702373    .0812468
       2018  |   .0693192   .0037456    18.51   0.000     .0619708    .0766677
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   -.016465   .0015418   -10.68   0.000    -.0194899   -.0134401
       2016  |  -.0209449   .0014074   -14.88   0.000    -.0237061   -.0181838
       2017  |   -.011003   .0015438    -7.13   0.000    -.0140317   -.0079743
       2018  |  -.0121638   .0015471    -7.86   0.000     -.015199   -.0091286
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0008234   .0005789    -1.42   0.155    -.0019592    .0003124
       2016  |   .0010507   .0005136     2.05   0.041      .000043    .0020584
       2017  |  -.0021252   .0005285    -4.02   0.000    -.0031621   -.0010882
       2018  |  -.0045414    .000927    -4.90   0.000      -.00636   -.0027228
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0541496   .0025797    20.99   0.000     .0490886    .0592105
       2016  |   .0590163    .002668    22.12   0.000     .0537819    .0642506
       2017  |   .0558401   .0028418    19.65   0.000     .0502648    .0614153
       2018  |   .0842469   .0038048    22.14   0.000     .0767823    .0917114
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0097048   .0018738    -5.18   0.000    -.0133809   -.0060286
       2016  |  -.0136832   .0016756    -8.17   0.000    -.0169705   -.0103958
       2017  |  -.0118674   .0018935    -6.27   0.000    -.0155823   -.0081525
       2018  |  -.0024735   .0015818    -1.56   0.118    -.0055767    .0006298
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0007218   .0006571    -1.10   0.272     -.002011    .0005674
       2016  |   .0005486   .0006783     0.81   0.419    -.0007821    .0018793
       2017  |  -.0001216   .0007082    -0.17   0.864     -.001511    .0012678
       2018  |  -.0060074   .0009381    -6.40   0.000    -.0078478    -.004167
             |
       _cons |    1.67951   .0344442    48.76   0.000     1.611934    1.747086
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .7279527
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_acs_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =     766.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1366
                                                Root MSE          =     .41353

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_acs~k |
          1  |   .0700879    .002555    27.43   0.000     .0650753    .0751005
          2  |   .0754939   .0024829    30.41   0.000     .0706228    .0803651
          3  |   .0751012   .0028385    26.46   0.000     .0695324    .0806699
          4  |   .0686677   .0027127    25.31   0.000     .0633458    .0739897
          5  |   .0646443   .0026518    24.38   0.000     .0594417    .0698468
          6  |   .0619929   .0027992    22.15   0.000     .0565012    .0674846
          7  |   .0559692   .0026028    21.50   0.000     .0508629    .0610756
          8  |   .0475794   .0024789    19.19   0.000     .0427161    .0524428
          9  |   .0378059   .0023429    16.14   0.000     .0332095    .0424023
         10  |   .0282278   .0019577    14.42   0.000     .0243869    .0320687
             |
        year |
       2016  |   .0100939   .0042329     2.38   0.017     .0017894    .0183984
       2017  |  -.0180161    .003866    -4.66   0.000    -.0256006   -.0104315
       2018  |  -.0280001   .0044206    -6.33   0.000    -.0366728   -.0193273
             |
         age |  -.0001432   5.78e-06   -24.78   0.000    -.0001545   -.0001318
             |
        male |
       Male  |  -.0689138   .0019282   -35.74   0.000    -.0726967   -.0651309
 1.eth_asian |   .0544935   .0034848    15.64   0.000     .0476566    .0613303
1.eth_hisp~c |  -.0270454    .002907    -9.30   0.000    -.0327486   -.0213422
 1.eth_black |   .0079992   .0049346     1.62   0.105     -.001682    .0176803
 1.eth_other |  -.0094849    .003935    -2.41   0.016     -.017205   -.0017649
             |
econ_disad~e |
Economic ..  |  -.0615235   .0022096   -27.84   0.000    -.0658585   -.0571884
             |
limited_en~f |
Limited E..  |  -.0532681   .0044115   -12.07   0.000    -.0619229   -.0446133
             |
    disabled |
   Disabled  |  -.0213264   .0042559    -5.01   0.000    -.0296759   -.0129769
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0778378   .0028526    27.29   0.000     .0722412    .0834343
       2016  |   .0685359   .0026628    25.74   0.000     .0633118      .07376
       2017  |   .0743533   .0028621    25.98   0.000     .0687382    .0799683
       2018  |   .0685063   .0037432    18.30   0.000     .0611626      .07585
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0170526   .0015408   -11.07   0.000    -.0200755   -.0140297
       2016  |  -.0214515    .001406   -15.26   0.000    -.0242098   -.0186932
       2017  |  -.0114559   .0015354    -7.46   0.000    -.0144682   -.0084435
       2018  |  -.0128495   .0015419    -8.33   0.000    -.0158745   -.0098246
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0007145   .0005802    -1.23   0.218    -.0018528    .0004239
       2016  |   .0011257   .0005181     2.17   0.030     .0001092    .0021422
       2017  |  -.0019873   .0005282    -3.76   0.000    -.0030235   -.0009511
       2018  |  -.0046277    .000925    -5.00   0.000    -.0064425    -.002813
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0547892   .0025598    21.40   0.000     .0497672    .0598111
       2016  |   .0593713   .0025988    22.85   0.000     .0542727    .0644699
       2017  |   .0571227   .0028532    20.02   0.000     .0515251    .0627203
       2018  |   .0852743   .0037791    22.56   0.000     .0778601    .0926885
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0092144   .0018817    -4.90   0.000     -.012906   -.0055227
       2016  |  -.0133123   .0016821    -7.91   0.000    -.0166123   -.0100123
       2017  |  -.0115138   .0018854    -6.11   0.000    -.0152127    -.007815
       2018  |   -.002008   .0015866    -1.27   0.206    -.0051208    .0011048
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0008343   .0006597    -1.26   0.206    -.0021284    .0004599
       2016  |   .0004905   .0006763     0.73   0.468    -.0008363    .0018172
       2017  |  -.0002643   .0007018    -0.38   0.707    -.0016411    .0011125
       2018  |  -.0060308   .0009407    -6.41   0.000    -.0078764   -.0041852
             |
       _cons |   1.678831   .0344327    48.76   0.000     1.611278    1.746384
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794765
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_acs_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with sib controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =     909.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1387
                                                Root MSE          =     .41302

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_sib~k |
          1  |   .0771502   .0027142    28.42   0.000     .0718252    .0824752
          2  |   .0816625   .0024959    32.72   0.000     .0767659    .0865592
          3  |   .0771655   .0027313    28.25   0.000     .0718071    .0825239
          4  |   .0740625   .0027704    26.73   0.000     .0686273    .0794976
          5  |   .0691682   .0026003    26.60   0.000     .0640667    .0742697
          6  |   .0649496   .0027683    23.46   0.000     .0595186    .0703807
          7  |   .0620543   .0023053    26.92   0.000     .0575315    .0665772
          8  |   .0518048   .0023392    22.15   0.000     .0472155    .0563941
          9  |   .0414342   .0025493    16.25   0.000     .0364328    .0464355
         10  |   .0232601   .0020899    11.13   0.000       .01916    .0273602
             |
        year |
       2016  |   .0102207   .0042567     2.40   0.016     .0018695    .0185719
       2017  |  -.0185073   .0039004    -4.74   0.000    -.0261596   -.0108551
       2018  |    -.02819   .0044564    -6.33   0.000     -.036933    -.019447
             |
         age |  -.0001444   5.71e-06   -25.28   0.000    -.0001556   -.0001332
             |
        male |
       Male  |   -.069365     .00192   -36.13   0.000    -.0731319   -.0655981
 1.eth_asian |   .0502186    .003205    15.67   0.000     .0439308    .0565064
1.eth_hisp~c |  -.0206087   .0027817    -7.41   0.000    -.0260661   -.0151513
 1.eth_black |   .0125562   .0048382     2.60   0.010     .0030643    .0220482
 1.eth_other |  -.0098989   .0038559    -2.57   0.010    -.0174638    -.002334
             |
econ_disad~e |
Economic ..  |  -.0540175   .0021216   -25.46   0.000    -.0581798   -.0498551
             |
limited_en~f |
Limited E..  |  -.0555428   .0042839   -12.97   0.000    -.0639474   -.0471382
             |
    disabled |
   Disabled  |  -.0255201   .0041907    -6.09   0.000    -.0337418   -.0172984
             |
        year#|
          c. |
prior_ela~re |
       2015  |    .077309   .0028629    27.00   0.000     .0716924    .0829257
       2016  |    .067839   .0026635    25.47   0.000     .0626134    .0730645
       2017  |   .0744272   .0027758    26.81   0.000     .0689814     .079873
       2018  |   .0677781   .0037408    18.12   0.000      .060439    .0751172
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0154423    .001537   -10.05   0.000    -.0184577    -.012427
       2016  |  -.0200491   .0014106   -14.21   0.000    -.0228166   -.0172816
       2017  |  -.0099506   .0015323    -6.49   0.000    -.0129568   -.0069444
       2018  |  -.0110659   .0015435    -7.17   0.000    -.0140941   -.0080378
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0008651   .0005766    -1.50   0.134    -.0019964    .0002662
       2016  |   .0009989   .0005077     1.97   0.049     2.93e-06    .0019949
       2017  |  -.0022047   .0005237    -4.21   0.000    -.0032322   -.0011772
       2018  |  -.0042964   .0009256    -4.64   0.000    -.0061124   -.0024804
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0536079   .0025754    20.82   0.000     .0485553    .0586606
       2016  |   .0582241   .0026547    21.93   0.000     .0530159    .0634323
       2017  |   .0553902   .0028293    19.58   0.000     .0498394     .060941
       2018  |   .0828719   .0037938    21.84   0.000     .0754289    .0903148
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0090946   .0018669    -4.87   0.000    -.0127571    -.005432
       2016  |  -.0130238   .0016692    -7.80   0.000    -.0162986    -.009749
       2017  |  -.0115627   .0018872    -6.13   0.000    -.0152652   -.0078601
       2018  |  -.0022664   .0015804    -1.43   0.152    -.0053669    .0008341
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0008446   .0006548    -1.29   0.197    -.0021292    .0004401
       2016  |   .0004343   .0006761     0.64   0.521    -.0008921    .0017607
       2017  |  -.0001706   .0007064    -0.24   0.809    -.0015564    .0012152
       2018  |  -.0059287    .000938    -6.32   0.000     -.007769   -.0040884
             |
       _cons |   1.680639   .0341718    49.18   0.000     1.613597     1.74768
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .7279527
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_sib_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =     907.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1386
                                                Root MSE          =     .41305

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_sib~k |
          1  |   .0759759    .002534    29.98   0.000     .0710046    .0809472
          2  |   .0796996   .0024929    31.97   0.000     .0748088    .0845904
          3  |   .0801931   .0028425    28.21   0.000     .0746164    .0857698
          4  |   .0731435   .0027126    26.96   0.000     .0678217    .0784653
          5  |   .0698841   .0026536    26.34   0.000     .0646781    .0750901
          6  |   .0678926   .0026514    25.61   0.000     .0626909    .0730943
          7  |   .0603048   .0025479    23.67   0.000     .0553062    .0653035
          8  |   .0520605   .0023488    22.16   0.000     .0474524    .0566687
          9  |   .0415547   .0022083    18.82   0.000     .0372223     .045887
         10  |   .0293364   .0021325    13.76   0.000     .0251527    .0335201
             |
        year |
       2016  |    .010303   .0042441     2.43   0.015     .0019766    .0186294
       2017  |  -.0183558   .0039003    -4.71   0.000    -.0260077   -.0107039
       2018  |  -.0276645   .0044569    -6.21   0.000    -.0364084   -.0189205
             |
         age |  -.0001444   5.71e-06   -25.30   0.000    -.0001556   -.0001332
             |
        male |
       Male  |  -.0692156   .0019215   -36.02   0.000    -.0729853   -.0654459
 1.eth_asian |   .0507584    .003204    15.84   0.000     .0444725    .0570443
1.eth_hisp~c |  -.0206378   .0027784    -7.43   0.000    -.0260886   -.0151869
 1.eth_black |     .01293   .0048329     2.68   0.008     .0034484    .0224115
 1.eth_other |  -.0096912   .0038711    -2.50   0.012    -.0172857   -.0020966
             |
econ_disad~e |
Economic ..  |  -.0539606   .0021213   -25.44   0.000    -.0581224   -.0497988
             |
limited_en~f |
Limited E..  |  -.0554246   .0042988   -12.89   0.000    -.0638584   -.0469908
             |
    disabled |
   Disabled  |  -.0254541   .0041907    -6.07   0.000    -.0336758   -.0172323
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0760092   .0028645    26.53   0.000     .0703894    .0816291
       2016  |   .0669284   .0026604    25.16   0.000     .0617089    .0721479
       2017  |   .0724189   .0028513    25.40   0.000      .066825    .0780127
       2018  |   .0670987   .0037424    17.93   0.000     .0597565     .074441
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0164789   .0015335   -10.75   0.000    -.0194875   -.0134703
       2016  |  -.0210025    .001404   -14.96   0.000     -.023757    -.018248
       2017  |  -.0108969   .0015294    -7.12   0.000    -.0138974   -.0078964
       2018  |  -.0123305    .001537    -8.02   0.000    -.0153459   -.0093151
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0007276   .0005778    -1.26   0.208    -.0018611    .0004059
       2016  |   .0011034   .0005148     2.14   0.032     .0000935    .0021134
       2017  |  -.0019969   .0005262    -3.80   0.000    -.0030292   -.0009646
       2018  |  -.0046104   .0009223    -5.00   0.000    -.0064197    -.002801
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0544838   .0025526    21.34   0.000     .0494759    .0594918
       2016  |   .0587563   .0025733    22.83   0.000     .0537077    .0638049
       2017  |   .0570523   .0028267    20.18   0.000     .0515066    .0625979
       2018  |   .0840188   .0037581    22.36   0.000     .0766458    .0913918
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0082711   .0018781    -4.40   0.000    -.0119557   -.0045866
       2016  |  -.0123418   .0016817    -7.34   0.000     -.015641   -.0090425
       2017  |  -.0108224   .0018775    -5.76   0.000    -.0145059    -.007139
       2018  |   -.001453   .0015871    -0.92   0.360    -.0045668    .0016608
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   -.001013   .0006584    -1.54   0.124    -.0023048    .0002788
       2016  |   .0003328   .0006739     0.49   0.622    -.0009894    .0016549
       2017  |  -.0003808   .0006991    -0.54   0.586    -.0017524    .0009907
       2018  |  -.0058691   .0009435    -6.22   0.000    -.0077202    -.004018
             |
       _cons |   1.680354   .0341565    49.20   0.000     1.613343    1.747365
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794765
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_sib_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with both controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =     773.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1366
                                                Root MSE          =     .41352

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_bot~k |
          1  |   .0715338   .0026633    26.86   0.000     .0663087    .0767589
          2  |   .0761431   .0025609    29.73   0.000     .0711189    .0811672
          3  |   .0717141   .0027547    26.03   0.000     .0663098    .0771185
          4  |   .0685237   .0028291    24.22   0.000     .0629733     .074074
          5  |   .0637256    .002675    23.82   0.000     .0584776    .0689736
          6  |   .0600008   .0028982    20.70   0.000     .0543149    .0656867
          7  |   .0573098   .0023999    23.88   0.000     .0526014    .0620182
          8  |   .0476668   .0024533    19.43   0.000     .0428536    .0524799
          9  |   .0388061   .0026067    14.89   0.000      .033692    .0439202
         10  |   .0236136   .0019895    11.87   0.000     .0197105    .0275166
             |
        year |
       2016  |   .0099367   .0042455     2.34   0.019     .0016076    .0182659
       2017  |  -.0182356   .0038659    -4.72   0.000    -.0258201    -.010651
       2018  |  -.0283819   .0044214    -6.42   0.000    -.0370562   -.0197076
             |
         age |  -.0001432   5.79e-06   -24.74   0.000    -.0001545   -.0001318
             |
        male |
       Male  |   -.068983   .0019283   -35.77   0.000    -.0727661      -.0652
 1.eth_asian |   .0541686   .0034855    15.54   0.000     .0473304    .0610068
1.eth_hisp~c |  -.0270321   .0029056    -9.30   0.000    -.0327326   -.0213316
 1.eth_black |   .0077634   .0049365     1.57   0.116    -.0019215    .0174484
 1.eth_other |  -.0096804   .0039181    -2.47   0.014    -.0173673   -.0019935
             |
econ_disad~e |
Economic ..  |  -.0614489   .0022142   -27.75   0.000    -.0657929    -.057105
             |
limited_en~f |
Limited E..  |   -.053226   .0044031   -12.09   0.000    -.0618644   -.0445876
             |
    disabled |
   Disabled  |  -.0213997   .0042539    -5.03   0.000    -.0297453    -.013054
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0786871   .0028644    27.47   0.000     .0730674    .0843068
       2016  |   .0690689   .0026898    25.68   0.000     .0637919    .0743459
       2017  |   .0757058   .0028056    26.98   0.000     .0702015    .0812101
       2018  |   .0693115   .0037463    18.50   0.000     .0619617    .0766614
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0164689   .0015418   -10.68   0.000    -.0194937   -.0134441
       2016  |   -.020951   .0014077   -14.88   0.000    -.0237127   -.0181894
       2017  |  -.0109971   .0015431    -7.13   0.000    -.0140245   -.0079696
       2018  |  -.0121514   .0015463    -7.86   0.000    -.0151851   -.0091177
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0008209   .0005789    -1.42   0.156    -.0019566    .0003149
       2016  |   .0010528   .0005136     2.05   0.041     .0000451    .0020604
       2017  |  -.0021248   .0005283    -4.02   0.000    -.0031614   -.0010883
       2018  |  -.0045394   .0009267    -4.90   0.000    -.0063575   -.0027212
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0541521   .0025822    20.97   0.000      .049086    .0592181
       2016  |   .0590448   .0026697    22.12   0.000     .0538071    .0642825
       2017  |   .0558472   .0028422    19.65   0.000      .050271    .0614233
       2018  |   .0842471    .003805    22.14   0.000      .076782    .0917121
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0097215   .0018743    -5.19   0.000    -.0133987   -.0060444
       2016  |  -.0136803   .0016753    -8.17   0.000    -.0169671   -.0103935
       2017  |  -.0118843   .0018941    -6.27   0.000    -.0156003   -.0081682
       2018  |  -.0024916   .0015819    -1.58   0.115    -.0055951    .0006118
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0007187   .0006571    -1.09   0.274    -.0020079    .0005705
       2016  |   .0005429   .0006782     0.80   0.424    -.0007877    .0018735
       2017  |  -.0001198   .0007084    -0.17   0.866    -.0015096    .0012701
       2018  |  -.0060123    .000938    -6.41   0.000    -.0078526    -.004172
             |
       _cons |   1.678944   .0344725    48.70   0.000     1.611313    1.746575
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .7279527
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_both_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =     769.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1366
                                                Root MSE          =     .41353

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_bot~k |
          1  |   .0701451    .002555    27.45   0.000     .0651324    .0751578
          2  |   .0754657   .0024888    30.32   0.000      .070583    .0803484
          3  |   .0750461   .0028417    26.41   0.000     .0694709    .0806212
          4  |   .0686444   .0027148    25.29   0.000     .0633183    .0739705
          5  |   .0645996   .0026575    24.31   0.000     .0593858    .0698134
          6  |   .0619238   .0028046    22.08   0.000     .0564215     .067426
          7  |   .0559236    .002602    21.49   0.000     .0508188    .0610283
          8  |    .047537   .0024801    19.17   0.000     .0426713    .0524028
          9  |   .0378563   .0023411    16.17   0.000     .0332633    .0424493
         10  |   .0282806    .001966    14.38   0.000     .0244236    .0321376
             |
        year |
       2016  |   .0100178   .0042363     2.36   0.018     .0017067    .0183289
       2017  |  -.0180694   .0038676    -4.67   0.000    -.0256572   -.0104817
       2018  |  -.0280838   .0044228    -6.35   0.000    -.0367608   -.0194068
             |
         age |  -.0001431   5.78e-06   -24.74   0.000    -.0001544   -.0001317
             |
        male |
       Male  |  -.0689179   .0019278   -35.75   0.000    -.0727001   -.0651357
 1.eth_asian |   .0545478   .0034861    15.65   0.000     .0477085    .0613871
1.eth_hisp~c |  -.0270092   .0029028    -9.30   0.000    -.0327043   -.0213142
 1.eth_black |   .0080041   .0049341     1.62   0.105     -.001676    .0176842
 1.eth_other |  -.0095059   .0039347    -2.42   0.016    -.0172254   -.0017865
             |
econ_disad~e |
Economic ..  |  -.0613455   .0022094   -27.77   0.000    -.0656801   -.0570108
             |
limited_en~f |
Limited E..  |  -.0532017   .0044151   -12.05   0.000    -.0618637   -.0445397
             |
    disabled |
   Disabled  |  -.0213876   .0042539    -5.03   0.000    -.0297332    -.013042
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0778186   .0028545    27.26   0.000     .0722185    .0834187
       2016  |   .0685131   .0026631    25.73   0.000     .0632883    .0737378
       2017  |   .0743123   .0028614    25.97   0.000     .0686985    .0799261
       2018  |   .0684979   .0037435    18.30   0.000     .0611535    .0758423
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0170536   .0015409   -11.07   0.000    -.0200766   -.0140306
       2016  |  -.0214577   .0014062   -15.26   0.000    -.0242165    -.018699
       2017  |  -.0114554   .0015349    -7.46   0.000    -.0144666   -.0084442
       2018  |  -.0128425   .0015414    -8.33   0.000    -.0158665   -.0098185
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0007149   .0005802    -1.23   0.218    -.0018532    .0004233
       2016  |   .0011268   .0005182     2.17   0.030     .0001102    .0021434
       2017  |  -.0019868    .000528    -3.76   0.000    -.0030227    -.000951
       2018  |  -.0046293   .0009247    -5.01   0.000    -.0064435   -.0028151
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0547734   .0025611    21.39   0.000     .0497488    .0597981
       2016  |   .0593938   .0025997    22.85   0.000     .0542935     .064494
       2017  |   .0571335   .0028534    20.02   0.000     .0515354    .0627315
       2018  |   .0852808    .003779    22.57   0.000     .0778668    .0926948
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0092289   .0018821    -4.90   0.000    -.0129214   -.0055365
       2016  |  -.0133032   .0016815    -7.91   0.000    -.0166021   -.0100044
       2017  |  -.0115248   .0018862    -6.11   0.000    -.0152252   -.0078243
       2018  |  -.0020203   .0015867    -1.27   0.203    -.0051333    .0010926
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0008303   .0006596    -1.26   0.208    -.0021244    .0004637
       2016  |   .0004839   .0006761     0.72   0.474    -.0008424    .0018102
       2017  |  -.0002638   .0007021    -0.38   0.707    -.0016413    .0011137
       2018  |  -.0060359   .0009407    -6.42   0.000    -.0078814   -.0041905
             |
       _cons |   1.678272   .0344604    48.70   0.000     1.610664    1.745879
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72794765
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_both_dk_x_prior_math.ster saved
LHS = enr_2year
RHS DK VA: Deep Knowledge VA with og controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =     677.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0882
                                                Root MSE          =     .45856

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
~2year_og_dk |
          1  |   .0805226   .0032702    24.62   0.000     .0741068    .0869384
          2  |     .09735   .0027444    35.47   0.000     .0919658    .1027341
          3  |   .1006393    .002684    37.50   0.000     .0953735     .105905
          4  |   .1023728   .0026345    38.86   0.000     .0972042    .1075414
          5  |   .1080264   .0026328    41.03   0.000     .1028612    .1131916
          6  |   .0986189   .0024476    40.29   0.000     .0938171    .1034208
          7  |   .1024463   .0022883    44.77   0.000     .0979569    .1069357
          8  |   .0867311   .0026664    32.53   0.000        .0815    .0919622
          9  |   .0791744   .0026817    29.52   0.000     .0739132    .0844356
         10  |   .0574802   .0021716    26.47   0.000     .0532197    .0617407
             |
        year |
       2016  |  -.0077317   .0049939    -1.55   0.122    -.0175291    .0020657
       2017  |  -.0386732   .0039776    -9.72   0.000    -.0464768   -.0308695
       2018  |  -.0105503   .0050031    -2.11   0.035    -.0203659   -.0007348
             |
         age |  -.0000682   5.64e-06   -12.09   0.000    -.0000793   -.0000572
             |
        male |
       Male  |   .0204996   .0020007    10.25   0.000     .0165744    .0244247
 1.eth_asian |  -.0224917   .0034547    -6.51   0.000    -.0292695   -.0157139
1.eth_hisp~c |   .0108701   .0027248     3.99   0.000     .0055244    .0162158
 1.eth_black |  -.0141315   .0047573    -2.97   0.003    -.0234647   -.0047983
 1.eth_other |  -.0010767   .0045491    -0.24   0.813    -.0100015     .007848
             |
econ_disad~e |
Economic ..  |  -.0103281   .0021329    -4.84   0.000    -.0145126   -.0061437
             |
limited_en~f |
Limited E..  |  -.0364123   .0043867    -8.30   0.000    -.0450185   -.0278062
             |
    disabled |
   Disabled  |   .0313162   .0048924     6.40   0.000     .0217179    .0409145
             |
        year#|
          c. |
prior_ela~re |
       2015  |   -.064195   .0032362   -19.84   0.000    -.0705441   -.0578459
       2016  |  -.0570804    .002971   -19.21   0.000    -.0629091   -.0512517
       2017  |  -.0514299   .0031012   -16.58   0.000    -.0575142   -.0453456
       2018  |  -.0283037   .0039323    -7.20   0.000    -.0360185    -.020589
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0390001   .0015584   -25.03   0.000    -.0420576   -.0359427
       2016  |  -.0374055   .0015475   -24.17   0.000    -.0404415   -.0343694
       2017  |  -.0277304   .0016206   -17.11   0.000    -.0309098    -.024551
       2018  |  -.0307769   .0016124   -19.09   0.000    -.0339401   -.0276136
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |      .0107   .0006209    17.23   0.000     .0094817    .0119182
       2016  |   .0104128   .0005192    20.06   0.000     .0093942    .0114314
       2017  |   .0078006    .000561    13.90   0.000     .0066999    .0089013
       2018  |   .0046455   .0010089     4.60   0.000     .0026661    .0066249
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0663532   .0031687   -20.94   0.000    -.0725698   -.0601367
       2016  |  -.0685792   .0033405   -20.53   0.000    -.0751329   -.0620255
       2017  |  -.0680972   .0034036   -20.01   0.000    -.0747747   -.0614197
       2018  |   -.058144   .0042589   -13.65   0.000    -.0664995   -.0497885
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0257839   .0020175   -12.78   0.000    -.0297421   -.0218257
       2016  |  -.0307694   .0019126   -16.09   0.000    -.0345217   -.0270172
       2017  |  -.0238848    .002014   -11.86   0.000     -.027836   -.0199336
       2018  |   -.033686   .0016745   -20.12   0.000    -.0369712   -.0304007
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0090156   .0007278    12.39   0.000     .0075878    .0104434
       2016  |   .0110215   .0007736    14.25   0.000     .0095037    .0125393
       2017  |   .0086236   .0007908    10.90   0.000     .0070721    .0101751
       2018  |   .0033627   .0010395     3.23   0.001     .0013233    .0054021
             |
       _cons |   .8575228   .0346344    24.76   0.000      .789574    .9254716
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070194
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_og_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =     674.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0883
                                                Root MSE          =     .45853

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
~2year_og_dk |
          1  |   .0805536   .0031119    25.89   0.000     .0744484    .0866588
          2  |   .0941096   .0026303    35.78   0.000     .0889492      .09927
          3  |   .1057828   .0026629    39.72   0.000     .1005585    .1110071
          4  |   .1042424   .0028166    37.01   0.000     .0987165    .1097682
          5  |   .1026769   .0026751    38.38   0.000     .0974288    .1079251
          6  |   .1006845     .00231    43.59   0.000     .0961526    .1052164
          7  |   .1031155   .0025093    41.09   0.000     .0981925    .1080385
          8  |    .091446   .0023381    39.11   0.000     .0868588    .0960331
          9  |    .080138   .0028455    28.16   0.000     .0745554    .0857206
         10  |   .0543601   .0021397    25.41   0.000     .0501622     .058558
             |
        year |
       2016  |  -.0075524   .0050161    -1.51   0.132    -.0173935    .0022887
       2017  |  -.0384788   .0039873    -9.65   0.000    -.0463015   -.0306561
       2018  |  -.0103719     .00502    -2.07   0.039    -.0202206   -.0005231
             |
         age |  -.0000682   5.64e-06   -12.09   0.000    -.0000793   -.0000571
             |
        male |
       Male  |     .02047   .0019968    10.25   0.000     .0165525    .0243875
 1.eth_asian |  -.0223954   .0034884    -6.42   0.000    -.0292393   -.0155515
1.eth_hisp~c |   .0107838   .0027267     3.95   0.000     .0054342    .0161334
 1.eth_black |  -.0139293   .0047564    -2.93   0.003    -.0232608   -.0045977
 1.eth_other |  -.0009671   .0045414    -0.21   0.831    -.0098768    .0079426
             |
econ_disad~e |
Economic ..  |  -.0103366   .0021346    -4.84   0.000    -.0145246   -.0061487
             |
limited_en~f |
Limited E..  |   -.036412   .0043836    -8.31   0.000    -.0450122   -.0278118
             |
    disabled |
   Disabled  |   .0314547   .0048873     6.44   0.000     .0218663    .0410431
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0664075   .0032289   -20.57   0.000    -.0727421   -.0600729
       2016  |  -.0588336   .0029381   -20.02   0.000    -.0645979   -.0530694
       2017  |  -.0532172   .0031296   -17.00   0.000    -.0593572   -.0470772
       2018  |   -.029555   .0039065    -7.57   0.000    -.0372191   -.0218909
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0391587   .0016047   -24.40   0.000    -.0423069   -.0360105
       2016  |  -.0373654   .0015763   -23.71   0.000    -.0404579    -.034273
       2017  |  -.0280855   .0016114   -17.43   0.000     -.031247   -.0249241
       2018  |  -.0311455   .0016084   -19.36   0.000     -.034301   -.0279901
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107314   .0006208    17.29   0.000     .0095135    .0119493
       2016  |    .010421   .0005182    20.11   0.000     .0094044    .0114376
       2017  |   .0078886   .0005638    13.99   0.000     .0067825    .0089947
       2018  |   .0045855   .0010134     4.52   0.000     .0025973    .0065737
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0645966   .0031542   -20.48   0.000    -.0707848   -.0584084
       2016  |   -.066992    .003342   -20.05   0.000    -.0735485   -.0604354
       2017  |  -.0664949   .0033661   -19.75   0.000    -.0730988   -.0598909
       2018  |  -.0569117   .0042807   -13.30   0.000    -.0653098   -.0485135
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0256869   .0019739   -13.01   0.000    -.0295595   -.0218143
       2016  |  -.0308948     .00188   -16.43   0.000    -.0345831   -.0272066
       2017  |  -.0236037   .0019877   -11.87   0.000    -.0275034   -.0197039
       2018  |  -.0334526   .0016459   -20.32   0.000    -.0366817   -.0302235
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0090235   .0007198    12.54   0.000     .0076113    .0104356
       2016  |    .011069     .00077    14.38   0.000     .0095583    .0125796
       2017  |   .0086073   .0007824    11.00   0.000     .0070722    .0101424
       2018  |   .0034061   .0010317     3.30   0.001     .0013821    .0054301
             |
       _cons |   .8572561   .0346395    24.75   0.000     .7892974    .9252148
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36069943
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_og_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with acs controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =     534.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0844
                                                Root MSE          =     .45951

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_2ye.. |
          1  |   .0754807   .0033916    22.26   0.000     .0688268    .0821347
          2  |   .0919851   .0031015    29.66   0.000     .0859002    .0980699
          3  |     .09348   .0029262    31.95   0.000     .0877391    .0992209
          4  |   .0948924   .0028836    32.91   0.000     .0892351    .1005496
          5  |   .1008181   .0028507    35.37   0.000     .0952253    .1064109
          6  |   .0919201    .002631    34.94   0.000     .0867584    .0970818
          7  |   .0957062   .0025288    37.85   0.000     .0907449    .1006674
          8  |   .0802301   .0028105    28.55   0.000     .0747162     .085744
          9  |   .0734327   .0029345    25.02   0.000     .0676755    .0791899
         10  |   .0544352   .0024466    22.25   0.000     .0496353    .0592352
             |
        year |
       2016  |  -.0077149   .0050392    -1.53   0.126    -.0176012    .0021714
       2017  |  -.0386174   .0040323    -9.58   0.000    -.0465284   -.0307064
       2018  |   -.010453   .0050314    -2.08   0.038    -.0203241   -.0005819
             |
         age |  -.0000688   5.75e-06   -11.96   0.000      -.00008   -.0000575
             |
        male |
       Male  |   .0208194   .0020017    10.40   0.000     .0168922    .0247465
 1.eth_asian |  -.0155775   .0038711    -4.02   0.000    -.0231723   -.0079828
1.eth_hisp~c |   .0031294   .0030853     1.01   0.311    -.0029236    .0091823
 1.eth_black |   -.023024   .0049382    -4.66   0.000    -.0327122   -.0133358
 1.eth_other |   .0003437    .004608     0.07   0.941    -.0086967     .009384
             |
econ_disad~e |
Economic ..  |  -.0121047   .0022611    -5.35   0.000    -.0165407   -.0076688
             |
limited_en~f |
Limited E..  |  -.0331189   .0045718    -7.24   0.000    -.0420883   -.0241494
             |
    disabled |
   Disabled  |   .0324998   .0048617     6.68   0.000     .0229616    .0420379
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0631909   .0032433   -19.48   0.000    -.0695538   -.0568279
       2016  |  -.0560228   .0029977   -18.69   0.000    -.0619039   -.0501418
       2017  |  -.0509248   .0031533   -16.15   0.000    -.0571112   -.0447385
       2018  |   -.028342   .0039826    -7.12   0.000    -.0361553   -.0205287
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0399222   .0015613   -25.57   0.000    -.0429852   -.0368592
       2016  |   -.038291   .0015607   -24.54   0.000    -.0413529   -.0352292
       2017  |  -.0288031   .0016166   -17.82   0.000    -.0319747   -.0256315
       2018  |  -.0314748   .0016171   -19.46   0.000    -.0346474   -.0283022
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107257   .0006246    17.17   0.000     .0095002    .0119511
       2016  |   .0104473   .0005244    19.92   0.000     .0094184    .0114762
       2017  |   .0079302   .0005629    14.09   0.000     .0068259    .0090345
       2018  |   .0045942   .0010133     4.53   0.000     .0026062    .0065822
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0666842   .0031708   -21.03   0.000     -.072905   -.0604635
       2016  |  -.0688398   .0033864   -20.33   0.000    -.0754835   -.0621961
       2017  |   -.068602   .0034245   -20.03   0.000    -.0753205   -.0618835
       2018  |  -.0570241   .0043409   -13.14   0.000    -.0655405   -.0485078
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0268958   .0020217   -13.30   0.000    -.0308622   -.0229294
       2016  |  -.0318373   .0019215   -16.57   0.000     -.035607   -.0280676
       2017  |  -.0244992   .0020279   -12.08   0.000    -.0284777   -.0205206
       2018  |  -.0345461   .0016839   -20.52   0.000    -.0378497   -.0312425
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0092696   .0007298    12.70   0.000     .0078378    .0107014
       2016  |   .0112418   .0007792    14.43   0.000     .0097131    .0127705
       2017  |   .0087409   .0007946    11.00   0.000      .007182    .0102999
       2018  |   .0031237   .0010437     2.99   0.003      .001076    .0051713
             |
       _cons |   .8657961   .0352065    24.59   0.000     .7967251    .9348671
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070194
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_acs_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =     517.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0845
                                                Root MSE          =     .45949

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_2ye.. |
          1  |   .0757565   .0033377    22.70   0.000     .0692083    .0823047
          2  |   .0886864   .0028874    30.72   0.000     .0830217    .0943511
          3  |   .0994816     .00285    34.91   0.000     .0938902     .105073
          4  |   .0971627   .0029473    32.97   0.000     .0913804    .1029449
          5  |   .0954907   .0027832    34.31   0.000     .0900304    .1009509
          6  |   .0930184   .0026666    34.88   0.000     .0877869    .0982499
          7  |   .0955793   .0027551    34.69   0.000     .0901742    .1009844
          8  |   .0847981   .0025627    33.09   0.000     .0797704    .0898257
          9  |   .0745678   .0031574    23.62   0.000     .0683733    .0807624
         10  |   .0513582   .0024862    20.66   0.000     .0464806    .0562358
             |
        year |
       2016  |  -.0075528   .0050584    -1.49   0.136    -.0174768    .0023712
       2017  |  -.0384203   .0040423    -9.50   0.000    -.0463509   -.0304897
       2018  |  -.0103288   .0050457    -2.05   0.041    -.0202279   -.0004296
             |
         age |  -.0000687   5.75e-06   -11.96   0.000      -.00008   -.0000574
             |
        male |
       Male  |   .0208092   .0019993    10.41   0.000     .0168868    .0247316
 1.eth_asian |   -.015634   .0038936    -4.02   0.000    -.0232729   -.0079951
1.eth_hisp~c |   .0030524    .003088     0.99   0.323     -.003006    .0091107
 1.eth_black |  -.0228366   .0049399    -4.62   0.000     -.032528   -.0131452
 1.eth_other |   .0004774   .0046014     0.10   0.917      -.00855    .0095048
             |
econ_disad~e |
Economic ..  |   -.012113   .0022659    -5.35   0.000    -.0165584   -.0076677
             |
limited_en~f |
Limited E..  |  -.0331267   .0045645    -7.26   0.000    -.0420818   -.0241716
             |
    disabled |
   Disabled  |   .0325871   .0048599     6.71   0.000     .0230524    .0421217
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0648054   .0032283   -20.07   0.000    -.0711389   -.0584718
       2016  |  -.0572072   .0029634   -19.30   0.000    -.0630211   -.0513934
       2017  |  -.0522464   .0031857   -16.40   0.000    -.0584964   -.0459963
       2018  |  -.0292351   .0039533    -7.40   0.000    -.0369911   -.0214791
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0400395   .0015986   -25.05   0.000    -.0431759   -.0369032
       2016  |  -.0382177   .0015799   -24.19   0.000    -.0413174   -.0351181
       2017  |  -.0291039   .0016136   -18.04   0.000    -.0322697   -.0259382
       2018  |  -.0317228   .0016147   -19.65   0.000    -.0348907   -.0285549
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107488   .0006225    17.27   0.000     .0095276      .01197
       2016  |   .0104452   .0005221    20.01   0.000     .0094209    .0114695
       2017  |   .0080099   .0005657    14.16   0.000     .0069002    .0091197
       2018  |   .0045859   .0010162     4.51   0.000     .0025922    .0065797
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0653859   .0031665   -20.65   0.000    -.0715982   -.0591736
       2016  |  -.0676993   .0033813   -20.02   0.000    -.0743331   -.0610656
       2017  |  -.0673627   .0033996   -19.82   0.000    -.0740322   -.0606931
       2018  |  -.0562387   .0043551   -12.91   0.000    -.0647829   -.0476946
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0267971   .0019816   -13.52   0.000    -.0306848   -.0229094
       2016  |  -.0319394   .0018916   -16.88   0.000    -.0356506   -.0282282
       2017  |    -.02427   .0020113   -12.07   0.000    -.0282159   -.0203241
       2018  |  -.0343986   .0016603   -20.72   0.000    -.0376558   -.0311413
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0092624   .0007216    12.84   0.000     .0078466    .0106781
       2016  |   .0112684    .000776    14.52   0.000     .0097458    .0127909
       2017  |   .0087155   .0007887    11.05   0.000     .0071681    .0102629
       2018  |   .0031319   .0010382     3.02   0.003      .001095    .0051688
             |
       _cons |   .8655304   .0352078    24.58   0.000     .7964567    .9346041
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36069943
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_acs_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with sib controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =     669.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0881
                                                Root MSE          =     .45858

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_2ye.. |
          1  |   .0806509   .0032681    24.68   0.000     .0742393    .0870625
          2  |   .0974901   .0027424    35.55   0.000     .0921098    .1028704
          3  |    .100616   .0026868    37.45   0.000     .0953447    .1058873
          4  |   .1022617   .0026329    38.84   0.000     .0970963    .1074271
          5  |   .1079122   .0026444    40.81   0.000     .1027242    .1131001
          6  |   .0984479   .0024673    39.90   0.000     .0936073    .1032885
          7  |   .1023385    .002294    44.61   0.000      .097838     .106839
          8  |   .0865908   .0026801    32.31   0.000     .0813328    .0918489
          9  |   .0789628   .0026945    29.31   0.000     .0736765    .0842492
         10  |    .057341   .0021776    26.33   0.000     .0530687    .0616132
             |
        year |
       2016  |  -.0077173   .0050096    -1.54   0.124    -.0175456    .0021109
       2017  |  -.0386923   .0039693    -9.75   0.000    -.0464797   -.0309049
       2018  |  -.0105409   .0049984    -2.11   0.035    -.0203472   -.0007346
             |
         age |  -.0000683   5.64e-06   -12.10   0.000    -.0000793   -.0000572
             |
        male |
       Male  |   .0204883   .0020007    10.24   0.000     .0165631    .0244134
 1.eth_asian |  -.0223662   .0034619    -6.46   0.000    -.0291579   -.0155744
1.eth_hisp~c |   .0109132   .0027222     4.01   0.000     .0055726    .0162539
 1.eth_black |  -.0141179   .0047601    -2.97   0.003    -.0234566   -.0047791
 1.eth_other |  -.0008706   .0045469    -0.19   0.848    -.0097911      .00805
             |
econ_disad~e |
Economic ..  |  -.0101981   .0021353    -4.78   0.000    -.0143874   -.0060088
             |
limited_en~f |
Limited E..  |    -.03637   .0043873    -8.29   0.000    -.0449775   -.0277626
             |
    disabled |
   Disabled  |    .031262     .00489     6.39   0.000     .0216684    .0408555
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0642111   .0032388   -19.83   0.000    -.0705652    -.057857
       2016  |  -.0571377   .0029694   -19.24   0.000    -.0629633   -.0513121
       2017  |   -.051502   .0031019   -16.60   0.000    -.0575875   -.0454165
       2018  |  -.0283595   .0039313    -7.21   0.000    -.0360723   -.0206467
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   -.038986   .0015582   -25.02   0.000    -.0420429    -.035929
       2016  |  -.0374031   .0015469   -24.18   0.000    -.0404379   -.0343682
       2017  |  -.0277269     .00162   -17.12   0.000    -.0309052   -.0245486
       2018  |  -.0307797   .0016124   -19.09   0.000    -.0339431   -.0276163
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0106961    .000621    17.23   0.000     .0094779    .0119143
       2016  |   .0104176   .0005191    20.07   0.000     .0093992     .011436
       2017  |   .0078076   .0005609    13.92   0.000     .0067071    .0089081
       2018  |   .0046544   .0010084     4.62   0.000     .0026759    .0066328
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0663941     .00317   -20.94   0.000    -.0726132    -.060175
       2016  |  -.0686651   .0033419   -20.55   0.000    -.0752216   -.0621086
       2017  |  -.0681435   .0034026   -20.03   0.000     -.074819   -.0614679
       2018  |  -.0581887   .0042593   -13.66   0.000     -.066545   -.0498324
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0257885   .0020184   -12.78   0.000    -.0297483   -.0218286
       2016  |  -.0307687   .0019135   -16.08   0.000    -.0345227   -.0270147
       2017  |  -.0238916   .0020143   -11.86   0.000    -.0278435   -.0199398
       2018  |  -.0336969   .0016747   -20.12   0.000    -.0369825   -.0304114
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0090219   .0007282    12.39   0.000     .0075933    .0104506
       2016  |   .0110245   .0007741    14.24   0.000     .0095059    .0125431
       2017  |   .0086317   .0007911    10.91   0.000     .0070797    .0101838
       2018  |   .0033663   .0010398     3.24   0.001     .0013263    .0054063
             |
       _cons |   .8575965   .0346067    24.78   0.000     .7897021    .9254909
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070194
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_sib_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =     667.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0883
                                                Root MSE          =     .45855

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_2ye.. |
          1  |   .0806626   .0031164    25.88   0.000     .0745486    .0867767
          2  |   .0942315   .0026246    35.90   0.000     .0890824    .0993807
          3  |   .1057522   .0026627    39.72   0.000     .1005284     .110976
          4  |   .1042519   .0028232    36.93   0.000     .0987131    .1097908
          5  |   .1025815   .0026874    38.17   0.000     .0973092    .1078538
          6  |   .1005768   .0023244    43.27   0.000     .0960166     .105137
          7  |   .1030564   .0025281    40.77   0.000     .0980967    .1080162
          8  |   .0912234   .0023583    38.68   0.000     .0865966    .0958501
          9  |   .0799299   .0028471    28.07   0.000     .0743442    .0855156
         10  |   .0541817    .002145    25.26   0.000     .0499736    .0583899
             |
        year |
       2016  |  -.0075376   .0050321    -1.50   0.134      -.01741    .0023347
       2017  |  -.0385008   .0039791    -9.68   0.000    -.0463073   -.0306943
       2018  |  -.0103618   .0050154    -2.07   0.039    -.0202014   -.0005223
             |
         age |  -.0000682   5.64e-06   -12.10   0.000    -.0000793   -.0000571
             |
        male |
       Male  |   .0204578   .0019968    10.25   0.000     .0165403    .0243753
 1.eth_asian |  -.0222685   .0034963    -6.37   0.000    -.0291278   -.0154093
1.eth_hisp~c |   .0108267   .0027243     3.97   0.000     .0054818    .0161715
 1.eth_black |  -.0139054   .0047592    -2.92   0.004    -.0232424   -.0045685
 1.eth_other |  -.0007575   .0045393    -0.17   0.867    -.0096632    .0081481
             |
econ_disad~e |
Economic ..  |  -.0102046   .0021372    -4.77   0.000    -.0143975   -.0060116
             |
limited_en~f |
Limited E..  |  -.0363665   .0043843    -8.29   0.000    -.0449681    -.027765
             |
    disabled |
   Disabled  |    .031399    .004885     6.43   0.000     .0218152    .0409828
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0664342   .0032315   -20.56   0.000     -.072774   -.0600945
       2016  |   -.058908   .0029363   -20.06   0.000    -.0646687   -.0531472
       2017  |  -.0533153   .0031312   -17.03   0.000    -.0594584   -.0471722
       2018  |  -.0296219   .0039053    -7.58   0.000    -.0372838   -.0219601
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0391486   .0016043   -24.40   0.000    -.0422961   -.0360011
       2016  |  -.0373694   .0015751   -23.73   0.000    -.0404595   -.0342793
       2017  |  -.0280882   .0016111   -17.43   0.000     -.031249   -.0249275
       2018  |  -.0311568   .0016082   -19.37   0.000    -.0343119   -.0280017
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107284   .0006209    17.28   0.000     .0095102    .0119465
       2016  |   .0104262    .000518    20.13   0.000       .00941    .0114424
       2017  |   .0078974   .0005637    14.01   0.000     .0067914    .0090033
       2018  |   .0045927   .0010129     4.53   0.000     .0026055    .0065799
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0646263   .0031558   -20.48   0.000    -.0708176   -.0584351
       2016  |  -.0670585    .003342   -20.07   0.000    -.0736151   -.0605019
       2017  |  -.0665148   .0033659   -19.76   0.000    -.0731183   -.0599113
       2018  |  -.0569416    .004281   -13.30   0.000    -.0653404   -.0485428
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0256874   .0019747   -13.01   0.000    -.0295615   -.0218133
       2016  |  -.0308881   .0018813   -16.42   0.000    -.0345791   -.0271971
       2017  |   -.023602   .0019877   -11.87   0.000    -.0275017   -.0197023
       2018  |  -.0334549   .0016453   -20.33   0.000    -.0366829    -.030227
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0090286   .0007202    12.54   0.000     .0076156    .0104415
       2016  |    .011072   .0007705    14.37   0.000     .0095605    .0125835
       2017  |   .0086131   .0007827    11.00   0.000     .0070775    .0101487
       2018  |   .0034107   .0010319     3.31   0.001     .0013861    .0054353
             |
       _cons |   .8572601   .0346121    24.77   0.000     .7893551    .9251651
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36069943
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_sib_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with both controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =     531.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0843
                                                Root MSE          =     .45954

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_2ye.. |
          1  |   .0755227    .003392    22.26   0.000     .0688679    .0821775
          2  |   .0920487   .0030987    29.71   0.000     .0859695     .098128
          3  |   .0934222   .0029248    31.94   0.000     .0876841    .0991602
          4  |   .0947378   .0028836    32.85   0.000     .0890805    .1003951
          5  |   .1006683   .0028657    35.13   0.000     .0950461    .1062905
          6  |   .0917203   .0026501    34.61   0.000     .0865212    .0969194
          7  |   .0955848   .0025357    37.70   0.000       .09061    .1005596
          8  |   .0801051   .0028224    28.38   0.000     .0745679    .0856423
          9  |   .0732461   .0029427    24.89   0.000     .0674728    .0790193
         10  |   .0543185   .0024474    22.19   0.000     .0495171      .05912
             |
        year |
       2016  |  -.0077061   .0050539    -1.52   0.128    -.0176213    .0022091
       2017  |  -.0386317    .004026    -9.60   0.000    -.0465302   -.0307331
       2018  |  -.0104551   .0050253    -2.08   0.038    -.0203142   -.0005959
             |
         age |  -.0000687   5.74e-06   -11.97   0.000      -.00008   -.0000575
             |
        male |
       Male  |    .020812   .0020018    10.40   0.000     .0168847    .0247394
 1.eth_asian |  -.0155303   .0038648    -4.02   0.000    -.0231126    -.007948
1.eth_hisp~c |   .0031106   .0030792     1.01   0.313    -.0029304    .0091516
 1.eth_black |  -.0230679   .0049446    -4.67   0.000    -.0327688   -.0133671
 1.eth_other |   .0005148   .0046057     0.11   0.911    -.0085211    .0095507
             |
econ_disad~e |
Economic ..  |  -.0121021   .0022611    -5.35   0.000    -.0165381   -.0076661
             |
limited_en~f |
Limited E..  |  -.0330636   .0045714    -7.23   0.000    -.0420322    -.024095
             |
    disabled |
   Disabled  |   .0324983   .0048613     6.69   0.000     .0229609    .0420356
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0631909   .0032458   -19.47   0.000    -.0695587   -.0568231
       2016  |  -.0560676    .002996   -18.71   0.000    -.0619454   -.0501898
       2017  |  -.0509796   .0031541   -16.16   0.000    -.0571676   -.0447916
       2018  |  -.0283763   .0039813    -7.13   0.000    -.0361871   -.0205654
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0399128   .0015613   -25.56   0.000    -.0429758   -.0368497
       2016  |   -.038294   .0015596   -24.55   0.000    -.0413537   -.0352342
       2017  |  -.0288023   .0016161   -17.82   0.000    -.0319729   -.0256317
       2018  |  -.0314824    .001617   -19.47   0.000    -.0346549     -.02831
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107222   .0006247    17.16   0.000     .0094966    .0119479
       2016  |   .0104531   .0005242    19.94   0.000     .0094247    .0114816
       2017  |   .0079369   .0005628    14.10   0.000     .0068328     .009041
       2018  |   .0046007   .0010128     4.54   0.000     .0026137    .0065876
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0667155   .0031726   -21.03   0.000    -.0729397   -.0604913
       2016  |  -.0689094   .0033876   -20.34   0.000    -.0755555   -.0622634
       2017  |  -.0686362   .0034241   -20.04   0.000     -.075354   -.0619184
       2018  |  -.0570569   .0043405   -13.15   0.000    -.0655725   -.0485413
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0269011   .0020227   -13.30   0.000    -.0308694   -.0229329
       2016  |  -.0318367   .0019224   -16.56   0.000    -.0356082   -.0280652
       2017  |  -.0245074   .0020284   -12.08   0.000    -.0284869   -.0205278
       2018  |  -.0345515   .0016841   -20.52   0.000    -.0378554   -.0312475
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0092766   .0007303    12.70   0.000     .0078439    .0107093
       2016  |   .0112447   .0007796    14.42   0.000     .0097152    .0127742
       2017  |   .0087496    .000795    11.01   0.000     .0071899    .0103092
       2018  |   .0031291    .001044     3.00   0.003     .0010808    .0051773
             |
       _cons |   .8657108   .0351711    24.61   0.000     .7967091    .9347124
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070194
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_both_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =     515.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0844
                                                Root MSE          =     .45951

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_2ye.. |
          1  |   .0757952   .0033406    22.69   0.000     .0692413    .0823491
          2  |   .0887595   .0028848    30.77   0.000     .0830998    .0944191
          3  |   .0993901   .0028466    34.92   0.000     .0938054    .1049748
          4  |   .0971391   .0029542    32.88   0.000     .0913434    .1029348
          5  |   .0953431   .0027977    34.08   0.000     .0898543    .1008319
          6  |   .0928742   .0026813    34.64   0.000     .0876139    .0981345
          7  |   .0955056   .0027735    34.44   0.000     .0900643    .1009468
          8  |   .0845862   .0025798    32.79   0.000     .0795249    .0896475
          9  |   .0743873   .0031579    23.56   0.000      .068192    .0805827
         10  |   .0511929   .0024829    20.62   0.000     .0463218     .056064
             |
        year |
       2016  |   -.007544   .0050735    -1.49   0.137    -.0174976    .0024095
       2017  |  -.0384371   .0040361    -9.52   0.000    -.0463555   -.0305188
       2018  |   -.010332   .0050397    -2.05   0.041    -.0202194   -.0004446
             |
         age |  -.0000687   5.74e-06   -11.96   0.000    -.0000799   -.0000574
             |
        male |
       Male  |      .0208   .0019994    10.40   0.000     .0168774    .0247225
 1.eth_asian |  -.0155872   .0038884    -4.01   0.000    -.0232159   -.0079585
1.eth_hisp~c |   .0030323   .0030821     0.98   0.325    -.0030144     .009079
 1.eth_black |  -.0228737   .0049463    -4.62   0.000    -.0325778   -.0131696
 1.eth_other |   .0006515   .0045993     0.14   0.887    -.0083718    .0096747
             |
econ_disad~e |
Economic ..  |  -.0121078   .0022659    -5.34   0.000    -.0165533   -.0076623
             |
limited_en~f |
Limited E..  |  -.0330702   .0045641    -7.25   0.000    -.0420244    -.024116
             |
    disabled |
   Disabled  |   .0325838   .0048596     6.71   0.000     .0230499    .0421178
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0648078   .0032307   -20.06   0.000    -.0711461   -.0584695
       2016  |   -.057263   .0029614   -19.34   0.000    -.0630729   -.0514531
       2017  |  -.0523171   .0031872   -16.41   0.000      -.05857   -.0460641
       2018  |  -.0292764    .003952    -7.41   0.000    -.0370299    -.021523
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0400307   .0015985   -25.04   0.000    -.0431667   -.0368947
       2016  |  -.0382242   .0015787   -24.21   0.000    -.0413214   -.0351269
       2017  |  -.0291061   .0016133   -18.04   0.000    -.0322712    -.025941
       2018  |  -.0317356   .0016145   -19.66   0.000     -.034903   -.0285682
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107454   .0006226    17.26   0.000     .0095239    .0119669
       2016  |    .010451   .0005218    20.03   0.000     .0094273    .0114748
       2017  |   .0080176   .0005656    14.17   0.000     .0069079    .0091273
       2018  |   .0045921   .0010157     4.52   0.000     .0025994    .0065849
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0654129   .0031684   -20.65   0.000     -.071629   -.0591969
       2016  |  -.0677555   .0033813   -20.04   0.000    -.0743891   -.0611218
       2017  |  -.0673796      .0034   -19.82   0.000      -.07405   -.0607092
       2018  |  -.0562618   .0043546   -12.92   0.000    -.0648051   -.0477186
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0268007   .0019825   -13.52   0.000    -.0306902   -.0229112
       2016  |  -.0319345   .0018929   -16.87   0.000    -.0356482   -.0282209
       2017  |  -.0242722   .0020116   -12.07   0.000    -.0282187   -.0203258
       2018  |  -.0343984   .0016596   -20.73   0.000    -.0376544   -.0311423
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0092682   .0007221    12.84   0.000     .0078516    .0106848
       2016  |   .0112712   .0007765    14.52   0.000     .0097478    .0127945
       2017  |   .0087222   .0007891    11.05   0.000     .0071741    .0102702
       2018  |   .0031367   .0010384     3.02   0.003     .0010993     .005174
             |
       _cons |    .865375   .0351727    24.60   0.000     .7963702    .9343799
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36069943
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_both_dk_x_prior_math.ster saved
LHS = enr_4year
RHS DK VA: Deep Knowledge VA with og controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =    2398.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2656
                                                Root MSE          =     .41313

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
~4year_og_dk |
          1  |   .0373351   .0023084    16.17   0.000     .0328063    .0418639
          2  |   .0626164   .0027332    22.91   0.000     .0572541    .0679786
          3  |   .0731529   .0027466    26.63   0.000     .0677643    .0785414
          4  |   .0803023   .0027529    29.17   0.000     .0749014    .0857031
          5  |   .0864811   .0028357    30.50   0.000     .0809177    .0920445
          6  |   .0897418   .0026341    34.07   0.000      .084574    .0949095
          7  |   .0946005   .0026602    35.56   0.000     .0893814    .0998196
          8  |     .09084   .0026577    34.18   0.000      .085626     .096054
          9  |   .0787935   .0026121    30.16   0.000     .0736688    .0839182
         10  |   .0548587   .0023089    23.76   0.000     .0503288    .0593885
             |
        year |
       2016  |   .0164375   .0032396     5.07   0.000     .0100817    .0227933
       2017  |   .0171842   .0039245     4.38   0.000     .0094848    .0248835
       2018  |  -.0214563   .0041306    -5.19   0.000      -.02956   -.0133526
             |
         age |  -.0000783   5.00e-06   -15.66   0.000    -.0000881   -.0000685
             |
        male |
       Male  |  -.0897573   .0016983   -52.85   0.000    -.0930892   -.0864254
 1.eth_asian |   .0738742   .0042004    17.59   0.000     .0656334     .082115
1.eth_hisp~c |  -.0302845   .0030263   -10.01   0.000    -.0362216   -.0243473
 1.eth_black |    .028214   .0051992     5.43   0.000     .0180138    .0384142
 1.eth_other |  -.0085668   .0044772    -1.91   0.056    -.0173505    .0002169
             |
econ_disad~e |
Economic ..  |  -.0420048   .0025579   -16.42   0.000    -.0470232   -.0369864
             |
limited_en~f |
Limited E..  |  -.0202455   .0026751    -7.57   0.000    -.0254937   -.0149972
             |
    disabled |
   Disabled  |   -.054475   .0033178   -16.42   0.000    -.0609841   -.0479658
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1406736   .0026696    52.69   0.000      .135436    .1459111
       2016  |   .1276853   .0026563    48.07   0.000     .1224739    .1328967
       2017  |   .1234689   .0028293    43.64   0.000     .1179181    .1290197
       2018  |   .0962138   .0035266    27.28   0.000     .0892949    .1031326
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0218579   .0011257    19.42   0.000     .0196494    .0240663
       2016  |   .0163237   .0011933    13.68   0.000     .0139827    .0186648
       2017  |   .0171553   .0011523    14.89   0.000     .0148947    .0194159
       2018  |   .0186777   .0012625    14.79   0.000     .0162009    .0211545
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0112396   .0005104   -22.02   0.000     -.012241   -.0102383
       2016  |  -.0094429   .0004855   -19.45   0.000    -.0103954   -.0084904
       2017  |  -.0097397   .0004972   -19.59   0.000    -.0107151   -.0087642
       2018  |  -.0089113    .000806   -11.06   0.000    -.0104926   -.0073301
             |
        year#|
          c. |
prior_mat~re |
       2015  |     .11976   .0027837    43.02   0.000     .1142988    .1252213
       2016  |   .1264404   .0029077    43.48   0.000     .1207359     .132145
       2017  |   .1232542   .0030713    40.13   0.000     .1172286    .1292797
       2018  |   .1418139   .0036321    39.04   0.000      .134688    .1489397
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0163082   .0014795    11.02   0.000     .0134056    .0192108
       2016  |   .0171377   .0014028    12.22   0.000     .0143855    .0198899
       2017  |   .0121942   .0015093     8.08   0.000      .009233    .0151553
       2018  |   .0313015   .0012221    25.61   0.000     .0289038    .0336991
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0097544   .0006017   -16.21   0.000    -.0109349   -.0085739
       2016  |   -.010339   .0006626   -15.60   0.000    -.0116389   -.0090391
       2017  |  -.0087383    .000705   -12.40   0.000    -.0101214   -.0073552
       2018  |  -.0092211   .0008277   -11.14   0.000    -.0108449   -.0075973
             |
       _cons |   .8357988    .030188    27.69   0.000     .7765733    .8950242
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36725077
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_og_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =    2295.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2655
                                                Root MSE          =     .41315

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
~4year_og_dk |
          1  |   .0382805    .002161    17.71   0.000     .0340409    .0425201
          2  |   .0618976   .0029568    20.93   0.000     .0560966    .0676986
          3  |   .0758965   .0028424    26.70   0.000     .0703199     .081473
          4  |   .0817384   .0029373    27.83   0.000     .0759757    .0875011
          5  |   .0849552   .0026207    32.42   0.000     .0798137    .0900967
          6  |    .090889   .0028198    32.23   0.000     .0853569    .0964211
          7  |   .0923788   .0028717    32.17   0.000     .0867448    .0980127
          8  |   .0884096   .0026813    32.97   0.000     .0831491      .09367
          9  |    .079818    .002698    29.58   0.000     .0745249    .0851112
         10  |   .0541123   .0020969    25.81   0.000     .0499983    .0582262
             |
        year |
       2016  |    .016339   .0032578     5.02   0.000     .0099476    .0227304
       2017  |   .0169452   .0039397     4.30   0.000      .009216    .0246744
       2018  |  -.0214641   .0041459    -5.18   0.000     -.029598   -.0133303
             |
         age |  -.0000781   5.01e-06   -15.59   0.000    -.0000879   -.0000683
             |
        male |
       Male  |  -.0896274   .0017022   -52.65   0.000     -.092967   -.0862879
 1.eth_asian |   .0737942   .0042096    17.53   0.000     .0655356    .0820529
1.eth_hisp~c |  -.0303857   .0030168   -10.07   0.000    -.0363042   -.0244671
 1.eth_black |   .0283124   .0051882     5.46   0.000     .0181338    .0384909
 1.eth_other |  -.0084985   .0044692    -1.90   0.057    -.0172667    .0002696
             |
econ_disad~e |
Economic ..  |  -.0420931   .0025614   -16.43   0.000    -.0471183   -.0370679
             |
limited_en~f |
Limited E..  |  -.0199937   .0027015    -7.40   0.000    -.0252936   -.0146937
             |
    disabled |
   Disabled  |  -.0545442   .0033124   -16.47   0.000    -.0610427   -.0480456
             |
        year#|
          c. |
prior_ela~re |
       2015  |    .139878   .0026804    52.18   0.000     .1346193    .1451367
       2016  |   .1274351   .0026705    47.72   0.000     .1221959    .1326744
       2017  |   .1232729   .0028441    43.34   0.000     .1176931    .1288528
       2018  |    .096036   .0035169    27.31   0.000     .0891363    .1029357
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0220771   .0011732    18.82   0.000     .0197754    .0243788
       2016  |   .0164036   .0012206    13.44   0.000      .014009    .0187982
       2017  |    .016785   .0011585    14.49   0.000     .0145122    .0190577
       2018  |   .0182483   .0012921    14.12   0.000     .0157134    .0207832
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0112442   .0005109   -22.01   0.000    -.0122465   -.0102419
       2016  |  -.0094755   .0004812   -19.69   0.000    -.0104194   -.0085315
       2017  |  -.0096817   .0004963   -19.51   0.000    -.0106555   -.0087079
       2018  |  -.0090215   .0008163   -11.05   0.000    -.0106229     -.00742
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1203595   .0027693    43.46   0.000     .1149265    .1257926
       2016  |   .1267638   .0029195    43.42   0.000     .1210362    .1324915
       2017  |   .1233686    .003085    39.99   0.000     .1173161    .1294211
       2018  |   .1421008   .0035948    39.53   0.000     .1350482    .1491535
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0158898   .0014477    10.98   0.000     .0130496    .0187301
       2016  |    .016908   .0013789    12.26   0.000     .0142029    .0196132
       2017  |   .0125891   .0014914     8.44   0.000     .0096631     .015515
       2018  |   .0317752   .0012061    26.35   0.000     .0294089    .0341414
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0096492   .0006038   -15.98   0.000    -.0108338   -.0084646
       2016  |  -.0102926   .0006623   -15.54   0.000     -.011592   -.0089932
       2017  |  -.0088222   .0007038   -12.54   0.000    -.0102029   -.0074415
       2018  |  -.0091367   .0008157   -11.20   0.000     -.010737   -.0075364
             |
       _cons |   .8344422   .0302127    27.62   0.000     .7751684    .8937161
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724821
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_og_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with acs controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =    2235.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2629
                                                Root MSE          =     .41389

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_4ye.. |
          1  |    .035802   .0022395    15.99   0.000     .0314084    .0401956
          2  |   .0600662    .002683    22.39   0.000     .0548024    .0653299
          3  |   .0693075   .0027225    25.46   0.000     .0639663    .0746486
          4  |   .0757228   .0027524    27.51   0.000     .0703228    .0811228
          5  |    .081917   .0028777    28.47   0.000     .0762712    .0875628
          6  |   .0849591   .0027272    31.15   0.000     .0796087    .0903096
          7  |   .0899191   .0028527    31.52   0.000     .0843224    .0955158
          8  |   .0853325   .0028863    29.56   0.000     .0796699     .090995
          9  |   .0731832   .0029252    25.02   0.000     .0674442    .0789221
         10  |   .0521985   .0024797    21.05   0.000     .0473337    .0570634
             |
        year |
       2016  |   .0164695   .0033377     4.93   0.000     .0099212    .0230177
       2017  |   .0177513   .0039079     4.54   0.000     .0100845    .0254182
       2018  |  -.0213153   .0041104    -5.19   0.000    -.0293795   -.0132511
             |
         age |  -.0000761   5.25e-06   -14.49   0.000    -.0000864   -.0000658
             |
        male |
       Male  |  -.0897984   .0016995   -52.84   0.000    -.0931326   -.0864642
 1.eth_asian |   .0713501   .0047835    14.92   0.000     .0619654    .0807348
1.eth_hisp~c |  -.0295133   .0034082    -8.66   0.000    -.0361997   -.0228269
 1.eth_black |   .0317107   .0053565     5.92   0.000     .0212019    .0422196
 1.eth_other |  -.0096246    .004628    -2.08   0.038    -.0187042   -.0005449
             |
econ_disad~e |
Economic ..  |  -.0485974   .0027794   -17.48   0.000    -.0540504   -.0431445
             |
limited_en~f |
Limited E..  |  -.0205662   .0027332    -7.52   0.000    -.0259284    -.015204
             |
    disabled |
   Disabled  |  -.0525454   .0032526   -16.15   0.000    -.0589266   -.0461642
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1407473   .0026472    53.17   0.000     .1355538    .1459408
       2016  |   .1270506   .0026655    47.67   0.000     .1218212      .13228
       2017  |   .1242254   .0028555    43.50   0.000     .1186232    .1298277
       2018  |   .0969167   .0035616    27.21   0.000     .0899292    .1039043
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0225088   .0011285    19.94   0.000     .0202947    .0247229
       2016  |   .0168622   .0011915    14.15   0.000     .0145245    .0191998
       2017  |   .0178545   .0011402    15.66   0.000     .0156176    .0200915
       2018  |   .0189644   .0012748    14.88   0.000     .0164633    .0214654
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   -.011307    .000512   -22.08   0.000    -.0123114   -.0103025
       2016  |  -.0094169   .0004857   -19.39   0.000    -.0103699    -.008464
       2017  |  -.0099102   .0004965   -19.96   0.000    -.0108844   -.0089361
       2018  |  -.0089991   .0008118   -11.09   0.000    -.0105917   -.0074065
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1204719    .002788    43.21   0.000     .1150022    .1259415
       2016  |   .1273234   .0029563    43.07   0.000     .1215236    .1331233
       2017  |   .1240826   .0030784    40.31   0.000      .118043    .1301221
       2018  |   .1415648   .0037118    38.14   0.000     .1342827    .1488469
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0171768   .0014844    11.57   0.000     .0142645    .0200891
       2016  |   .0179112   .0014056    12.74   0.000     .0151536    .0206689
       2017  |   .0127657   .0015128     8.44   0.000     .0097978    .0157336
       2018  |   .0322106   .0012325    26.13   0.000     .0297926    .0346285
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0099048   .0006035   -16.41   0.000    -.0110888   -.0087208
       2016  |  -.0104796   .0006672   -15.71   0.000    -.0117885   -.0091706
       2017  |   -.008821   .0007088   -12.44   0.000    -.0102116   -.0074304
       2018  |  -.0089023   .0008272   -10.76   0.000    -.0105253   -.0072794
             |
       _cons |   .8239456   .0312354    26.38   0.000     .7626654    .8852258
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36725077
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_acs_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =    2205.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2628
                                                Root MSE          =     .41391

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_4ye.. |
          1  |   .0364374    .002173    16.77   0.000     .0321743    .0407006
          2  |   .0592128   .0029473    20.09   0.000     .0534305    .0649952
          3  |   .0729615   .0026729    27.30   0.000     .0677175    .0782054
          4  |   .0783782   .0028258    27.74   0.000     .0728342    .0839222
          5  |   .0799455   .0027799    28.76   0.000     .0744917    .0853993
          6  |   .0865848   .0029352    29.50   0.000     .0808263    .0923433
          7  |   .0869852   .0030336    28.67   0.000     .0810335    .0929368
          8  |   .0827262   .0029738    27.82   0.000     .0768919    .0885604
          9  |   .0738145   .0032103    22.99   0.000     .0675163    .0801127
         10  |   .0511915   .0023751    21.55   0.000     .0465319    .0558512
             |
        year |
       2016  |    .016397   .0033589     4.88   0.000     .0098072    .0229869
       2017  |   .0175024   .0039246     4.46   0.000     .0098028    .0252021
       2018  |  -.0213552   .0041274    -5.17   0.000    -.0294527   -.0132577
             |
         age |  -.0000759   5.26e-06   -14.42   0.000    -.0000862   -.0000656
             |
        male |
       Male  |  -.0897123   .0017027   -52.69   0.000    -.0930527   -.0863719
 1.eth_asian |   .0712003   .0047655    14.94   0.000      .061851    .0805496
1.eth_hisp~c |  -.0295758   .0034001    -8.70   0.000    -.0362464   -.0229052
 1.eth_black |   .0317659   .0053487     5.94   0.000     .0212722    .0422595
 1.eth_other |  -.0095527   .0046214    -2.07   0.039    -.0186193   -.0004861
             |
econ_disad~e |
Economic ..  |  -.0485619   .0027789   -17.48   0.000    -.0540138     -.04311
             |
limited_en~f |
Limited E..  |  -.0205569   .0027585    -7.45   0.000    -.0259687    -.015145
             |
    disabled |
   Disabled  |  -.0525864   .0032477   -16.19   0.000     -.058958   -.0462148
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1403923    .002668    52.62   0.000     .1351581    .1456266
       2016  |    .127155   .0026803    47.44   0.000     .1218965    .1324135
       2017  |   .1245797   .0028689    43.42   0.000     .1189513    .1302081
       2018  |   .0971389   .0035587    27.30   0.000     .0901572    .1041207
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0227366   .0011637    19.54   0.000     .0204536    .0250197
       2016  |   .0169469   .0012124    13.98   0.000     .0145683    .0193256
       2017  |   .0175033   .0011498    15.22   0.000     .0152475    .0197591
       2018  |   .0185739    .001292    14.38   0.000     .0160392    .0211087
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0113079   .0005117   -22.10   0.000    -.0123117   -.0103041
       2016  |  -.0094426   .0004812   -19.62   0.000    -.0103867   -.0084985
       2017  |   -.009854   .0004965   -19.85   0.000    -.0108281   -.0088799
       2018  |  -.0090456   .0008173   -11.07   0.000     -.010649   -.0074422
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1207256   .0027728    43.54   0.000     .1152857    .1261655
       2016  |   .1273288   .0029567    43.06   0.000      .121528    .1331295
       2017  |   .1237377   .0030827    40.14   0.000     .1176897    .1297857
       2018  |   .1415518   .0036842    38.42   0.000     .1343239    .1487797
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0168164   .0014476    11.62   0.000     .0139765    .0196563
       2016  |   .0177456   .0013763    12.89   0.000     .0150454    .0204458
       2017  |    .013245   .0015025     8.82   0.000     .0102973    .0161926
       2018  |   .0326408   .0012167    26.83   0.000     .0302539    .0350277
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0098315   .0006043   -16.27   0.000     -.011017    -.008646
       2016  |  -.0104658   .0006659   -15.72   0.000    -.0117723   -.0091594
       2017  |  -.0089522   .0007078   -12.65   0.000     -.010341   -.0075635
       2018  |  -.0089046   .0008198   -10.86   0.000    -.0105129   -.0072963
             |
       _cons |    .822401   .0312584    26.31   0.000     .7610756    .8837263
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724821
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_acs_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with sib controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =    2428.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2655
                                                Root MSE          =     .41316

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_4ye.. |
          1  |   .0372393   .0023227    16.03   0.000     .0326824    .0417962
          2  |   .0625527   .0027392    22.84   0.000     .0571786    .0679268
          3  |   .0729642   .0027691    26.35   0.000     .0675315    .0783969
          4  |   .0800383   .0027795    28.80   0.000     .0745853    .0854914
          5  |   .0862389   .0028544    30.21   0.000     .0806388    .0918389
          6  |   .0895079   .0026602    33.65   0.000      .084289    .0947269
          7  |   .0943916   .0026706    35.35   0.000     .0891523    .0996309
          8  |   .0907347   .0026722    33.96   0.000     .0854922    .0959772
          9  |   .0785782   .0025954    30.28   0.000     .0734863    .0836701
         10  |   .0547246   .0022873    23.93   0.000     .0502372    .0592121
             |
        year |
       2016  |   .0164182   .0032683     5.02   0.000     .0100063    .0228302
       2017  |   .0171835   .0039205     4.38   0.000      .009492    .0248751
       2018  |  -.0214392   .0041265    -5.20   0.000    -.0295348   -.0133436
             |
         age |  -.0000782   5.01e-06   -15.62   0.000     -.000088   -.0000684
             |
        male |
       Male  |  -.0897717   .0016983   -52.86   0.000    -.0931036   -.0864398
 1.eth_asian |   .0736579   .0041963    17.55   0.000     .0654253    .0818904
1.eth_hisp~c |  -.0300811   .0030286    -9.93   0.000    -.0360229   -.0241394
 1.eth_black |   .0283775   .0052163     5.44   0.000     .0181437    .0386114
 1.eth_other |  -.0087877   .0044639    -1.97   0.049    -.0175453   -.0000301
             |
econ_disad~e |
Economic ..  |   -.041704   .0025642   -16.26   0.000    -.0467346   -.0366734
             |
limited_en~f |
Limited E..  |  -.0202842   .0026831    -7.56   0.000    -.0255481   -.0150203
             |
    disabled |
   Disabled  |  -.0546205   .0033247   -16.43   0.000    -.0611431   -.0480978
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1406357   .0026717    52.64   0.000     .1353941    .1458773
       2016  |   .1276122   .0026554    48.06   0.000     .1224026    .1328218
       2017  |   .1235619   .0028313    43.64   0.000     .1180072    .1291165
       2018  |   .0962718   .0035286    27.28   0.000     .0893492    .1031945
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0218474   .0011253    19.41   0.000     .0196397    .0240552
       2016  |   .0162942   .0011939    13.65   0.000     .0139519    .0186366
       2017  |   .0171553   .0011526    14.88   0.000     .0148941    .0194165
       2018  |   .0186978   .0012625    14.81   0.000     .0162209    .0211747
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0112301   .0005102   -22.01   0.000    -.0122311   -.0102291
       2016  |  -.0094334   .0004858   -19.42   0.000    -.0103864   -.0084804
       2017  |  -.0097511   .0004973   -19.61   0.000    -.0107268   -.0087755
       2018  |  -.0089103   .0008058   -11.06   0.000    -.0104911   -.0073294
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1197591   .0027889    42.94   0.000     .1142877    .1252305
       2016  |   .1264497   .0029135    43.40   0.000     .1207337    .1321656
       2017  |   .1232987   .0030725    40.13   0.000     .1172708    .1293267
       2018  |   .1416761   .0036316    39.01   0.000     .1345514    .1488008
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0163107   .0014814    11.01   0.000     .0134044     .019217
       2016  |   .0171436   .0014032    12.22   0.000     .0143908    .0198965
       2017  |   .0121886   .0015089     8.08   0.000     .0092284    .0151489
       2018  |   .0312393   .0012232    25.54   0.000     .0288396     .033639
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0097585   .0006021   -16.21   0.000    -.0109397   -.0085773
       2016  |  -.0103416   .0006627   -15.61   0.000    -.0116417   -.0090415
       2017  |  -.0087394   .0007053   -12.39   0.000    -.0101231   -.0073557
       2018  |  -.0092203   .0008276   -11.14   0.000    -.0108439   -.0075966
             |
       _cons |   .8348638   .0302073    27.64   0.000     .7756004    .8941271
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36725077
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_sib_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =    2313.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2654
                                                Root MSE          =     .41319

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_4ye.. |
          1  |   .0381872   .0021629    17.66   0.000     .0339438    .0424307
          2  |   .0617742   .0029669    20.82   0.000     .0559535     .067595
          3  |   .0757921   .0028626    26.48   0.000     .0701761    .0814082
          4  |   .0815535   .0029701    27.46   0.000     .0757266    .0873805
          5  |   .0847294    .002637    32.13   0.000     .0795559     .089903
          6  |   .0905582    .002852    31.75   0.000      .084963    .0961535
          7  |   .0920672   .0028948    31.80   0.000     .0863878    .0977465
          8  |   .0882899   .0026792    32.95   0.000     .0830336    .0935462
          9  |   .0796997    .002681    29.73   0.000     .0744399    .0849596
         10  |   .0540125   .0020912    25.83   0.000     .0499098    .0581153
             |
        year |
       2016  |   .0163193    .003287     4.96   0.000     .0098705    .0227681
       2017  |   .0169382   .0039355     4.30   0.000     .0092172    .0246591
       2018  |  -.0214518   .0041419    -5.18   0.000    -.0295778   -.0133257
             |
         age |   -.000078   5.01e-06   -15.56   0.000    -.0000878   -.0000681
             |
        male |
       Male  |  -.0896407   .0017021   -52.67   0.000    -.0929799   -.0863014
 1.eth_asian |   .0735913   .0042064    17.49   0.000     .0653387    .0818438
1.eth_hisp~c |  -.0301775   .0030193    -9.99   0.000     -.036101   -.0242541
 1.eth_black |   .0284693   .0052054     5.47   0.000     .0182568    .0386817
 1.eth_other |  -.0087122   .0044558    -1.96   0.051    -.0174539    .0000295
             |
econ_disad~e |
Economic ..  |  -.0417951   .0025676   -16.28   0.000    -.0468325   -.0367577
             |
limited_en~f |
Limited E..  |   -.020027   .0027092    -7.39   0.000    -.0253422   -.0147118
             |
    disabled |
   Disabled  |  -.0546863   .0033187   -16.48   0.000    -.0611971   -.0481754
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1397998   .0026818    52.13   0.000     .1345384    .1450612
       2016  |   .1273176   .0026688    47.71   0.000     .1220817    .1325536
       2017  |   .1233606   .0028462    43.34   0.000     .1177768    .1289445
       2018  |   .0960769   .0035195    27.30   0.000      .089172    .1029818
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0220716    .001172    18.83   0.000     .0197723    .0243708
       2016  |   .0163682   .0012216    13.40   0.000     .0139716    .0187648
       2017  |   .0167844   .0011591    14.48   0.000     .0145105    .0190584
       2018  |   .0182602   .0012929    14.12   0.000     .0157236    .0207968
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0112365   .0005107   -22.00   0.000    -.0122385   -.0102345
       2016  |  -.0094654   .0004814   -19.66   0.000    -.0104098    -.008521
       2017  |  -.0096932   .0004965   -19.52   0.000    -.0106672   -.0087191
       2018  |  -.0090309   .0008165   -11.06   0.000    -.0106328    -.007429
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1203916   .0027744    43.39   0.000     .1149486    .1258347
       2016  |   .1267986   .0029256    43.34   0.000     .1210589    .1325383
       2017  |   .1234155   .0030857    40.00   0.000     .1173618    .1294693
       2018  |   .1419973   .0035948    39.50   0.000     .1349448    .1490498
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0158806   .0014524    10.93   0.000     .0130311    .0187301
       2016  |   .0169095   .0013808    12.25   0.000     .0142005    .0196184
       2017  |   .0125816   .0014916     8.43   0.000     .0096552     .015508
       2018  |    .031723   .0012079    26.26   0.000     .0293532    .0340927
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0096486   .0006046   -15.96   0.000    -.0108346   -.0084625
       2016  |   -.010291   .0006626   -15.53   0.000     -.011591    -.008991
       2017  |  -.0088231   .0007041   -12.53   0.000    -.0102045   -.0074417
       2018  |   -.009129   .0008156   -11.19   0.000     -.010729   -.0075289
             |
       _cons |   .8335868   .0302323    27.57   0.000     .7742744    .8928991
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724821
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_sib_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with both controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,833
                                                F(46, 1236)       =    2249.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2628
                                                Root MSE          =     .41392

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_4ye.. |
          1  |   .0357238   .0022532    15.85   0.000     .0313032    .0401444
          2  |   .0600431   .0026846    22.37   0.000     .0547763      .06531
          3  |   .0691453   .0027394    25.24   0.000     .0637708    .0745198
          4  |   .0754966   .0027786    27.17   0.000     .0700453    .0809479
          5  |   .0817047   .0028921    28.25   0.000     .0760308    .0873786
          6  |   .0847694   .0027542    30.78   0.000     .0793659    .0901728
          7  |   .0897504   .0028666    31.31   0.000     .0841265    .0953742
          8  |   .0853137   .0028911    29.51   0.000     .0796418    .0909857
          9  |   .0730559   .0029035    25.16   0.000     .0673595    .0787523
         10  |   .0521382   .0024526    21.26   0.000     .0473265    .0569499
             |
        year |
       2016  |   .0164418   .0033649     4.89   0.000     .0098402    .0230433
       2017  |   .0177296   .0039046     4.54   0.000     .0100693    .0253899
       2018  |  -.0213215   .0041084    -5.19   0.000    -.0293818   -.0132612
             |
         age |   -.000076   5.26e-06   -14.46   0.000    -.0000863   -.0000657
             |
        male |
       Male  |  -.0898103   .0016995   -52.85   0.000    -.0931445   -.0864762
 1.eth_asian |   .0713723   .0047638    14.98   0.000     .0620262    .0807184
1.eth_hisp~c |  -.0293937   .0034059    -8.63   0.000    -.0360757   -.0227117
 1.eth_black |   .0318616   .0053693     5.93   0.000     .0213277    .0423955
 1.eth_other |  -.0097889    .004615    -2.12   0.034    -.0188429   -.0007348
             |
econ_disad~e |
Economic ..  |  -.0483163   .0027801   -17.38   0.000    -.0537705    -.042862
             |
limited_en~f |
Limited E..  |  -.0205666   .0027416    -7.50   0.000    -.0259452   -.0151879
             |
    disabled |
   Disabled  |   -.052669    .003259   -16.16   0.000    -.0590627   -.0462752
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1407174   .0026492    53.12   0.000     .1355199    .1459148
       2016  |   .1269858   .0026638    47.67   0.000     .1217597    .1322119
       2017  |   .1243224   .0028571    43.51   0.000     .1187172    .1299277
       2018  |   .0969644   .0035624    27.22   0.000     .0899753    .1039534
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0224927   .0011284    19.93   0.000     .0202789    .0247065
       2016  |    .016831   .0011925    14.11   0.000     .0144914    .0191706
       2017  |   .0178511   .0011407    15.65   0.000     .0156132    .0200889
       2018  |   .0189784   .0012747    14.89   0.000     .0164775    .0214793
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0112989   .0005117   -22.08   0.000    -.0123029    -.010295
       2016  |  -.0094095    .000486   -19.36   0.000     -.010363    -.008456
       2017  |  -.0099223   .0004966   -19.98   0.000    -.0108966    -.008948
       2018  |  -.0090009   .0008115   -11.09   0.000    -.0105931   -.0074088
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1204741   .0027934    43.13   0.000     .1149937    .1259545
       2016  |   .1273423   .0029617    43.00   0.000     .1215317    .1331528
       2017  |   .1241228   .0030799    40.30   0.000     .1180805    .1301652
       2018  |   .1414555     .00371    38.13   0.000     .1341769    .1487342
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0171753   .0014861    11.56   0.000     .0142598    .0200908
       2016  |   .0179132   .0014059    12.74   0.000     .0151549    .0206715
       2017  |   .0127614   .0015124     8.44   0.000     .0097943    .0157285
       2018  |   .0321533   .0012333    26.07   0.000     .0297336    .0345729
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0099086   .0006039   -16.41   0.000    -.0110934   -.0087238
       2016  |  -.0104823   .0006673   -15.71   0.000    -.0117915   -.0091731
       2017  |  -.0088226   .0007091   -12.44   0.000    -.0102138   -.0074314
       2018  |  -.0089028   .0008269   -10.77   0.000    -.0105251   -.0072804
             |
       _cons |   .8231768   .0312469    26.34   0.000      .761874    .8844796
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36725077
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_both_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,836
                                                F(46, 1236)       =    2208.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2627
                                                Root MSE          =     .41394

                            (Std. err. adjusted for 1,237 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_4ye.. |
          1  |   .0363824   .0021731    16.74   0.000      .032119    .0406459
          2  |   .0591332   .0029532    20.02   0.000     .0533393    .0649271
          3  |   .0728992   .0026916    27.08   0.000     .0676185    .0781799
          4  |   .0782489   .0028542    27.41   0.000     .0726492    .0838486
          5  |    .079737   .0027916    28.56   0.000     .0742602    .0852138
          6  |   .0862809   .0029609    29.14   0.000     .0804719    .0920899
          7  |   .0867432    .003057    28.37   0.000     .0807457    .0927408
          8  |   .0826529   .0029731    27.80   0.000       .07682    .0884857
          9  |    .073753    .003194    23.09   0.000     .0674867    .0800192
         10  |   .0511711   .0023573    21.71   0.000     .0465463    .0557958
             |
        year |
       2016  |   .0163688   .0033867     4.83   0.000     .0097245     .023013
       2017  |   .0174743    .003921     4.46   0.000     .0097818    .0251669
       2018  |  -.0213639   .0041255    -5.18   0.000    -.0294576   -.0132702
             |
         age |  -.0000758   5.26e-06   -14.40   0.000    -.0000861   -.0000655
             |
        male |
       Male  |  -.0897229   .0017025   -52.70   0.000     -.093063   -.0863827
 1.eth_asian |    .071231   .0047481    15.00   0.000     .0619157    .0805463
1.eth_hisp~c |   -.029453   .0033982    -8.67   0.000    -.0361198   -.0227862
 1.eth_black |   .0319102    .005362     5.95   0.000     .0213906    .0424298
 1.eth_other |  -.0097096   .0046082    -2.11   0.035    -.0187505   -.0006688
             |
econ_disad~e |
Economic ..  |  -.0482842     .00278   -17.37   0.000    -.0537382   -.0428301
             |
limited_en~f |
Limited E..  |   -.020548   .0027672    -7.43   0.000    -.0259769   -.0151191
             |
    disabled |
   Disabled  |  -.0527063   .0032535   -16.20   0.000    -.0590894   -.0463233
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1403307   .0026694    52.57   0.000     .1350937    .1455677
       2016  |   .1270575    .002678    47.44   0.000     .1218036    .1323115
       2017  |   .1246816   .0028703    43.44   0.000     .1190504    .1303128
       2018  |   .0971761   .0035602    27.30   0.000     .0901915    .1041608
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0227253   .0011629    19.54   0.000     .0204438    .0250068
       2016  |   .0169099   .0012136    13.93   0.000      .014529    .0192908
       2017  |   .0174981   .0011502    15.21   0.000     .0152414    .0197547
       2018  |   .0185811   .0012928    14.37   0.000     .0160448    .0211175
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0113008   .0005115   -22.09   0.000    -.0123043   -.0102972
       2016  |  -.0094341   .0004815   -19.59   0.000    -.0103787   -.0084895
       2017  |  -.0098655   .0004966   -19.87   0.000    -.0108398   -.0088913
       2018  |  -.0090549   .0008175   -11.08   0.000    -.0106587   -.0074512
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1207542   .0027782    43.47   0.000     .1153038    .1262046
       2016  |   .1273643   .0029624    42.99   0.000     .1215524    .1331762
       2017  |   .1237735   .0030836    40.14   0.000     .1177238    .1298232
       2018  |   .1414665   .0036824    38.42   0.000      .134242     .148691
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0168042    .001452    11.57   0.000     .0139555    .0196529
       2016  |   .0177451   .0013782    12.88   0.000     .0150413    .0204489
       2017  |   .0132408   .0015028     8.81   0.000     .0102925    .0161891
       2018  |   .0325918   .0012183    26.75   0.000     .0302018    .0349819
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0098315    .000605   -16.25   0.000    -.0110185   -.0086445
       2016  |  -.0104656   .0006662   -15.71   0.000    -.0117726   -.0091586
       2017  |  -.0089546   .0007082   -12.64   0.000     -.010344   -.0075652
       2018  |  -.0089001   .0008194   -10.86   0.000    -.0105077   -.0072925
             |
       _cons |   .8217012   .0312713    26.28   0.000     .7603505    .8830519
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36724821
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_both_dk_x_prior_math.ster saved

. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:    174.08 /        1 =     174.0840

. 
. set trace off

. cd $projdir
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/reg_out_va_sib_acs_dk.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 22:31:34
-------------------------------------------------------------------------------
