-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/reg_out_va_sib_acs.smcl
  log type:  smcl
 opened on:   7 May 2022, 17:55:24

. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative fil
> e paths  */
. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. macro list
T_gm_fix_span:  0
S_4:            .0020423965494575
S_2:            300
S_3:            .0135669174878782
S_1:            epanechnikov
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. //startomg timer
. timer on 1

. 
. 
. *****************************************************************************
> ***
. * begin main code
. 
. // load the resctricted outcome sample with sibling and acs controls
. use $vaprojdir/data/va_samples/va_sib_acs_out_restr_smp.dta, clear
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)

. 
. foreach subject in ela math {
  2.   //merge to test score VA estimates dataset
.   merge m:1 cdscode year using ///
>    $vaprojdir/data/sib_acs_restr_smp/test_score_va/va_`subject'_sib_acs.dta /
> //
>    , nogen keep(1 3) keepusing(va_*)
  3. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                           739
        from master                       739  
        from using                          0  

    Matched                           525,895  
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                           763
        from master                       763  
        from using                          0  

    Matched                           525,871  
    -----------------------------------------

. 
. 
. ********** regress enrollment outcomes on test score value added
. /* no peer effectsm no tfx, using the standard controls in primary VA specifi
> cation */
. 
. foreach outcome in enr enr_2year enr_4year {
  2.   // regress outcomes on each test score VA individually
.   di "Dependent Var = `outcome'"
  3. 
.   // regressing on single subject VA, 4 VA specifications
.   foreach subject in ela math {
  4.     di "Subject = `subject'"
  5. 
.     foreach control in og acs sib both {
  6.       di "test score VA with `control' controls"
  7. 
.       reg `outcome' va_`subject'_`control' ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         if touse_g11_`subject'==1 ///
>         , cluster(school_id)
  8.       //add mean of yvar to stored results
.       estadd ysumm, mean
  9.       estimates save $vaprojdir/estimates/sib_acs_restr_smp/persistence/re
> g_`outcome'_va_`subject'_`control'.ster, replace
 10.     }
 11.   }
 12. 
.   //regressing on both subject VAs, 4 VA specifications
.   foreach control in og acs sib both {
 13.     di "test score VA with `control' controls"
 14. 
.     reg `outcome' va_ela_`control' va_math_`control' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       if touse_g11_ela==1 & touse_g11_math==1 ///
>       , cluster(school_id)
 15.     //add mean of yvar to stored results
.     estadd ysumm, mean
 16.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_
> `outcome'_va_ela_math_`control'.ster, replace
 17.   }
 18. 
. }
Dependent Var = enr
Subject = ela
test score VA with og controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =     365.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1164
                                                Root MSE          =     .41598

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .1514374   .0227215     6.66   0.000     .1068606    .1960141
             |
        year |
       2016  |   .0090597   .0034059     2.66   0.008     .0023778    .0157416
       2017  |  -.0190998   .0038336    -4.98   0.000    -.0266208   -.0115788
       2018  |   -.032069   .0040452    -7.93   0.000    -.0400051   -.0241328
             |
         age |   -.000137   6.51e-06   -21.05   0.000    -.0001498   -.0001242
             |
        male |
       Male  |  -.0687131   .0019677   -34.92   0.000    -.0725733   -.0648528
 1.eth_asian |   .0532649   .0041359    12.88   0.000     .0451508     .061379
1.eth_hisp~c |  -.0316687   .0038225    -8.28   0.000    -.0391679   -.0241696
 1.eth_black |   .0039555   .0058365     0.68   0.498     -.007495    .0154061
 1.eth_other |  -.0107337   .0041971    -2.56   0.011    -.0189679   -.0024995
             |
econ_disad~e |
Economic ..  |  -.0659682   .0027326   -24.14   0.000    -.0713292   -.0606072
             |
limited_en~f |
Limited E..  |  -.0492526    .005952    -8.28   0.000    -.0609295   -.0375756
             |
    disabled |
   Disabled  |  -.0150853    .004686    -3.22   0.001    -.0242787    -.005892
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0794595   .0029308    27.11   0.000     .0737095    .0852094
       2016  |   .0688579   .0028071    24.53   0.000     .0633507    .0743652
       2017  |   .0762473   .0029923    25.48   0.000     .0703768    .0821177
       2018  |   .0712475   .0038033    18.73   0.000      .063786    .0787091
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174042   .0016585   -10.49   0.000    -.0206579   -.0141505
       2016  |  -.0210038   .0015624   -13.44   0.000     -.024069   -.0179386
       2017  |  -.0117307   .0016034    -7.32   0.000    -.0148764   -.0085849
       2018  |  -.0132315   .0015913    -8.32   0.000    -.0163534   -.0101096
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0007036   .0006241    -1.13   0.260     -.001928    .0005207
       2016  |   .0009316   .0005506     1.69   0.091    -.0001485    .0020118
       2017  |  -.0020851   .0005417    -3.85   0.000    -.0031478   -.0010224
       2018  |  -.0049867   .0009503    -5.25   0.000     -.006851   -.0031223
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0539752   .0027691    19.49   0.000     .0485426    .0594079
       2016  |   .0604064   .0028165    21.45   0.000     .0548807     .065932
       2017  |   .0565015   .0029844    18.93   0.000     .0506465    .0623566
       2018  |   .0879908   .0038894    22.62   0.000     .0803604    .0956213
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0102715   .0020322    -5.05   0.000    -.0142584   -.0062845
       2016  |  -.0151504   .0018095    -8.37   0.000    -.0187005   -.0116003
       2017  |  -.0131167   .0019505    -6.72   0.000    -.0169434     -.00929
       2018  |  -.0024933   .0016288    -1.53   0.126    -.0056888    .0007022
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0006333    .000709    -0.89   0.372    -.0020243    .0007577
       2016  |   .0007221   .0007081     1.02   0.308    -.0006671    .0021113
       2017  |   .0001323     .00072     0.18   0.854    -.0012802    .0015449
       2018  |  -.0068736    .000962    -7.14   0.000     -.008761   -.0049862
             |
       _cons |   1.652466   .0388183    42.57   0.000     1.576309    1.728622
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73277973
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_ela_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =     366.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1162
                                                Root MSE          =     .41603

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_acs |   .1404331   .0232511     6.04   0.000     .0948175    .1860487
             |
        year |
       2016  |   .0089397   .0034038     2.63   0.009     .0022619    .0156176
       2017  |  -.0190974   .0038352    -4.98   0.000    -.0266215   -.0115732
       2018  |  -.0321538   .0040438    -7.95   0.000    -.0400872   -.0242204
             |
         age |  -.0001375   6.52e-06   -21.09   0.000    -.0001503   -.0001247
             |
        male |
       Male  |  -.0686984   .0019689   -34.89   0.000    -.0725611   -.0648356
 1.eth_asian |   .0544559   .0041797    13.03   0.000     .0462558     .062656
1.eth_hisp~c |  -.0309938   .0038302    -8.09   0.000    -.0385082   -.0234794
 1.eth_black |   .0032897   .0058428     0.56   0.574    -.0081731    .0147524
 1.eth_other |  -.0106223   .0042093    -2.52   0.012    -.0188804   -.0023642
             |
econ_disad~e |
Economic ..  |  -.0663055   .0027367   -24.23   0.000    -.0716745   -.0609366
             |
limited_en~f |
Limited E..  |  -.0492694    .005957    -8.27   0.000    -.0609562   -.0375826
             |
    disabled |
   Disabled  |  -.0147975   .0046923    -3.15   0.002    -.0240032   -.0055918
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0795692   .0029325    27.13   0.000      .073816    .0853224
       2016  |   .0690387   .0028062    24.60   0.000     .0635333    .0745441
       2017  |   .0762756   .0029924    25.49   0.000      .070405    .0821463
       2018  |    .071323   .0038035    18.75   0.000     .0638611    .0787849
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174113   .0016593   -10.49   0.000    -.0206666   -.0141559
       2016  |  -.0210277   .0015641   -13.44   0.000    -.0240962   -.0179592
       2017  |  -.0117407    .001603    -7.32   0.000    -.0148855   -.0085959
       2018  |  -.0132486   .0015913    -8.33   0.000    -.0163705   -.0101267
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0007019   .0006241    -1.12   0.261    -.0019264    .0005225
       2016  |   .0009381   .0005514     1.70   0.089    -.0001438      .00202
       2017  |  -.0020783   .0005416    -3.84   0.000    -.0031408   -.0010158
       2018  |   -.004976   .0009503    -5.24   0.000    -.0068403   -.0031117
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0539568   .0027715    19.47   0.000     .0485194    .0593942
       2016  |   .0604555    .002818    21.45   0.000      .054927    .0659841
       2017  |   .0565408   .0029856    18.94   0.000     .0506834    .0623983
       2018  |   .0880993   .0038919    22.64   0.000     .0804639    .0957347
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0102705   .0020337    -5.05   0.000    -.0142603   -.0062807
       2016  |  -.0151268   .0018101    -8.36   0.000     -.018678   -.0115756
       2017  |  -.0130914   .0019506    -6.71   0.000    -.0169183   -.0092645
       2018  |  -.0024424   .0016278    -1.50   0.134    -.0056359    .0007511
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0006232   .0007088    -0.88   0.379    -.0020138    .0007675
       2016  |   .0007267   .0007084     1.03   0.305    -.0006631    .0021166
       2017  |   .0001336     .00072     0.19   0.853    -.0012789     .001546
       2018  |  -.0068574   .0009617    -7.13   0.000    -.0087443   -.0049706
             |
       _cons |   1.655085   .0388606    42.59   0.000     1.578845    1.731324
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73277973
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_ela_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =     365.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1164
                                                Root MSE          =     .41598

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_sib |   .1517064   .0227489     6.67   0.000      .107076    .1963368
             |
        year |
       2016  |   .0090594   .0034058     2.66   0.008     .0023776    .0157412
       2017  |  -.0191014   .0038337    -4.98   0.000    -.0266226   -.0115802
       2018  |   -.032069   .0040454    -7.93   0.000    -.0400056   -.0241325
             |
         age |   -.000137   6.51e-06   -21.05   0.000    -.0001498   -.0001242
             |
        male |
       Male  |  -.0687132   .0019676   -34.92   0.000    -.0725735   -.0648529
 1.eth_asian |   .0532535   .0041358    12.88   0.000     .0451395    .0613674
1.eth_hisp~c |  -.0316617   .0038222    -8.28   0.000    -.0391603   -.0241631
 1.eth_black |   .0039643    .005837     0.68   0.497    -.0074872    .0154157
 1.eth_other |  -.0107426   .0041969    -2.56   0.011    -.0189765   -.0025088
             |
econ_disad~e |
Economic ..  |  -.0659592    .002733   -24.13   0.000    -.0713209   -.0605974
             |
limited_en~f |
Limited E..  |  -.0492567   .0059514    -8.28   0.000    -.0609326   -.0375809
             |
    disabled |
   Disabled  |  -.0150857   .0046861    -3.22   0.001    -.0242792   -.0058921
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0794589    .002931    27.11   0.000     .0737087    .0852091
       2016  |   .0688569    .002807    24.53   0.000     .0633499    .0743639
       2017  |   .0762512   .0029921    25.48   0.000      .070381    .0821214
       2018  |   .0712479   .0038033    18.73   0.000     .0637863    .0787096
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174029   .0016585   -10.49   0.000    -.0206565   -.0141492
       2016  |  -.0210024   .0015624   -13.44   0.000    -.0240676   -.0179372
       2017  |  -.0117285   .0016034    -7.31   0.000    -.0148743   -.0085828
       2018  |  -.0132299   .0015913    -8.31   0.000    -.0163518   -.0101081
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0007039    .000624    -1.13   0.260    -.0019282    .0005204
       2016  |   .0009314   .0005506     1.69   0.091    -.0001487    .0020116
       2017  |  -.0020859   .0005417    -3.85   0.000    -.0031486   -.0010232
       2018  |  -.0049867   .0009503    -5.25   0.000    -.0068511   -.0031223
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0539771   .0027692    19.49   0.000     .0485443    .0594099
       2016  |   .0604085   .0028166    21.45   0.000     .0548827    .0659343
       2017  |   .0565029   .0029844    18.93   0.000     .0506479    .0623578
       2018  |   .0879915   .0038895    22.62   0.000     .0803609    .0956221
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0102703   .0020322    -5.05   0.000    -.0142572   -.0062833
       2016  |  -.0151488   .0018095    -8.37   0.000    -.0186989   -.0115988
       2017  |  -.0131157   .0019505    -6.72   0.000    -.0169424   -.0092891
       2018  |  -.0024933   .0016288    -1.53   0.126    -.0056888    .0007022
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0006338    .000709    -0.89   0.372    -.0020248    .0007572
       2016  |   .0007214   .0007081     1.02   0.308    -.0006678    .0021106
       2017  |   .0001316     .00072     0.18   0.855    -.0012809    .0015442
       2018  |  -.0068739    .000962    -7.15   0.000    -.0087613   -.0049865
             |
       _cons |   1.652412   .0388175    42.57   0.000     1.576257    1.728567
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73277973
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_ela_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =     366.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1162
                                                Root MSE          =     .41603

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_ela_both |   .1406898    .023277     6.04   0.000     .0950233    .1863562
             |
        year |
       2016  |    .008939   .0034037     2.63   0.009     .0022613    .0156167
       2017  |  -.0190991   .0038352    -4.98   0.000    -.0266234   -.0115748
       2018  |  -.0321544    .004044    -7.95   0.000    -.0400882   -.0242205
             |
         age |  -.0001375   6.52e-06   -21.09   0.000    -.0001503   -.0001247
             |
        male |
       Male  |  -.0686984   .0019689   -34.89   0.000    -.0725611   -.0648357
 1.eth_asian |   .0544536   .0041799    13.03   0.000     .0462531    .0626541
1.eth_hisp~c |  -.0309897     .00383    -8.09   0.000    -.0385036   -.0234758
 1.eth_black |   .0032956   .0058431     0.56   0.573    -.0081678    .0147591
 1.eth_other |  -.0106282   .0042091    -2.53   0.012     -.018886   -.0023704
             |
econ_disad~e |
Economic ..  |  -.0662936   .0027369   -24.22   0.000    -.0716631   -.0609242
             |
limited_en~f |
Limited E..  |  -.0492711   .0059568    -8.27   0.000    -.0609575   -.0375848
             |
    disabled |
   Disabled  |  -.0147984   .0046923    -3.15   0.002    -.0240042   -.0055927
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0795688   .0029326    27.13   0.000     .0738154    .0853222
       2016  |   .0690381   .0028061    24.60   0.000     .0635329    .0745433
       2017  |   .0762786   .0029923    25.49   0.000     .0704081    .0821491
       2018  |   .0713228   .0038035    18.75   0.000     .0638608    .0787848
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174107   .0016593   -10.49   0.000     -.020666   -.0141554
       2016  |   -.021027   .0015641   -13.44   0.000    -.0240956   -.0179585
       2017  |  -.0117397    .001603    -7.32   0.000    -.0148845   -.0085949
       2018  |  -.0132476   .0015913    -8.33   0.000    -.0163695   -.0101257
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0007022   .0006241    -1.13   0.261    -.0019266    .0005223
       2016  |   .0009379   .0005515     1.70   0.089     -.000144    .0020198
       2017  |  -.0020789   .0005416    -3.84   0.000    -.0031414   -.0010164
       2018  |  -.0049761   .0009503    -5.24   0.000    -.0068404   -.0031117
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0539582   .0027716    19.47   0.000     .0485207    .0593958
       2016  |   .0604572   .0028181    21.45   0.000     .0549285    .0659859
       2017  |   .0565418   .0029856    18.94   0.000     .0506844    .0623991
       2018  |   .0881003    .003892    22.64   0.000     .0804647    .0957358
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0102701   .0020337    -5.05   0.000    -.0142599   -.0062803
       2016  |   -.015126   .0018101    -8.36   0.000    -.0186772   -.0115749
       2017  |   -.013091   .0019506    -6.71   0.000    -.0169179   -.0092641
       2018  |  -.0024431   .0016278    -1.50   0.134    -.0056366    .0007505
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0006235   .0007088    -0.88   0.379    -.0020141    .0007671
       2016  |   .0007262   .0007084     1.03   0.305    -.0006636     .002116
       2017  |    .000133     .00072     0.18   0.853    -.0012795    .0015455
       2018  |  -.0068579   .0009618    -7.13   0.000    -.0087447   -.0049711
             |
       _cons |   1.655046     .03886    42.59   0.000     1.578807    1.731284
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73277973
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_ela_both.ster saved
Subject = math
test score VA with og controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =     348.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1175
                                                Root MSE          =     .41545

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_math_og |    .193208   .0213923     9.03   0.000      .151239    .2351771
             |
        year |
       2016  |   .0091837   .0034168     2.69   0.007     .0024803    .0158871
       2017  |  -.0200157   .0038069    -5.26   0.000    -.0274843   -.0125471
       2018  |  -.0328046   .0040652    -8.07   0.000      -.04078   -.0248292
             |
         age |  -.0001371   6.49e-06   -21.14   0.000    -.0001499   -.0001244
             |
        male |
       Male  |  -.0689401   .0019629   -35.12   0.000     -.072791   -.0650891
 1.eth_asian |   .0513672   .0041399    12.41   0.000     .0432451    .0594892
1.eth_hisp~c |  -.0295296   .0037057    -7.97   0.000    -.0367998   -.0222594
 1.eth_black |   .0077644   .0058392     1.33   0.184    -.0036914    .0192202
 1.eth_other |  -.0101158   .0040851    -2.48   0.013    -.0181302   -.0021014
             |
econ_disad~e |
Economic ..  |  -.0622356   .0026924   -23.12   0.000    -.0675176   -.0569535
             |
limited_en~f |
Limited E..  |  -.0486527   .0059865    -8.13   0.000    -.0603974   -.0369079
             |
    disabled |
   Disabled  |  -.0172009   .0046821    -3.67   0.000    -.0263866   -.0080153
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0780701   .0029127    26.80   0.000     .0723558    .0837845
       2016  |   .0667917   .0028513    23.42   0.000     .0611977    .0723857
       2017  |    .074354   .0030197    24.62   0.000     .0684297    .0802783
       2018  |   .0721136   .0038052    18.95   0.000     .0646483    .0795789
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0172173   .0016603   -10.37   0.000    -.0204745     -.01396
       2016  |   -.021696   .0015368   -14.12   0.000    -.0247111    -.018681
       2017  |  -.0118879   .0016043    -7.41   0.000    -.0150354   -.0087404
       2018  |  -.0130458    .001602    -8.14   0.000    -.0161888   -.0099028
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0007519   .0006196    -1.21   0.225    -.0019676    .0004637
       2016  |   .0010918   .0005412     2.02   0.044       .00003    .0021536
       2017  |  -.0020025    .000544    -3.68   0.000    -.0030698   -.0009353
       2018  |  -.0050841   .0009542    -5.33   0.000    -.0069563    -.003212
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538856   .0027836    19.36   0.000     .0484245    .0593466
       2016  |     .06061   .0028231    21.47   0.000     .0550716    .0661485
       2017  |   .0576904   .0030098    19.17   0.000     .0517856    .0635952
       2018  |   .0856601   .0038906    22.02   0.000     .0780273    .0932929
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0109812   .0020539    -5.35   0.000    -.0150108   -.0069517
       2016  |  -.0156169   .0018126    -8.62   0.000     -.019173   -.0120607
       2017  |  -.0134156   .0019567    -6.86   0.000    -.0172545   -.0095768
       2018  |  -.0034973   .0016443    -2.13   0.034    -.0067233   -.0002713
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004683   .0007071    -0.66   0.508    -.0018555     .000919
       2016  |   .0007756   .0007063     1.10   0.272    -.0006101    .0021613
       2017  |    .000065   .0007276     0.09   0.929    -.0013624    .0014924
       2018  |  -.0069478   .0009659    -7.19   0.000    -.0088429   -.0050528
             |
       _cons |   1.652073   .0387702    42.61   0.000     1.576011    1.728135
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73331325
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_math_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =     354.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1166
                                                Root MSE          =     .41566

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_math_acs |   .1685795   .0233734     7.21   0.000     .1227237    .2144352
             |
        year |
       2016  |   .0090025   .0034075     2.64   0.008     .0023173    .0156876
       2017  |  -.0199281   .0038175    -5.22   0.000    -.0274176   -.0124387
       2018  |  -.0328685   .0040585    -8.10   0.000    -.0408307   -.0249063
             |
         age |  -.0001375   6.52e-06   -21.08   0.000    -.0001503   -.0001247
             |
        male |
       Male  |  -.0688457   .0019663   -35.01   0.000    -.0727033   -.0649881
 1.eth_asian |   .0541408   .0041718    12.98   0.000     .0459563    .0623254
1.eth_hisp~c |  -.0302385    .003752    -8.06   0.000    -.0375994   -.0228776
 1.eth_black |   .0055151   .0058863     0.94   0.349     -.006033    .0170633
 1.eth_other |  -.0098983   .0041396    -2.39   0.017    -.0180196    -.001777
             |
econ_disad~e |
Economic ..  |  -.0645375    .002704   -23.87   0.000    -.0698425   -.0592325
             |
limited_en~f |
Limited E..  |  -.0485803   .0060122    -8.08   0.000    -.0603755    -.036785
             |
    disabled |
   Disabled  |  -.0159097    .004703    -3.38   0.001    -.0251365   -.0066829
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0786061   .0029172    26.95   0.000      .072883    .0843293
       2016  |   .0676301   .0028462    23.76   0.000     .0620463    .0732139
       2017  |   .0749644   .0030138    24.87   0.000     .0690516    .0808771
       2018  |   .0723585   .0038065    19.01   0.000     .0648907    .0798264
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0171145   .0016632   -10.29   0.000    -.0203775   -.0138515
       2016  |  -.0215776   .0015411   -14.00   0.000    -.0246011   -.0185542
       2017  |  -.0117462   .0016026    -7.33   0.000    -.0148903    -.008602
       2018  |  -.0131308   .0016006    -8.20   0.000    -.0162708   -.0099907
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0007686   .0006202    -1.24   0.215    -.0019853     .000448
       2016  |   .0010877   .0005439     2.00   0.046     .0000207    .0021547
       2017  |  -.0020316   .0005434    -3.74   0.000    -.0030978   -.0009654
       2018  |  -.0050478   .0009538    -5.29   0.000    -.0069192   -.0031765
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538223   .0027888    19.30   0.000     .0483511    .0592936
       2016  |   .0607632   .0028284    21.48   0.000     .0552142    .0663123
       2017  |   .0576298   .0030119    19.13   0.000     .0517207    .0635388
       2018  |   .0862753   .0038968    22.14   0.000     .0786303    .0939202
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0108978    .002054    -5.31   0.000    -.0149275   -.0068681
       2016  |  -.0154978   .0018123    -8.55   0.000    -.0190533   -.0119424
       2017  |   -.013335    .001956    -6.82   0.000    -.0171725   -.0094975
       2018  |  -.0031543     .00164    -1.92   0.055    -.0063718    .0000632
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004375    .000706    -0.62   0.536    -.0018226    .0009475
       2016  |   .0007911   .0007069     1.12   0.263    -.0005958     .002178
       2017  |   .0000859    .000727     0.12   0.906    -.0013405    .0015122
       2018  |  -.0068586   .0009629    -7.12   0.000    -.0087477   -.0049694
             |
       _cons |   1.655295     .03892    42.53   0.000     1.578939    1.731651
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73331325
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_math_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =     348.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1175
                                                Root MSE          =     .41545

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_math_sib |    .193991   .0214362     9.05   0.000     .1519358    .2360461
             |
        year |
       2016  |   .0091847   .0034168     2.69   0.007     .0024814     .015888
       2017  |  -.0200204   .0038069    -5.26   0.000    -.0274891   -.0125517
       2018  |  -.0328046    .004066    -8.07   0.000    -.0407817   -.0248276
             |
         age |  -.0001371   6.49e-06   -21.13   0.000    -.0001498   -.0001244
             |
        male |
       Male  |  -.0689415   .0019629   -35.12   0.000    -.0727924   -.0650905
 1.eth_asian |   .0513323   .0041406    12.40   0.000      .043209    .0594555
1.eth_hisp~c |  -.0295024   .0037051    -7.96   0.000    -.0367715   -.0222334
 1.eth_black |   .0078001   .0058402     1.34   0.182    -.0036575    .0192578
 1.eth_other |  -.0101389   .0040843    -2.48   0.013    -.0181518   -.0021259
             |
econ_disad~e |
Economic ..  |  -.0621999   .0026934   -23.09   0.000    -.0674839   -.0569158
             |
limited_en~f |
Limited E..  |  -.0486617   .0059854    -8.13   0.000    -.0604043    -.036919
             |
    disabled |
   Disabled  |  -.0172085   .0046824    -3.68   0.000    -.0263949   -.0080221
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0780655   .0029128    26.80   0.000     .0723509      .08378
       2016  |    .066779    .002851    23.42   0.000     .0611856    .0723723
       2017  |   .0743601   .0030192    24.63   0.000     .0684367    .0802835
       2018  |   .0721144   .0038053    18.95   0.000     .0646489    .0795799
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0172153   .0016601   -10.37   0.000    -.0204723   -.0139584
       2016  |  -.0216949   .0015368   -14.12   0.000    -.0247098   -.0186799
       2017  |  -.0118838   .0016042    -7.41   0.000    -.0150311   -.0087364
       2018  |  -.0130405   .0016021    -8.14   0.000    -.0161836   -.0098974
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0007524   .0006196    -1.21   0.225    -.0019679    .0004631
       2016  |   .0010916   .0005412     2.02   0.044     .0000298    .0021534
       2017  |  -.0020043   .0005439    -3.68   0.000    -.0030715   -.0009372
       2018  |  -.0050844   .0009543    -5.33   0.000    -.0069565   -.0032122
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538915   .0027838    19.36   0.000       .04843     .059353
       2016  |   .0606161   .0028232    21.47   0.000     .0550774    .0661548
       2017  |   .0576957   .0030096    19.17   0.000     .0517912    .0636002
       2018  |    .085656   .0038906    22.02   0.000     .0780232    .0932888
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0109789    .002054    -5.35   0.000    -.0150085   -.0069493
       2016  |  -.0156146   .0018125    -8.62   0.000    -.0191705   -.0120588
       2017  |  -.0134136   .0019567    -6.86   0.000    -.0172524   -.0095748
       2018  |  -.0035003   .0016444    -2.13   0.033    -.0067264   -.0002741
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004698   .0007071    -0.66   0.507     -.001857    .0009174
       2016  |    .000774   .0007063     1.10   0.273    -.0006116    .0021596
       2017  |   .0000631   .0007276     0.09   0.931    -.0013643    .0014906
       2018  |  -.0069488    .000966    -7.19   0.000    -.0088439   -.0050537
             |
       _cons |   1.651924   .0387705    42.61   0.000     1.575861    1.727987
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73331325
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_math_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =     354.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1166
                                                Root MSE          =     .41566

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_math_both |   .1691986   .0234181     7.23   0.000     .1232552    .2151421
             |
        year |
       2016  |   .0090012   .0034073     2.64   0.008     .0023164     .015686
       2017  |  -.0199333   .0038176    -5.22   0.000    -.0274228   -.0124437
       2018  |  -.0328705    .004059    -8.10   0.000    -.0408337   -.0249072
             |
         age |  -.0001375   6.52e-06   -21.08   0.000    -.0001503   -.0001247
             |
        male |
       Male  |  -.0688466   .0019663   -35.01   0.000    -.0727042   -.0649889
 1.eth_asian |   .0541356   .0041724    12.97   0.000     .0459499    .0623214
1.eth_hisp~c |  -.0302256   .0037515    -8.06   0.000    -.0375855   -.0228657
 1.eth_black |   .0055349   .0058873     0.94   0.347    -.0060153     .017085
 1.eth_other |  -.0099119    .004139    -2.39   0.017    -.0180322   -.0017916
             |
econ_disad~e |
Economic ..  |  -.0645053   .0027046   -23.85   0.000    -.0698114   -.0591991
             |
limited_en~f |
Limited E..  |  -.0485823   .0060121    -8.08   0.000    -.0603772   -.0367873
             |
    disabled |
   Disabled  |  -.0159146   .0047033    -3.38   0.001    -.0251419   -.0066872
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0786034   .0029173    26.94   0.000       .07288    .0843268
       2016  |   .0676229   .0028459    23.76   0.000     .0620395    .0732062
       2017  |   .0749693   .0030136    24.88   0.000     .0690571    .0808815
       2018  |   .0723584   .0038066    19.01   0.000     .0648904    .0798264
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0171143   .0016631   -10.29   0.000    -.0203771   -.0138514
       2016  |  -.0215777   .0015411   -14.00   0.000    -.0246011   -.0185542
       2017  |  -.0117445   .0016026    -7.33   0.000    -.0148886   -.0086004
       2018  |  -.0131277   .0016006    -8.20   0.000    -.0162678   -.0099875
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0007689   .0006201    -1.24   0.215    -.0019855    .0004476
       2016  |   .0010875   .0005439     2.00   0.046     .0000205    .0021545
       2017  |  -.0020328   .0005434    -3.74   0.000     -.003099   -.0009667
       2018  |   -.005048   .0009539    -5.29   0.000    -.0069194   -.0031766
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538263   .0027889    19.30   0.000     .0483548    .0592979
       2016  |   .0607683   .0028286    21.48   0.000      .055219    .0663176
       2017  |   .0576334   .0030119    19.14   0.000     .0517244    .0635423
       2018  |   .0862741   .0038968    22.14   0.000     .0786291    .0939192
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0108976    .002054    -5.31   0.000    -.0149273   -.0068678
       2016  |  -.0154973   .0018122    -8.55   0.000    -.0190525   -.0119421
       2017  |  -.0133343   .0019561    -6.82   0.000    -.0171719   -.0094968
       2018  |  -.0031578   .0016401    -1.93   0.054    -.0063755    .0000599
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004384    .000706    -0.62   0.535    -.0018235    .0009466
       2016  |     .00079   .0007069     1.12   0.264    -.0005968    .0021769
       2017  |   .0000845   .0007271     0.12   0.908    -.0013419    .0015109
       2018  |  -.0068598    .000963    -7.12   0.000     -.008749   -.0049706
             |
       _cons |   1.655196     .03892    42.53   0.000      1.57884    1.731552
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73331325
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_math_both.ster saved
test score VA with og controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =     334.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1170
                                                Root MSE          =     .41511

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |    .031733   .0268616     1.18   0.238    -.0209661    .0844322
  va_math_og |    .173553   .0253417     6.85   0.000     .1238357    .2232704
             |
        year |
       2016  |   .0084458   .0034509     2.45   0.015     .0016756    .0152159
       2017  |  -.0207581   .0038144    -5.44   0.000    -.0282414   -.0132748
       2018  |   -.033304   .0040851    -8.15   0.000    -.0413185   -.0252895
             |
         age |  -.0001363   6.46e-06   -21.08   0.000    -.0001489   -.0001236
             |
        male |
       Male  |  -.0688341   .0019666   -35.00   0.000    -.0726923   -.0649758
 1.eth_asian |    .051201   .0041412    12.36   0.000     .0430764    .0593255
1.eth_hisp~c |   -.029788   .0037028    -8.04   0.000    -.0370524   -.0225237
 1.eth_black |   .0079325    .005821     1.36   0.173    -.0034875    .0193526
 1.eth_other |  -.0103481    .004081    -2.54   0.011    -.0183546   -.0023416
             |
econ_disad~e |
Economic ..  |  -.0624244   .0026802   -23.29   0.000    -.0676825   -.0571663
             |
limited_en~f |
Limited E..  |  -.0487161   .0060102    -8.11   0.000    -.0605074   -.0369248
             |
    disabled |
   Disabled  |  -.0165729   .0047298    -3.50   0.000    -.0258522   -.0072935
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0781213   .0029175    26.78   0.000     .0723975    .0838452
       2016  |   .0665393   .0028519    23.33   0.000     .0609441    .0721344
       2017  |   .0750707   .0030226    24.84   0.000     .0691407    .0810007
       2018  |   .0715308   .0038117    18.77   0.000     .0640527    .0790089
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0175392   .0016706   -10.50   0.000    -.0208168   -.0142617
       2016  |  -.0214903   .0015539   -13.83   0.000    -.0245388   -.0184419
       2017  |  -.0119042   .0016124    -7.38   0.000    -.0150676   -.0087409
       2018  |  -.0131211   .0016055    -8.17   0.000    -.0162708   -.0099713
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006631   .0006242    -1.06   0.288    -.0018877    .0005615
       2016  |   .0010737   .0005458     1.97   0.049     2.88e-06    .0021445
       2017  |  -.0020383   .0005433    -3.75   0.000    -.0031042   -.0009724
       2018  |   -.004999   .0009554    -5.23   0.000    -.0068734   -.0031246
             |
        year#|
          c. |
prior_math~e |
       2015  |    .053084   .0027864    19.05   0.000     .0476175    .0585505
       2016  |   .0603687   .0028172    21.43   0.000     .0548418    .0658957
       2017  |   .0572177   .0030193    18.95   0.000     .0512942    .0631413
       2018  |   .0858816   .0038877    22.09   0.000     .0782544    .0935088
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.010615   .0020659    -5.14   0.000     -.014668   -.0065619
       2016  |  -.0153893   .0018253    -8.43   0.000    -.0189704   -.0118083
       2017  |  -.0133739   .0019581    -6.83   0.000    -.0172155   -.0095323
       2018  |  -.0032539    .001643    -1.98   0.048    -.0064772   -.0000306
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004967   .0007145    -0.70   0.487    -.0018986    .0009051
       2016  |   .0007415   .0007096     1.04   0.296    -.0006507    .0021336
       2017  |   .0000933   .0007257     0.13   0.898    -.0013303     .001517
       2018  |  -.0069797   .0009668    -7.22   0.000    -.0088765   -.0050828
             |
       _cons |   1.648082   .0386709    42.62   0.000     1.572214    1.723949
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73424438
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_ela_math_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =     341.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1162
                                                Root MSE          =      .4153

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_acs |   .0502424   .0277784     1.81   0.071    -.0042554    .1047402
 va_math_acs |   .1361196    .027895     4.88   0.000     .0813929    .1908462
             |
        year |
       2016  |   .0082991   .0034419     2.41   0.016     .0015466    .0150516
       2017  |   -.020617   .0038245    -5.39   0.000    -.0281202   -.0131138
       2018  |  -.0333339   .0040773    -8.18   0.000     -.041333   -.0253348
             |
         age |  -.0001366   6.51e-06   -20.99   0.000    -.0001494   -.0001239
             |
        male |
       Male  |  -.0687275   .0019695   -34.90   0.000    -.0725914   -.0648636
 1.eth_asian |   .0539466   .0041652    12.95   0.000      .045775    .0621181
1.eth_hisp~c |   -.030414   .0037576    -8.09   0.000    -.0377859    -.023042
 1.eth_black |   .0056765   .0058652     0.97   0.333    -.0058304    .0171834
 1.eth_other |  -.0100912   .0041367    -2.44   0.015    -.0182069   -.0019754
             |
econ_disad~e |
Economic ..  |  -.0646457   .0026966   -23.97   0.000    -.0699361   -.0593554
             |
limited_en~f |
Limited E..  |  -.0486477   .0060254    -8.07   0.000    -.0604687   -.0368266
             |
    disabled |
   Disabled  |   -.015301   .0047511    -3.22   0.001     -.024622     -.00598
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0786851   .0029224    26.92   0.000     .0729517    .0844184
       2016  |   .0673875   .0028453    23.68   0.000     .0618053    .0729697
       2017  |   .0757262   .0030162    25.11   0.000     .0698088    .0816436
       2018  |   .0717649   .0038124    18.82   0.000     .0642854    .0792443
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174042   .0016732   -10.40   0.000    -.0206868   -.0141216
       2016  |  -.0213457   .0015584   -13.70   0.000    -.0244031   -.0182884
       2017  |  -.0117459   .0016106    -7.29   0.000    -.0149057   -.0085861
       2018  |  -.0132083   .0016045    -8.23   0.000     -.016356   -.0100605
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.000688   .0006246    -1.10   0.271    -.0019135    .0005375
       2016  |   .0010681   .0005483     1.95   0.052    -7.68e-06    .0021438
       2017  |  -.0020727   .0005427    -3.82   0.000    -.0031373    -.001008
       2018  |  -.0049689   .0009553    -5.20   0.000    -.0068432   -.0030947
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0530193   .0027905    19.00   0.000     .0475448    .0584938
       2016  |   .0604775    .002824    21.42   0.000     .0549371    .0660179
       2017  |   .0571508   .0030209    18.92   0.000     .0512241    .0630775
       2018  |   .0865127   .0038941    22.22   0.000      .078873    .0941524
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0105146   .0020655    -5.09   0.000    -.0145669   -.0064623
       2016  |   -.015248   .0018252    -8.35   0.000    -.0188288   -.0116671
       2017  |  -.0132914   .0019573    -6.79   0.000    -.0171313   -.0094515
       2018  |  -.0028904   .0016392    -1.76   0.078    -.0061064    .0003256
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004672   .0007135    -0.65   0.513     -.001867    .0009326
       2016  |   .0007559   .0007102     1.06   0.287    -.0006374    .0021491
       2017  |   .0001146   .0007251     0.16   0.874    -.0013079    .0015371
       2018  |  -.0068819   .0009641    -7.14   0.000    -.0087733   -.0049906
             |
       _cons |   1.651027   .0388633    42.48   0.000     1.574782    1.727272
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73424438
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_ela_math_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =     334.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1170
                                                Root MSE          =      .4151

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_sib |   .0317794   .0268744     1.18   0.237    -.0209448    .0845036
 va_math_sib |   .1743078    .025379     6.87   0.000     .1245173    .2240983
             |
        year |
       2016  |   .0084467   .0034508     2.45   0.015     .0016766    .0152167
       2017  |  -.0207626   .0038144    -5.44   0.000     -.028246   -.0132791
       2018  |   -.033304   .0040859    -8.15   0.000    -.0413201   -.0252879
             |
         age |  -.0001362   6.46e-06   -21.08   0.000    -.0001489   -.0001236
             |
        male |
       Male  |  -.0688353   .0019666   -35.00   0.000    -.0726936   -.0649771
 1.eth_asian |   .0511668   .0041418    12.35   0.000     .0430411    .0592925
1.eth_hisp~c |  -.0297613   .0037019    -8.04   0.000    -.0370241   -.0224986
 1.eth_black |   .0079686   .0058218     1.37   0.171    -.0034531    .0193903
 1.eth_other |  -.0103704   .0040802    -2.54   0.011    -.0183754   -.0023655
             |
econ_disad~e |
Economic ..  |  -.0623893    .002681   -23.27   0.000    -.0676491   -.0571296
             |
limited_en~f |
Limited E..  |  -.0487246   .0060091    -8.11   0.000    -.0605138   -.0369354
             |
    disabled |
   Disabled  |  -.0165806   .0047302    -3.51   0.000    -.0258605   -.0073006
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0781165   .0029176    26.77   0.000     .0723925    .0838405
       2016  |   .0665271   .0028516    23.33   0.000     .0609326    .0721216
       2017  |   .0750767   .0030221    24.84   0.000     .0691476    .0810057
       2018  |   .0715316   .0038118    18.77   0.000     .0640533      .07901
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0175373   .0016705   -10.50   0.000    -.0208145     -.01426
       2016  |  -.0214891   .0015538   -13.83   0.000    -.0245375   -.0184407
       2017  |  -.0119002   .0016123    -7.38   0.000    -.0150634   -.0087371
       2018  |  -.0131159   .0016055    -8.17   0.000    -.0162657   -.0099661
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006636   .0006241    -1.06   0.288    -.0018881    .0005609
       2016  |   .0010735   .0005458     1.97   0.049     2.67e-06    .0021443
       2017  |  -.0020401   .0005433    -3.76   0.000    -.0031059   -.0009743
       2018  |  -.0049992   .0009554    -5.23   0.000    -.0068737   -.0031247
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0530901   .0027866    19.05   0.000     .0476232     .058557
       2016  |   .0603745   .0028173    21.43   0.000     .0548473    .0659017
       2017  |   .0572231   .0030192    18.95   0.000     .0512998    .0631464
       2018  |   .0858775   .0038877    22.09   0.000     .0782504    .0935047
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0106127   .0020659    -5.14   0.000    -.0146658   -.0065596
       2016  |  -.0153871   .0018252    -8.43   0.000    -.0189678   -.0118063
       2017  |  -.0133719   .0019581    -6.83   0.000    -.0172134   -.0095303
       2018  |  -.0032567   .0016431    -1.98   0.048    -.0064802   -.0000332
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004982   .0007145    -0.70   0.486       -.0019    .0009036
       2016  |   .0007399   .0007096     1.04   0.297    -.0006522     .002132
       2017  |   .0000915   .0007257     0.13   0.900    -.0013322    .0015152
       2018  |  -.0069807   .0009669    -7.22   0.000    -.0088776   -.0050838
             |
       _cons |   1.647935   .0386706    42.61   0.000     1.572068    1.723802
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73424438
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_ela_math_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =     341.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1162
                                                Root MSE          =      .4153

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_ela_both |   .0503438   .0277893     1.81   0.070    -.0041754     .104863
va_math_both |   .1366776   .0279286     4.89   0.000     .0818851    .1914701
             |
        year |
       2016  |    .008298   .0034417     2.41   0.016     .0015458    .0150501
       2017  |  -.0206217   .0038246    -5.39   0.000    -.0281251   -.0131184
       2018  |  -.0333357   .0040778    -8.17   0.000    -.0413357   -.0253356
             |
         age |  -.0001366   6.51e-06   -20.99   0.000    -.0001494   -.0001239
             |
        male |
       Male  |  -.0687282   .0019695   -34.90   0.000    -.0725921   -.0648643
 1.eth_asian |   .0539416   .0041657    12.95   0.000     .0457691    .0621141
1.eth_hisp~c |  -.0304017    .003757    -8.09   0.000    -.0377725   -.0230309
 1.eth_black |   .0056965   .0058662     0.97   0.332    -.0058122    .0172053
 1.eth_other |   -.010104   .0041361    -2.44   0.015    -.0182186   -.0019894
             |
econ_disad~e |
Economic ..  |  -.0646148   .0026971   -23.96   0.000    -.0699061   -.0593235
             |
limited_en~f |
Limited E..  |  -.0486493   .0060252    -8.07   0.000      -.06047   -.0368286
             |
    disabled |
   Disabled  |  -.0153059   .0047513    -3.22   0.001    -.0246275   -.0059844
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0786824   .0029225    26.92   0.000     .0729488    .0844159
       2016  |   .0673809   .0028451    23.68   0.000     .0617991    .0729627
       2017  |   .0757312   .0030159    25.11   0.000     .0698143    .0816481
       2018  |   .0717648   .0038125    18.82   0.000     .0642851    .0792444
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174038   .0016731   -10.40   0.000    -.0206862   -.0141214
       2016  |  -.0213456   .0015584   -13.70   0.000     -.024403   -.0182882
       2017  |  -.0117443   .0016105    -7.29   0.000    -.0149039   -.0085846
       2018  |  -.0132053   .0016045    -8.23   0.000    -.0163531   -.0100574
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006883   .0006246    -1.10   0.271    -.0019137     .000537
       2016  |   .0010678   .0005483     1.95   0.052    -7.93e-06    .0021436
       2017  |  -.0020739   .0005426    -3.82   0.000    -.0031385   -.0010093
       2018  |  -.0049692   .0009554    -5.20   0.000    -.0068435   -.0030949
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0530234   .0027906    19.00   0.000     .0475485    .0584983
       2016  |   .0604822   .0028242    21.42   0.000     .0549415    .0660228
       2017  |   .0571545   .0030209    18.92   0.000     .0512279     .063081
       2018  |   .0865114   .0038941    22.22   0.000     .0788716    .0941512
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0105143   .0020656    -5.09   0.000    -.0145667   -.0064619
       2016  |  -.0152473   .0018251    -8.35   0.000     -.018828   -.0116667
       2017  |  -.0132906   .0019573    -6.79   0.000    -.0171305   -.0094506
       2018  |  -.0028937   .0016393    -1.77   0.078    -.0061098    .0003225
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004681   .0007135    -0.66   0.512    -.0018678    .0009317
       2016  |   .0007548   .0007101     1.06   0.288    -.0006384     .002148
       2017  |   .0001132   .0007251     0.16   0.876    -.0013093    .0015358
       2018  |   -.006883   .0009641    -7.14   0.000    -.0087744   -.0049916
             |
       _cons |   1.650929   .0388629    42.48   0.000     1.574685    1.727174
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .73424438
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_ela_math_both.ster saved
Dependent Var = enr_2year
Subject = ela
test score VA with og controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =     258.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0542
                                                Root MSE          =     .46784

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |  -.0187671   .0314473    -0.60   0.551    -.0804627    .0429284
             |
        year |
       2016  |  -.0090116     .00373    -2.42   0.016    -.0163292   -.0016939
       2017  |  -.0391763   .0041376    -9.47   0.000    -.0472938   -.0310589
       2018  |  -.0132836    .004494    -2.96   0.003    -.0221003   -.0044669
             |
         age |  -.0000642   7.04e-06    -9.11   0.000     -.000078   -.0000503
             |
        male |
       Male  |   .0226584   .0020859    10.86   0.000     .0185662    .0267507
 1.eth_asian |  -.0128237   .0068323    -1.88   0.061    -.0262277    .0005803
1.eth_hisp~c |  -.0084807    .005694    -1.49   0.137    -.0196517    .0026902
 1.eth_black |  -.0399084   .0069726    -5.72   0.000    -.0535877   -.0262291
 1.eth_other |   .0013714   .0059226     0.23   0.817     -.010248    .0129908
             |
econ_disad~e |
Economic ..  |  -.0260081   .0039315    -6.62   0.000    -.0337211   -.0182951
             |
limited_en~f |
Limited E..  |  -.0244037   .0061742    -3.95   0.000    -.0365166   -.0122908
             |
    disabled |
   Disabled  |   .0319213   .0052698     6.06   0.000     .0215826      .04226
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0622731   .0033391   -18.65   0.000    -.0688239   -.0557223
       2016  |  -.0590773   .0033291   -17.75   0.000    -.0656085    -.052546
       2017  |  -.0517186   .0034861   -14.84   0.000    -.0585579   -.0448794
       2018  |  -.0276094   .0042873    -6.44   0.000    -.0360204   -.0191983
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0411646   .0017116   -24.05   0.000    -.0445225   -.0378067
       2016  |  -.0396801   .0017629   -22.51   0.000    -.0431387   -.0362215
       2017  |  -.0312603   .0017026   -18.36   0.000    -.0346006   -.0279199
       2018  |  -.0324774   .0016847   -19.28   0.000    -.0357826   -.0291722
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108574     .00068    15.97   0.000     .0095234    .0121915
       2016  |    .010565   .0005649    18.70   0.000     .0094567    .0116733
       2017  |   .0083095   .0005885    14.12   0.000     .0071549    .0094641
       2018  |   .0043493   .0010694     4.07   0.000     .0022512    .0064474
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0678172   .0034666   -19.56   0.000    -.0746183   -.0610161
       2016  |  -.0678044   .0037372   -18.14   0.000    -.0751362   -.0604725
       2017  |  -.0678715   .0037802   -17.95   0.000    -.0752876   -.0604553
       2018  |  -.0565886   .0045828   -12.35   0.000    -.0655795   -.0475976
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0278354   .0021667   -12.85   0.000    -.0320862   -.0235846
       2016  |  -.0328345   .0020718   -15.85   0.000    -.0368991     -.02877
       2017  |  -.0259394   .0021394   -12.12   0.000    -.0301367   -.0217421
       2018  |  -.0358404   .0017761   -20.18   0.000    -.0393248    -.032356
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0092527   .0007718    11.99   0.000     .0077384    .0107669
       2016  |   .0113786   .0008198    13.88   0.000     .0097702    .0129871
       2017  |   .0091187   .0008284    11.01   0.000     .0074936    .0107439
       2018  |   .0021953   .0010841     2.02   0.043     .0000684    .0043221
             |
       _cons |    .857475   .0427784    20.04   0.000     .7735492    .9414008
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36360384
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_ela_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =     258.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0542
                                                Root MSE          =     .46784

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_acs |  -.0221234   .0318338    -0.69   0.487    -.0845772    .0403305
             |
        year |
       2016  |  -.0090173   .0037288    -2.42   0.016    -.0163327   -.0017018
       2017  |  -.0391816   .0041379    -9.47   0.000    -.0472996   -.0310636
       2018  |  -.0132801   .0044935    -2.96   0.003    -.0220957   -.0044645
             |
         age |  -.0000641   7.04e-06    -9.11   0.000     -.000078   -.0000503
             |
        male |
       Male  |   .0226563   .0020858    10.86   0.000     .0185642    .0267485
 1.eth_asian |  -.0129601   .0068323    -1.90   0.058    -.0263643     .000444
1.eth_hisp~c |  -.0085424   .0056951    -1.50   0.134    -.0197155    .0026307
 1.eth_black |  -.0398875   .0069777    -5.72   0.000    -.0535769   -.0261981
 1.eth_other |   .0013493   .0059234     0.23   0.820    -.0102717    .0129702
             |
econ_disad~e |
Economic ..  |  -.0259803   .0039294    -6.61   0.000    -.0336893   -.0182712
             |
limited_en~f |
Limited E..  |  -.0244345   .0061735    -3.96   0.000    -.0365461   -.0123229
             |
    disabled |
   Disabled  |   .0319055    .005269     6.06   0.000     .0215684    .0422426
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0622822   .0033403   -18.65   0.000    -.0688354   -.0557289
       2016  |  -.0590684   .0033272   -17.75   0.000     -.065596   -.0525409
       2017  |  -.0517457   .0034867   -14.84   0.000    -.0585862   -.0449052
       2018  |  -.0276167   .0042871    -6.44   0.000    -.0360274    -.019206
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0411699   .0017115   -24.05   0.000    -.0445277    -.037812
       2016  |  -.0396854   .0017631   -22.51   0.000    -.0431444   -.0362264
       2017  |  -.0312636   .0017026   -18.36   0.000    -.0346039   -.0279233
       2018  |  -.0324797   .0016848   -19.28   0.000    -.0357851   -.0291744
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108577     .00068    15.97   0.000     .0095236    .0121918
       2016  |   .0105634    .000565    18.70   0.000      .009455    .0116719
       2017  |   .0083107   .0005885    14.12   0.000     .0071561    .0094652
       2018  |   .0043503   .0010693     4.07   0.000     .0022525    .0064481
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0678262   .0034663   -19.57   0.000    -.0746267   -.0610257
       2016  |  -.0678055   .0037372   -18.14   0.000    -.0751375   -.0604735
       2017  |  -.0678861   .0037808   -17.96   0.000    -.0753035   -.0604687
       2018  |   -.056573    .004585   -12.34   0.000    -.0655682   -.0475778
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0278418   .0021668   -12.85   0.000    -.0320928   -.0235907
       2016  |  -.0328423   .0020719   -15.85   0.000    -.0369072   -.0287775
       2017  |  -.0259474   .0021396   -12.13   0.000    -.0301451   -.0217498
       2018  |  -.0358457   .0017765   -20.18   0.000    -.0393311   -.0323604
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0092529    .000772    11.99   0.000     .0077384    .0107675
       2016  |   .0113789   .0008198    13.88   0.000     .0097705    .0129873
       2017  |   .0091194   .0008285    11.01   0.000     .0074941    .0107448
       2018  |   .0021889   .0010842     2.02   0.044     .0000617     .004316
             |
       _cons |   .8575163   .0427969    20.04   0.000     .7735542    .9414783
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36360384
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_ela_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =     258.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0542
                                                Root MSE          =     .46784

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_sib |  -.0159883   .0314957    -0.51   0.612    -.0777789    .0458023
             |
        year |
       2016  |  -.0089979   .0037293    -2.41   0.016    -.0163144   -.0016814
       2017  |  -.0391735   .0041372    -9.47   0.000    -.0472901   -.0310569
       2018  |  -.0132782   .0044933    -2.96   0.003    -.0220935   -.0044628
             |
         age |  -.0000641   7.04e-06    -9.11   0.000    -.0000779   -.0000503
             |
        male |
       Male  |   .0226583   .0020858    10.86   0.000     .0185662    .0267505
 1.eth_asian |  -.0128507   .0068307    -1.88   0.060    -.0262517    .0005504
1.eth_hisp~c |  -.0085061   .0056935    -1.49   0.135    -.0196761    .0026638
 1.eth_black |   -.039863   .0069711    -5.72   0.000    -.0535394   -.0261866
 1.eth_other |   .0013749   .0059223     0.23   0.816    -.0102438    .0129937
             |
econ_disad~e |
Economic ..  |  -.0259951   .0039321    -6.61   0.000    -.0337093   -.0182808
             |
limited_en~f |
Limited E..  |  -.0243848   .0061736    -3.95   0.000    -.0364966   -.0122729
             |
    disabled |
   Disabled  |    .031905   .0052697     6.05   0.000     .0215666    .0422434
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0622776    .003339   -18.65   0.000    -.0688282   -.0557269
       2016  |  -.0590977   .0033293   -17.75   0.000    -.0656294   -.0525661
       2017  |  -.0517066   .0034856   -14.83   0.000    -.0585449   -.0448682
       2018  |  -.0276119   .0042865    -6.44   0.000    -.0360214   -.0192025
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0411613   .0017115   -24.05   0.000    -.0445189   -.0378036
       2016  |  -.0396752   .0017628   -22.51   0.000    -.0431335   -.0362169
       2017  |  -.0312578   .0017027   -18.36   0.000    -.0345983   -.0279173
       2018  |  -.0324748   .0016848   -19.28   0.000    -.0357801   -.0291695
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108571     .00068    15.97   0.000     .0095231    .0121911
       2016  |   .0105654   .0005648    18.71   0.000     .0094572    .0116735
       2017  |   .0083083   .0005885    14.12   0.000     .0071538    .0094629
       2018  |   .0043479   .0010694     4.07   0.000     .0022498     .006446
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0678109   .0034667   -19.56   0.000    -.0746121   -.0610097
       2016  |  -.0678082   .0037373   -18.14   0.000    -.0751404   -.0604761
       2017  |  -.0678669   .0037798   -17.96   0.000    -.0752825   -.0604514
       2018  |  -.0566066   .0045823   -12.35   0.000    -.0655965   -.0476167
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0278321   .0021666   -12.85   0.000    -.0320827   -.0235816
       2016  |  -.0328325   .0020718   -15.85   0.000    -.0368971   -.0287678
       2017  |  -.0259373   .0021394   -12.12   0.000    -.0301345   -.0217401
       2018  |  -.0358419   .0017759   -20.18   0.000     -.039326   -.0323577
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0092517   .0007718    11.99   0.000     .0077375    .0107659
       2016  |   .0113782   .0008198    13.88   0.000     .0097698    .0129865
       2017  |   .0091183   .0008283    11.01   0.000     .0074933    .0107433
       2018  |   .0021974   .0010841     2.03   0.043     .0000706    .0043242
             |
       _cons |   .8572303   .0427749    20.04   0.000     .7733114    .9411491
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36360384
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_ela_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =     258.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0542
                                                Root MSE          =     .46784

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_ela_both |  -.0197951   .0318799    -0.62   0.535    -.0823393    .0427491
             |
        year |
       2016  |  -.0090069   .0037283    -2.42   0.016    -.0163212   -.0016925
       2017  |  -.0391789   .0041375    -9.47   0.000    -.0472961   -.0310616
       2018  |  -.0132765   .0044929    -2.96   0.003    -.0220909   -.0044621
             |
         age |  -.0000641   7.04e-06    -9.11   0.000    -.0000779   -.0000503
             |
        male |
       Male  |   .0226565   .0020858    10.86   0.000     .0185644    .0267485
 1.eth_asian |  -.0129654   .0068311    -1.90   0.058    -.0263672    .0004364
1.eth_hisp~c |   -.008554   .0056946    -1.50   0.133     -.019726    .0026181
 1.eth_black |  -.0398575   .0069765    -5.71   0.000    -.0535445   -.0261705
 1.eth_other |   .0013543   .0059231     0.23   0.819     -.010266    .0129746
             |
econ_disad~e |
Economic ..  |  -.0259749   .0039299    -6.61   0.000     -.033685   -.0182649
             |
limited_en~f |
Limited E..  |  -.0244178   .0061731    -3.96   0.000    -.0365285    -.012307
             |
    disabled |
   Disabled  |   .0318957    .005269     6.05   0.000     .0215586    .0422327
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0622844   .0033402   -18.65   0.000    -.0688375   -.0557313
       2016  |   -.059084   .0033273   -17.76   0.000    -.0656118   -.0525562
       2017  |  -.0517343   .0034863   -14.84   0.000     -.058574   -.0448946
       2018  |  -.0276177   .0042864    -6.44   0.000    -.0360271   -.0192083
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0411669   .0017115   -24.05   0.000    -.0445245   -.0378092
       2016  |  -.0396813    .001763   -22.51   0.000    -.0431401   -.0362226
       2017  |  -.0312615   .0017027   -18.36   0.000    -.0346019   -.0279211
       2018  |  -.0324776   .0016848   -19.28   0.000    -.0357831   -.0291722
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108575     .00068    15.97   0.000     .0095235    .0121916
       2016  |   .0105639   .0005649    18.70   0.000     .0094555    .0116722
       2017  |   .0083097   .0005885    14.12   0.000     .0071553    .0094642
       2018  |   .0043491   .0010693     4.07   0.000     .0022513     .006447
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0678208   .0034664   -19.57   0.000    -.0746214   -.0610201
       2016  |  -.0678082   .0037374   -18.14   0.000    -.0751404    -.060476
       2017  |  -.0678813   .0037805   -17.96   0.000    -.0752982   -.0604644
       2018  |  -.0565877   .0045846   -12.34   0.000     -.065582   -.0475934
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0278387   .0021668   -12.85   0.000    -.0320896   -.0235878
       2016  |    -.03284    .002072   -15.85   0.000    -.0369049   -.0287751
       2017  |  -.0259451   .0021396   -12.13   0.000    -.0301426   -.0217475
       2018  |  -.0358461   .0017764   -20.18   0.000    -.0393312    -.032361
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0092522    .000772    11.98   0.000     .0077377    .0107668
       2016  |   .0113786   .0008198    13.88   0.000     .0097702    .0129869
       2017  |   .0091191   .0008284    11.01   0.000     .0074938    .0107443
       2018  |   .0021911   .0010842     2.02   0.043     .0000641    .0043182
             |
       _cons |   .8573385   .0427942    20.03   0.000     .7733819    .9412951
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36360384
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_ela_both.ster saved
Subject = math
test score VA with og controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =     264.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0549
                                                Root MSE          =     .46766

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_math_og |  -.1042751   .0299438    -3.48   0.001     -.163021   -.0455292
             |
        year |
       2016  |  -.0090188   .0037619    -2.40   0.017    -.0163991   -.0016384
       2017  |  -.0386845   .0041601    -9.30   0.000    -.0468462   -.0305228
       2018  |  -.0132183   .0045175    -2.93   0.003    -.0220811   -.0043556
             |
         age |   -.000066   7.05e-06    -9.36   0.000    -.0000798   -.0000522
             |
        male |
       Male  |   .0231625    .002084    11.11   0.000     .0190739    .0272512
 1.eth_asian |  -.0117809   .0067577    -1.74   0.082    -.0250387    .0014768
1.eth_hisp~c |  -.0094221   .0056945    -1.65   0.098     -.020594    .0017498
 1.eth_black |  -.0431385   .0068779    -6.27   0.000    -.0566321   -.0296449
 1.eth_other |   .0024644    .005976     0.41   0.680    -.0092599    .0141887
             |
econ_disad~e |
Economic ..  |  -.0275717   .0039383    -7.00   0.000    -.0352981   -.0198453
             |
limited_en~f |
Limited E..  |  -.0250721    .006177    -4.06   0.000    -.0371906   -.0129536
             |
    disabled |
   Disabled  |   .0327447   .0053356     6.14   0.000      .022277    .0432123
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0620548   .0033543   -18.50   0.000    -.0686356   -.0554741
       2016  |   -.057967   .0032866   -17.64   0.000    -.0644149    -.051519
       2017  |  -.0511716   .0034576   -14.80   0.000    -.0579551   -.0443881
       2018  |  -.0274085   .0043073    -6.36   0.000    -.0358589   -.0189581
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0403997     .00172   -23.49   0.000    -.0437742   -.0370253
       2016  |  -.0396882   .0017598   -22.55   0.000    -.0431407   -.0362356
       2017  |  -.0306956   .0017038   -18.02   0.000    -.0340382    -.027353
       2018  |  -.0327232   .0016814   -19.46   0.000    -.0360218   -.0294246
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0107379   .0006802    15.79   0.000     .0094035    .0120723
       2016  |   .0106174   .0005673    18.72   0.000     .0095045    .0117304
       2017  |    .008135   .0005878    13.84   0.000     .0069818    .0092883
       2018  |   .0044283   .0010699     4.14   0.000     .0023292    .0065274
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0684014   .0034955   -19.57   0.000     -.075259   -.0615438
       2016  |  -.0678628   .0037499   -18.10   0.000    -.0752196   -.0605059
       2017  |  -.0685319   .0037641   -18.21   0.000    -.0759165   -.0611472
       2018  |  -.0554297   .0045716   -12.12   0.000    -.0643986   -.0464608
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0280813   .0021991   -12.77   0.000    -.0323957   -.0237669
       2016  |  -.0327053   .0020742   -15.77   0.000    -.0367746    -.028636
       2017  |  -.0263874   .0021487   -12.28   0.000    -.0306028    -.022172
       2018  |  -.0353572   .0017918   -19.73   0.000    -.0388726   -.0318418
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0095091   .0007785    12.21   0.000     .0079818    .0110364
       2016  |   .0114333   .0008216    13.92   0.000     .0098214    .0130452
       2017  |   .0093131   .0008292    11.23   0.000     .0076863    .0109398
       2018  |   .0023256   .0010797     2.15   0.031     .0002074    .0044438
             |
       _cons |    .869223   .0428137    20.30   0.000     .7852278    .9532182
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36357195
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_math_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =     260.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0549
                                                Root MSE          =     .46765

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_math_acs |  -.1149118   .0324147    -3.55   0.000    -.1785054   -.0513182
             |
        year |
       2016  |  -.0090066    .003764    -2.39   0.017     -.016391   -.0016221
       2017  |  -.0386941   .0041632    -9.29   0.000    -.0468618   -.0305265
       2018  |  -.0131853   .0045171    -2.92   0.004    -.0220473   -.0043232
             |
         age |   -.000066   7.05e-06    -9.37   0.000    -.0000799   -.0000522
             |
        male |
       Male  |   .0231411   .0020829    11.11   0.000     .0190547    .0272275
 1.eth_asian |   -.013216   .0067575    -1.96   0.051    -.0264734    .0000414
1.eth_hisp~c |  -.0091003   .0057301    -1.59   0.113     -.020342    .0021414
 1.eth_black |  -.0425005   .0069229    -6.14   0.000    -.0560825   -.0289186
 1.eth_other |   .0023336   .0059896     0.39   0.697    -.0094172    .0140844
             |
econ_disad~e |
Economic ..  |   -.026564   .0039325    -6.75   0.000    -.0342792   -.0188489
             |
limited_en~f |
Limited E..  |  -.0253339   .0061574    -4.11   0.000    -.0374139   -.0132538
             |
    disabled |
   Disabled  |   .0322588    .005305     6.08   0.000     .0218511    .0426665
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   -.062224   .0033575   -18.53   0.000    -.0688111   -.0556369
       2016  |  -.0581233   .0032907   -17.66   0.000    -.0645792   -.0516674
       2017  |  -.0514969   .0034673   -14.85   0.000    -.0582992   -.0446945
       2018  |  -.0275373   .0043067    -6.39   0.000    -.0359865    -.019088
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0404378   .0017182   -23.53   0.000    -.0438087   -.0370668
       2016  |    -.03974   .0017589   -22.59   0.000    -.0431908   -.0362892
       2017  |  -.0307492   .0017032   -18.05   0.000    -.0340908   -.0274077
       2018  |  -.0327196   .0016817   -19.46   0.000    -.0360189   -.0294203
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0107371   .0006808    15.77   0.000     .0094015    .0120728
       2016  |   .0106085   .0005675    18.69   0.000     .0094952    .0117217
       2017  |    .008148   .0005884    13.85   0.000     .0069937    .0093023
       2018  |   .0044184   .0010692     4.13   0.000     .0023209     .006516
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0684465   .0034935   -19.59   0.000    -.0753003   -.0615927
       2016  |  -.0679695   .0037469   -18.14   0.000    -.0753204   -.0606186
       2017  |   -.068603   .0037654   -18.22   0.000    -.0759903   -.0612156
       2018  |  -.0554718   .0045829   -12.10   0.000    -.0644629   -.0464807
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0281311   .0021982   -12.80   0.000    -.0324437   -.0238186
       2016  |  -.0327551   .0020745   -15.79   0.000     -.036825   -.0286853
       2017  |  -.0264554   .0021488   -12.31   0.000    -.0306711   -.0222398
       2018  |  -.0354566   .0017925   -19.78   0.000    -.0389733   -.0319399
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |    .009502   .0007792    12.19   0.000     .0079734    .0110307
       2016  |   .0114291   .0008216    13.91   0.000     .0098172     .013041
       2017  |   .0093111   .0008297    11.22   0.000     .0076833     .010939
       2018  |   .0022682   .0010801     2.10   0.036     .0001493    .0043871
             |
       _cons |   .8692575   .0427913    20.31   0.000     .7853062    .9532088
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36357195
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_math_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =     264.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0549
                                                Root MSE          =     .46767

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_math_sib |  -.0998278   .0300815    -3.32   0.001    -.1588439   -.0408117
             |
        year |
       2016  |  -.0089996   .0037597    -2.39   0.017    -.0163756   -.0016235
       2017  |   -.038691   .0041589    -9.30   0.000    -.0468501   -.0305318
       2018  |  -.0132165   .0045161    -2.93   0.003    -.0220765   -.0043564
             |
         age |  -.0000659   7.05e-06    -9.35   0.000    -.0000798   -.0000521
             |
        male |
       Male  |   .0231556   .0020841    11.11   0.000     .0190668    .0272444
 1.eth_asian |  -.0118436   .0067637    -1.75   0.080    -.0251132     .001426
1.eth_hisp~c |  -.0094076   .0056966    -1.65   0.099    -.0205836    .0017684
 1.eth_black |  -.0429986   .0068775    -6.25   0.000    -.0564914   -.0295057
 1.eth_other |   .0024732   .0059772     0.41   0.679    -.0092534    .0141997
             |
econ_disad~e |
Economic ..  |  -.0274907   .0039438    -6.97   0.000     -.035228   -.0197535
             |
limited_en~f |
Limited E..  |    -.02503   .0061775    -4.05   0.000    -.0371495   -.0129104
             |
    disabled |
   Disabled  |   .0326788   .0053348     6.13   0.000     .0222126    .0431451
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0620872   .0033542   -18.51   0.000    -.0686677   -.0555066
       2016  |  -.0580338   .0032875   -17.65   0.000    -.0644835   -.0515842
       2017  |  -.0511908    .003459   -14.80   0.000     -.057977   -.0444046
       2018  |  -.0274157   .0043071    -6.37   0.000    -.0358657   -.0189657
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0404064   .0017197   -23.50   0.000    -.0437802   -.0370326
       2016  |  -.0396939   .0017594   -22.56   0.000    -.0431456   -.0362422
       2017  |  -.0307053   .0017039   -18.02   0.000    -.0340481   -.0273625
       2018  |  -.0327163   .0016818   -19.45   0.000    -.0360158   -.0294168
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0107403   .0006801    15.79   0.000      .009406    .0120745
       2016  |   .0106196   .0005672    18.72   0.000     .0095069    .0117323
       2017  |   .0081372   .0005879    13.84   0.000     .0069838    .0092906
       2018  |   .0044257   .0010701     4.14   0.000     .0023264    .0065251
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0683889   .0034959   -19.56   0.000    -.0752475   -.0615302
       2016  |  -.0678655   .0037505   -18.10   0.000    -.0752234   -.0605075
       2017  |  -.0685147   .0037648   -18.20   0.000    -.0759008   -.0611286
       2018  |  -.0554943   .0045712   -12.14   0.000    -.0644625   -.0465262
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0280837   .0021991   -12.77   0.000    -.0323981   -.0237693
       2016  |  -.0327121   .0020743   -15.77   0.000    -.0367816   -.0286426
       2017  |  -.0263861   .0021487   -12.28   0.000    -.0306016   -.0221707
       2018  |  -.0353795   .0017917   -19.75   0.000    -.0388946   -.0318643
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0095074   .0007785    12.21   0.000       .00798    .0110348
       2016  |    .011433   .0008217    13.91   0.000      .009821     .013045
       2017  |   .0093119   .0008292    11.23   0.000     .0076851    .0109387
       2018  |   .0023255   .0010797     2.15   0.031     .0002074    .0044437
             |
       _cons |   .8689053   .0428139    20.29   0.000     .7849097    .9529008
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36357195
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_math_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =     260.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0549
                                                Root MSE          =     .46766

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_math_both |  -.1110177   .0325404    -3.41   0.001    -.1748579   -.0471775
             |
        year |
       2016  |  -.0089903    .003762    -2.39   0.017    -.0163709   -.0016098
       2017  |  -.0386975    .004162    -9.30   0.000    -.0468629   -.0305321
       2018  |  -.0131837   .0045159    -2.92   0.004    -.0220433   -.0043242
             |
         age |   -.000066   7.05e-06    -9.36   0.000    -.0000798   -.0000522
             |
        male |
       Male  |   .0231364    .002083    11.11   0.000     .0190498    .0272229
 1.eth_asian |  -.0132237   .0067616    -1.96   0.051    -.0264892    .0000417
1.eth_hisp~c |  -.0090979    .005731    -1.59   0.113    -.0203415    .0021457
 1.eth_black |    -.04241   .0069225    -6.13   0.000     -.055991    -.028829
 1.eth_other |    .002345   .0059899     0.39   0.696    -.0094065    .0140964
             |
econ_disad~e |
Economic ..  |   -.026543   .0039366    -6.74   0.000    -.0342661   -.0188198
             |
limited_en~f |
Limited E..  |  -.0252925   .0061579    -4.11   0.000    -.0373735   -.0132115
             |
    disabled |
   Disabled  |    .032224   .0053048     6.07   0.000     .0218167    .0426314
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0622438   .0033575   -18.54   0.000    -.0688308   -.0556569
       2016  |  -.0581718   .0032914   -17.67   0.000    -.0646292   -.0517145
       2017  |  -.0515009   .0034682   -14.85   0.000     -.058305   -.0446967
       2018  |  -.0275378   .0043064    -6.39   0.000    -.0359865   -.0190891
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.040441    .001718   -23.54   0.000    -.0438116   -.0370704
       2016  |  -.0397421   .0017586   -22.60   0.000    -.0431923    -.036292
       2017  |  -.0307544   .0017034   -18.06   0.000    -.0340962   -.0274126
       2018  |   -.032714   .0016821   -19.45   0.000    -.0360141    -.029414
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0107391   .0006807    15.78   0.000     .0094036    .0120746
       2016  |   .0106106   .0005674    18.70   0.000     .0094975    .0117237
       2017  |   .0081493   .0005884    13.85   0.000     .0069949    .0093037
       2018  |   .0044168   .0010693     4.13   0.000      .002319    .0065146
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0684349   .0034939   -19.59   0.000    -.0752896   -.0615803
       2016  |  -.0679685   .0037473   -18.14   0.000    -.0753203   -.0606167
       2017  |  -.0685867   .0037661   -18.21   0.000    -.0759752   -.0611981
       2018  |  -.0555232   .0045825   -12.12   0.000    -.0645134   -.0465329
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0281304   .0021982   -12.80   0.000     -.032443   -.0238178
       2016  |  -.0327581   .0020746   -15.79   0.000    -.0368281    -.028688
       2017  |  -.0264515   .0021488   -12.31   0.000    -.0306671   -.0222359
       2018  |  -.0354697   .0017923   -19.79   0.000    -.0389861   -.0319533
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0095009   .0007792    12.19   0.000     .0079722    .0110296
       2016  |    .011429   .0008216    13.91   0.000     .0098171     .013041
       2017  |   .0093104   .0008298    11.22   0.000     .0076825    .0109382
       2018  |   .0022706     .00108     2.10   0.036     .0001519    .0043894
             |
       _cons |   .8690038   .0427896    20.31   0.000     .7850558    .9529518
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36357195
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_math_both.ster saved
test score VA with og controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =     260.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0555
                                                Root MSE          =     .46756

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0843974   .0382252     2.21   0.027     .0094043    .1593905
  va_math_og |  -.1556366   .0370086    -4.21   0.000    -.2282429   -.0830303
             |
        year |
       2016  |  -.0092977   .0037925    -2.45   0.014     -.016738   -.0018574
       2017  |  -.0391346   .0041862    -9.35   0.000    -.0473474   -.0309218
       2018  |  -.0134662   .0045435    -2.96   0.003      -.02238   -.0045524
             |
         age |  -.0000642   7.03e-06    -9.13   0.000     -.000078   -.0000504
             |
        male |
       Male  |   .0232283   .0020842    11.14   0.000     .0191393    .0273172
 1.eth_asian |  -.0119846   .0066584    -1.80   0.072    -.0250476    .0010783
1.eth_hisp~c |   -.010686   .0056192    -1.90   0.057    -.0217101    .0003382
 1.eth_black |   -.043249   .0068425    -6.32   0.000    -.0566732   -.0298248
 1.eth_other |   .0017661   .0059428     0.30   0.766     -.009893    .0134253
             |
econ_disad~e |
Economic ..  |  -.0283178    .003919    -7.23   0.000    -.0360063   -.0206293
             |
limited_en~f |
Limited E..  |  -.0246611   .0061946    -3.98   0.000    -.0368141    -.012508
             |
    disabled |
   Disabled  |   .0335427   .0053868     6.23   0.000     .0229745    .0441108
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0618301   .0033591   -18.41   0.000    -.0684202   -.0552399
       2016  |  -.0580674   .0032736   -17.74   0.000    -.0644898    -.051645
       2017  |  -.0507148   .0034366   -14.76   0.000    -.0574569   -.0439727
       2018  |  -.0280021   .0042857    -6.53   0.000    -.0364102    -.019594
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0405828    .001734   -23.40   0.000    -.0439846   -.0371809
       2016  |  -.0393697   .0017811   -22.10   0.000    -.0428641   -.0358753
       2017  |  -.0306703   .0017045   -17.99   0.000    -.0340143   -.0273262
       2018  |  -.0328234   .0016898   -19.42   0.000    -.0361385   -.0295083
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108051   .0006833    15.81   0.000     .0094646    .0121455
       2016  |   .0105717   .0005688    18.58   0.000     .0094557    .0116877
       2017  |   .0081546   .0005844    13.95   0.000      .007008    .0093012
       2018  |   .0045258   .0010716     4.22   0.000     .0024234    .0066282
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0695514   .0034877   -19.94   0.000    -.0763939    -.062709
       2016  |  -.0682391   .0037526   -18.18   0.000    -.0756012    -.060877
       2017  |  -.0688011   .0037457   -18.37   0.000    -.0761496   -.0614525
       2018  |  -.0551659   .0045644   -12.09   0.000    -.0641207    -.046211
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0277076   .0022013   -12.59   0.000    -.0320263    -.023389
       2016  |  -.0324605   .0020802   -15.60   0.000    -.0365416   -.0283794
       2017  |  -.0262718   .0021487   -12.23   0.000    -.0304873   -.0220564
       2018  |   -.034995   .0017923   -19.53   0.000    -.0385112   -.0314787
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0095095   .0007773    12.23   0.000     .0079846    .0110344
       2016  |   .0114281   .0008226    13.89   0.000     .0098143     .013042
       2017  |   .0093213   .0008251    11.30   0.000     .0077025    .0109401
       2018  |   .0022964   .0010867     2.11   0.035     .0001644    .0044284
             |
       _cons |   .8595571   .0428044    20.08   0.000     .7755802     .943534
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36374642
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_ela_math_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =     255.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0555
                                                Root MSE          =     .46755

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_acs |   .0858074   .0390132     2.20   0.028     .0092684    .1623465
 va_math_acs |  -.1705146   .0404002    -4.22   0.000    -.2497748   -.0912543
             |
        year |
       2016  |  -.0093099   .0037948    -2.45   0.014    -.0167549   -.0018649
       2017  |   -.039145   .0041897    -9.34   0.000    -.0473647   -.0309254
       2018  |  -.0134535   .0045427    -2.96   0.003    -.0223657   -.0045414
             |
         age |  -.0000644   7.04e-06    -9.15   0.000    -.0000783   -.0000506
             |
        male |
       Male  |   .0232027   .0020829    11.14   0.000     .0191164     .027289
 1.eth_asian |  -.0134927   .0066615    -2.03   0.043    -.0265617   -.0004238
1.eth_hisp~c |  -.0098681   .0056775    -1.74   0.082    -.0210067    .0012705
 1.eth_black |  -.0425531   .0068908    -6.18   0.000     -.056072   -.0290341
 1.eth_other |   .0016394     .00596     0.28   0.783    -.0100534    .0133323
             |
econ_disad~e |
Economic ..  |  -.0269712   .0039134    -6.89   0.000    -.0346488   -.0192935
             |
limited_en~f |
Limited E..  |  -.0249958   .0061712    -4.05   0.000     -.037103   -.0128887
             |
    disabled |
   Disabled  |   .0329407   .0053476     6.16   0.000     .0224493     .043432
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0620343   .0033614   -18.45   0.000    -.0686289   -.0554397
       2016  |  -.0582619   .0032794   -17.77   0.000    -.0646957   -.0518282
       2017  |  -.0511445   .0034495   -14.83   0.000     -.057912    -.044377
       2018  |   -.028156   .0042862    -6.57   0.000    -.0365649    -.019747
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0406372    .001732   -23.46   0.000    -.0440352   -.0372392
       2016  |  -.0394475   .0017802   -22.16   0.000      -.04294    -.035955
       2017  |  -.0307495   .0017032   -18.05   0.000    -.0340911    -.027408
       2018  |  -.0328192   .0016901   -19.42   0.000     -.036135   -.0295034
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108053   .0006841    15.79   0.000     .0094632    .0121474
       2016  |   .0105633   .0005691    18.56   0.000     .0094467    .0116799
       2017  |   .0081747   .0005853    13.97   0.000     .0070264     .009323
       2018  |   .0045136    .001071     4.21   0.000     .0024124    .0066147
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0696102    .003486   -19.97   0.000    -.0764494    -.062771
       2016  |  -.0683739   .0037488   -18.24   0.000    -.0757286   -.0610192
       2017  |  -.0688648   .0037477   -18.38   0.000    -.0762174   -.0615122
       2018  |  -.0552279    .004576   -12.07   0.000    -.0642054   -.0462503
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.027771   .0022004   -12.62   0.000     -.032088    -.023454
       2016  |  -.0325123   .0020805   -15.63   0.000     -.036594   -.0284307
       2017  |  -.0263483    .002149   -12.26   0.000    -.0305644   -.0221322
       2018  |  -.0351178   .0017924   -19.59   0.000    -.0386343   -.0316013
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |    .009502   .0007781    12.21   0.000     .0079755    .0110285
       2016  |   .0114219   .0008227    13.88   0.000      .009808    .0130359
       2017  |   .0093162   .0008259    11.28   0.000      .007696    .0109364
       2018  |   .0022265   .0010868     2.05   0.041     .0000944    .0043587
             |
       _cons |   .8604055   .0428211    20.09   0.000     .7763959    .9444152
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36374642
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_ela_math_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =     260.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0554
                                                Root MSE          =     .46757

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_sib |   .0836215   .0382989     2.18   0.029     .0084838    .1587592
 va_math_sib |  -.1507295   .0371458    -4.06   0.000     -.223605    -.077854
             |
        year |
       2016  |  -.0092812   .0037904    -2.45   0.014    -.0167175    -.001845
       2017  |  -.0391442   .0041849    -9.35   0.000    -.0473544   -.0309339
       2018  |  -.0134673   .0045422    -2.96   0.003    -.0223785   -.0045561
             |
         age |  -.0000642   7.03e-06    -9.12   0.000     -.000078   -.0000504
             |
        male |
       Male  |   .0232209   .0020843    11.14   0.000     .0191318    .0273101
 1.eth_asian |  -.0120468   .0066655    -1.81   0.071    -.0251236      .00103
1.eth_hisp~c |  -.0106629   .0056212    -1.90   0.058    -.0216911    .0003653
 1.eth_black |  -.0431069   .0068422    -6.30   0.000    -.0565306   -.0296833
 1.eth_other |   .0017746   .0059441     0.30   0.765    -.0098871    .0134362
             |
econ_disad~e |
Economic ..  |  -.0282327   .0039246    -7.19   0.000    -.0359323   -.0205332
             |
limited_en~f |
Limited E..  |  -.0246205   .0061954    -3.97   0.000    -.0367751   -.0124658
             |
    disabled |
   Disabled  |   .0334741    .005386     6.22   0.000     .0229074    .0440407
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0618648   .0033589   -18.42   0.000    -.0684544   -.0552751
       2016  |  -.0581352   .0032743   -17.75   0.000    -.0645591   -.0517114
       2017  |  -.0507393   .0034379   -14.76   0.000     -.057484   -.0439945
       2018  |  -.0280098   .0042858    -6.54   0.000     -.036418   -.0196017
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0405917   .0017337   -23.41   0.000     -.043993   -.0371904
       2016  |  -.0393773   .0017807   -22.11   0.000    -.0428708   -.0358838
       2017  |  -.0306816   .0017046   -18.00   0.000    -.0340259   -.0273374
       2018  |  -.0328166   .0016903   -19.42   0.000    -.0361326   -.0295005
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    .010808   .0006832    15.82   0.000     .0094676    .0121483
       2016  |    .010574   .0005687    18.59   0.000     .0094583    .0116898
       2017  |   .0081572   .0005845    13.96   0.000     .0070104     .009304
       2018  |   .0045234   .0010718     4.22   0.000     .0024208    .0066261
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0695391   .0034882   -19.94   0.000    -.0763826   -.0626957
       2016  |  -.0682411    .003753   -18.18   0.000    -.0756041   -.0608781
       2017  |  -.0687838   .0037465   -18.36   0.000     -.076134   -.0614335
       2018  |   -.055232   .0045641   -12.10   0.000    -.0641862   -.0462778
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0277113   .0022013   -12.59   0.000    -.0320301   -.0233926
       2016  |  -.0324684   .0020803   -15.61   0.000    -.0365498   -.0283871
       2017  |  -.0262711   .0021487   -12.23   0.000    -.0304866   -.0220556
       2018  |  -.0350189   .0017922   -19.54   0.000    -.0385349   -.0315028
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0095079   .0007773    12.23   0.000     .0079829    .0110329
       2016  |   .0114279   .0008227    13.89   0.000     .0098139    .0130419
       2017  |   .0093201   .0008252    11.29   0.000     .0077012     .010939
       2018  |   .0022956   .0010867     2.11   0.035     .0001637    .0044276
             |
       _cons |   .8592786   .0428062    20.07   0.000      .775298    .9432592
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36374642
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_ela_math_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =     255.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0555
                                                Root MSE          =     .46756

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_ela_both |   .0850937   .0390755     2.18   0.030     .0084324     .161755
va_math_both |  -.1661673   .0405185    -4.10   0.000    -.2456596    -.086675
             |
        year |
       2016  |  -.0092955   .0037929    -2.45   0.014    -.0167368   -.0018543
       2017  |  -.0391508   .0041885    -9.35   0.000    -.0473682   -.0309334
       2018  |  -.0134542   .0045415    -2.96   0.003     -.022364   -.0045444
             |
         age |  -.0000644   7.04e-06    -9.15   0.000    -.0000782   -.0000506
             |
        male |
       Male  |   .0231975    .002083    11.14   0.000      .019111    .0272841
 1.eth_asian |     -.0135   .0066664    -2.03   0.043    -.0265787   -.0004213
1.eth_hisp~c |  -.0098617   .0056786    -1.74   0.083    -.0210025    .0012791
 1.eth_black |  -.0424604   .0068905    -6.16   0.000    -.0559787   -.0289421
 1.eth_other |   .0016505   .0059605     0.28   0.782    -.0100432    .0133442
             |
econ_disad~e |
Economic ..  |  -.0269499   .0039177    -6.88   0.000     -.034636   -.0192638
             |
limited_en~f |
Limited E..  |  -.0249555   .0061719    -4.04   0.000    -.0370641   -.0128469
             |
    disabled |
   Disabled  |   .0329046   .0053474     6.15   0.000     .0224136    .0433955
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0620559   .0033612   -18.46   0.000    -.0686502   -.0554616
       2016  |  -.0583113     .00328   -17.78   0.000    -.0647463   -.0518763
       2017  |  -.0511525   .0034505   -14.82   0.000    -.0579219   -.0443831
       2018  |  -.0281567   .0042861    -6.57   0.000    -.0365655   -.0197478
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0406422   .0017318   -23.47   0.000    -.0440399   -.0372445
       2016  |  -.0394511   .0017798   -22.17   0.000    -.0429429   -.0359593
       2017  |   -.030756   .0017033   -18.06   0.000    -.0340977   -.0274142
       2018  |  -.0328136   .0016905   -19.41   0.000    -.0361302    -.029497
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108077    .000684    15.80   0.000     .0094657    .0121497
       2016  |   .0105656    .000569    18.57   0.000     .0094492     .011682
       2017  |   .0081764   .0005854    13.97   0.000     .0070279    .0093248
       2018  |   .0045122   .0010711     4.21   0.000     .0024108    .0066136
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0695986   .0034865   -19.96   0.000    -.0764387   -.0627586
       2016  |  -.0683721   .0037492   -18.24   0.000    -.0757276   -.0610166
       2017  |  -.0688485   .0037484   -18.37   0.000    -.0762025   -.0614945
       2018  |  -.0552806   .0045757   -12.08   0.000    -.0642575   -.0463038
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0277712   .0022005   -12.62   0.000    -.0320883   -.0234541
       2016  |  -.0325163   .0020806   -15.63   0.000    -.0365982   -.0284344
       2017  |  -.0263447    .002149   -12.26   0.000    -.0305608   -.0221286
       2018  |  -.0351322   .0017923   -19.60   0.000    -.0386484   -.0316159
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0095009   .0007781    12.21   0.000     .0079744    .0110275
       2016  |    .011422   .0008227    13.88   0.000      .009808    .0130361
       2017  |   .0093155   .0008259    11.28   0.000     .0076952    .0109358
       2018  |   .0022285   .0010867     2.05   0.041     .0000966    .0043605
             |
       _cons |   .8601804   .0428209    20.09   0.000      .776171    .9441898
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36374642
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_ela_math_both.ster saved
Dependent Var = enr_4year
Subject = ela
test score VA with og controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =    1968.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2390
                                                Root MSE          =     .42099

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .1702045   .0288878     5.89   0.000     .1135303    .2268787
             |
        year |
       2016  |   .0180713   .0030366     5.95   0.000     .0121139    .0240287
       2017  |   .0200766   .0032047     6.26   0.000     .0137894    .0263637
       2018  |  -.0187854   .0035321    -5.32   0.000    -.0257149   -.0118559
             |
         age |  -.0000729   6.25e-06   -11.66   0.000    -.0000851   -.0000606
             |
        male |
       Male  |  -.0913715   .0017532   -52.12   0.000    -.0948111   -.0879319
 1.eth_asian |   .0660886   .0068266     9.68   0.000     .0526956    .0794815
1.eth_hisp~c |   -.023188   .0052732    -4.40   0.000    -.0335333   -.0128427
 1.eth_black |   .0438639   .0070014     6.26   0.000      .030128    .0575999
 1.eth_other |  -.0121051   .0055352    -2.19   0.029    -.0229646   -.0012457
             |
econ_disad~e |
Economic ..  |  -.0399601   .0039187   -10.20   0.000    -.0476482   -.0322721
             |
limited_en~f |
Limited E..  |  -.0248489   .0033034    -7.52   0.000    -.0313299    -.018368
             |
    disabled |
   Disabled  |  -.0470066   .0034576   -13.60   0.000      -.05379   -.0402232
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1417326   .0029395    48.22   0.000     .1359656    .1474996
       2016  |   .1279352   .0029326    43.62   0.000     .1221818    .1336886
       2017  |   .1279659   .0030697    41.69   0.000     .1219435    .1339882
       2018  |   .0988569   .0039671    24.92   0.000      .091074    .1066398
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0237604   .0011889    19.98   0.000     .0214279     .026093
       2016  |   .0186763   .0012641    14.77   0.000     .0161963    .0211563
       2017  |   .0195296   .0011847    16.49   0.000     .0172055    .0218538
       2018  |   .0192459   .0013362    14.40   0.000     .0166244    .0218674
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0115611   .0005565   -20.77   0.000    -.0126529   -.0104692
       2016  |  -.0096334   .0004946   -19.48   0.000    -.0106038    -.008663
       2017  |  -.0103946      .0005   -20.79   0.000    -.0113755   -.0094137
       2018  |   -.009336   .0008667   -10.77   0.000    -.0110364   -.0076356
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1217925   .0029704    41.00   0.000      .115965    .1276199
       2016  |   .1282107   .0031887    40.21   0.000     .1219549    .1344665
       2017  |    .124373   .0033426    37.21   0.000     .1178153    .1309307
       2018  |   .1445794   .0040636    35.58   0.000     .1366072    .1525516
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0175639   .0015699    11.19   0.000     .0144839    .0206439
       2016  |   .0176841   .0014876    11.89   0.000     .0147657    .0206025
       2017  |   .0128227   .0016058     7.99   0.000     .0096723    .0159731
       2018  |    .033347   .0013006    25.64   0.000     .0307954    .0358987
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.009886   .0006235   -15.85   0.000    -.0111093   -.0086627
       2016  |  -.0106566   .0006886   -15.47   0.000    -.0120076   -.0093055
       2017  |  -.0089864   .0007424   -12.10   0.000    -.0104428     -.00753
       2018  |  -.0090688   .0008614   -10.53   0.000    -.0107589   -.0073788
             |
       _cons |   .7949905   .0363806    21.85   0.000     .7236164    .8663647
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36917589
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_ela_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =    1949.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2389
                                                Root MSE          =     .42104

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_acs |   .1625564   .0295587     5.50   0.000     .1045661    .2205468
             |
        year |
       2016  |    .017957   .0030321     5.92   0.000     .0120084    .0239056
       2017  |   .0200842   .0032054     6.27   0.000     .0137957    .0263727
       2018  |  -.0188737   .0035282    -5.35   0.000    -.0257955   -.0119519
             |
         age |  -.0000734   6.26e-06   -11.72   0.000    -.0000856   -.0000611
             |
        male |
       Male  |  -.0913547   .0017542   -52.08   0.000    -.0947963   -.0879131
 1.eth_asian |    .067416   .0068415     9.85   0.000     .0539939    .0808382
1.eth_hisp~c |  -.0224514   .0052982    -4.24   0.000    -.0328457   -.0120571
 1.eth_black |   .0431772   .0070045     6.16   0.000     .0294354     .056919
 1.eth_other |  -.0119715   .0055489    -2.16   0.031    -.0228578   -.0010853
             |
econ_disad~e |
Economic ..  |  -.0403252   .0039261   -10.27   0.000    -.0480277   -.0326228
             |
limited_en~f |
Limited E..  |  -.0248349   .0032995    -7.53   0.000     -.031308   -.0183618
             |
    disabled |
   Disabled  |   -.046703   .0034505   -13.54   0.000    -.0534725   -.0399335
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1418514   .0029375    48.29   0.000     .1360884    .1476144
       2016  |   .1281071   .0029293    43.73   0.000     .1223603     .133854
       2017  |   .1280213   .0030695    41.71   0.000     .1219994    .1340433
       2018  |   .0989397   .0039636    24.96   0.000     .0911636    .1067159
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0237586    .001188    20.00   0.000      .021428    .0260893
       2016  |   .0186577   .0012641    14.76   0.000     .0161777    .0211377
       2017  |   .0195229   .0011842    16.49   0.000     .0171997    .0218461
       2018  |   .0192311   .0013366    14.39   0.000     .0166089    .0218533
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0115597   .0005565   -20.77   0.000    -.0126515   -.0104679
       2016  |  -.0096253   .0004952   -19.44   0.000    -.0105969   -.0086538
       2017  |   -.010389   .0004999   -20.78   0.000    -.0113697   -.0094083
       2018  |  -.0093263   .0008663   -10.77   0.000    -.0110259   -.0076266
             |
        year#|
          c. |
prior_math~e |
       2015  |    .121783   .0029707    41.00   0.000     .1159549    .1276111
       2016  |    .128261   .0031898    40.21   0.000      .122003    .1345189
       2017  |    .124427   .0033413    37.24   0.000     .1178718    .1309821
       2018  |   .1446723   .0040672    35.57   0.000     .1366931    .1526516
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0175713   .0015697    11.19   0.000     .0144917    .0206508
       2016  |   .0177155   .0014877    11.91   0.000     .0147969    .0206341
       2017  |   .0128561    .001606     8.00   0.000     .0097053    .0160068
       2018  |   .0334033   .0013009    25.68   0.000     .0308512    .0359554
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0098761   .0006236   -15.84   0.000    -.0110995   -.0086527
       2016  |  -.0106522   .0006886   -15.47   0.000    -.0120032   -.0093012
       2017  |  -.0089858   .0007422   -12.11   0.000     -.010442   -.0075297
       2018  |  -.0090463    .000862   -10.49   0.000    -.0107374   -.0073552
             |
       _cons |   .7975685   .0364237    21.90   0.000     .7261099    .8690271
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36917589
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_ela_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =    1969.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2390
                                                Root MSE          =       .421

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_sib |   .1676947   .0289725     5.79   0.000     .1108545     .224535
             |
        year |
       2016  |   .0180573   .0030346     5.95   0.000     .0121037    .0240109
       2017  |   .0200721   .0032043     6.26   0.000     .0137857    .0263585
       2018  |  -.0187908   .0035308    -5.32   0.000    -.0257179   -.0118638
             |
         age |  -.0000729   6.25e-06   -11.66   0.000    -.0000852   -.0000606
             |
        male |
       Male  |  -.0913715   .0017534   -52.11   0.000    -.0948114   -.0879317
 1.eth_asian |   .0661041    .006828     9.68   0.000     .0527084    .0794999
1.eth_hisp~c |  -.0231555   .0052745    -4.39   0.000    -.0335034   -.0128077
 1.eth_black |   .0438272   .0070031     6.26   0.000      .030088    .0575665
 1.eth_other |  -.0121176   .0055365    -2.19   0.029    -.0229795   -.0012556
             |
econ_disad~e |
Economic ..  |  -.0399641   .0039215   -10.19   0.000    -.0476576   -.0322706
             |
limited_en~f |
Limited E..  |   -.024872   .0033049    -7.53   0.000    -.0313558   -.0183882
             |
    disabled |
   Disabled  |  -.0469907   .0034574   -13.59   0.000    -.0537738   -.0402076
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1417364   .0029397    48.21   0.000      .135969    .1475038
       2016  |   .1279546   .0029329    43.63   0.000     .1222007    .1337085
       2017  |   .1279578   .0030694    41.69   0.000      .121936    .1339795
       2018  |   .0988599   .0039666    24.92   0.000     .0910779    .1066418
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0237584   .0011888    19.99   0.000     .0214261    .0260907
       2016  |   .0186728   .0012642    14.77   0.000     .0161927     .021153
       2017  |   .0195293   .0011847    16.48   0.000      .017205    .0218535
       2018  |   .0192449   .0013362    14.40   0.000     .0166234    .0218663
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0115611   .0005565   -20.77   0.000    -.0126529   -.0104693
       2016  |   -.009634   .0004946   -19.48   0.000    -.0106044   -.0086635
       2017  |  -.0103943   .0004999   -20.79   0.000     -.011375   -.0094135
       2018  |  -.0093346   .0008667   -10.77   0.000    -.0110349   -.0076343
             |
        year#|
          c. |
prior_math~e |
       2015  |    .121788   .0029709    40.99   0.000     .1159595    .1276164
       2016  |   .1282167   .0031892    40.20   0.000       .12196    .1344735
       2017  |   .1243698   .0033426    37.21   0.000      .117812    .1309276
       2018  |   .1445981   .0040635    35.58   0.000     .1366261    .1525702
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0175619   .0015701    11.19   0.000     .0144816    .0206421
       2016  |   .0176836   .0014876    11.89   0.000     .0147652    .0206021
       2017  |   .0128216   .0016057     7.98   0.000     .0096713    .0159719
       2018  |   .0333486   .0013005    25.64   0.000     .0307971       .0359
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0098855   .0006235   -15.85   0.000    -.0111088   -.0086622
       2016  |  -.0106567   .0006886   -15.48   0.000    -.0120077   -.0093058
       2017  |  -.0089867   .0007424   -12.11   0.000    -.0104431   -.0075303
       2018  |  -.0090713   .0008615   -10.53   0.000    -.0107613   -.0073812
             |
       _cons |   .7951815   .0363797    21.86   0.000     .7238091    .8665538
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36917589
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_ela_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    416,544
                                                F(37, 1245)       =    1950.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2388
                                                Root MSE          =     .42105

                          (Std. err. adjusted for 1,246 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_ela_both |   .1604849   .0296398     5.41   0.000     .1023355    .2186343
             |
        year |
       2016  |   .0179459   .0030305     5.92   0.000     .0120005    .0238913
       2017  |   .0200798    .003205     6.27   0.000      .013792    .0263675
       2018  |  -.0188779   .0035271    -5.35   0.000    -.0257976   -.0119581
             |
         age |  -.0000734   6.26e-06   -11.72   0.000    -.0000857   -.0000611
             |
        male |
       Male  |  -.0913549   .0017543   -52.07   0.000    -.0947967   -.0879131
 1.eth_asian |    .067419   .0068425     9.85   0.000     .0539948    .0808432
1.eth_hisp~c |  -.0224357   .0052989    -4.23   0.000    -.0328315     -.01204
 1.eth_black |   .0431531   .0070055     6.16   0.000     .0294091    .0568971
 1.eth_other |  -.0119825   .0055496    -2.16   0.031    -.0228702   -.0010948
             |
econ_disad~e |
Economic ..  |  -.0403187   .0039283   -10.26   0.000    -.0480254    -.032612
             |
limited_en~f |
Limited E..  |  -.0248534   .0033008    -7.53   0.000     -.031329   -.0183777
             |
    disabled |
   Disabled  |  -.0466941   .0034504   -13.53   0.000    -.0534634   -.0399249
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1418532   .0029377    48.29   0.000     .1360898    .1476167
       2016  |   .1281221   .0029294    43.74   0.000     .1223749    .1338693
       2017  |   .1280129   .0030692    41.71   0.000     .1219915    .1340343
       2018  |   .0989405   .0039632    24.96   0.000     .0911653    .1067158
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0237562   .0011879    20.00   0.000     .0214257    .0260867
       2016  |   .0186543   .0012642    14.76   0.000     .0161741    .0211345
       2017  |   .0195218   .0011842    16.48   0.000     .0171985    .0218451
       2018  |     .01923   .0013366    14.39   0.000     .0166079    .0218522
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0115597   .0005565   -20.77   0.000    -.0126514   -.0104679
       2016  |   -.009626   .0004952   -19.44   0.000    -.0105975   -.0086544
       2017  |  -.0103887   .0004998   -20.78   0.000    -.0113693   -.0094081
       2018  |  -.0093252   .0008663   -10.76   0.000    -.0110248   -.0076257
             |
        year#|
          c. |
prior_math~e |
       2015  |    .121779   .0029711    40.99   0.000     .1159501    .1276079
       2016  |   .1282654   .0031902    40.21   0.000     .1220067    .1345241
       2017  |   .1244231   .0033413    37.24   0.000     .1178679    .1309783
       2018  |   .1446879    .004067    35.58   0.000     .1367091    .1526668
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0175686   .0015698    11.19   0.000     .0144888    .0206483
       2016  |   .0177139   .0014877    11.91   0.000     .0147953    .0206326
       2017  |   .0128541   .0016059     8.00   0.000     .0097035    .0160048
       2018  |    .033403   .0013008    25.68   0.000     .0308511     .035955
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0098757   .0006236   -15.84   0.000    -.0110991   -.0086523
       2016  |  -.0106523   .0006886   -15.47   0.000    -.0120033   -.0093013
       2017  |  -.0089861   .0007422   -12.11   0.000    -.0104422     -.00753
       2018  |  -.0090491    .000862   -10.50   0.000    -.0107402   -.0073579
             |
       _cons |   .7977072   .0364225    21.90   0.000      .726251    .8691635
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36917589
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_ela_both.ster saved
Subject = math
test score VA with og controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =    2033.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2426
                                                Root MSE          =     .42013

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_math_og |   .2974832   .0263023    11.31   0.000     .2458813     .349085
             |
        year |
       2016  |   .0182025   .0031412     5.79   0.000     .0120398    .0243652
       2017  |   .0186688   .0032327     5.77   0.000     .0123266     .025011
       2018  |  -.0195863   .0036187    -5.41   0.000    -.0266857   -.0124868
             |
         age |  -.0000711   6.22e-06   -11.43   0.000    -.0000833   -.0000589
             |
        male |
       Male  |  -.0921026   .0017298   -53.25   0.000    -.0954962   -.0887089
 1.eth_asian |   .0631481   .0064609     9.77   0.000     .0504727    .0758235
1.eth_hisp~c |  -.0201075   .0051125    -3.93   0.000    -.0301377   -.0100773
 1.eth_black |   .0509029   .0067854     7.50   0.000     .0375907    .0642151
 1.eth_other |  -.0125802   .0054239    -2.32   0.021    -.0232212   -.0019392
             |
econ_disad~e |
Economic ..  |  -.0346639   .0037342    -9.28   0.000      -.04199   -.0273378
             |
limited_en~f |
Limited E..  |  -.0235806   .0033184    -7.11   0.000    -.0300909   -.0170702
             |
    disabled |
   Disabled  |  -.0499456    .003612   -13.83   0.000    -.0570319   -.0428593
             |
        year#|
          c. |
prior_ela_~e |
       2015  |    .140125   .0029451    47.58   0.000      .134347    .1459029
       2016  |   .1247586   .0028977    43.05   0.000     .1190736    .1304436
       2017  |   .1255256   .0029908    41.97   0.000     .1196581    .1313931
       2018  |   .0995221   .0039427    25.24   0.000      .091787    .1072572
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0231824   .0012022    19.28   0.000     .0208238    .0255411
       2016  |   .0179921   .0012749    14.11   0.000     .0154908    .0204934
       2017  |   .0188077   .0011822    15.91   0.000     .0164883    .0211271
       2018  |   .0196775   .0013264    14.84   0.000     .0170753    .0222796
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0114898   .0005566   -20.64   0.000    -.0125817   -.0103979
       2016  |  -.0095256   .0004905   -19.42   0.000    -.0104879   -.0085633
       2017  |  -.0101376   .0004928   -20.57   0.000    -.0111043   -.0091709
       2018  |  -.0095124   .0008637   -11.01   0.000    -.0112069   -.0078179
             |
        year#|
          c. |
prior_math~e |
       2015  |    .122287   .0029595    41.32   0.000     .1164808    .1280932
       2016  |   .1284728   .0031691    40.54   0.000     .1222555    .1346902
       2017  |   .1262223   .0033121    38.11   0.000     .1197243    .1327202
       2018  |   .1410898   .0040066    35.21   0.000     .1332293    .1489503
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |      .0171   .0015747    10.86   0.000     .0140107    .0201893
       2016  |   .0170885   .0014908    11.46   0.000     .0141637    .0200132
       2017  |   .0129718   .0016088     8.06   0.000     .0098155    .0161281
       2018  |   .0318599   .0013226    24.09   0.000     .0292651    .0344547
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0099774   .0006229   -16.02   0.000    -.0111995   -.0087553
       2016  |  -.0106577   .0006887   -15.48   0.000    -.0120088   -.0093065
       2017  |   -.009248   .0007453   -12.41   0.000    -.0107102   -.0077859
       2018  |  -.0092735    .000873   -10.62   0.000    -.0109862   -.0075607
             |
       _cons |   .7828499   .0363506    21.54   0.000     .7115345    .8541653
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .3697413
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_math_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =    2011.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2415
                                                Root MSE          =     .42044

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_math_acs |   .2834913   .0289235     9.80   0.000      .226747    .3402356
             |
        year |
       2016  |    .018009    .003122     5.77   0.000     .0118841    .0241339
       2017  |    .018766    .003243     5.79   0.000     .0124037    .0251283
       2018  |  -.0196832   .0036019    -5.46   0.000    -.0267496   -.0126168
             |
         age |  -.0000715   6.27e-06   -11.40   0.000    -.0000838   -.0000592
             |
        male |
       Male  |  -.0919868   .0017339   -53.05   0.000    -.0953886   -.0885851
 1.eth_asian |   .0673568   .0065486    10.29   0.000     .0545093    .0802043
1.eth_hisp~c |  -.0211382   .0052373    -4.04   0.000    -.0314131   -.0108632
 1.eth_black |   .0480157   .0069218     6.94   0.000      .034436    .0615954
 1.eth_other |  -.0122319   .0055145    -2.22   0.027    -.0230506   -.0014132
             |
econ_disad~e |
Economic ..  |  -.0379734   .0038141    -9.96   0.000    -.0454563   -.0304906
             |
limited_en~f |
Limited E..  |  -.0232464    .003306    -7.03   0.000    -.0297323   -.0167605
             |
    disabled |
   Disabled  |  -.0481685   .0035657   -13.51   0.000     -.055164    -.041173
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1408301   .0029411    47.88   0.000       .13506    .1466003
       2016  |   .1257534   .0028936    43.46   0.000     .1200765    .1314303
       2017  |   .1264612    .003009    42.03   0.000      .120558    .1323644
       2018  |   .0998958   .0039467    25.31   0.000     .0921529    .1076387
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0233233    .001199    19.45   0.000      .020971    .0256756
       2016  |   .0181624   .0012715    14.28   0.000     .0156678    .0206569
       2017  |    .019003   .0011775    16.14   0.000     .0166929    .0213131
       2018  |   .0195888     .00133    14.73   0.000     .0169796     .022198
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0115058   .0005575   -20.64   0.000    -.0125996   -.0104119
       2016  |  -.0095207   .0004927   -19.33   0.000    -.0104873   -.0085542
       2017  |  -.0101796   .0004937   -20.62   0.000    -.0111482    -.009211
       2018  |  -.0094663   .0008627   -10.97   0.000    -.0111587   -.0077738
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1222689    .002964    41.25   0.000     .1164538    .1280839
       2016  |   .1287328   .0031722    40.58   0.000     .1225094    .1349562
       2017  |   .1262327   .0033184    38.04   0.000     .1197224     .132743
       2018  |   .1417471    .004028    35.19   0.000     .1338447    .1496495
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0172333   .0015713    10.97   0.000     .0141506    .0203159
       2016  |   .0172573    .001491    11.57   0.000     .0143322    .0201825
       2017  |   .0131204   .0016108     8.15   0.000     .0099601    .0162806
       2018  |   .0323023   .0013166    24.53   0.000     .0297192    .0348854
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0099396   .0006233   -15.95   0.000    -.0111624   -.0087168
       2016  |  -.0106379   .0006893   -15.43   0.000    -.0119903   -.0092856
       2017  |  -.0092253   .0007459   -12.37   0.000    -.0106886   -.0077619
       2018  |  -.0091268   .0008698   -10.49   0.000    -.0108333   -.0074203
             |
       _cons |   .7860378   .0365031    21.53   0.000     .7144232    .8576524
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .3697413
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_math_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =    2036.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2425
                                                Root MSE          =     .42017

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_math_sib |   .2938187   .0264269    11.12   0.000     .2419725     .345665
             |
        year |
       2016  |   .0181843   .0031364     5.80   0.000      .012031    .0243375
       2017  |   .0186706   .0032322     5.78   0.000     .0123294    .0250117
       2018  |  -.0195881   .0036166    -5.42   0.000    -.0266835   -.0124928
             |
         age |  -.0000712   6.23e-06   -11.43   0.000    -.0000834   -.0000589
             |
        male |
       Male  |  -.0920971   .0017301   -53.23   0.000    -.0954914   -.0887028
 1.eth_asian |   .0631759   .0064728     9.76   0.000     .0504769    .0758748
1.eth_hisp~c |  -.0200949   .0051217    -3.92   0.000    -.0301431   -.0100466
 1.eth_black |   .0507987   .0067925     7.48   0.000     .0374727    .0641247
 1.eth_other |  -.0126121   .0054298    -2.32   0.020    -.0232646   -.0019595
             |
econ_disad~e |
Economic ..  |  -.0347092   .0037454    -9.27   0.000    -.0420572   -.0273612
             |
limited_en~f |
Limited E..  |  -.0236317   .0033212    -7.12   0.000    -.0301475   -.0171159
             |
    disabled |
   Disabled  |  -.0498873    .003612   -13.81   0.000    -.0569736    -.042801
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1401526   .0029461    47.57   0.000     .1343727    .1459325
       2016  |   .1248128   .0028981    43.07   0.000      .119127    .1304986
       2017  |   .1255509   .0029918    41.97   0.000     .1196815    .1314204
       2018  |   .0995301   .0039435    25.24   0.000     .0917934    .1072668
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0231911    .001202    19.29   0.000     .0208329    .0255492
       2016  |    .017999    .001275    14.12   0.000     .0154976    .0205004
       2017  |   .0188216   .0011821    15.92   0.000     .0165024    .0211407
       2018  |   .0196758   .0013266    14.83   0.000     .0170732    .0222785
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0114927   .0005565   -20.65   0.000    -.0125845   -.0104008
       2016  |   -.009528   .0004906   -19.42   0.000    -.0104905   -.0085655
       2017  |  -.0101416   .0004927   -20.58   0.000    -.0111082   -.0091749
       2018  |  -.0095101   .0008638   -11.01   0.000    -.0112048   -.0078154
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1222804   .0029609    41.30   0.000     .1164715    .1280892
       2016  |   .1284816   .0031707    40.52   0.000     .1222611     .134702
       2017  |   .1262103   .0033136    38.09   0.000     .1197094    .1327113
       2018  |   .1411503   .0040073    35.22   0.000     .1332884    .1490122
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0171048   .0015749    10.86   0.000     .0140151    .0201946
       2016  |   .0170975   .0014909    11.47   0.000     .0141725    .0200225
       2017  |   .0129726   .0016089     8.06   0.000     .0098161    .0161291
       2018  |   .0318792   .0013223    24.11   0.000      .029285    .0344734
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0099772    .000623   -16.02   0.000    -.0111994    -.008755
       2016  |   -.010659   .0006888   -15.47   0.000    -.0120103   -.0093076
       2017  |  -.0092487   .0007454   -12.41   0.000    -.0107112   -.0077863
       2018  |  -.0092743   .0008729   -10.63   0.000    -.0109868   -.0075619
             |
       _cons |   .7830184   .0363765    21.53   0.000     .7116522    .8543845
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .3697413
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_math_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    414,955
                                                F(37, 1242)       =    2014.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2414
                                                Root MSE          =     .42047

                          (Std. err. adjusted for 1,243 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_math_both |   .2802163   .0290561     9.64   0.000     .2232118    .3372208
             |
        year |
       2016  |   .0179915   .0031178     5.77   0.000     .0118747    .0241084
       2017  |   .0187642   .0032422     5.79   0.000     .0124034    .0251251
       2018  |  -.0196868      .0036    -5.47   0.000    -.0267495    -.012624
             |
         age |  -.0000715   6.27e-06   -11.40   0.000    -.0000838   -.0000592
             |
        male |
       Male  |  -.0919829   .0017342   -53.04   0.000    -.0953852   -.0885806
 1.eth_asian |   .0673593   .0065567    10.27   0.000      .054496    .0802227
1.eth_hisp~c |  -.0211277   .0052425    -4.03   0.000    -.0314129   -.0108425
 1.eth_black |   .0479449   .0069262     6.92   0.000     .0343565    .0615333
 1.eth_other |  -.0122569   .0055179    -2.22   0.027    -.0230824   -.0014314
             |
econ_disad~e |
Economic ..  |  -.0379623   .0038222    -9.93   0.000    -.0454609   -.0304636
             |
limited_en~f |
Limited E..  |  -.0232897   .0033083    -7.04   0.000    -.0297803   -.0167992
             |
    disabled |
   Disabled  |  -.0481386   .0035658   -13.50   0.000    -.0551342    -.041143
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1408473    .002942    47.87   0.000     .1350753    .1466192
       2016  |   .1257947   .0028939    43.47   0.000     .1201173    .1314722
       2017  |   .1264702   .0030096    42.02   0.000     .1205657    .1323747
       2018  |   .0998962   .0039471    25.31   0.000     .0921525    .1076398
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0233268   .0011988    19.46   0.000     .0209748    .0256788
       2016  |   .0181645   .0012716    14.28   0.000     .0156697    .0206592
       2017  |   .0190099   .0011775    16.14   0.000     .0166999      .02132
       2018  |   .0195863   .0013302    14.72   0.000     .0169767     .022196
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.011508   .0005575   -20.64   0.000    -.0126018   -.0104143
       2016  |  -.0095231   .0004927   -19.33   0.000    -.0104898   -.0085564
       2017  |  -.0101821   .0004937   -20.62   0.000    -.0111507   -.0092136
       2018  |  -.0094649   .0008628   -10.97   0.000    -.0111576   -.0077721
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1222613   .0029652    41.23   0.000      .116444    .1280785
       2016  |   .1287368   .0031734    40.57   0.000      .122511    .1349627
       2017  |     .12622   .0033196    38.02   0.000     .1197074    .1327327
       2018  |   .1417973   .0040283    35.20   0.000     .1338943    .1497003
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0172328   .0015715    10.97   0.000     .0141497    .0203159
       2016  |   .0172608   .0014911    11.58   0.000     .0143353    .0201862
       2017  |   .0131172   .0016109     8.14   0.000     .0099568    .0162775
       2018  |   .0323119   .0013164    24.55   0.000     .0297293    .0348944
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0099393   .0006233   -15.95   0.000    -.0111622   -.0087164
       2016  |   -.010639   .0006894   -15.43   0.000    -.0119915   -.0092865
       2017  |  -.0092259    .000746   -12.37   0.000    -.0106894   -.0077623
       2018  |  -.0091304   .0008697   -10.50   0.000    -.0108366   -.0074241
             |
       _cons |   .7861924   .0365159    21.53   0.000     .7145528     .857832
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .3697413
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_math_both.ster saved
test score VA with og controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =    1971.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2425
                                                Root MSE          =     .42034

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |  -.0526644   .0332421    -1.58   0.113    -.1178813    .0125526
  va_math_og |   .3291896   .0323913    10.16   0.000     .2656419    .3927373
             |
        year |
       2016  |   .0177435    .003174     5.59   0.000     .0115165    .0239705
       2017  |   .0183764   .0032534     5.65   0.000     .0119936    .0247593
       2018  |  -.0198379   .0036277    -5.47   0.000     -.026955   -.0127208
             |
         age |  -.0000721   6.10e-06   -11.82   0.000     -.000084   -.0000601
             |
        male |
       Male  |  -.0920624   .0017373   -52.99   0.000    -.0954707    -.088654
 1.eth_asian |   .0631856   .0063933     9.88   0.000     .0506426    .0757285
1.eth_hisp~c |   -.019102   .0049603    -3.85   0.000    -.0288336   -.0093705
 1.eth_black |   .0511816   .0067328     7.60   0.000     .0379726    .0643905
 1.eth_other |  -.0121143   .0053757    -2.25   0.024    -.0226607   -.0015678
             |
econ_disad~e |
Economic ..  |  -.0341066   .0036699    -9.29   0.000    -.0413065   -.0269067
             |
limited_en~f |
Limited E..  |  -.0240551   .0033288    -7.23   0.000    -.0305857   -.0175244
             |
    disabled |
   Disabled  |  -.0501155    .003616   -13.86   0.000    -.0572096   -.0430215
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1399514   .0029524    47.40   0.000     .1341592    .1457435
       2016  |   .1246066   .0028955    43.03   0.000      .118926    .1302873
       2017  |   .1257855   .0029768    42.25   0.000     .1199453    .1316257
       2018  |   .0995329   .0039348    25.30   0.000     .0918133    .1072525
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0230435   .0012111    19.03   0.000     .0206675    .0254195
       2016  |   .0178793   .0012829    13.94   0.000     .0153624    .0203963
       2017  |    .018766   .0011932    15.73   0.000      .016425     .021107
       2018  |   .0197023   .0013277    14.84   0.000     .0170974    .0223072
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0114682   .0005596   -20.49   0.000     -.012566   -.0103704
       2016  |  -.0094981   .0004915   -19.32   0.000    -.0104623   -.0085338
       2017  |  -.0101928    .000492   -20.72   0.000     -.011158   -.0092276
       2018  |  -.0095248   .0008607   -11.07   0.000    -.0112133   -.0078362
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1226355   .0029621    41.40   0.000     .1168242    .1284467
       2016  |   .1286078   .0031626    40.67   0.000     .1224033    .1348124
       2017  |   .1260188   .0033043    38.14   0.000     .1195362    .1325014
       2018  |   .1410475   .0040117    35.16   0.000      .133177     .148918
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0170927   .0015931    10.73   0.000     .0139673    .0202181
       2016  |   .0170712   .0014975    11.40   0.000     .0141332    .0200091
       2017  |   .0128979    .001607     8.03   0.000     .0097452    .0160506
       2018  |    .031741   .0013382    23.72   0.000     .0291156    .0343665
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100062   .0006254   -16.00   0.000    -.0112332   -.0087793
       2016  |  -.0106866   .0006897   -15.50   0.000    -.0120397   -.0093336
       2017  |  -.0092279   .0007434   -12.41   0.000    -.0106865   -.0077694
       2018  |  -.0092761   .0008787   -10.56   0.000        -.011   -.0075522
             |
       _cons |   .7885247    .035856    21.99   0.000     .7181796    .8588699
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .37049796
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_ela_math_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =    1977.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2414
                                                Root MSE          =     .42065

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_acs |   -.035565   .0338821    -1.05   0.294    -.1020376    .0309075
 va_math_acs |   .3066341   .0349577     8.77   0.000     .2380514    .3752168
             |
        year |
       2016  |    .017609    .003155     5.58   0.000     .0114191    .0237988
       2017  |    .018528   .0032644     5.68   0.000     .0121237    .0249324
       2018  |  -.0198804   .0036128    -5.50   0.000    -.0269684   -.0127925
             |
         age |  -.0000722   6.18e-06   -11.68   0.000    -.0000843   -.0000601
             |
        male |
       Male  |  -.0919302   .0017419   -52.78   0.000    -.0953476   -.0885128
 1.eth_asian |   .0674393   .0064915    10.39   0.000     .0547039    .0801748
1.eth_hisp~c |  -.0205459    .005149    -3.99   0.000    -.0306476   -.0104442
 1.eth_black |   .0482296   .0068854     7.00   0.000     .0347213    .0617379
 1.eth_other |  -.0117306    .005471    -2.14   0.032    -.0224641   -.0009971
             |
econ_disad~e |
Economic ..  |  -.0376746   .0037766    -9.98   0.000    -.0450838   -.0302654
             |
limited_en~f |
Limited E..  |  -.0236518   .0033189    -7.13   0.000    -.0301631   -.0171405
             |
    disabled |
   Disabled  |  -.0482417   .0035691   -13.52   0.000    -.0552438   -.0412396
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1407194   .0029479    47.74   0.000     .1349359    .1465028
       2016  |   .1256495   .0028927    43.44   0.000     .1199744    .1313245
       2017  |   .1268707   .0030003    42.29   0.000     .1209845    .1327568
       2018  |   .0999208   .0039451    25.33   0.000      .092181    .1076607
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    .023233   .0012077    19.24   0.000     .0208637    .0256023
       2016  |   .0181018   .0012784    14.16   0.000     .0155937    .0206099
       2017  |   .0190036   .0011869    16.01   0.000      .016675    .0213322
       2018  |   .0196109   .0013321    14.72   0.000     .0169975    .0222243
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0114933   .0005606   -20.50   0.000    -.0125932   -.0103934
       2016  |  -.0094952   .0004938   -19.23   0.000    -.0104639   -.0085265
       2017  |  -.0102473   .0004933   -20.77   0.000    -.0112152   -.0092794
       2018  |  -.0094825   .0008604   -11.02   0.000    -.0111705   -.0077945
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1226294   .0029664    41.34   0.000     .1168096    .1284493
       2016  |   .1288514   .0031657    40.70   0.000     .1226407    .1350621
       2017  |   .1260157   .0033134    38.03   0.000     .1195152    .1325162
       2018  |   .1417405   .0040367    35.11   0.000     .1338211      .14966
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0172564    .001589    10.86   0.000      .014139    .0203738
       2016  |   .0172644    .001497    11.53   0.000     .0143274    .0202013
       2017  |   .0130569   .0016097     8.11   0.000      .009899    .0162149
       2018  |   .0322274   .0013306    24.22   0.000      .029617    .0348378
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0099692   .0006259   -15.93   0.000     -.011197   -.0087413
       2016  |  -.0106661   .0006907   -15.44   0.000    -.0120211   -.0093111
       2017  |  -.0092016   .0007444   -12.36   0.000    -.0106621   -.0077412
       2018  |  -.0091085   .0008747   -10.41   0.000    -.0108245   -.0073924
             |
       _cons |   .7906214   .0361691    21.86   0.000      .719662    .8615808
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .37049796
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_ela_math_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =    1974.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2424
                                                Root MSE          =     .42038

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_sib |  -.0518421   .0333403    -1.55   0.120    -.1172516    .0135675
 va_math_sib |   .3250373   .0324667    10.01   0.000     .2613416    .3887331
             |
        year |
       2016  |   .0177279   .0031693     5.59   0.000       .01151    .0239457
       2017  |   .0183816    .003253     5.65   0.000     .0119997    .0247635
       2018  |  -.0198367   .0036257    -5.47   0.000    -.0269498   -.0127235
             |
         age |  -.0000721   6.10e-06   -11.81   0.000    -.0000841   -.0000601
             |
        male |
       Male  |  -.0920563   .0017376   -52.98   0.000    -.0954653   -.0886472
 1.eth_asian |   .0632135   .0064062     9.87   0.000     .0506453    .0757817
1.eth_hisp~c |  -.0190985   .0049691    -3.84   0.000    -.0288472   -.0093497
 1.eth_black |   .0510755   .0067396     7.58   0.000     .0378532    .0642979
 1.eth_other |   -.012145   .0053817    -2.26   0.024    -.0227032   -.0015868
             |
econ_disad~e |
Economic ..  |  -.0341566   .0036808    -9.28   0.000    -.0413779   -.0269352
             |
limited_en~f |
Limited E..  |  -.0241042   .0033316    -7.23   0.000    -.0306404   -.0175679
             |
    disabled |
   Disabled  |  -.0500546    .003616   -13.84   0.000    -.0571487   -.0429605
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1399813   .0029534    47.40   0.000     .1341871    .1457754
       2016  |   .1246623   .0028958    43.05   0.000      .118981    .1303435
       2017  |    .125816   .0029779    42.25   0.000     .1199737    .1316582
       2018  |   .0995415    .003936    25.29   0.000     .0918196    .1072634
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0230544   .0012108    19.04   0.000     .0206789      .02543
       2016  |   .0178882    .001283    13.94   0.000     .0153712    .0204052
       2017  |   .0187814   .0011931    15.74   0.000     .0164406    .0211222
       2018  |   .0197007    .001328    14.83   0.000     .0170952    .0223062
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0114715   .0005595   -20.50   0.000    -.0125692   -.0103739
       2016  |  -.0095005   .0004916   -19.33   0.000     -.010465   -.0085361
       2017  |  -.0101973    .000492   -20.73   0.000    -.0111624   -.0092321
       2018  |  -.0095226   .0008608   -11.06   0.000    -.0112115   -.0078338
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1226292   .0029635    41.38   0.000     .1168153    .1284432
       2016  |   .1286156   .0031642    40.65   0.000     .1224079    .1348233
       2017  |   .1260069    .003306    38.11   0.000      .119521    .1324928
       2018  |   .1411095   .0040126    35.17   0.000     .1332374    .1489817
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0170986   .0015933    10.73   0.000     .0139728    .0202244
       2016  |   .0170814   .0014977    11.41   0.000     .0141431    .0200196
       2017  |   .0128992   .0016072     8.03   0.000     .0097462    .0160523
       2018  |   .0317621    .001338    23.74   0.000     .0291371    .0343872
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100061   .0006255   -16.00   0.000    -.0112332    -.008779
       2016  |   -.010688   .0006898   -15.49   0.000    -.0120412   -.0093347
       2017  |  -.0092286   .0007436   -12.41   0.000    -.0106875   -.0077698
       2018  |  -.0092763   .0008786   -10.56   0.000        -.011   -.0075526
             |
       _cons |   .7886568   .0358841    21.98   0.000     .7182566     .859057
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .37049796
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_ela_math_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    412,202
                                                F(38, 1241)       =    1980.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2413
                                                Root MSE          =     .42068

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_ela_both |  -.0347499   .0339526    -1.02   0.306    -.1013607    .0318609
va_math_both |   .3028449   .0350279     8.65   0.000     .2341245    .3715653
             |
        year |
       2016  |   .0175935   .0031511     5.58   0.000     .0114115    .0237755
       2017  |   .0185291   .0032637     5.68   0.000     .0121261    .0249321
       2018  |  -.0198815   .0036111    -5.51   0.000    -.0269659   -.0127971
             |
         age |  -.0000722   6.19e-06   -11.67   0.000    -.0000844   -.0000601
             |
        male |
       Male  |  -.0919257   .0017422   -52.76   0.000    -.0953437   -.0885078
 1.eth_asian |   .0674416   .0065003    10.38   0.000     .0546888    .0801944
1.eth_hisp~c |  -.0205401   .0051543    -3.99   0.000    -.0306521    -.010428
 1.eth_black |   .0481569   .0068898     6.99   0.000       .03464    .0616738
 1.eth_other |  -.0117545   .0054746    -2.15   0.032     -.022495    -.001014
             |
econ_disad~e |
Economic ..  |  -.0376648   .0037847    -9.95   0.000    -.0450899   -.0302398
             |
limited_en~f |
Limited E..  |  -.0236938   .0033213    -7.13   0.000    -.0302098   -.0171779
             |
    disabled |
   Disabled  |  -.0482105   .0035692   -13.51   0.000    -.0552127   -.0412082
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1407383   .0029488    47.73   0.000      .134953    .1465235
       2016  |   .1256922   .0028929    43.45   0.000     .1200167    .1313677
       2017  |   .1268837   .0030011    42.28   0.000     .1209959    .1327714
       2018  |   .0999214   .0039458    25.32   0.000     .0921803    .1076625
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0232384   .0012075    19.24   0.000     .0208694    .0256075
       2016  |   .0181056   .0012785    14.16   0.000     .0155973    .0206138
       2017  |   .0190117   .0011869    16.02   0.000     .0166832    .0213403
       2018  |   .0196084   .0013324    14.72   0.000     .0169944    .0222223
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.011496   .0005606   -20.51   0.000    -.0125958   -.0103962
       2016  |  -.0094977   .0004938   -19.23   0.000    -.0104665   -.0085289
       2017  |  -.0102502   .0004933   -20.78   0.000    -.0112181   -.0092824
       2018  |  -.0094814   .0008605   -11.02   0.000    -.0111696   -.0077931
             |
        year#|
          c. |
prior_math~e |
       2015  |    .122622   .0029676    41.32   0.000        .1168    .1284441
       2016  |   .1288543    .003167    40.69   0.000      .122641    .1350675
       2017  |    .126003   .0033147    38.01   0.000     .1194999     .132506
       2018  |   .1417921   .0040372    35.12   0.000     .1338717    .1497124
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0172569   .0015892    10.86   0.000      .014139    .0203747
       2016  |    .017269   .0014971    11.53   0.000     .0143318    .0202062
       2017  |   .0130541   .0016097     8.11   0.000      .009896    .0162122
       2018  |   .0322385   .0013303    24.23   0.000     .0296286    .0348484
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.009969   .0006259   -15.93   0.000    -.0111969    -.008741
       2016  |  -.0106672   .0006907   -15.44   0.000    -.0120223    -.009312
       2017  |  -.0092023   .0007445   -12.36   0.000     -.010663   -.0077416
       2018  |  -.0091116   .0008746   -10.42   0.000    -.0108274   -.0073957
             |
       _cons |    .790749   .0361843    21.85   0.000     .7197599    .8617381
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .37049796
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_ela_math_both.ster saved

. 
. 
. 
. // merge in dk VA dataset
. foreach outcome in enr enr_2year enr_4year {
  2.   //merge to test score VA estimates dataset
.   merge m:1 cdscode year using ///
>    $vaprojdir/data/sib_acs_restr_smp/outcome_va/va_`outcome'_sib_acs_dk.dta /
> //
>    , nogen keep(1 3) keepusing(va_*)
  3. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,386
        from master                     2,386  
        from using                          0  

    Matched                           524,248  
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,386
        from master                     2,386  
        from using                          0  

    Matched                           524,248  
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,386
        from master                     2,386  
        from using                          0  

    Matched                           524,248  
    -----------------------------------------

. 
. ********** regress enrollment outcomes on deep knowledge outcome value added
. foreach outcome in enr enr_2year enr_4year {
  2.   //regressing on all 3 outcome VA's
.   foreach control in og acs sib both {
  3.     di "test score VA with `control' controls"
  4. 
.     reg `outcome' va_enr_`control'_dk va_enr_2year_`control'_dk va_enr_4year_
> `control'_dk ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       if touse_enr_dk==1 & touse_enr_2year_dk==1 & touse_enr_4year_dk==1 ///
>       , cluster(school_id)
  5.     //add mean of yvar to stored results
.     estadd ysumm, mean
  6.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_
> `outcome'_va_allenr_`control'.ster, replace
  7.   }
  8. }
test score VA with og controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     694.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1377
                                                Root MSE          =     .41327

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .7296503   .0657276    11.10   0.000     .6007005    .8586001
~2year_og_dk |     .35379   .0597398     5.92   0.000     .2365875    .4709926
~4year_og_dk |   .3665094    .061098     6.00   0.000     .2466424    .4863765
             |
        year |
       2016  |   .0094315   .0041393     2.28   0.023     .0013107    .0175523
       2017  |  -.0192176   .0039076    -4.92   0.000    -.0268839   -.0115513
       2018  |  -.0295787   .0044556    -6.64   0.000    -.0383202   -.0208373
             |
         age |  -.0001463   5.68e-06   -25.77   0.000    -.0001574   -.0001351
             |
        male |
       Male  |  -.0690048   .0019278   -35.80   0.000    -.0727869   -.0652227
 1.eth_asian |   .0509884    .003289    15.50   0.000     .0445359     .057441
1.eth_hisp~c |  -.0202416   .0027682    -7.31   0.000    -.0256724   -.0148107
 1.eth_black |    .012974   .0048468     2.68   0.008     .0034652    .0224828
 1.eth_other |  -.0095615   .0038785    -2.47   0.014    -.0171708   -.0019523
             |
econ_disad~e |
Economic ..  |  -.0539875    .002167   -24.91   0.000    -.0582388   -.0497362
             |
limited_en~f |
Limited E..  |   -.054759   .0044241   -12.38   0.000    -.0634386   -.0460794
             |
    disabled |
   Disabled  |  -.0236276   .0041983    -5.63   0.000    -.0318641    -.015391
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0755855   .0028662    26.37   0.000     .0699624    .0812087
       2016  |   .0675619   .0026903    25.11   0.000     .0622837      .07284
       2017  |   .0718872   .0028588    25.15   0.000     .0662785     .077496
       2018  |   .0675389    .003739    18.06   0.000     .0602034    .0748744
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0172987   .0015272   -11.33   0.000    -.0202948   -.0143025
       2016  |  -.0216403   .0014061   -15.39   0.000     -.024399   -.0188817
       2017  |  -.0115821   .0015469    -7.49   0.000    -.0146169   -.0085474
       2018  |  -.0128615   .0015427    -8.34   0.000    -.0158881   -.0098348
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006604   .0005834    -1.13   0.258    -.0018048    .0004841
       2016  |   .0011582   .0005232     2.21   0.027     .0001318    .0021846
       2017  |  -.0018447   .0005313    -3.47   0.001    -.0028871   -.0008023
       2018  |  -.0046602   .0009227    -5.05   0.000    -.0064704   -.0028499
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538274   .0025844    20.83   0.000     .0487571    .0588977
       2016  |   .0585187   .0026613    21.99   0.000     .0532974    .0637399
       2017  |   .0553984   .0028207    19.64   0.000     .0498646    .0609322
       2018  |   .0834021   .0038031    21.93   0.000     .0759409    .0908633
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100415   .0018698    -5.37   0.000    -.0137099   -.0063731
       2016  |  -.0139658   .0016749    -8.34   0.000    -.0172517   -.0106799
       2017  |  -.0120611   .0018896    -6.38   0.000    -.0157683   -.0083538
       2018  |  -.0026984   .0015945    -1.69   0.091    -.0058266    .0004298
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0005522   .0006568    -0.84   0.401    -.0018407    .0007363
       2016  |   .0006595   .0006779     0.97   0.331    -.0006703    .0019894
       2017  |  -.0000282   .0007044    -0.04   0.968    -.0014102    .0013538
       2018  |  -.0059465   .0009385    -6.34   0.000    -.0077877   -.0041054
             |
       _cons |   1.691555   .0339847    49.77   0.000     1.624881    1.758229
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     618.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1357
                                                Root MSE          =     .41375

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |    .729021   .0769335     9.48   0.000     .5780863    .8799556
va_enr_2ye.. |     .36113   .0705447     5.12   0.000     .2227296    .4995305
va_enr_4ye.. |   .3452151   .0725921     4.76   0.000     .2027978    .4876323
             |
        year |
       2016  |   .0093051   .0041324     2.25   0.025     .0011977    .0174125
       2017  |  -.0186649   .0038794    -4.81   0.000    -.0262757    -.011054
       2018  |  -.0295258   .0044096    -6.70   0.000     -.038177   -.0208746
             |
         age |   -.000145   5.77e-06   -25.14   0.000    -.0001563   -.0001337
             |
        male |
       Male  |  -.0687537   .0019331   -35.57   0.000    -.0725461   -.0649612
 1.eth_asian |   .0558642   .0036757    15.20   0.000     .0486529    .0630755
1.eth_hisp~c |  -.0263894   .0029021    -9.09   0.000     -.032083   -.0206959
 1.eth_black |   .0081847    .004951     1.65   0.099    -.0015286    .0178981
 1.eth_other |  -.0093691   .0039516    -2.37   0.018    -.0171217   -.0016165
             |
econ_disad~e |
Economic ..  |  -.0618288   .0022782   -27.14   0.000    -.0662985   -.0573592
             |
limited_en~f |
Limited E..  |  -.0527579   .0045309   -11.64   0.000    -.0616471   -.0438687
             |
    disabled |
   Disabled  |  -.0203178   .0042584    -4.77   0.000    -.0286721   -.0119634
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0774302   .0028568    27.10   0.000     .0718255    .0830349
       2016  |   .0690063   .0026953    25.60   0.000     .0637184    .0742943
       2017  |   .0738119   .0028658    25.76   0.000     .0681895    .0794342
       2018  |   .0687433   .0037379    18.39   0.000     .0614099    .0760767
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174589    .001534   -11.38   0.000    -.0204683   -.0144494
       2016  |  -.0217473   .0014093   -15.43   0.000    -.0245121   -.0189825
       2017  |  -.0117158    .001549    -7.56   0.000    -.0147547   -.0086768
       2018  |  -.0131169   .0015453    -8.49   0.000    -.0161486   -.0100853
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006609   .0005833    -1.13   0.257    -.0018053    .0004835
       2016  |   .0012033   .0005281     2.28   0.023     .0001673    .0022393
       2017  |  -.0018681   .0005326    -3.51   0.000     -.002913   -.0008232
       2018  |  -.0046283   .0009251    -5.00   0.000    -.0064432   -.0028134
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0542012   .0025858    20.96   0.000     .0491281    .0592743
       2016  |   .0591759   .0026747    22.12   0.000     .0539285    .0644234
       2017  |   .0556824   .0028331    19.65   0.000     .0501242    .0612407
       2018  |   .0843275   .0038168    22.09   0.000     .0768395    .0918155
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0102864   .0018743    -5.49   0.000    -.0139634   -.0066093
       2016  |  -.0142609   .0016799    -8.49   0.000    -.0175567   -.0109652
       2017  |  -.0121057   .0018936    -6.39   0.000    -.0158207   -.0083907
       2018  |  -.0024619   .0015929    -1.55   0.122     -.005587    .0006632
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004398   .0006566    -0.67   0.503     -.001728    .0008484
       2016  |   .0007622   .0006798     1.12   0.262    -.0005716    .0020959
       2017  |   .0000321   .0007061     0.05   0.964    -.0013532    .0014173
       2018  |  -.0058158   .0009408    -6.18   0.000    -.0076616     -.00397
             |
       _cons |   1.689785   .0343814    49.15   0.000     1.622333    1.757237
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     695.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1377
                                                Root MSE          =     .41327

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .7251928   .0678166    10.69   0.000     .5921445    .8582412
va_enr_2ye.. |   .3601881   .0620108     5.81   0.000     .2385302     .481846
va_enr_4ye.. |   .3784075   .0636414     5.95   0.000     .2535506    .5032644
             |
        year |
       2016  |   .0093696   .0041448     2.26   0.024     .0012381    .0175011
       2017  |  -.0192454    .003907    -4.93   0.000    -.0269104   -.0115804
       2018  |  -.0296252   .0044552    -6.65   0.000    -.0383658   -.0208846
             |
         age |  -.0001462   5.68e-06   -25.72   0.000    -.0001573    -.000135
             |
        male |
       Male  |  -.0690081   .0019273   -35.81   0.000    -.0727892    -.065227
 1.eth_asian |   .0509403   .0032871    15.50   0.000     .0444914    .0573893
1.eth_hisp~c |  -.0201954   .0027658    -7.30   0.000    -.0256217   -.0147691
 1.eth_black |   .0129283    .004848     2.67   0.008     .0034171    .0224395
 1.eth_other |  -.0096036   .0038777    -2.48   0.013    -.0172111   -.0019961
             |
econ_disad~e |
Economic ..  |  -.0538164   .0021667   -24.84   0.000    -.0580672   -.0495656
             |
limited_en~f |
Limited E..  |  -.0546853   .0044283   -12.35   0.000    -.0633731   -.0459976
             |
    disabled |
   Disabled  |   -.023721   .0041967    -5.65   0.000    -.0319545   -.0154875
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0755709   .0028694    26.34   0.000     .0699416    .0812002
       2016  |   .0675077   .0026901    25.10   0.000     .0622301    .0727853
       2017  |   .0718614   .0028591    25.13   0.000     .0662521    .0774707
       2018  |   .0675535   .0037394    18.07   0.000     .0602174    .0748897
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0173096   .0015271   -11.33   0.000    -.0203056   -.0143136
       2016  |  -.0216703   .0014061   -15.41   0.000    -.0244289   -.0189117
       2017  |  -.0115952   .0015466    -7.50   0.000    -.0146294    -.008561
       2018  |  -.0128598   .0015422    -8.34   0.000    -.0158854   -.0098342
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006597   .0005833    -1.13   0.258    -.0018041    .0004847
       2016  |   .0011628   .0005231     2.22   0.026     .0001365     .002189
       2017  |  -.0018451   .0005313    -3.47   0.001    -.0028875   -.0008027
       2018  |  -.0046651   .0009224    -5.06   0.000    -.0064748   -.0028555
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538361   .0025866    20.81   0.000     .0487614    .0589108
       2016  |   .0585424   .0026632    21.98   0.000     .0533176    .0637672
       2017  |   .0554286   .0028213    19.65   0.000     .0498936    .0609635
       2018  |   .0833867   .0038031    21.93   0.000     .0759254     .090848
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100666   .0018702    -5.38   0.000    -.0137358   -.0063975
       2016  |  -.0139712   .0016748    -8.34   0.000     -.017257   -.0106854
       2017  |  -.0120875   .0018903    -6.39   0.000     -.015796   -.0083791
       2018  |  -.0027465   .0015944    -1.72   0.085    -.0058746    .0003816
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.000551   .0006568    -0.84   0.402    -.0018396    .0007376
       2016  |   .0006527   .0006779     0.96   0.336    -.0006772    .0019826
       2017  |  -.0000266   .0007046    -0.04   0.970     -.001409    .0013558
       2018  |  -.0059652   .0009386    -6.36   0.000    -.0078066   -.0041238
             |
       _cons |   1.690924   .0340192    49.70   0.000     1.624182    1.757665
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     619.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1357
                                                Root MSE          =     .41375

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .7299445   .0795238     9.18   0.000      .573928    .8859609
va_enr_2ye.. |   .3645305    .073267     4.98   0.000     .2207891    .5082719
va_enr_4ye.. |   .3537901   .0756843     4.67   0.000     .2053062     .502274
             |
        year |
       2016  |   .0092483   .0041384     2.23   0.026     .0011294    .0173673
       2017  |  -.0186953   .0038793    -4.82   0.000     -.026306   -.0110846
       2018  |  -.0295752   .0044098    -6.71   0.000    -.0382267   -.0209236
             |
         age |  -.0001449   5.77e-06   -25.10   0.000    -.0001563   -.0001336
             |
        male |
       Male  |  -.0687567   .0019327   -35.58   0.000    -.0725484    -.064965
 1.eth_asian |   .0558921   .0036716    15.22   0.000     .0486887    .0630954
1.eth_hisp~c |  -.0263745   .0028994    -9.10   0.000    -.0320628   -.0206862
 1.eth_black |   .0081571   .0049521     1.65   0.100    -.0015584    .0178726
 1.eth_other |  -.0093843   .0039518    -2.37   0.018    -.0171371   -.0016314
             |
econ_disad~e |
Economic ..  |  -.0616646    .002277   -27.08   0.000    -.0661318   -.0571975
             |
limited_en~f |
Limited E..  |  -.0526798   .0045357   -11.61   0.000    -.0615784   -.0437813
             |
    disabled |
   Disabled  |  -.0203916    .004257    -4.79   0.000    -.0287433     -.01204
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0774247   .0028596    27.08   0.000     .0718145    .0830349
       2016  |   .0689563   .0026948    25.59   0.000     .0636694    .0742433
       2017  |   .0737959   .0028661    25.75   0.000     .0681729    .0794188
       2018  |   .0687521   .0037383    18.39   0.000      .061418    .0760863
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174699    .001534   -11.39   0.000    -.0204794   -.0144604
       2016  |  -.0217767   .0014092   -15.45   0.000    -.0245414    -.019012
       2017  |  -.0117281   .0015487    -7.57   0.000    -.0147664   -.0086898
       2018  |   -.013117   .0015448    -8.49   0.000    -.0161478   -.0100863
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006606   .0005833    -1.13   0.258     -.001805    .0004838
       2016  |   .0012079   .0005279     2.29   0.022     .0001722    .0022436
       2017  |  -.0018688   .0005326    -3.51   0.000    -.0029137   -.0008238
       2018  |  -.0046326   .0009248    -5.01   0.000    -.0064469   -.0028182
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0542082    .002588    20.95   0.000     .0491308    .0592857
       2016  |   .0592002   .0026762    22.12   0.000     .0539499    .0644505
       2017  |   .0557057   .0028338    19.66   0.000     .0501461    .0612652
       2018  |   .0843162   .0038166    22.09   0.000     .0768285    .0918039
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0103093   .0018746    -5.50   0.000     -.013987   -.0066316
       2016  |  -.0142657   .0016798    -8.49   0.000    -.0175613   -.0109702
       2017  |  -.0121297   .0018943    -6.40   0.000     -.015846   -.0084133
       2018  |   -.002504   .0015927    -1.57   0.116    -.0056287    .0006207
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004382   .0006566    -0.67   0.505    -.0017264      .00085
       2016  |   .0007557   .0006798     1.11   0.267     -.000578    .0020895
       2017  |    .000034   .0007063     0.05   0.962    -.0013516    .0014196
       2018  |   -.005831   .0009407    -6.20   0.000    -.0076765   -.0039854
             |
       _cons |   1.689229     .03441    49.09   0.000      1.62172    1.756737
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_both.ster saved
test score VA with og controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     627.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0877
                                                Root MSE          =     .45868

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .5612343   .0781802     7.18   0.000     .4078538    .7146148
~2year_og_dk |   .5646461   .0718043     7.86   0.000     .4237745    .7055178
~4year_og_dk |   -.494219   .0722957    -6.84   0.000    -.6360547   -.3523834
             |
        year |
       2016  |  -.0070332   .0046221    -1.52   0.128    -.0161013    .0020349
       2017  |  -.0372253   .0041967    -8.87   0.000    -.0454586   -.0289919
       2018  |  -.0090559   .0048132    -1.88   0.060    -.0184988     .000387
             |
         age |  -.0000686   5.64e-06   -12.16   0.000    -.0000797   -.0000575
             |
        male |
       Male  |   .0205573   .0019964    10.30   0.000     .0166406    .0244739
 1.eth_asian |  -.0230996   .0033823    -6.83   0.000    -.0297353    -.016464
1.eth_hisp~c |   .0106965   .0027172     3.94   0.000     .0053657    .0160273
 1.eth_black |  -.0145448   .0047455    -3.06   0.002     -.023855   -.0052346
 1.eth_other |  -.0005926   .0045639    -0.13   0.897    -.0095465    .0083612
             |
econ_disad~e |
Economic ..  |  -.0110348    .002131    -5.18   0.000    -.0152156    -.006854
             |
limited_en~f |
Limited E..  |  -.0355306   .0044049    -8.07   0.000    -.0441724   -.0268888
             |
    disabled |
   Disabled  |   .0305416   .0048412     6.31   0.000     .0210439    .0400394
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0650154   .0031996   -20.32   0.000    -.0712927   -.0587382
       2016  |  -.0598994   .0029428   -20.35   0.000     -.065673   -.0541259
       2017  |  -.0521117   .0031229   -16.69   0.000    -.0582385   -.0459849
       2018  |  -.0290588   .0039009    -7.45   0.000     -.036712   -.0214057
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0391388   .0015896   -24.62   0.000    -.0422573   -.0360203
       2016  |  -.0376847   .0015661   -24.06   0.000    -.0407572   -.0346123
       2017  |  -.0280402   .0016159   -17.35   0.000    -.0312105   -.0248699
       2018  |  -.0310194   .0016047   -19.33   0.000    -.0341677   -.0278711
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0105658    .000625    16.91   0.000     .0093397    .0117919
       2016  |   .0106178   .0005216    20.36   0.000     .0095946    .0116411
       2017  |   .0078287    .000566    13.83   0.000     .0067183     .008939
       2018  |   .0044934   .0010212     4.40   0.000     .0024899    .0064969
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0663398   .0031575   -21.01   0.000    -.0725345   -.0601452
       2016  |  -.0682326   .0033528   -20.35   0.000    -.0748104   -.0616547
       2017  |  -.0679897   .0034047   -19.97   0.000    -.0746694   -.0613101
       2018  |   -.058903   .0042654   -13.81   0.000    -.0672713   -.0505347
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0257419   .0020168   -12.76   0.000    -.0296986   -.0217851
       2016  |  -.0309144   .0019203   -16.10   0.000    -.0346819    -.027147
       2017  |  -.0238981   .0020209   -11.83   0.000     -.027863   -.0199333
       2018  |  -.0338178   .0016845   -20.08   0.000    -.0371225    -.030513
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090605   .0007279    12.45   0.000     .0076325    .0104885
       2016  |   .0109556   .0007781    14.08   0.000     .0094289    .0124822
       2017  |   .0085955   .0007937    10.83   0.000     .0070383    .0101527
       2018  |    .003442   .0010634     3.24   0.001     .0013558    .0055282
             |
       _cons |   .8597162   .0346246    24.83   0.000     .7917868    .9276455
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     397.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0841
                                                Root MSE          =     .45959

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .5909293   .0900051     6.57   0.000     .4143499    .7675087
va_enr_2ye.. |   .5626111   .0841333     6.69   0.000     .3975513    .7276709
va_enr_4ye.. |  -.6170233   .0841577    -7.33   0.000     -.782131   -.4519156
             |
        year |
       2016  |  -.0071539   .0046542    -1.54   0.125     -.016285    .0019771
       2017  |   -.037108   .0042465    -8.74   0.000    -.0454392   -.0287769
       2018  |  -.0089702   .0048446    -1.85   0.064    -.0184747    .0005342
             |
         age |  -.0000693   5.74e-06   -12.07   0.000    -.0000806    -.000058
             |
        male |
       Male  |   .0208875   .0019963    10.46   0.000     .0169709     .024804
 1.eth_asian |  -.0156995   .0038035    -4.13   0.000    -.0231615   -.0082376
1.eth_hisp~c |   .0032667    .003057     1.07   0.285    -.0027309    .0092643
 1.eth_black |  -.0232802     .00493    -4.72   0.000    -.0329524   -.0136081
 1.eth_other |   .0005023   .0046053     0.11   0.913    -.0085328    .0095374
             |
econ_disad~e |
Economic ..  |  -.0127192   .0022383    -5.68   0.000    -.0171104   -.0083279
             |
limited_en~f |
Limited E..  |  -.0325979   .0046197    -7.06   0.000    -.0416613   -.0235345
             |
    disabled |
   Disabled  |   .0321419   .0048387     6.64   0.000      .022649    .0416349
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0634376   .0032052   -19.79   0.000    -.0697259   -.0571494
       2016  |  -.0581067   .0029672   -19.58   0.000    -.0639279   -.0522855
       2017  |   -.051118   .0031774   -16.09   0.000    -.0573517   -.0448843
       2018  |  -.0286832   .0039359    -7.29   0.000     -.036405   -.0209614
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0400453   .0015892   -25.20   0.000    -.0431631   -.0369275
       2016  |  -.0384771   .0015719   -24.48   0.000    -.0415609   -.0353934
       2017  |  -.0289769   .0016208   -17.88   0.000    -.0321568    -.025797
       2018  |  -.0316566   .0016115   -19.64   0.000    -.0348182    -.028495
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |      .0106   .0006266    16.92   0.000     .0093707    .0118293
       2016  |   .0106243   .0005253    20.23   0.000     .0095938    .0116548
       2017  |   .0079337   .0005681    13.96   0.000     .0068191    .0090482
       2018  |   .0044796   .0010217     4.38   0.000     .0024752     .006484
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0665132   .0031673   -21.00   0.000    -.0727271   -.0602992
       2016  |  -.0683155   .0033915   -20.14   0.000    -.0749693   -.0616618
       2017  |   -.068356   .0034325   -19.91   0.000    -.0750902   -.0616218
       2018  |  -.0574846   .0043358   -13.26   0.000     -.065991   -.0489782
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0269435   .0020228   -13.32   0.000     -.030912   -.0229749
       2016  |  -.0320344   .0019292   -16.60   0.000    -.0358193   -.0282495
       2017  |  -.0245391    .002033   -12.07   0.000    -.0285277   -.0205506
       2018  |  -.0346037   .0016902   -20.47   0.000    -.0379198   -.0312876
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0093038   .0007298    12.75   0.000      .007872    .0107356
       2016  |   .0111698   .0007835    14.26   0.000     .0096327    .0127068
       2017  |   .0086909   .0007975    10.90   0.000     .0071263    .0102555
       2018  |    .003172   .0010599     2.99   0.003     .0010927    .0052513
             |
       _cons |   .8687013   .0351847    24.69   0.000      .799673    .9377296
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     617.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0876
                                                Root MSE          =      .4587

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .5739814   .0813791     7.05   0.000     .4143251    .7336378
va_enr_2ye.. |   .5669893   .0750445     7.56   0.000     .4197608    .7142178
va_enr_4ye.. |  -.5182157   .0757319    -6.84   0.000     -.666793   -.3696385
             |
        year |
       2016  |    -.00704   .0046373    -1.52   0.129    -.0161378    .0020579
       2017  |  -.0372377   .0042004    -8.87   0.000    -.0454784    -.028997
       2018  |  -.0090836   .0048131    -1.89   0.059    -.0185263    .0003591
             |
         age |  -.0000686   5.64e-06   -12.17   0.000    -.0000797   -.0000576
             |
        male |
       Male  |   .0205542   .0019967    10.29   0.000      .016637    .0244714
 1.eth_asian |   -.022984   .0033848    -6.79   0.000    -.0296246   -.0163434
1.eth_hisp~c |   .0107031   .0027116     3.95   0.000     .0053832     .016023
 1.eth_black |  -.0145546   .0047488    -3.06   0.002    -.0238712    -.005238
 1.eth_other |  -.0004096   .0045596    -0.09   0.928     -.009355    .0085358
             |
econ_disad~e |
Economic ..  |  -.0110021   .0021326    -5.16   0.000    -.0151861   -.0068181
             |
limited_en~f |
Limited E..  |  -.0354752   .0044102    -8.04   0.000    -.0441274    -.026823
             |
    disabled |
   Disabled  |   .0305611   .0048411     6.31   0.000     .0210634    .0400587
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   -.065002   .0032021   -20.30   0.000    -.0712841   -.0587199
       2016  |  -.0599252   .0029414   -20.37   0.000    -.0656959   -.0541545
       2017  |  -.0522121   .0031245   -16.71   0.000    -.0583421   -.0460821
       2018  |  -.0291053   .0039003    -7.46   0.000    -.0367573   -.0214534
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0391387   .0015901   -24.61   0.000    -.0422583    -.036019
       2016  |  -.0376903   .0015658   -24.07   0.000    -.0407623   -.0346184
       2017  |  -.0280415   .0016158   -17.35   0.000    -.0312116   -.0248714
       2018  |  -.0310294   .0016047   -19.34   0.000    -.0341775   -.0278812
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0105627   .0006252    16.90   0.000     .0093362    .0117893
       2016  |   .0106219   .0005215    20.37   0.000     .0095989     .011645
       2017  |   .0078382    .000566    13.85   0.000     .0067278    .0089486
       2018  |   .0045006   .0010208     4.41   0.000     .0024979    .0065033
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0663627   .0031597   -21.00   0.000    -.0725615   -.0601638
       2016  |  -.0682721   .0033547   -20.35   0.000    -.0748537   -.0616905
       2017  |   -.068024   .0034047   -19.98   0.000    -.0747037   -.0613443
       2018  |  -.0588969   .0042652   -13.81   0.000    -.0672646   -.0505292
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.025754   .0020184   -12.76   0.000    -.0297139   -.0217941
       2016  |   -.030922   .0019215   -16.09   0.000    -.0346918   -.0271522
       2017  |   -.023914   .0020215   -11.83   0.000      -.02788   -.0199481
       2018  |  -.0338122   .0016852   -20.06   0.000    -.0371183    -.030506
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090678   .0007284    12.45   0.000     .0076389    .0104968
       2016  |   .0109567   .0007786    14.07   0.000     .0094291    .0124842
       2017  |   .0086031   .0007941    10.83   0.000     .0070451    .0101611
       2018  |   .0034439   .0010637     3.24   0.001      .001357    .0055307
             |
       _cons |    .859879   .0346093    24.85   0.000     .7919796    .9277785
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     397.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0840
                                                Root MSE          =     .45961

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .6059688     .09354     6.48   0.000     .4224543    .7894833
va_enr_2ye.. |   .5637993   .0879258     6.41   0.000     .3912992    .7362995
va_enr_4ye.. |  -.6462067      .0881    -7.33   0.000    -.8190486   -.4733647
             |
        year |
       2016  |  -.0071585     .00467    -1.53   0.126    -.0163205    .0020036
       2017  |  -.0371095   .0042507    -8.73   0.000    -.0454488   -.0287701
       2018  |   -.008995   .0048448    -1.86   0.064    -.0184999    .0005099
             |
         age |  -.0000693   5.74e-06   -12.08   0.000    -.0000806   -.0000581
             |
        male |
       Male  |   .0208858   .0019967    10.46   0.000     .0169686     .024803
 1.eth_asian |  -.0156817    .003791    -4.14   0.000    -.0231193   -.0082441
1.eth_hisp~c |   .0032411   .0030468     1.06   0.288    -.0027364    .0092187
 1.eth_black |  -.0233374   .0049341    -4.73   0.000    -.0330176   -.0136572
 1.eth_other |   .0006582   .0046001     0.14   0.886    -.0083667    .0096831
             |
econ_disad~e |
Economic ..  |   -.012757   .0022371    -5.70   0.000    -.0171459    -.008368
             |
limited_en~f |
Limited E..  |  -.0325507   .0046241    -7.04   0.000    -.0416227   -.0234788
             |
    disabled |
   Disabled  |   .0321914   .0048398     6.65   0.000     .0226963    .0416865
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0634133   .0032077   -19.77   0.000    -.0697066   -.0571201
       2016  |  -.0581167   .0029654   -19.60   0.000    -.0639344   -.0522991
       2017  |  -.0512094    .003179   -16.11   0.000    -.0574463   -.0449724
       2018  |  -.0287207   .0039349    -7.30   0.000    -.0364405   -.0210009
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0400415   .0015901   -25.18   0.000     -.043161    -.036922
       2016  |   -.038478   .0015716   -24.48   0.000    -.0415613   -.0353947
       2017  |  -.0289739   .0016206   -17.88   0.000    -.0321534   -.0257945
       2018  |  -.0316658   .0016114   -19.65   0.000    -.0348273   -.0285043
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0105963   .0006269    16.90   0.000     .0093665    .0118262
       2016  |    .010628   .0005252    20.24   0.000     .0095977    .0116583
       2017  |   .0079427   .0005681    13.98   0.000     .0068281    .0090573
       2018  |   .0044874   .0010212     4.39   0.000     .0024839     .006491
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0665327   .0031698   -20.99   0.000    -.0727516   -.0603139
       2016  |  -.0683498   .0033933   -20.14   0.000    -.0750072   -.0616925
       2017  |  -.0683858   .0034329   -19.92   0.000    -.0751207   -.0616509
       2018  |  -.0574701   .0043349   -13.26   0.000    -.0659747   -.0489655
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0269526   .0020246   -13.31   0.000    -.0309246   -.0229807
       2016  |  -.0320392   .0019305   -16.60   0.000    -.0358266   -.0282518
       2017  |  -.0245532   .0020337   -12.07   0.000     -.028543   -.0205634
       2018  |  -.0345905   .0016909   -20.46   0.000    -.0379079   -.0312731
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0093109   .0007304    12.75   0.000      .007878    .0107438
       2016  |   .0111706   .0007839    14.25   0.000     .0096326    .0127086
       2017  |   .0086981    .000798    10.90   0.000     .0071326    .0102636
       2018  |   .0031753   .0010602     2.99   0.003     .0010953    .0052552
             |
       _cons |   .8687813   .0351594    24.71   0.000     .7998027    .9377598
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_both.ster saved
test score VA with og controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =    2180.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2645
                                                Root MSE          =     .41342

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |    .168416   .0780182     2.16   0.031     .0153534    .3214785
~2year_og_dk |  -.2108561   .0687031    -3.07   0.002    -.3456435   -.0760687
~4year_og_dk |   .8607285   .0725544    11.86   0.000     .7183851    1.003072
             |
        year |
       2016  |   .0164647   .0032618     5.05   0.000     .0100655    .0228639
       2017  |   .0180077   .0036586     4.92   0.000     .0108299    .0251854
       2018  |  -.0205229   .0039462    -5.20   0.000    -.0282648   -.0127809
             |
         age |  -.0000777   5.02e-06   -15.47   0.000    -.0000875   -.0000678
             |
        male |
       Male  |   -.089562   .0017054   -52.52   0.000    -.0929079   -.0862162
 1.eth_asian |   .0740881   .0041967    17.65   0.000     .0658547    .0823214
1.eth_hisp~c |   -.030938   .0030762   -10.06   0.000    -.0369731    -.024903
 1.eth_black |   .0275188   .0052208     5.27   0.000     .0172762    .0377615
 1.eth_other |  -.0089689   .0044859    -2.00   0.046    -.0177698    -.000168
             |
econ_disad~e |
Economic ..  |  -.0429527   .0025939   -16.56   0.000    -.0480416   -.0378639
             |
limited_en~f |
Limited E..  |  -.0192284   .0027997    -6.87   0.000    -.0247211   -.0137358
             |
    disabled |
   Disabled  |  -.0541692    .003341   -16.21   0.000    -.0607239   -.0476145
             |
        year#|
          c. |
prior_ela_~e |
       2015  |    .140601   .0026848    52.37   0.000     .1353337    .1458682
       2016  |   .1274613   .0026748    47.65   0.000     .1222137    .1327089
       2017  |    .123999   .0028491    43.52   0.000     .1184094    .1295886
       2018  |   .0965977   .0035392    27.29   0.000     .0896541    .1035413
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0218401   .0011898    18.36   0.000      .019506    .0241743
       2016  |   .0160444    .001228    13.07   0.000     .0136352    .0184535
       2017  |   .0164581   .0011627    14.16   0.000      .014177    .0187392
       2018  |   .0181579   .0013025    13.94   0.000     .0156026    .0207133
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112261   .0005175   -21.69   0.000    -.0122415   -.0102108
       2016  |  -.0094597   .0004839   -19.55   0.000     -.010409   -.0085103
       2017  |  -.0096734    .000501   -19.31   0.000    -.0106562   -.0086905
       2018  |  -.0091536   .0008242   -11.11   0.000    -.0107706   -.0075365
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1201672   .0027906    43.06   0.000     .1146923    .1256421
       2016  |   .1267512   .0029045    43.64   0.000      .121053    .1324495
       2017  |   .1233881   .0030811    40.05   0.000     .1173433     .129433
       2018  |   .1423051   .0036768    38.70   0.000     .1350916    .1495186
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0157004   .0014952    10.50   0.000      .012767    .0186338
       2016  |   .0169487   .0014081    12.04   0.000     .0141862    .0197111
       2017  |   .0118371    .001517     7.80   0.000     .0088608    .0148133
       2018  |   .0311194    .001236    25.18   0.000     .0286945    .0335442
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0096127   .0006097   -15.77   0.000     -.010809   -.0084165
       2016  |   -.010296   .0006658   -15.46   0.000    -.0116022   -.0089899
       2017  |  -.0086237   .0007098   -12.15   0.000    -.0100162   -.0072312
       2018  |  -.0093886   .0008549   -10.98   0.000    -.0110658   -.0077113
             |
       _cons |   .8318389   .0302235    27.52   0.000      .772544    .8911338
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_og.ster saved
test score VA with acs controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =    2161.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2619
                                                Root MSE          =     .41415

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .1380917    .091003     1.52   0.129    -.0404456    .3166289
va_enr_2ye.. |  -.2014811   .0816172    -2.47   0.014    -.3616045   -.0413577
va_enr_4ye.. |   .9622383   .0867926    11.09   0.000     .7919614    1.132515
             |
        year |
       2016  |    .016459   .0033342     4.94   0.000     .0099176    .0230004
       2017  |   .0184432   .0036755     5.02   0.000     .0112323     .025654
       2018  |  -.0205556   .0039446    -5.21   0.000    -.0282944   -.0128167
             |
         age |  -.0000757   5.27e-06   -14.38   0.000    -.0000861   -.0000654
             |
        male |
       Male  |  -.0896411   .0017083   -52.47   0.000    -.0929926   -.0862896
 1.eth_asian |   .0715637   .0047738    14.99   0.000     .0621981    .0809293
1.eth_hisp~c |  -.0296561   .0034474    -8.60   0.000    -.0364196   -.0228927
 1.eth_black |    .031465   .0053712     5.86   0.000     .0209273    .0420026
 1.eth_other |  -.0098714   .0046282    -2.13   0.033    -.0189515   -.0007914
             |
econ_disad~e |
Economic ..  |  -.0491097   .0028283   -17.36   0.000    -.0546585   -.0435608
             |
limited_en~f |
Limited E..  |  -.0201601   .0028379    -7.10   0.000    -.0257277   -.0145925
             |
    disabled |
   Disabled  |  -.0524597   .0032798   -15.99   0.000    -.0588943   -.0460251
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1408678   .0026808    52.55   0.000     .1356085    .1461272
       2016  |    .127113   .0026867    47.31   0.000      .121842     .132384
       2017  |   .1249299   .0028722    43.50   0.000     .1192949    .1305648
       2018  |   .0974265    .003577    27.24   0.000     .0904089    .1044441
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0225864    .001178    19.17   0.000     .0202753    .0248976
       2016  |   .0167299   .0012188    13.73   0.000     .0143388     .019121
       2017  |   .0172612   .0011537    14.96   0.000     .0149977    .0195246
       2018  |   .0185397   .0013017    14.24   0.000     .0159859    .0210934
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112609   .0005185   -21.72   0.000    -.0122781   -.0102436
       2016  |   -.009421   .0004848   -19.43   0.000    -.0103722   -.0084698
       2017  |  -.0098018   .0005006   -19.58   0.000     -.010784   -.0088196
       2018  |  -.0091079    .000822   -11.08   0.000    -.0107206   -.0074953
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1207143   .0027907    43.26   0.000     .1152393    .1261894
       2016  |   .1274914   .0029491    43.23   0.000     .1217057    .1332772
       2017  |   .1240384   .0030881    40.17   0.000     .1179799     .130097
       2018  |   .1418121   .0037484    37.83   0.000     .1344581    .1491661
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0166571   .0014992    11.11   0.000     .0137158    .0195984
       2016  |   .0177735   .0014107    12.60   0.000     .0150058    .0205412
       2017  |   .0124334   .0015169     8.20   0.000     .0094574    .0154094
       2018  |   .0321418   .0012426    25.87   0.000     .0297039    .0345798
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097436   .0006106   -15.96   0.000    -.0109415   -.0085457
       2016  |  -.0104076   .0006688   -15.56   0.000    -.0117196   -.0090955
       2017  |  -.0086588   .0007115   -12.17   0.000    -.0100548   -.0072629
       2018  |  -.0089878   .0008477   -10.60   0.000    -.0106508   -.0073247
             |
       _cons |   .8210838   .0312352    26.29   0.000     .7598039    .8823637
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_acs.ster saved
test score VA with sib controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =    2207.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2644
                                                Root MSE          =     .41345

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .1512114   .0816092     1.85   0.064    -.0088964    .3113192
va_enr_2ye.. |  -.2068012   .0723549    -2.86   0.004     -.348753   -.0648494
va_enr_4ye.. |   .8966232   .0765638    11.71   0.000     .7464139    1.046833
             |
        year |
       2016  |   .0164096   .0032793     5.00   0.000      .009976    .0228432
       2017  |   .0179923   .0036639     4.91   0.000     .0108041    .0251804
       2018  |  -.0205416   .0039475    -5.20   0.000    -.0282862    -.012797
             |
         age |  -.0000775   5.03e-06   -15.43   0.000    -.0000874   -.0000677
             |
        male |
       Male  |  -.0895624   .0017054   -52.52   0.000    -.0929082   -.0862165
 1.eth_asian |   .0739244   .0041913    17.64   0.000     .0657015    .0821472
1.eth_hisp~c |  -.0308985   .0030772   -10.04   0.000    -.0369357   -.0248613
 1.eth_black |   .0274829    .005235     5.25   0.000     .0172125    .0377534
 1.eth_other |  -.0091941   .0044734    -2.06   0.040    -.0179703   -.0004178
             |
econ_disad~e |
Economic ..  |  -.0428143   .0025989   -16.47   0.000     -.047913   -.0377156
             |
limited_en~f |
Limited E..  |  -.0192101   .0028082    -6.84   0.000    -.0247195   -.0137008
             |
    disabled |
   Disabled  |  -.0542821   .0033448   -16.23   0.000    -.0608442   -.0477199
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1405729   .0026865    52.33   0.000     .1353023    .1458435
       2016  |   .1274329   .0026735    47.67   0.000     .1221879     .132678
       2017  |   .1240735   .0028516    43.51   0.000      .118479    .1296681
       2018  |   .0966588   .0035404    27.30   0.000      .089713    .1036047
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0218291   .0011885    18.37   0.000     .0194974    .0241608
       2016  |     .01602   .0012291    13.03   0.000     .0136086    .0184315
       2017  |   .0164463   .0011635    14.14   0.000     .0141636    .0187289
       2018  |   .0181696   .0013033    13.94   0.000     .0156127    .0207264
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112224   .0005172   -21.70   0.000    -.0122371   -.0102078
       2016  |  -.0094592   .0004843   -19.53   0.000    -.0104094   -.0085089
       2017  |  -.0096833   .0005011   -19.32   0.000    -.0106665   -.0087002
       2018  |  -.0091658   .0008244   -11.12   0.000    -.0107831   -.0075484
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1201987   .0027946    43.01   0.000      .114716    .1256814
       2016  |   .1268145   .0029096    43.59   0.000     .1211063    .1325227
       2017  |   .1234526   .0030811    40.07   0.000     .1174077    .1294974
       2018  |   .1422836   .0036753    38.71   0.000      .135073    .1494941
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0156874   .0014971    10.48   0.000     .0127502    .0186245
       2016  |   .0169508   .0014088    12.03   0.000      .014187    .0197147
       2017  |   .0118265   .0015166     7.80   0.000     .0088512    .0148018
       2018  |   .0310656   .0012373    25.11   0.000     .0286382     .033493
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0096188   .0006101   -15.77   0.000    -.0108157   -.0084219
       2016  |   -.010304    .000666   -15.47   0.000    -.0116106   -.0089974
       2017  |  -.0086297   .0007101   -12.15   0.000    -.0100229   -.0072365
       2018  |   -.009409   .0008554   -11.00   0.000    -.0110872   -.0077309
             |
       _cons |   .8310445   .0302504    27.47   0.000     .7716967    .8903924
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_sib.ster saved
test score VA with both controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =    2173.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2619
                                                Root MSE          =     .41417

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .1239757   .0951462     1.30   0.193      -.06269    .3106413
va_enr_2ye.. |  -.1992688   .0861043    -2.31   0.021    -.3681953   -.0303423
va_enr_4ye.. |   .9999968   .0915462    10.92   0.000     .8203939      1.1796
             |
        year |
       2016  |   .0164068   .0033528     4.89   0.000      .009829    .0229847
       2017  |   .0184142   .0036796     5.00   0.000     .0111951    .0256332
       2018  |  -.0205802   .0039472    -5.21   0.000    -.0283242   -.0128362
             |
         age |  -.0000756   5.27e-06   -14.35   0.000     -.000086   -.0000653
             |
        male |
       Male  |  -.0896425   .0017082   -52.48   0.000    -.0929938   -.0862911
 1.eth_asian |   .0715737   .0047489    15.07   0.000     .0622571    .0808904
1.eth_hisp~c |  -.0296156   .0034438    -8.60   0.000    -.0363719   -.0228594
 1.eth_black |   .0314945   .0053806     5.85   0.000     .0209383    .0420507
 1.eth_other |  -.0100424   .0046146    -2.18   0.030    -.0190957   -.0009891
             |
econ_disad~e |
Economic ..  |  -.0489077   .0028278   -17.30   0.000    -.0544555   -.0433598
             |
limited_en~f |
Limited E..  |  -.0201291   .0028457    -7.07   0.000     -.025712   -.0145462
             |
    disabled |
   Disabled  |   -.052583   .0032836   -16.01   0.000    -.0590251   -.0461409
             |
        year#|
          c. |
prior_ela_~e |
       2015  |    .140838   .0026823    52.51   0.000     .1355757    .1461003
       2016  |   .1270731   .0026844    47.34   0.000     .1218066    .1323395
       2017  |   .1250052   .0028742    43.49   0.000     .1193663    .1306441
       2018  |   .0974728   .0035773    27.25   0.000     .0904545    .1044911
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0225716   .0011771    19.18   0.000     .0202622     .024881
       2016  |   .0167013     .00122    13.69   0.000     .0143078    .0190947
       2017  |   .0172459   .0011543    14.94   0.000     .0149812    .0195105
       2018  |   .0185488   .0013024    14.24   0.000     .0159935     .021104
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112569   .0005182   -21.72   0.000    -.0122735   -.0102403
       2016  |  -.0094202   .0004852   -19.41   0.000    -.0103721   -.0084682
       2017  |  -.0098115   .0005008   -19.59   0.000     -.010794   -.0088289
       2018  |    -.00912   .0008221   -11.09   0.000     -.010733   -.0075071
             |
        year#|
          c. |
prior_math~e |
       2015  |    .120741    .002795    43.20   0.000     .1152574    .1262245
       2016  |   .1275501   .0029536    43.19   0.000     .1217555    .1333446
       2017  |   .1240915   .0030884    40.18   0.000     .1180324    .1301506
       2018  |   .1417863   .0037458    37.85   0.000     .1344376     .149135
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0166433   .0015009    11.09   0.000     .0136988    .0195879
       2016  |   .0177735   .0014114    12.59   0.000     .0150045    .0205424
       2017  |   .0124235   .0015164     8.19   0.000     .0094486    .0153985
       2018  |   .0320865   .0012435    25.80   0.000     .0296469    .0345262
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097491   .0006109   -15.96   0.000    -.0109476   -.0085506
       2016  |  -.0104149    .000669   -15.57   0.000    -.0117273   -.0091024
       2017  |  -.0086641   .0007118   -12.17   0.000    -.0100607   -.0072676
       2018  |  -.0090062   .0008477   -10.62   0.000    -.0106693   -.0073431
             |
       _cons |   .8204475   .0312452    26.26   0.000     .7591481    .8817469
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_both.ster saved

. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:    144.89 /        1 =     144.8940

. 
. set trace off

. cd $projdir
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/reg_out_va_sib_acs.smcl
  log type:  smcl
 closed on:   7 May 2022, 17:57:49
-------------------------------------------------------------------------------
