-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/reg_out_va_sib_acs_tab.smcl
  log type:  smcl
 opened on:  10 May 2022, 19:05:42

. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative fil
> e paths  */
. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. macro list
eststo_counter: 12
eststo:         est1 est2 est3 est4 est5 est6 est7 est8 est9 est10 est11 est12
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. //startomg timer
. timer on 1

. 
. 
. *****************************************************************************
> ***
. * begin main code
. 
. //macros for esttab options
. #delimit ;
delimiter now ;
. local esttab_format
>   replace nonumbers se(%4.3f) b(%5.3f)
>   ;

. local esttab_order_va
>   order(va_*)
>   ;

. local esttab_order_het
>   order(?.prior*va*)
>   ;

. local esttab_scalars
>         scalars(
>         "ymean Y Mean"
>         "r2 $ R^2 $"
>         "N Observations"
>         )
>         sfmt(
>         %12.3gc
>         %12.3g
>         %12.3gc
>         )
>         noobs
>         ;

. local esttab_mtitles
>   mtitles("Original w/ Census Leave Out" "Original w/ Sibling Leave Out"
>   "Census w/ Sibling Leave Out" "Sibling w/ Census Leave Out"
>   "Original w/ Census Leave Out" "Original w/ Sibling Leave Out"
>   "Census w/ Sibling Leave Out" "Sibling w/ Census Leave Out"
>   "Original w/ Census Leave Out" "Original w/ Sibling Leave Out"
>   "Census w/ Sibling Leave Out" "Sibling w/ Census Leave Out")
>   ;

. local esttab_mgroups
>   mgroups( "Overall Enrollment" "2 Year Enrollment" "4 Year Enrollment",
>   pattern(1 0 0 0 1 0 0 0 1 0 0 0) )
>   ;

. #delimit cr
delimiter now cr
. 
. 
. ********** estimates from regressing enrollment on test score VA
. /* no peer effectsm no tfx */
. 
. // only one subject test score VA on the RHS
. foreach subject in ela math {
  2.   di "only `subject' VA on the RHS"
  3. 
.   foreach outcome in enr enr_2year enr_4year {
  4.     di "Dependent Var = `outcome'"
  5. 
.     foreach control in og acs sib both {
  6.       di "RHS = `subject' test score VA with `control' controls"
  7. 
.       estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_`o
> utcome'_va_`subject'_`control'.ster
  8.       eststo
  9.     }
 10.   }
 11. 
.   esttab using ///
>     $projdir/out/csv/siblingvaregs/persistence/sib_acs_restr_smp/reg_out_scor
> e_va/reg_outcome_va_`subject'.csv ///
>     , `esttab_format' `esttab_order_va' `esttab_scalars' `esttab_mtitles' `es
> ttab_mgroups' ///
>     title ("Regression of Outcome on ``subject'_str' VA on Sibling Census Res
> tricted Sample")
 12. 
.   eststo clear
 13. }
only ela VA on the RHS
Dependent Var = enr
RHS = ela test score VA with og controls
(est1 stored)
RHS = ela test score VA with acs controls
(est2 stored)
RHS = ela test score VA with sib controls
(est3 stored)
RHS = ela test score VA with both controls
(est4 stored)
Dependent Var = enr_2year
RHS = ela test score VA with og controls
(est5 stored)
RHS = ela test score VA with acs controls
(est6 stored)
RHS = ela test score VA with sib controls
(est7 stored)
RHS = ela test score VA with both controls
(est8 stored)
Dependent Var = enr_4year
RHS = ela test score VA with og controls
(est9 stored)
RHS = ela test score VA with acs controls
(est10 stored)
RHS = ela test score VA with sib controls
(est11 stored)
RHS = ela test score VA with both controls
(est12 stored)
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/persistence/sib_acs_restr_smp/reg_out_score_va/reg_outcome_va_ela
> .csv)
only math VA on the RHS
Dependent Var = enr
RHS = math test score VA with og controls
(est1 stored)
RHS = math test score VA with acs controls
(est2 stored)
RHS = math test score VA with sib controls
(est3 stored)
RHS = math test score VA with both controls
(est4 stored)
Dependent Var = enr_2year
RHS = math test score VA with og controls
(est5 stored)
RHS = math test score VA with acs controls
(est6 stored)
RHS = math test score VA with sib controls
(est7 stored)
RHS = math test score VA with both controls
(est8 stored)
Dependent Var = enr_4year
RHS = math test score VA with og controls
(est9 stored)
RHS = math test score VA with acs controls
(est10 stored)
RHS = math test score VA with sib controls
(est11 stored)
RHS = math test score VA with both controls
(est12 stored)
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/persistence/sib_acs_restr_smp/reg_out_score_va/reg_outcome_va_mat
> h.csv)

. 
. 
. 
. /*
> 
> // only math score VA on the RHS
> foreach outcome in enr enr_2year enr_4year {
>   di "Dependent Var = `outcome'"
> 
>   foreach control in og acs sib both {
>     di "test score VA with `control' controls"
> 
>     estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_`out
> come'_va_math_`control'.ster
>     eststo
>   }
> }
> 
> esttab using ///
>   $projdir/out/csv/siblingvaregs/persistence/sib_acs_restr_smp/reg_outcome_va
> _math.csv ///
>   , `esttab_format' `esttab_scalars' `esttab_mtitles' `esttab_mgroups' ///
>   title ("Regression of Outcome on Math VA on Sibling Census Restricted Sampl
> e")
> 
> eststo clear */
. 
. 
. 
. // both ELA and math VA on RHS
. foreach outcome in enr enr_2year enr_4year {
  2.   di "Dependent Var = `outcome'"
  3. 
.   foreach control in og acs sib both {
  4.     di "test score VA with `control' controls"
  5. 
.     estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_`out
> come'_va_ela_math_`control'.ster
  6.     eststo
  7.   }
  8. }
Dependent Var = enr
test score VA with og controls
(est1 stored)
test score VA with acs controls
(est2 stored)
test score VA with sib controls
(est3 stored)
test score VA with both controls
(est4 stored)
Dependent Var = enr_2year
test score VA with og controls
(est5 stored)
test score VA with acs controls
(est6 stored)
test score VA with sib controls
(est7 stored)
test score VA with both controls
(est8 stored)
Dependent Var = enr_4year
test score VA with og controls
(est9 stored)
test score VA with acs controls
(est10 stored)
test score VA with sib controls
(est11 stored)
test score VA with both controls
(est12 stored)

. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/persistence/sib_acs_restr_smp/reg_out_score_
> va/reg_outcome_va_ela_math.csv ///
>   , `esttab_format' `esttab_order_va' `esttab_scalars' `esttab_mtitles' `estt
> ab_mgroups' ///
>   title ("Regression of Outcome on ELA and Math VA on Sibling Census Restrict
> ed Sample")
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/persistence/sib_acs_restr_smp/reg_out_score_va/reg_outcome_va_ela
> _math.csv)

. 
. eststo clear

. 
. 
. 
. 
. 
. ********** estimates from regressing outcome on test score VA interacted with
>  prior score deciles
. /* no peer effectsm no tfx */
. 
. // estimates from regressing outcome on single subject test score VA interact
> ed with prior score decile by subject
. 
. foreach subject in ela math {
  2.   di "RHS VA Subject = `subject'"
  3. 
.   foreach prior_subject in ela math {
  4.     di "interaction with prior `prior_subject' score deciles"
  5. 
.     foreach outcome in enr enr_2year enr_4year {
  6.       di "Dependent Var = `outcome'"
  7. 
.       foreach control in og acs sib both {
  8.         di "VA with `control' controls"
  9. 
.         estimates use ///
>           $vaprojdir/estimates/sib_acs_restr_smp/persistence/het_reg_`outcome
> '_va_`subject'_`control'_x_prior_`prior_subject'.ster
 10.         eststo
 11.       }
 12.     }
 13. 
.     esttab using ///
>       $projdir/out/csv/siblingvaregs/persistence/sib_acs_restr_smp/reg_out_sc
> ore_va/het_reg_outcome_va_`subject'_x_prior_`prior_subject'.csv ///
>       , `esttab_format' `esttab_order_het' `esttab_scalars' `esttab_mtitles' 
> `esttab_mgroups' ///
>       title ("Regression of Outcome on ``subject'_str' VA interacted with pri
> or `prior_subject' score deciles on Sibling Census Restricted Sample")
 14. 
.     eststo clear
 15.   }
 16. }
RHS VA Subject = ela
interaction with prior ela score deciles
Dependent Var = enr
VA with og controls
(est1 stored)
VA with acs controls
(est2 stored)
VA with sib controls
(est3 stored)
VA with both controls
(est4 stored)
Dependent Var = enr_2year
VA with og controls
(est5 stored)
VA with acs controls
(est6 stored)
VA with sib controls
(est7 stored)
VA with both controls
(est8 stored)
Dependent Var = enr_4year
VA with og controls
(est9 stored)
VA with acs controls
(est10 stored)
VA with sib controls
(est11 stored)
VA with both controls
(est12 stored)
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/persistence/sib_acs_restr_smp/reg_out_score_va/het_reg_outcome_va
> _ela_x_prior_ela.csv)
interaction with prior math score deciles
Dependent Var = enr
VA with og controls
(est1 stored)
VA with acs controls
(est2 stored)
VA with sib controls
(est3 stored)
VA with both controls
(est4 stored)
Dependent Var = enr_2year
VA with og controls
(est5 stored)
VA with acs controls
(est6 stored)
VA with sib controls
(est7 stored)
VA with both controls
(est8 stored)
Dependent Var = enr_4year
VA with og controls
(est9 stored)
VA with acs controls
(est10 stored)
VA with sib controls
(est11 stored)
VA with both controls
(est12 stored)
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/persistence/sib_acs_restr_smp/reg_out_score_va/het_reg_outcome_va
> _ela_x_prior_math.csv)
RHS VA Subject = math
interaction with prior ela score deciles
Dependent Var = enr
VA with og controls
(est1 stored)
VA with acs controls
(est2 stored)
VA with sib controls
(est3 stored)
VA with both controls
(est4 stored)
Dependent Var = enr_2year
VA with og controls
(est5 stored)
VA with acs controls
(est6 stored)
VA with sib controls
(est7 stored)
VA with both controls
(est8 stored)
Dependent Var = enr_4year
VA with og controls
(est9 stored)
VA with acs controls
(est10 stored)
VA with sib controls
(est11 stored)
VA with both controls
(est12 stored)
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/persistence/sib_acs_restr_smp/reg_out_score_va/het_reg_outcome_va
> _math_x_prior_ela.csv)
interaction with prior math score deciles
Dependent Var = enr
VA with og controls
(est1 stored)
VA with acs controls
(est2 stored)
VA with sib controls
(est3 stored)
VA with both controls
(est4 stored)
Dependent Var = enr_2year
VA with og controls
(est5 stored)
VA with acs controls
(est6 stored)
VA with sib controls
(est7 stored)
VA with both controls
(est8 stored)
Dependent Var = enr_4year
VA with og controls
(est9 stored)
VA with acs controls
(est10 stored)
VA with sib controls
(est11 stored)
VA with both controls
(est12 stored)
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/persistence/sib_acs_restr_smp/reg_out_score_va/het_reg_outcome_va
> _math_x_prior_math.csv)

. 
. 
. // both subject VA interacted with prior score deciles by subject
. foreach prior_subject in ela math {
  2.   di "interaction with prior `prior_subject' score deciles"
  3. 
.   foreach outcome in enr enr_2year enr_4year {
  4.     di "Dependent Var = `outcome'"
  5. 
.     foreach control in og acs sib both {
  6.       di "VA with `control' controls"
  7. 
.       estimates use ///
>         $vaprojdir/estimates/sib_acs_restr_smp/persistence/het_reg_`outcome'_
> va_ela_math_`control'_x_prior_`prior_subject'.ster
  8.       eststo
  9.     }
 10.   }
 11. 
.   esttab using ///
>     $projdir/out/csv/siblingvaregs/persistence/sib_acs_restr_smp/reg_out_scor
> e_va/het_reg_outcome_va_ela_math_x_prior_`prior_subject'.csv ///
>     , `esttab_format' `esttab_order_het' `esttab_scalars' `esttab_mtitles' `e
> sttab_mgroups' ///
>     title ("Regression of Outcome on both ELA and Math VA interacted with pri
> or `prior_subject' score deciles on Sibling Census Restricted Sample")
 12. 
.   eststo clear
 13. }
interaction with prior ela score deciles
Dependent Var = enr
VA with og controls
(est1 stored)
VA with acs controls
(est2 stored)
VA with sib controls
(est3 stored)
VA with both controls
(est4 stored)
Dependent Var = enr_2year
VA with og controls
(est5 stored)
VA with acs controls
(est6 stored)
VA with sib controls
(est7 stored)
VA with both controls
(est8 stored)
Dependent Var = enr_4year
VA with og controls
(est9 stored)
VA with acs controls
(est10 stored)
VA with sib controls
(est11 stored)
VA with both controls
(est12 stored)
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/persistence/sib_acs_restr_smp/reg_out_score_va/het_reg_outcome_va
> _ela_math_x_prior_ela.csv)
interaction with prior math score deciles
Dependent Var = enr
VA with og controls
(est1 stored)
VA with acs controls
(est2 stored)
VA with sib controls
(est3 stored)
VA with both controls
(est4 stored)
Dependent Var = enr_2year
VA with og controls
(est5 stored)
VA with acs controls
(est6 stored)
VA with sib controls
(est7 stored)
VA with both controls
(est8 stored)
Dependent Var = enr_4year
VA with og controls
(est9 stored)
VA with acs controls
(est10 stored)
VA with sib controls
(est11 stored)
VA with both controls
(est12 stored)
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/persistence/sib_acs_restr_smp/reg_out_score_va/het_reg_outcome_va
> _ela_math_x_prior_math.csv)

. 
. 
. 
. 
. timer off 1

. timer list
   1:      4.28 /        1 =       4.2840

. 
. cd $projdir
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. set trace off

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/reg_out_va_sib_acs_tab.smcl
  log type:  smcl
 closed on:  10 May 2022, 19:05:46
-------------------------------------------------------------------------------
