-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/reg_out_va_sib_acs_fig.smcl
  log type:  smcl
 opened on:  28 Nov 2022, 19:06:03

. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative fil
> e paths  */
. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls
> 09/20/2022: Added delimiter : after comments
> 10/31/2022: Changed naming convention for samples
> b - base
> l - loscore
> a - acs
> s - sibling
> la - loscore and acs
> ls - loscore and sibling
> as - acs and sibling
> las - loscore, acs and sibling
> */
. 
. #delimit ;
delimiter now ;
. *** file paths ;
. local home $vaprojdir ;

. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk";

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk";

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk";

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;

. local acs_str
>         "Original + Census"
>         ;

. local sib_str
>         "Original + Sibling"
>         ;

. local both_str
>         "Original + Census + Sibling"
>         ;

. **** Value Added ;
. local school_controls
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local peer_census_controls
>         peer_eth_asian_pct  peer_eth_hispanic_pct  peer_eth_black_pct
>         peer_educ_hs_dropout_prop  peer_educ_deg_4year_plus_prop
>         peer_pov_fam_child_lt18_pct      peer_inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. local peer_sibling_controls
>         peer_has_older_sibling_enr_2year
>         peer_has_older_sibling_enr_4year
>         ;

. **********************************************  ;
. *** macros for STANDALONE control vars for running loops over all samples and
>  specifications ;
. //base specification controls ;
> local b_controls
>         `school_controls'
>         `demographic_controls'
>         `ela_score_controls'
>         `math_score_controls'
>         ;

. //peer base controls ;
> local peer_b_controls
>         `peer_ela_score_controls'
>         `peer_math_score_controls'
>         `peer_demographic_controls'
>         ;

. // leave out score controls ;
> local l_controls
>         loscore
>         ;

. // peer leave out score controls ;
> local peer_l_controls
>         `peer_b_controls'
>         peer_loscore
>         ;

. local a_controls
>         `census_controls'
>         ;

. local peer_a_controls
>         `peer_b_controls'
>         `peer_census_controls'
>         ;

. local s_controls
>         `sibling_controls'
>         ;

. local peer_s_controls
>         `peer_b_controls'
>         `peer_sibling_controls'
>         ;

. // control var groups for looping ;
> local la_controls
>         `l_controls'
>         `a_controls'
>         ;

. local peer_la_controls
>         `peer_b_controls'
>         `peer_l_controls'
>         `peer_a_controls'
>         ;

. local ls_controls
>         `l_controls'
>         `s_controls'
>         ;

. local peer_ls_controls
>         `peer_b_controls'
>         `peer_l_controls'
>         `peer_s_controls'
>         ;

. local as_controls
>         `a_controls'
>         `s_controls'
>         ;

. local peer_as_controls
>         `peer_b_controls'
>         `peer_a_controls'
>         `peer_s_controls'
>         ;

. local las_controls
>         `l_controls'
>         `a_controls'
>         `s_controls'
>         ;

. local peer_las_controls
>         `peer_b_controls'
>         `peer_l_controls'
>         `peer_a_controls'
>         `peer_s_controls'
>         ;

. *** macros for control var COMBINATIONS for running loops over all samples an
> d specifications ;
. //base specification controls ;
> local b_spec_controls
>         `school_controls'
>         `demographic_controls'
>         `ela_score_controls'
>         `math_score_controls'
>         ;

. // leave out prior score controls ;
> local l_spec_controls
>         `b_spec_controls'
>         loscore
>         ;

. // update the local macro name for looping in the creation of all sample VA e
> stimates ;
> local a_spec_controls
>         `b_spec_controls'
>         `census_controls'
>         ;

. local s_spec_controls
>         `b_spec_controls'
>         `s_controls'
>         ;

. // control var groups for looping ;
> local la_spec_controls
>         `b_spec_controls'
>         `l_controls'
>         `a_controls'
>         ;

. local ls_spec_controls
>         `b_spec_controls'
>         `l_controls'
>         `s_controls'
>         ;

. local as_spec_controls
>         `b_spec_controls'
>         `a_controls'
>         `s_controls'
>         ;

. local las_spec_controls
>         `b_spec_controls'
>         `l_controls'
>         `a_controls'
>         `s_controls'
>         ;

. // strings for all sample and control combinations ;
> 
> local b_str
>         "base"
>         ;

. local l_str
>         "leave out score"
>         ;

. local a_str
>         "ACS"
>         ;

. local s_str
>         "sibling"
>         ;

. local la_str
>         "leave out score & ACS"
>         ;

. local ls_str
>         "leave out score & sibling"
>         ;

. local as_str
>         "ACS & sibling"
>         ;

. local las_str
>         "leave out score & ACS & sibling"
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. macro list
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_las_str:       leave out score & ACS & sibling
_as_str:        ACS & sibling
_ls_str:        leave out score & sibling
_la_str:        leave out score & ACS
_s_str:         sibling
_a_str:         ACS
_l_str:         leave out score
_b_str:         base
_las_spec_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score) loscore eth_asian_pct eth_hispanic_pct
                eth_black_pct educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_as_spec_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score) eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_ls_spec_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score) loscore i.has_older_sibling_enr_2year
                i.has_older_sibling_enr_4year
_la_spec_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score) loscore eth_asian_pct eth_hispanic_pct
                eth_black_pct educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_s_spec_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score) i.has_older_sibling_enr_2year
                i.has_older_sibling_enr_4year
_a_spec_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score) eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_l_spec_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score) loscore
_b_spec_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_las_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_loscore
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_eth_asian_pct peer_eth_hispanic_pct peer_eth_black_pct
                peer_educ_hs_dropout_prop peer_educ_deg_4year_plus_prop
                peer_pov_fam_child_lt18_pct peer_inc_median_hh
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_has_older_sibling_enr_2year
                peer_has_older_sibling_enr_4year
_las_controls:  loscore eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_peer_as_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_eth_asian_pct peer_eth_hispanic_pct peer_eth_black_pct
                peer_educ_hs_dropout_prop peer_educ_deg_4year_plus_prop
                peer_pov_fam_child_lt18_pct peer_inc_median_hh
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_has_older_sibling_enr_2year
                peer_has_older_sibling_enr_4year
_as_controls:   eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_peer_ls_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_loscore
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_has_older_sibling_enr_2year
                peer_has_older_sibling_enr_4year
_ls_controls:   loscore i.has_older_sibling_enr_2year
                i.has_older_sibling_enr_4year
_peer_la_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_loscore
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_eth_asian_pct peer_eth_hispanic_pct peer_eth_black_pct
                peer_educ_hs_dropout_prop peer_educ_deg_4year_plus_prop
                peer_pov_fam_child_lt18_pct peer_inc_median_hh
_la_controls:   loscore eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_peer_s_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_has_older_sibling_enr_2year
                peer_has_older_sibling_enr_4year
_s_controls:    i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_peer_a_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_eth_asian_pct peer_eth_hispanic_pct peer_eth_black_pct
                peer_educ_hs_dropout_prop peer_educ_deg_4year_plus_prop
                peer_pov_fam_child_lt18_pct peer_inc_median_hh
_a_controls:    eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_peer_l_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
                peer_loscore
_l_controls:    loscore
_peer_b_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
_b_controls:    age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_sibling_controls:
                peer_has_older_sibling_enr_2year
                peer_has_older_sibling_enr_4year
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_peer_census_controls:
                peer_eth_asian_pct peer_eth_hispanic_pct peer_eth_black_pct
                peer_educ_hs_dropout_prop peer_educ_deg_4year_plus_prop
                peer_pov_fam_child_lt18_pct peer_inc_median_hh
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_both_str:      Original + Census + Sibling
_sib_str:       Original + Sibling
_acs_str:       Original + Census
_og_str:        Original Specification
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_home:          /home/research/ca_ed_lab/projects/common_core_va
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. //startomg timer
. timer on 1

. 
. 
. *****************************************************************************
> ***
. * begin main code
. 
. ********** assign outcome on test score VA regression coefficients to scalars
. foreach outcome in enr enr_2year enr_4year {
  2.   di "LHS = `outcome'"
  3. 
.   foreach subject in ela math {
  4.     di "RHS VA subject = `subject'"
  5. 
.     foreach control in og acs sib both {
  6.       di "RHS VA control = `control'"
  7. 
.       // pull the regression estimates from regressing outcome on only one su
> bject VA
.       estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_`o
> utcome'_va_`subject'_`control'.ster
  8. 
.       // assign a tempname to a local macro name
.       tempname `outcome'_va_`subject'_`control'
  9.       // assign the coefficient value from the regression to a scalar
.       scalar ``outcome'_va_`subject'_`control'' = _b[va_`subject'_`control']
 10. 
.     }
 11.   }
 12. 
. 
.   foreach control in og acs sib both {
 13.     // pull the regression estimates from regressing outcome on both subje
> ct VAs
.     estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_`out
> come'_va_ela_math_`control'.ster
 14. 
.     //assign tempname
.     // naming convention: coefficient of outcome on both va (with specified c
> ontrols) regression, coefficient on ela term
.     tempname `outcome'_va_both_`control'_ela
 15.     tempname `outcome'_va_both_`control'_math
 16.     //assign the coefficient value to scalar with the name
.     scalar ``outcome'_va_both_`control'_ela' = _b[va_ela_`control']
 17.     scalar ``outcome'_va_both_`control'_math' = _b[va_math_`control']
 18. 
.   }
 19. }
LHS = enr
RHS VA subject = ela
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both
RHS VA subject = math
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both
LHS = enr_2year
RHS VA subject = ela
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both
RHS VA subject = math
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both
LHS = enr_4year
RHS VA subject = ela
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both
RHS VA subject = math
RHS VA control = og
RHS VA control = acs
RHS VA control = sib
RHS VA control = both

. 
. 
. ********** make figures for prior score heterogeneity regressions
. 
. foreach outcome in enr enr_2year enr_4year {
  2.   di "LHS = `outcome'"
  3. 
.   // regression of outcome on single test score VA interacted with prior scor
> e decile by prior subject
.   // 3 outcomes, 2 subject VAs, 2 prior scores, 4 VA specifications = 48 regr
> essions
. 
.   foreach subject in ela math {
  4.     di "VA Subject = `subject'"
  5. 
.     foreach control in og acs sib both {
  6.       di "`subject' test score VA with `control' controls"
  7. 
.       foreach prior_subject in ela math {
  8.         di "interaction with prior `prior_subject' score deciles"
  9. 
.         // pull the estimates from regression of outcome on single subject VA
>  interacted with single prior subject score decile
.         estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/het_
> reg_`outcome'_va_`subject'_`control'_x_prior_`prior_subject'.ster
 10.         // convert estimation results into a dataset
.         parmest, norestore
 11.         // keep only the interaction parameters
.         keep if strpos(parm, "prior_`prior_subject'_z_score_xtile#c.va_`subje
> ct'_`control'") != 0
 12.         // generate a var that is the decile number of the prior score, fr
> om 1 to 10
.         gen xtile = subinstr(substr(parm, 1, strpos(parm, ".")-1), "b", "", .
> )
 13.         // convert xtile var into a numeric var
.         destring xtile, replace
 14. 
.         // twoway graph 1) bar graph of coefficient estimates 2) rcap for 90%
>  CI
.         // draw horizontal yline at the coefficient estimate from regression 
> with only the subject VA, no interaction
.         twoway ///
>           (bar estimate xtile) ///
>           (rcap min95 max95 xtile) ///
>           , yline(`=``outcome'_va_`subject'_`control''') ///
>           legend(off) ///
>           ytitle("Coefficient Estimate") ///
>           xtitle("Prior ``prior_subject'_str' Score Decile") ///
>           title("LHS = ``outcome'_str'; RHS = ``subject'_str' VA w/ ``control
> '_str' Controls # Prior ``prior_subject'_str' Decile" ///
>           , size(vsmall))
 15. 
. 
.         graph export $vaprojdir/figures/va_sib_acs/het_reg_prior_score/het_re
> g_`outcome'_va_`subject'_`control'_x_prior_`prior_subject'.pdf, replace
 16.         graph export $projdir/out/graph//siblingvaregs/persistence/sib_acs
> _restr_smp/het_reg_prior_score/het_reg_`outcome'_va_`subject'_`control'_x_pri
> or_`prior_subject'.pdf, replace
 17. 
.         // redraw the graph to be used for combining into panels
.         twoway ///
>           (bar estimate xtile) ///
>           (rcap min95 max95 xtile) ///
>           , yline(`=``outcome'_va_`subject'_`control''') ///
>           legend(off) ///
>           ytitle("Coefficient Estimate") ///
>           xtitle("Prior ``prior_subject'_str' Score Decile") ///
>           title("Restricted Sample, ``control'_str' Controls", size(vsmall)) 
> ///
>           saving($vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_
> `outcome'_va_`subject'_`control'_x_prior_`prior_subject', replace)
 18.       }
 19.     }
 20.   }
 21. 
. 
.   // regression of outcome on both test score VAs interacted with prior score
>  decile by prior subject
.   // 3 outcomes, 2 prior subjects, 4 specifications = 24 regressions
.   foreach control in og acs sib both {
 22.     di "`subject' test score VA with `control' controls"
 23. 
.     foreach prior_subject in ela math {
 24.       di "interaction with prior `prior_subject' score deciles"
 25. 
.       // pull the regression estimates
.       estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/het_re
> g_`outcome'_va_ela_math_`control'_x_prior_`prior_subject'.ster
 26.       // convert to dataset
.       parmest, norestore
 27.       // keep only interaction parameters
.       keep if strpos(parm, "prior_`prior_subject'_z_score_xtile#c.va_ela_`con
> trol'")!=0 | strpos(parm, "prior_`prior_subject'_z_score_xtile#c.va_math_`con
> trol'")!=0
 28.       // create a var that is the decile number of the prior score, from 1
>  to 10
.       gen xtile = subinstr(substr(parm, 1, strpos(parm, ".")-1), "b", "", .)
 29.       // convert xtile var into a numeric var
.       destring xtile, replace
 30. 
.       // two way graph
.       // yline 1: coefficient estimate of ELA VA from regression with both su
> bject VA without interactions
.       // yline 2: coefficient estimate of Math VA from regression with both s
> ubject VA without interactions
.       twoway ///
>         (bar estimate xtile) ///
>         (rcap min95 max95 xtile) ///
>         , yline(`=``outcome'_va_both_`control'_ela'')  ///
>         yline(`=``outcome'_va_both_`control'_math'') ///
>         legend(off) ///
>         ytitle(Coefficient Estimate) ///
>         xtitle("Prior ``prior_subject'_str' Score Decile") ///
>         title("LHS = ``outcome'_str'; RHS = Both VA w/ ``control'_str' Contro
> ls # Prior ``prior_subject'_str' Decile" ///
>         , size(vsmall))
 31. 
.       graph export $vaprojdir/figures/va_sib_acs/het_reg_prior_score/het_reg_
> `outcome'_va_both_`control'_x_prior_`prior_subject'.pdf, replace
 32.       graph export $projdir/out/graph//siblingvaregs/persistence/sib_acs_r
> estr_smp/het_reg_prior_score/het_reg_`outcome'_va_both_`control'_x_prior_`pri
> or_subject'.pdf, replace
 33.     }
 34.   }
 35. 
. 
. }
LHS = enr
VA Subject = ela
ela test score VA with og controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_og_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > og_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_og_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_og_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > og_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_og_x_prior_math.gph saved
ela test score VA with acs controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_acs_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > acs_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_acs_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_acs_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > acs_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_acs_x_prior_math.gph saved
ela test score VA with sib controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_sib_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > sib_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_sib_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_sib_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > sib_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_sib_x_prior_math.gph saved
ela test score VA with both controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_both_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > both_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_both_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_both_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > both_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_both_x_prior_math.gph saved
VA Subject = math
math test score VA with og controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_og_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _og_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_og_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_og_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _og_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_og_x_prior_math.gph saved
math test score VA with acs controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_acs_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _acs_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_acs_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_acs_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _acs_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_acs_x_prior_math.gph saved
math test score VA with sib controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_sib_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _sib_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_sib_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_sib_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _sib_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_sib_x_prior_math.gph saved
math test score VA with both controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_both_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _both_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_both_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_both_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _both_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_both_x_prior_math.gph saved
 test score VA with og controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_both_og_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both
    > _og_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_both_og_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both
    > _og_x_prior_math.pdf saved as PDF format
 test score VA with acs controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_both_acs_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both
    > _acs_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_both_acs_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both
    > _acs_x_prior_math.pdf saved as PDF format
 test score VA with sib controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_both_sib_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both
    > _sib_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_both_sib_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both
    > _sib_x_prior_math.pdf saved as PDF format
 test score VA with both controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_both_both_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both
    > _both_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_both_both_x_prior_math.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_both
    > _both_x_prior_math.pdf saved as PDF format
LHS = enr_2year
VA Subject = ela
ela test score VA with og controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_og_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_og_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_math.gph saved
ela test score VA with acs controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_acs_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_acs_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_math.gph saved
ela test score VA with sib controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_sib_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_sib_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_math.gph saved
ela test score VA with both controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_both_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_both_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_math.gph saved
VA Subject = math
math test score VA with og controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_og_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_og_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_og_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_og_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_math.gph saved
math test score VA with acs controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_acs_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_acs_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_math.gph saved
math test score VA with sib controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_sib_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_sib_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_math.gph saved
math test score VA with both controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_both_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_both_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_both_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_both_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_math.gph saved
 test score VA with og controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_both_og_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_both_og_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_both_og_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_both_og_x_prior_math.pdf saved as PDF format
 test score VA with acs controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_both_acs_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_both_acs_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_both_acs_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_both_acs_x_prior_math.pdf saved as PDF format
 test score VA with sib controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_both_sib_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_both_sib_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_both_sib_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_both_sib_x_prior_math.pdf saved as PDF format
 test score VA with both controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_both_both_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_both_both_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_both_both_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_both_both_x_prior_math.pdf saved as PDF format
LHS = enr_4year
VA Subject = ela
ela test score VA with og controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_ela.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_og_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_og_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_math.gph saved
ela test score VA with acs controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_acs_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_acs_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_math.gph saved
ela test score VA with sib controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_sib_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_sib_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_math.gph saved
ela test score VA with both controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_both_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_both_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_math.gph saved
VA Subject = math
math test score VA with og controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_og_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_og_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_og_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_og_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_math.gph saved
math test score VA with acs controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_acs_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_acs_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_math.gph saved
math test score VA with sib controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_sib_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_sib_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_math.gph saved
math test score VA with both controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_both_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_both_x_prior_ela.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_ela.gph saved
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_both_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_both_x_prior_math.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_math.gph saved
 test score VA with og controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_both_og_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_both_og_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_both_og_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_both_og_x_prior_math.pdf saved as PDF format
 test score VA with acs controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_both_acs_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_both_acs_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_both_acs_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_both_acs_x_prior_math.pdf saved as PDF format
 test score VA with sib controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_both_sib_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_both_sib_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_both_sib_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_both_sib_x_prior_math.pdf saved as PDF format
 test score VA with both controls
interaction with prior ela score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_both_both_x_prior_ela.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_both_both_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
(46 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_both_both_x_prior_math.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_both_both_x_prior_math.pdf saved as PDF format

. 
. 
. 
. ********** combine het by prior score decile figures into panels
. /* Original sample,
> restricted sample with original controls,
> restricted sample with sibling controls,
> restricted sample with both sibling and census controls: 4 graphs in one pane
> l */
. 
. // 3 outcomes, 2 VA subjects, 2 prior subjects = 12 panels
. foreach outcome in enr enr_2year enr_4year {
  2.   di "LHS outcome = `outcome'"
  3. 
.   foreach subject in ela math {
  4.     di "VA Subject = `subject'"
  5. 
.     foreach prior_subject in ela math {
  6.       di "interaction with prior `prior_subject' score deciles"
  7. 
.       graph combine ///
>         $vaprojdir/gph_files/sbac/reg_`outcome'_va_`subject'_hetero_prior_`pr
> ior_subject'.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'
> _va_`subject'_og_x_prior_`prior_subject'.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'
> _va_`subject'_sib_x_prior_`prior_subject'.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'
> _va_`subject'_both_x_prior_`prior_subject'.gph ///
>         , xcommon ycommon ///
>         title("Regression of ``outcome'_str' on ``subject'_str' VA Interacted
>  with Prior ``prior_subject'_str' Decile", size(small))
  8. 
.       graph export $vaprojdir/figures/va_sib_acs/combined_panels/het_reg_prio
> r_score/het_reg_`outcome'_va_`subject'_x_prior_`prior_subject'.pdf, replace
  9.       graph export $projdir/out/graph//siblingvaregs/persistence/sib_acs_r
> estr_smp/combined_panels/het_reg_prior_score/het_reg_`outcome'_va_`subject'_x
> _prior_`prior_subject'.pdf, replace
 10. 
. 
. 
. 
.     }
 11.   }
 12. }
LHS outcome = enr
VA Subject = ela
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_va_ela_x_prior_ela.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_va_ela_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_va_ela_x_prior_math.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_va_ela_x_prior_math.pdf saved as PDF format
VA Subject = math
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_va_math_x_prior_ela.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_va_math_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_va_math_x_prior_math.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_va_math_x_prior_math.pdf saved as PDF format
LHS outcome = enr_2year
VA Subject = ela
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_2year_va_ela_x_prior_ela.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_2year_va_ela_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_2year_va_ela_x_prior_math.pd
    > f saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_2year_va_ela_x_prior_math.pdf saved as PDF format
VA Subject = math
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_2year_va_math_x_prior_ela.pd
    > f saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_2year_va_math_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_2year_va_math_x_prior_math.p
    > df saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_2year_va_math_x_prior_math.pdf saved as PDF format
LHS outcome = enr_4year
VA Subject = ela
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_4year_va_ela_x_prior_ela.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_4year_va_ela_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_4year_va_ela_x_prior_math.pd
    > f saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_4year_va_ela_x_prior_math.pdf saved as PDF format
VA Subject = math
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_4year_va_math_x_prior_ela.pd
    > f saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_4year_va_math_x_prior_ela.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_4year_va_math_x_prior_math.p
    > df saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_4year_va_math_x_prior_math.pdf saved as PDF format

. 
. 
. ********** make individual figures for heterogeneity by prior score decile by
>  SED status
. foreach outcome in enr enr_2year enr_4year {
  2.   di "Dependent Var = `outcome'"
  3. 
.   foreach subject in ela math {
  4.     di "VA Subject = `subject'"
  5. 
.     foreach control in og acs sib both {
  6.       di "`subject' test score VA with `control' controls"
  7. 
.       foreach prior_subject in ela math {
  8.         di "interaction with prior `prior_subject' score deciles"
  9. 
.         foreach sed_status in 0 1 {
 10.           di "SED status = `sed_status'"
 11. 
.           estimates use $vaprojdir/estimates/sib_acs_restr_smp/persistence/he
> t_reg_`outcome'_va_`subject'_`control'_x_prior_`prior_subject'_sed`sed_status
> '.ster
 12. 
.           // convert estimation results into a dataset
.           parmest, norestore
 13.           // keep only the interaction parameters
.           keep if strpos(parm, "prior_`prior_subject'_z_score_xtile#c.va_`sub
> ject'_`control'") != 0
 14.           // generate a var that is the decile number of the prior score, 
> from 1 to 10
.           gen xtile = subinstr(substr(parm, 1, strpos(parm, ".")), "b", "", .
> )
 15.           // convert xtile var into a numeric var
.           destring xtile, replace
 16. 
.           twoway ///
>             (bar estimate xtile) ///
>             (rcap min95 max95 xtile) ///
>             , yline(`=``outcome'_va_`subject'_`control''') ///
>             legend(off) ///
>             ytitle("Coefficient Estimate") ///
>             xtitle("Prior ``prior_subject'_str' Score Decile") ///
>             title("LHS = ``outcome'_str'; RHS = ``subject'_str' VA w/ ``contr
> ol'_str' Controls # Prior ``prior_subject'_str' Decile, SED Status = `sed_sta
> tus'" ///
>             , size(vsmall))
 17. 
. 
.           graph export $vaprojdir/figures/va_sib_acs/het_reg_prior_score/het_
> reg_`outcome'_va_`subject'_`control'_x_prior_`prior_subject'_sed`sed_status'.
> pdf, replace
 18.           graph export $projdir/out/graph//siblingvaregs/persistence/sib_a
> cs_restr_smp/het_reg_prior_score/het_reg_`outcome'_va_`subject'_`control'_x_p
> rior_`prior_subject'_sed`sed_status'.pdf, replace
 19. 
.           // redraw the graph to be used for combining into panels
.           twoway ///
>             (bar estimate xtile) ///
>             (rcap min95 max95 xtile) ///
>             , yline(`=``outcome'_va_`subject'_`control''') ///
>             legend(off) ///
>             xtitle("Prior ``prior_subject'_str' Score Decile, SED = `sed_stat
> us'") ///
>             title("Restricted Sample, ``control'_str' Controls", size(vsmall)
> ) ///
>             saving($vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_re
> g_`outcome'_va_`subject'_`control'_x_prior_`prior_subject'_sed`sed_status', r
> eplace)
 20. 
. 
.         }
 21. 
.       }
 22.     }
 23.   }
 24. }
Dependent Var = enr
VA Subject = ela
ela test score VA with og controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_og_x_prior_ela_sed0.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > og_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_og_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_og_x_prior_ela_sed1.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > og_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_og_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_og_x_prior_math_sed0.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > og_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_og_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_og_x_prior_math_sed1.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > og_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_og_x_prior_math_sed1.gph saved
ela test score VA with acs controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_acs_x_prior_ela_sed0.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > acs_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_acs_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_acs_x_prior_ela_sed1.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > acs_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_acs_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_acs_x_prior_math_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > acs_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_acs_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_acs_x_prior_math_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > acs_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_acs_x_prior_math_sed1.gph saved
ela test score VA with sib controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_sib_x_prior_ela_sed0.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > sib_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_sib_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_sib_x_prior_ela_sed1.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > sib_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_sib_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_sib_x_prior_math_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > sib_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_sib_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_sib_x_prior_math_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > sib_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_sib_x_prior_math_sed1.gph saved
ela test score VA with both controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_both_x_prior_ela_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > both_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_both_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_both_x_prior_ela_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > both_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_both_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_both_x_prior_math_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > both_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_both_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_ela_both_x_prior_math_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_ela_
    > both_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_ela_both_x_prior_math_sed1.gph saved
VA Subject = math
math test score VA with og controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_og_x_prior_ela_sed0.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _og_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_og_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_og_x_prior_ela_sed1.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _og_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_og_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_og_x_prior_math_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _og_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_og_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_og_x_prior_math_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _og_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_og_x_prior_math_sed1.gph saved
math test score VA with acs controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_acs_x_prior_ela_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _acs_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_acs_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_acs_x_prior_ela_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _acs_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_acs_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_acs_x_prior_math_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _acs_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_acs_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_acs_x_prior_math_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _acs_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_acs_x_prior_math_sed1.gph saved
math test score VA with sib controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_sib_x_prior_ela_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _sib_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_sib_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_sib_x_prior_ela_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _sib_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_sib_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_sib_x_prior_math_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _sib_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_sib_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_sib_x_prior_math_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _sib_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_sib_x_prior_math_sed1.gph saved
math test score VA with both controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_both_x_prior_ela_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _both_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_both_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_both_x_prior_ela_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _both_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_both_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_both_x_prior_math_sed0.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _both_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_both_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_va_math_both_x_prior_math_sed1.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_va_math
    > _both_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_va_math_both_x_prior_math_sed1.gph saved
Dependent Var = enr_2year
VA Subject = ela
ela test score VA with og controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_og_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_og_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_math_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_og_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_math_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_og_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_og_x_prior_math_sed1.gph saved
ela test score VA with acs controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_acs_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_acs_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_math_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_acs_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_math_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_acs_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_acs_x_prior_math_sed1.gph saved
ela test score VA with sib controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_sib_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_sib_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_math_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_sib_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_math_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_sib_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_sib_x_prior_math_sed1.gph saved
ela test score VA with both controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_both_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_both_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_math_sed0.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_both_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_math_sed1.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_ela_both_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_ela_both_x_prior_math_sed1.gph saved
VA Subject = math
math test score VA with og controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_og_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_og_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_og_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_og_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_og_x_prior_math_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_og_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_og_x_prior_math_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_og_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_og_x_prior_math_sed1.gph saved
math test score VA with acs controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_acs_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_acs_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_math_sed0.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_acs_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_math_sed1.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_acs_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_acs_x_prior_math_sed1.gph saved
math test score VA with sib controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_sib_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_sib_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_math_sed0.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_sib_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_math_sed1.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_sib_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_sib_x_prior_math_sed1.gph saved
math test score VA with both controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_both_x_prior_ela_sed0.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_both_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_both_x_prior_ela_sed1.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_both_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_both_x_prior_math_sed0.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_both_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_2year_va_math_both_x_prior_math_sed1.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_2year_v
    > a_math_both_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_2year_va_math_both_x_prior_math_sed1.gph saved
Dependent Var = enr_4year
VA Subject = ela
ela test score VA with og controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_og_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_og_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_math_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_og_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_math_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_og_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_og_x_prior_math_sed1.gph saved
ela test score VA with acs controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_acs_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_acs_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_math_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_acs_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_math_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_acs_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_acs_x_prior_math_sed1.gph saved
ela test score VA with sib controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_sib_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_sib_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_math_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_sib_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_math_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_sib_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_sib_x_prior_math_sed1.gph saved
ela test score VA with both controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_both_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_both_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_math_sed0.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_both_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_math_sed1.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_ela_both_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_ela_both_x_prior_math_sed1.gph saved
VA Subject = math
math test score VA with og controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_og_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_og_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_og_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_og_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_og_x_prior_math_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_og_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_og_x_prior_math_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_og_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_og_x_prior_math_sed1.gph saved
math test score VA with acs controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_acs_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_acs_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_math_sed0.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_acs_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_math_sed1.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_acs_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_acs_x_prior_math_sed1.gph saved
math test score VA with sib controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_ela_sed0.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_sib_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_ela_sed1.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_sib_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_math_sed0.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_sib_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_math_sed1.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_sib_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_sib_x_prior_math_sed1.gph saved
math test score VA with both controls
interaction with prior ela score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_both_x_prior_ela_sed0.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_both_x_prior_ela_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_ela_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_both_x_prior_ela_sed1.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_both_x_prior_ela_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_ela_sed1.gph saved
interaction with prior math score deciles
SED status = 0
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_both_x_prior_math_sed0.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_both_x_prior_math_sed0.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_math_sed0.gph saved
SED status = 1
(45 observations deleted)
xtile: all characters numeric; replaced as byte
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/het_r
    > eg_prior_score/het_reg_enr_4year_va_math_both_x_prior_math_sed1.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/het_reg_prior_score/het_reg_enr_4year_v
    > a_math_both_x_prior_math_sed1.pdf saved as PDF format
file /home/research/ca_ed_lab/projects/common_core_va/gph_files/va_sib_acs/het_
> reg_prior_score/het_reg_enr_4year_va_math_both_x_prior_math_sed1.gph saved

. 
. 
. 
. ********** combine het by prior score decile by SED Status figures into panel
> s
. /* Original sample,
> restricted sample with original controls,
> restricted sample with sibling controls,
> restricted sample with both sibling and census controls,
> each by SED == 1 and SED == 1: 8 graphs in one panel */
. 
. // 3 outcomes, 2 VA subjects, 2 prior subjects = 12 panels
. foreach outcome in enr enr_2year enr_4year {
  2.   di "LHS outcome = `outcome'"
  3. 
.   foreach subject in ela math {
  4.     di "VA Subject = `subject'"
  5. 
.     foreach prior_subject in ela math {
  6.       di "interaction with prior `prior_subject' score deciles"
  7. 
.       graph combine ///
>         $vaprojdir/gph_files/sbac/reg_`outcome'_va_cfr_g11_`subject'_hetero_p
> rior_`prior_subject'_sed0.gph ///
>         $vaprojdir/gph_files/sbac/reg_`outcome'_va_cfr_g11_`subject'_hetero_p
> rior_`prior_subject'_sed1.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'
> _va_`subject'_og_x_prior_`prior_subject'_sed0.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'
> _va_`subject'_og_x_prior_`prior_subject'_sed1.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'
> _va_`subject'_sib_x_prior_`prior_subject'_sed0.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'
> _va_`subject'_sib_x_prior_`prior_subject'_sed1.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'
> _va_`subject'_both_x_prior_`prior_subject'_sed0.gph ///
>         $vaprojdir/gph_files/va_sib_acs/het_reg_prior_score/het_reg_`outcome'
> _va_`subject'_both_x_prior_`prior_subject'_sed1.gph ///
>         , xcommon ycommon ///
>         title("Regression of ``outcome'_str' on ``subject'_str' VA Interacted
>  with Prior ``prior_subject'_str' Decile by SED Status", size(small))
  8. 
.       graph export $vaprojdir/figures/va_sib_acs/combined_panels/het_reg_prio
> r_score/het_reg_`outcome'_va_`subject'_x_prior_`prior_subject'_sed.pdf, repla
> ce
  9.       graph export $projdir/out/graph//siblingvaregs/persistence/sib_acs_r
> estr_smp/combined_panels/het_reg_prior_score/het_reg_`outcome'_va_`subject'_x
> _prior_`prior_subject'_sed.pdf, replace
 10. 
. 
. 
. 
.     }
 11.   }
 12. }
LHS outcome = enr
VA Subject = ela
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_va_ela_x_prior_ela_sed.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_va_ela_x_prior_ela_sed.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_va_ela_x_prior_math_sed.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_va_ela_x_prior_math_sed.pdf saved as PDF format
VA Subject = math
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_va_math_x_prior_ela_sed.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_va_math_x_prior_ela_sed.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_va_math_x_prior_math_sed.pdf
    saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_va_math_x_prior_math_sed.pdf saved as PDF format
LHS outcome = enr_2year
VA Subject = ela
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_2year_va_ela_x_prior_ela_sed
    > .pdf saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_2year_va_ela_x_prior_ela_sed.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_2year_va_ela_x_prior_math_se
    > d.pdf saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_2year_va_ela_x_prior_math_sed.pdf saved as PDF format
VA Subject = math
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_2year_va_math_x_prior_ela_se
    > d.pdf saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_2year_va_math_x_prior_ela_sed.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_2year_va_math_x_prior_math_s
    > ed.pdf saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_2year_va_math_x_prior_math_sed.pdf saved as PDF format
LHS outcome = enr_4year
VA Subject = ela
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_4year_va_ela_x_prior_ela_sed
    > .pdf saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_4year_va_ela_x_prior_ela_sed.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_4year_va_ela_x_prior_math_se
    > d.pdf saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_4year_va_ela_x_prior_math_sed.pdf saved as PDF format
VA Subject = math
interaction with prior ela score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_4year_va_math_x_prior_ela_se
    > d.pdf saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_4year_va_math_x_prior_ela_sed.pdf saved as PDF format
interaction with prior math score deciles
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/combi
    > ned_panels/het_reg_prior_score/het_reg_enr_4year_va_math_x_prior_math_s
    > ed.pdf saved as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph//siblingvareg
    > s/persistence/sib_acs_restr_smp/combined_panels/het_reg_prior_score/het
    > _reg_enr_4year_va_math_x_prior_math_sed.pdf saved as PDF format

. 
. 
. 
. 
. timer off 1

. timer list
   1:    489.53 /        1 =     489.5330

. 
. cd $projdir
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. set trace off

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/reg_out_va_sib_acs_fig.smcl
  log type:  smcl
 closed on:  28 Nov 2022, 19:14:13
-------------------------------------------------------------------------------
