{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/reg_out_va_cfr_dk.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 May 2022, 14:10:12
{txt}
{com}. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative file paths  */
. cd $vaprojdir
{res}/home/research/ca_ed_lab/projects/common_core_va
{txt}
{com}. 
. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. macro list
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.0016940947555251
{p_end}
{txt}{p 0 16}
S_2:{space 12}{res}{res}300
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.0104764158075594
{p_end}
{txt}{p 0 16}
S_1:{space 12}{res}{res}epanechnikov
{p_end}
{txt}{p 0 16}
ReS_jv2:{space 8}{res}{res}0 1
{p_end}
{txt}{p 0 16}
ReS_Call:{space 7}{res}{res}version 16.1:
{p_end}
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_6:{space 12}{res}{res}.7097029923018954
{p_end}
{txt}{p 0 16}
S_5:{space 12}{res}{res}4
{p_end}
{txt}{p 0 16}
dropv:{space 10}{res}{res}_cdscode_x
{p_end}
{txt}{p 0 16}
n_offset:{space 7}{res}{res}0
{p_end}
{txt}{p 0 16}
sort:{space 11}{res}{res}0
{p_end}
{txt}{p 0 16}
dots:{space 11}{res}{res}nois _dots 5 0
{p_end}
{txt}{p 0 16}
dotss:{space 10}{res}{res}nois _dots 0, title(Survey results being calculated)
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_both_str:{space 6}{res}{res}Original + Census + Sibling
{p_end}
{txt}{p 0 16}
_sib_str:{space 7}{res}{res}Original + Sibling
{p_end}
{txt}{p 0 16}
_acs_str:{space 7}{res}{res}Original + Census
{p_end}
{txt}{p 0 16}
_og_str:{space 8}{res}{res}Original Specification
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}
{com}. 
. //startomg timer
. timer on 1
{txt}
{com}. 
. 
. ********************************************************************************
. * begin main code
. 
. local create_sample_from_scratch = 1
{txt}
{com}. if `create_sample_from_scratch'==1 {c -(}
.   // create VA sample
.   include $vaprojdir/do_files/sbac/create_va_sample.doh
{txt}
{com}. **************** Create VA Dataset
. use merge_id_k12_test_scores all_students_sample first_scores_sample ///
>         dataset test cdscode school_id state_student_id year grade ///
>         cohort_size ///
>         sbac_ela_z_score sbac_math_z_score ///
>         `va_control_vars' ///
>         /*if substr(cdscode, 1, 7)=="3768338"*/ ///
>         using `k12_test_scores'/k12_test_scores_clean.dta, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. merge 1:1 merge_id_k12_test_scores using data/sbac/va_samples.dta ///
>         , nogen keepusing(touse_*)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to lagged scores
. merge 1:1 merge_id_k12_test_scores using `k12_test_scores'/k12_lag_test_scores_clean.dta, nogen keep(1 3) ///
>         keepusing( ///
>                 L3_cst_ela_z_score ///
>                 L3_sbac_ela_z_score ///
>                 L4_cst_ela_z_score ///
>                 L3_sbac_math_z_score ///
>                 L4_sbac_math_z_score ///
>                 L5_cst_math_z_score ///
>                 L6_cst_math_z_score ///
>         )
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to peer scores
. merge 1:1 merge_id_k12_test_scores using `k12_test_scores'/k12_peer_test_scores_clean.dta, nogen keep(1 3) ///
>         keepusing( ///
>                 `peer_demographic_controls' ///
>                 peer_L3_cst_ela_z_score ///
>                 peer_L3_sbac_ela_z_score ///
>                 peer_L4_cst_ela_z_score ///
>                 peer_L3_sbac_math_z_score ///
>                 peer_L4_sbac_math_z_score ///
>                 peer_L5_cst_math_z_score ///
>                 peer_L6_cst_math_z_score ///
>         )
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to school grade spans
. merge m:1 cdscode year using `k12_test_scores_public'/k12_diff_school_prop_schyr.dta ///
>         , gen(merge_grade_span) keepusing(gr11_*_diff_school_prop) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         445,910
{txt}{col 9}from master{col 30}{res}         445,910{txt}  (merge_grade_span==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_grade_span==2)

{col 5}Matched{col 30}{res}      78,176,233{txt}  (merge_grade_span==3)
{col 5}{hline 41}

{com}. 
. * Merge to median cohort sizes
. merge m:1 cdscode using `k12_test_scores_public'/k12_cohort_size_sch.dta ///
>         , gen(merge_cohort_size) keepusing(med_cohort_size_first_scores) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  (merge_cohort_size==3)
{col 5}{hline 41}

{com}. 
. * Keep conventional schools
. merge m:1 cdscode using `k12_public_schools'/k12_public_schools_clean.dta ///
>         , gen(merge_public_schools) keepusing(conventional_school) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       1,432,257
{txt}{col 9}from master{col 30}{res}       1,432,257{txt}  (merge_public_schools==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_public_schools==2)

{col 5}Matched{col 30}{res}      77,189,886{txt}  (merge_public_schools==3)
{col 5}{hline 41}

{com}. keep if conventional_school==1
{txt}(3,908,486 observations deleted)

{com}. 
. * Exclude schools where more than 25 percent of students are receiving special education services
. 
. * Drop if a student is receiving instruction at home, in a hospital, or in a school serving disabled students solely
. 
. * Drop if 10 or fewer students per school
. drop if cohort_size<=10
{txt}(474,064 observations deleted)

{com}. . 
.   // merge on postsecondary outcomes
.   do do_files/merge_k12_postsecondary.doh enr_only
{txt}
{com}. version 16.1
{txt}
{com}. 
. *****************************************************
. * First created by Matthew Naven on June 11, 2018 *
. *****************************************************
. 
. local crosswalks "/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks/"
{txt}
{com}. 
. ***************
. * Description *
. ***************
. /*
> This file merges the K-12 data to the postsecondary data.
> */
. 
. 
. **********
. * Macros *
. **********
. args enr_only
{txt}
{com}. 
. local min_nsc_hs_grad_year "2010"
{txt}
{com}. local max_nsc_hs_grad_year "2019"
{txt}
{com}. 
. local min_nsc_enr_year "2010"
{txt}
{com}. local max_nsc_enr_year "2020"
{txt}
{com}. 
. local min_nsc_deg_year "2011"
{txt}
{com}. local max_nsc_deg_year "2020"
{txt}
{com}. 
. local min_ccc_enr_year "1993"
{txt}
{com}. local max_ccc_enr_year "2017"
{txt}
{com}. 
. local min_ccc_deg_year "1993"
{txt}
{com}. local max_ccc_deg_year "2016"
{txt}
{com}. 
. local min_csu_app_year "2002"
{txt}
{com}. local max_csu_app_year "2017"
{txt}
{com}. 
. local min_csu_enr_year "2002"
{txt}
{com}. local max_csu_enr_year "2017"
{txt}
{com}. 
. local min_csu_deg_year "2002"
{txt}
{com}. local max_csu_deg_year "2016"
{txt}
{com}. 
. 
. *****************
. * Begin Do File *
. *****************
. **** K-12 Variables
. gen year_grad_hs = year + (12 - grade)
{txt}(315 missing values generated)

{com}. gen year_college = year + (13 - grade)
{txt}(315 missing values generated)

{com}. 
. 
. 
. 
. **** Merge to K-12/NSC crosswalk
. gen k12_nsc_match = 0
{txt}
{com}. gen k12_nsc_2010_2017_match = 0
{txt}
{com}. /*gen k12_nsc_2010_2018_match = 0*/
. gen k12_nsc_2018cde_match = 0
{txt}
{com}. gen k12_nsc_2019cde_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}cohort_size{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}year_grad_hs{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}year_college{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}k12_nsc_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2010_2017_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2018cde_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2019cde_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (1,336,312,674 bytes saved)

{com}. 
. 
. ** NSC
. merge m:1 state_student_id      using `crosswalks'/nsc_outcomes_crosswalk_ssid.dta, gen(merge_k12_nsc_ssid) keep(1 3 4 5) update
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      38,120,615
{txt}{col 9}from master{col 30}{res}      38,120,615{txt}  (merge_k12_nsc_ssid==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==2)

{col 5}Matched{col 30}{res}      36,118,978
{txt}{col 9}not updated{col 30}{res}      36,118,978{txt}  (merge_k12_nsc_ssid==3)
{col 9}missing updated{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==4)
{col 9}nonmissing conflict{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==5)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. replace k12_nsc_match = 1 if inlist(merge_k12_nsc_ssid, 3, 4, 5)
{txt}(36,118,978 real changes made)

{com}. drop merge_k12_nsc_ssid
{txt}
{com}. 
. 
. 
. ** Edit NSC Variables
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist "nsc_enr nsc_enr_lt2year nsc_enr_2year nsc_enr_4year nsc_enr_ontime nsc_enr_ontime_lt2year nsc_enr_ontime_2year nsc_enr_ontime_4year"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist "nsc_*"
. {c )-}
{txt}
{com}. * Replace NSC variables with missing if no chance of matching to the NSC data
. foreach v of varlist `varlist' {c -(}
{txt}  2{com}.         replace `v' = . if k12_nsc_match==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         * Replace NSC persistence variables with missing if never enrolled
.         foreach v of varlist nsc_persist_year2 nsc_persist_year3 nsc_persist_year4 {c -(}
{txt}  2{com}.                 replace `v' = . if nsc_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 4 {c -(}
{txt}  2{com}.                 * Replace NSC persistence variables with 0 if they could have matched to the NSC data but didn't
.                 replace nsc_persist_year`t' = 0 if nsc_enr==1 & nsc_persist_year`t'!=1 & k12_nsc_match==1 & year_grad_hs + (`t' - 1)<=`max_nsc_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC persistence variables with missing if they could not have matched to the NSC data
.                 replace nsc_persist_year`t' = . if nsc_enr==1 & /*nsc_persist_year`t'!=1 &*/ k12_nsc_match==1 & year_grad_hs + (`t' - 1)>`max_nsc_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_lt2year {c -(}
{txt}  2{com}.                 * Replace NSC less-than-2-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 2<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC less-than-2-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 2>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_2year {c -(}
{txt}  2{com}.                 * Replace NSC 2-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 3<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC 2-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 3>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_4year {c -(}
{txt}  2{com}.                 * Replace NSC 4-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 6<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC 4-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 6>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * NSC degree receipt conditional on enrollment
.         gen nsc_enr_deg_lt2year = nsc_deg_lt2year if nsc_enr_lt2year==1
.         gen nsc_enr_deg_2year = nsc_deg_2year if nsc_enr_2year==1
.         gen nsc_enr_deg_4year = nsc_deg_4year if nsc_enr_4year==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. 
. 
. **** Merge to K-12/CCC crosswalk
. gen k12_ccc_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}k12_ccc_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (222,718,779 bytes saved)

{com}. 
. merge m:1 state_student_id ///
>         using `crosswalks'/k12_ccc_crosswalk.dta ///
>         , gen(merge_k12_ccc) keep(1 3) keepusing(student_id)
{res}{txt}(label {bf:{txt}male} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      55,226,385
{txt}{col 9}from master{col 30}{res}      55,226,385{txt}  (merge_k12_ccc==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_ccc==2)

{col 5}Matched{col 30}{res}      19,013,208{txt}  (merge_k12_ccc==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. replace k12_ccc_match = 1 if merge_k12_ccc==3
{txt}(19,013,208 real changes made)

{com}. drop merge_k12_ccc
{txt}
{com}. 
. 
. **** Merge to CCC data
. count if !mi(student_id)
  {res}19,013,208
{txt}
{com}. 
. merge m:1 student_id ///
>         using `crosswalks'/ccc_outcomes_crosswalk.dta ///
>         , gen(merge_k12_ccc) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      59,602,683
{txt}{col 9}from master{col 30}{res}      59,602,683{txt}  (merge_k12_ccc==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_ccc==2)

{col 5}Matched{col 30}{res}      14,636,910{txt}  (merge_k12_ccc==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. ** Edit CCC Variables
. foreach v of varlist ccc_enr {c -(}
{txt}  2{com}.         * Replace CCC enrollment with 0 if could have matched to the CCC data but didn't
.         replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_ccc_enr_year', `max_ccc_enr_year')
{txt}  3{com}.         * Replace CCC enrollment with missing if could not have matched to the CCC data
.         replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_ccc_enr_year', `max_ccc_enr_year')
{txt}  4{com}. {c )-}
{txt}(32,480,670 real changes made)
(4,773,803 real changes made, 4,773,803 to missing)

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. * CCC on-time enrollment
. gen ccc_enr_ontime = 1 if ccc_enr==1 ///
>         & (ccc_enr_start_year==year_grad_hs & inlist(ccc_enr_start_term, 5, 6, 7, 8)) ///
>         | (ccc_enr_start_year==year_grad_hs + 1 & inlist(ccc_enr_start_term, 1, 2, 3, 4))
{txt}(69,729,820 missing values generated)

{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         * Replace CCC remediation and persistence variables with missing if never enrolled
.         foreach v of varlist ccc_remediation ccc_ela_remediation ccc_math_remediation ///
>                 ccc_persist_year2 ccc_persist_year3 ///
>                 ccc_deg ccc_deg_c ccc_deg_a ccc_deg_b {c -(}
{txt}  2{com}.                 replace `v' = . if ccc_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 3 {c -(}
{txt}  2{com}.                 * Replace CCC persistence variables with 0 if they could have matched to the CCC data but didn't
.                 replace ccc_persist_year`t' = 0 if ccc_enr==1 & ccc_persist_year`t'!=1 & k12_ccc_match==1 & year_grad_hs + (`t' - 1)<=`max_ccc_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace CCC persistence variables with missing if they could not have matched to the CCC data
.                 replace ccc_persist_year`t' = . if ccc_enr==1 & /*ccc_persist_year`t'!=1 &*/ k12_ccc_match==1 & year_grad_hs + (`t' - 1)>`max_ccc_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist ccc_deg ccc_deg_c ccc_deg_a ccc_deg_b {c -(}
{txt}  2{com}.                 * Replace CCC degree variable with 0 if they could have matched to the CCC data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs + 3, `min_ccc_deg_year', `max_ccc_deg_year')
{txt}  3{com}.                 * Replace CCC degree variable with missing if they could not have matched to the CCC data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs + 3, `min_ccc_deg_year', `max_ccc_deg_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. 
. 
. **** Merge to K-12/CSU crosswalk
. gen k12_csu_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}ccc_enr_year{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}ccc_enr_ontime{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_csu_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (519,677,151 bytes saved)

{com}. 
. merge m:1 state_student_id ///
>         using `crosswalks'/k12_csu_crosswalk.dta ///
>         , gen(merge_k12_csu) keep(1 3) keepusing(idunique)
{res}{txt}(label {bf:{txt}male} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      65,945,290
{txt}{col 9}from master{col 30}{res}      65,945,290{txt}  (merge_k12_csu==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_csu==2)

{col 5}Matched{col 30}{res}       8,294,303{txt}  (merge_k12_csu==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. replace k12_csu_match = 1 if merge_k12_csu==3
{txt}(8,294,303 real changes made)

{com}. drop merge_k12_csu
{txt}
{com}. 
. 
. **** Merge to CSU data
. count if !mi(idunique)
  {res}8,294,303
{txt}
{com}. 
. merge m:1 idunique ///
>         using `crosswalks'/csu_outcomes_crosswalk.dta ///
>         , gen(merge_k12_csu) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      65,945,290
{txt}{col 9}from master{col 30}{res}      65,945,290{txt}  (merge_k12_csu==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_csu==2)

{col 5}Matched{col 30}{res}       8,294,303{txt}  (merge_k12_csu==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. ** Edit CSU Variables
. foreach v of varlist csu_enr {c -(}
{txt}  2{com}.         * Replace CSU enrollment with 0 if could have matched to the CSU data but didn't
.         replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_csu_enr_year', `max_csu_enr_year')
{txt}  3{com}.         * Replace CSU enrollment with missing if could not have matched to the CSU data
.         replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_csu_enr_year', `max_csu_enr_year')
{txt}  4{com}. {c )-}
{txt}(34,066,226 real changes made)
(16,752 real changes made, 16,752 to missing)

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. * CSU on-time enrollment
. gen csu_enr_ontime = 1 if csu_enr==1 ///
>         & (csu_enr_start_year==year_grad_hs & inlist(csu_enr_start_term, 3, 4)) ///
>         | (csu_enr_start_year==year_grad_hs + 1 & inlist(csu_enr_start_term, 1, 2))
{txt}(71,630,260 missing values generated)

{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         foreach v of varlist csu_applied csu_applied_multiple csu_accepted {c -(}
{txt}  2{com}.                 * Replace CSU application with 0 if could have matched to the CSU data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_csu_app_year', `max_csu_app_year')
{txt}  3{com}.                 * Replace CSU application with missing if could not have matched to the CSU data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_csu_app_year', `max_csu_app_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * Replace CSU acceptance with missing if never applied
.         foreach v of varlist csu_accepted {c -(}
{txt}  2{com}.                 replace `v' = . if csu_applied!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         * Replace CSU remediation and persistence variables with missing if never enrolled
.         foreach v of varlist ///
>                 csu_eng_remediation csu_math_remediation csu_first_maj_stem csu_first_maj_other csu_first_maj_undecided ///
>                 csu_persist_year2 csu_persist_year3 csu_persist_year4 ///
>                 csu_deg csu_deg_stem csu_deg_other {c -(}
{txt}  2{com}.                 replace `v' = . if csu_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 4 {c -(}
{txt}  2{com}.                 * Replace CSU persistence variables with 0 if they could have matched to the CSU data but didn't
.                 replace csu_persist_year`t' = 0 if csu_enr==1 & csu_persist_year`t'!=1 & k12_csu_match==1 & year_grad_hs + (`t' - 1)<=`max_csu_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace CSU persistence variables with missing if they could not have matched to the CSU data
.                 replace csu_persist_year`t' = . if csu_enr==1 & /*csu_persist_year`t'!=1 &*/ k12_csu_match==1 & year_grad_hs + (`t' - 1)>`max_csu_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist csu_deg csu_deg_stem csu_deg_other {c -(}
{txt}  2{com}.                 * Replace CSU degree variable with 0 if they could have matched to the CSU data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs + 6, `min_csu_deg_year', `max_csu_deg_year')
{txt}  3{com}.                 * Replace CSU degree variable with missing if they could not have matched to the CSU data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs + 6, `min_csu_deg_year', `max_csu_deg_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * CSU degree receipt conditional on STEM major
.         gen csu_maj_stem_deg_stem = csu_deg_stem if csu_first_maj_stem==1
.         gen csu_maj_stem_deg_other = csu_deg_other if csu_first_maj_stem==1
. 
.         * Replace CSU degree receipt conditional on STEM major with missing if never enrolled
.         foreach v of varlist ///
>                 csu_maj_stem_deg_stem csu_maj_stem_deg_other {c -(}
{txt}  2{com}.                 replace `v' = . if csu_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. {c )-}
{txt}
{com}. 
. 
. 
. 
. **** Drop observations that had no chance of matching to CCC/CSU data
. compress
  {txt}variable {bf}{res}csu_enr_ontime{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (222,718,779 bytes saved)

{com}. merge m:1 state_student_id ///
>         using `crosswalks'/k12_unique_crosswalk.dta ///
>         , gen(merge_k12_unique) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       8,542,396
{txt}{col 9}from master{col 30}{res}       8,542,396{txt}  (merge_k12_unique==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_unique==2)

{col 5}Matched{col 30}{res}      65,697,197{txt}  (merge_k12_unique==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist_ccc "ccc_enr_*"
.         local varlist_csu "csu_enr_*"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist_ccc "ccc_*"
.         local varlist_csu "csu_*"
. {c )-}
{txt}
{com}. * Replace CCC variables with missing if could not have matched to the CCC data due to non-unique name/birth date/sex
. foreach v of varlist `varlist_ccc' {c -(}
{txt}  2{com}.         replace `v' = . if k12_ccc_match==0 & uniq_first_last_bday_sex==0
{txt}  3{com}.         replace `v' = . if k12_ccc_match==0 & uniq_first3_last3_bday_sex==0 & inrange(year_grad_hs, 1993, 2011)
{txt}  4{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist_ccc
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. * Replace CSU variables with missing if could not have matched to the CSU data due to non-unique name/birth date/sex
. foreach v of varlist `varlist_csu' {c -(}
{txt}  2{com}.         replace `v' = . if k12_csu_match==0 & uniq_first_last_bday_sex_middle==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist_csu
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. 
. 
. **** All college outcomes
. * Enrollment
. gen enr = 1 if nsc_enr==1 /*| ccc_enr==1 | csu_enr==1*/
{txt}(49,586,845 missing values generated)

{com}. replace enr = 0 if nsc_enr==0 & ccc_enr!=1 & csu_enr!=1
{txt}(10,323,530 real changes made)

{com}. label var enr "Enrolled at a Postsecondary Institution"
{txt}
{com}. 
. gen enr_ontime = 1 if nsc_enr_ontime==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(50,213,163 missing values generated)

{com}. replace enr_ontime = 0 if nsc_enr_ontime==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(13,577,960 real changes made)

{com}. label var enr_ontime "Enrolled at a Postsecondary Institution"
{txt}
{com}. 
. gen enr_2year = 1 if nsc_enr_2year==1 | nsc_enr_lt2year==1 | ccc_enr==1
{txt}(52,461,856 missing values generated)

{com}. replace enr_2year = 0 if nsc_enr_2year==0 & nsc_enr_lt2year==0 & ccc_enr!=1
{txt}(16,849,793 real changes made)

{com}. label var enr_2year "Enrolled at a 2-Year College"
{txt}
{com}. 
. gen enr_ontime_2year = 1 if nsc_enr_ontime_2year==1 | nsc_enr_ontime_lt2year==1 | ccc_enr_ontime==1
{txt}(59,890,552 missing values generated)

{com}. replace enr_ontime_2year = 0 if nsc_enr_ontime_2year==0 & nsc_enr_ontime_lt2year==0 & ccc_enr_ontime!=1
{txt}(22,827,114 real changes made)

{com}. label var enr_ontime_2year "Enrolled at a 2-Year College"
{txt}
{com}. 
. gen enr_4year = 1 if nsc_enr_4year==1 | csu_enr==1
{txt}(61,425,712 missing values generated)

{com}. replace enr_4year = 0 if nsc_enr_4year==0 & csu_enr!=1
{txt}(24,208,513 real changes made)

{com}. label var enr_4year "Enrolled at a 4-Year University"
{txt}
{com}. 
. replace enr_2year = 0 if enr_4year==1
{txt}(6,287,618 real changes made)

{com}. 
. gen enr_ontime_4year = 1 if nsc_enr_ontime_4year==1 | csu_enr_ontime==1
{txt}(63,952,798 missing values generated)

{com}. replace enr_ontime_4year = 0 if nsc_enr_ontime_4year==0 & csu_enr_ontime!=1
{txt}(26,274,474 real changes made)

{com}. label var enr_ontime_4year "Enrolled at a 4-Year University"
{txt}
{com}. 
. replace enr_ontime_2year = 0 if enr_ontime_4year==1
{txt}(1,037,641 real changes made)

{com}. 
. gen enr_pub = 1 if nsc_enr_pub==1 | ccc_enr==1 | csu_enr==1
{txt}(46,968,587 missing values generated)

{com}. replace enr_pub = 0 if nsc_enr_pub==0 & ccc_enr!=1 & csu_enr!=1
{txt}(11,880,923 real changes made)

{com}. label var enr_pub "Enrolled at a Public Institution"
{txt}
{com}. 
. gen enr_ontime_pub = 1 if nsc_enr_ontime_pub==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(52,171,772 missing values generated)

{com}. replace enr_ontime_pub = 0 if nsc_enr_ontime_pub==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(15,536,569 real changes made)

{com}. label var enr_ontime_pub "Enrolled at a Public Institution"
{txt}
{com}. 
. gen enr_priv = 1 if nsc_enr_priv==1
{txt}(71,163,366 missing values generated)

{com}. replace enr_priv = 0 if nsc_enr_priv==0
{txt}(33,042,751 real changes made)

{com}. label var enr_priv "Enrolled at a Private Institution"
{txt}
{com}. 
. replace enr_pub = 0 if enr_priv==1
{txt}(1,518,834 real changes made)

{com}. 
. gen enr_ontime_priv = 1 if nsc_enr_ontime_priv==1
{txt}(72,128,792 missing values generated)

{com}. replace enr_ontime_priv = 0 if nsc_enr_ontime_priv==0
{txt}(34,008,177 real changes made)

{com}. label var enr_ontime_priv "Enrolled at a Private Institution"
{txt}
{com}. 
. replace enr_ontime_pub = 0 if enr_ontime_priv==1
{txt}(152,192 real changes made)

{com}. 
. gen enr_instate = 1 if nsc_enr_instate==1 | ccc_enr==1 | csu_enr==1
{txt}(47,217,334 missing values generated)

{com}. replace enr_instate = 0 if nsc_enr_instate==0 & ccc_enr!=1 & csu_enr!=1
{txt}(12,129,670 real changes made)

{com}. label var enr_instate "Enrolled at a CA Institution"
{txt}
{com}. 
. gen enr_ontime_instate = 1 if nsc_enr_ontime_instate==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(52,325,033 missing values generated)

{com}. replace enr_ontime_instate = 0 if nsc_enr_ontime_instate==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(15,689,830 real changes made)

{com}. label var enr_ontime_instate "Enrolled at a CA Institution"
{txt}
{com}. 
. gen enr_outstate = 1 if nsc_enr_outstate==1
{txt}(71,059,100 missing values generated)

{com}. replace enr_outstate = 0 if nsc_enr_outstate==0
{txt}(32,938,485 real changes made)

{com}. label var enr_outstate "Enrolled at an Out-of-State Institution"
{txt}
{com}. 
. replace enr_instate = 0 if enr_outstate==1
{txt}(1,374,491 real changes made)

{com}. 
. gen enr_ontime_outstate = 1 if nsc_enr_ontime_outstate==1
{txt}(71,982,845 missing values generated)

{com}. replace enr_ontime_outstate = 0 if nsc_enr_ontime_outstate==0
{txt}(33,862,230 real changes made)

{com}. label var enr_ontime_outstate "Enrolled at an Out-of-State Institution"
{txt}
{com}. 
. replace enr_ontime_instate = 0 if enr_ontime_outstate==1
{txt}(144,984 real changes made)

{com}. 
. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. * Persistence
. if "`enr_only'"!="enr_only" {c -(}
.         gen persist_year2 = 1 if nsc_persist_year2==1 | ccc_persist_year2==1 | csu_persist_year2==1
.         replace persist_year2 = 0 if nsc_persist_year2==0 & ccc_persist_year2!=1 & csu_persist_year2!=1
.         label var persist_year2 "Persisted to Year 2"
. 
.         gen persist_year3 = 1 if nsc_persist_year3==1 | ccc_persist_year3==1 | csu_persist_year3==1
.         replace persist_year3 = 0 if nsc_persist_year3==0 & ccc_persist_year3!=1 & csu_persist_year3!=1
.         label var persist_year3 "Persisted to Year 3"
. 
.         gen persist_year4 = 1 if nsc_persist_year4==1 /*| ccc_persist_year4==1*/ | csu_persist_year4==1
.         replace persist_year4 = 0 if nsc_persist_year4==0 /*& ccc_persist_year4!=1*/ & csu_persist_year4!=1
.         label var persist_year4 "Persisted to Year 4"
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. * Degree
. if "`enr_only'"!="enr_only" {c -(}
.         gen deg = 1 if nsc_deg==1 | ccc_deg==1 | csu_deg==1
.         replace deg = 0 if nsc_deg==0 & ccc_deg!=1 & csu_deg!=1
.         label var deg "Received a College Degree"
. 
.         gen deg_2year = 1 if nsc_deg_2year==1 | ccc_deg==1
.         replace deg_2year = 0 if nsc_deg_2year==0 & ccc_deg!=1
.         label var deg_2year "Received a 2-Year College Degree"
. 
.         gen deg_4year = 1 if nsc_deg_4year==1 | csu_deg==1
.         replace deg_4year = 0 if nsc_deg_4year==0 & csu_deg!=1
.         label var deg_4year "Received a 4-Year College Degree"
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. * Use only NSC sample + values of 1 from other samples
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist "enr enr_2year enr_4year enr_pub enr_priv enr_instate enr_outstate enr_ontime enr_ontime_2year enr_ontime_4year enr_ontime_pub enr_ontime_priv enr_ontime_instate enr_ontime_outstate"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist "enr enr_2year enr_4year enr_pub enr_priv enr_instate enr_outstate enr_ontime enr_ontime_2year enr_ontime_4year enr_ontime_pub enr_ontime_priv enr_ontime_instate enr_ontime_outstate deg deg_2year deg_4year"
. {c )-}
{txt}
{com}. foreach v of varlist `varlist' {c -(}
{txt}  2{com}.         replace `v' = . if /*`v'==0 &*/ k12_nsc_match==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(3,032,951 real changes made, 3,032,951 to missing)
(903,416 real changes made, 903,416 to missing)
(3,032,951 real changes made, 3,032,951 to missing)
(0 real changes made)
(3,032,951 real changes made, 3,032,951 to missing)
(0 real changes made)
(1,485,412 real changes made, 1,485,412 to missing)
(1,485,412 real changes made, 1,485,412 to missing)
(442,291 real changes made, 442,291 to missing)
(1,485,412 real changes made, 1,485,412 to missing)
(0 real changes made)
(1,485,412 real changes made, 1,485,412 to missing)
(0 real changes made)

{com}. macro drop _varlist
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. * CCC
. if "`enr_only'"!="enr_only" {c -(}
.         gen ccc_transfer_4year = 1 if ccc_enr==1 & enr_4year==1
.         replace ccc_transfer_4year = 0 if ccc_enr==1 & enr_4year==0
.         replace ccc_transfer_4year = . ///
>                 if (inlist(ccc_enr_start_year, `max_ccc_enr_year') & inlist(ccc_enr_start_term, 7, 8)) ///
>                 | (inlist(ccc_enr_start_year, `max_ccc_enr_year' + 1) & inlist(ccc_enr_start_term, 1, 2, 3, 4, 5, 6))
.         label var ccc_transfer_4year "Transfered to 4-Year University"
. 
.         replace ccc_persist_year2 = 1 if ccc_persist_year2==0 & ccc_transfer_4year==1
.         replace ccc_persist_year3 = 1 if ccc_persist_year3==0 & ccc_transfer_4year==1
.         replace ccc_deg = 1 if ccc_deg==0 & ccc_transfer_4year==1
.         replace ccc_deg_a = 1 if ccc_deg_a==0 & ccc_transfer_4year==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
. 
. * CSU
. if "`enr_only'"!="enr_only" {c -(}
.         gen csu_transfer_uc = 1 if csu_enr==1 & nsc_enr_uc==1
.         replace csu_transfer_uc = 0 if csu_enr==1 & nsc_enr_uc==0
.         replace csu_transfer_uc = . ///
>                 if (inlist(csu_enr_start_year, `max_csu_enr_year') & inlist(csu_enr_start_term, 4)) ///
>                 | (inlist(csu_enr_start_year, `max_csu_enr_year' + 1) & inlist(csu_enr_start_term, 1, 2, 3))
.         label var csu_transfer_uc "Transfered to a University of California"
. 
.         gen csu_transfer_ucplus = 1 if csu_enr==1 & nsc_enr_ucplus==1
.         replace csu_transfer_ucplus = 0 if csu_enr==1 & nsc_enr_ucplus==0
.         replace csu_transfer_ucplus = . ///
>                 if (inlist(csu_enr_start_year, `max_csu_enr_year') & inlist(csu_enr_start_term, 4)) ///
>                 | (inlist(csu_enr_start_year, `max_csu_enr_year' + 1) & inlist(csu_enr_start_term, 1, 2, 3))
.         label var csu_transfer_ucplus "Transfered to a University of California +"
. 
.         replace csu_persist_year2 = 1 if csu_persist_year2==0 & csu_transfer_ucplus==1
.         replace csu_persist_year3 = 1 if csu_persist_year3==0 & csu_transfer_ucplus==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   478,811    471,413    462,414    458,891    472,732 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   483,906    478,736    469,984    462,182    469,706 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   491,017    491,940    489,081    477,065    474,474 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   476,564    478,626    479,604    475,784    465,856 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   482,380    475,638    477,581    478,350    472,029 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   497,365    495,511    489,644    485,881    484,293 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   453,618    477,686    478,126    471,695    470,862 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   465,180    471,959    494,417    495,642    488,685 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   404,320    421,641    431,787    454,633    455,470 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   344,921    357,598    374,400    381,867    407,531 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,578,082  4,620,748  4,647,038  4,641,990  4,661,638 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   477,138    471,803    468,225    474,331    477,197 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   465,335    470,950    464,136    462,446    468,679 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   469,522    468,175    464,429    467,777    465,428 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   463,911    461,713    458,422    464,569    459,999 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   467,563    461,410    457,935    456,870    462,429 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   481,488    476,277    468,446    464,799    462,900 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   471,279    470,585    463,630    458,037    456,362 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   486,983    493,813    486,854    481,172    472,798 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   452,290    456,653    458,680    457,268    451,871 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   409,660    413,852    416,821    420,677    419,140 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,645,169  4,645,231  4,607,578  4,607,946  4,596,803 {txt}{c |}{res}74,239,278 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         2 {c |}{res}   481,090      1,799      2,079      1,649      1,138 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   472,196    484,890    473,760    465,059    440,204 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   471,815    472,830    488,694    469,686    464,003 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   458,379    930,800    953,631    963,455    925,930 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   457,254    465,708    472,998    472,987    488,487 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   468,092    459,829    470,667    469,722    472,367 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   454,971    912,429    921,699    927,937    925,351 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}   470,427        927      6,027      2,231     12,167 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}   447,194    428,898    463,043    389,735     16,548 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   420,513    424,011    428,138    472,994    557,079 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}         0          0      1,847     35,091    426,103 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,601,931  4,582,121  4,682,583  4,670,546  4,729,377 {txt}{c |}{res}74,239,278 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         2 {c |}{res}         0 {txt}{c |}{res} 5,200,710 
{txt}         3 {c |}{res}   459,647 {txt}{c |}{res} 7,491,816 
{txt}         4 {c |}{res}   450,420 {txt}{c |}{res} 7,576,356 
{txt}         5 {c |}{res}   923,665 {txt}{c |}{res} 9,840,908 
{txt}         6 {c |}{res}   469,764 {txt}{c |}{res} 7,519,383 
{txt}         7 {c |}{res}   483,016 {txt}{c |}{res} 7,630,297 
{txt}         8 {c |}{res}   934,176 {txt}{c |}{res} 9,748,443 
{txt}         9 {c |}{res}     6,047 {txt}{c |}{res} 5,335,329 
{txt}        10 {c |}{res}    31,824 {txt}{c |}{res} 6,221,855 
{txt}        11 {c |}{res}   673,301 {txt}{c |}{res} 6,922,503 
{txt}        12 {c |}{res}   288,637 {txt}{c |}{res}   751,678 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,720,497 {txt}{c |}{res}74,239,278 
{txt}
{com}. 
{txt}end of do-file
{com}.   drop enr enr_2year enr_4year
.   rename enr_ontime enr
{res}{com}.   rename enr_ontime_2year enr_2year
{res}{com}.   rename enr_ontime_4year enr_4year
{res}{com}. 
.   // Save temporary dataset
.   compress
  {txt}variable {bf}{res}enr{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_2year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_4year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_pub{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_pub{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_priv{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_priv{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_instate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_instate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_outstate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}enr_ontime_outstate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (2,449,906,569 bytes saved)
{com}.   tempfile va_dataset
.   save `va_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St192370.000001{rm}
saved
as .dta format
{p_end}
{com}. 
.   // create the postsecondary outcome VA sample and saves temp dataset called va_g11_dataset
.   include $vaprojdir/do_files/sbac/create_va_g11_out_sample.doh
{txt}
{com}. local drift_limit = max(`outcome_max_year' - `outcome_min_year' - 1, 1)
{txt}
{com}. use if grade==11 & dataset=="CAASPP" & inrange(year, `outcome_min_year', `outcome_max_year') using `va_dataset', clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. 
. include do_files/sbac/create_diff_school_prop.doh
{txt}
{com}. gen diff_school_prop = gr11_L3_diff_school_prop if year!=2017
{txt}(473,128 missing values generated)

{com}. replace diff_school_prop = gr11_L4_diff_school_prop if year==2017
{txt}(472,961 real changes made)

{com}. {txt}
{com}. keep if diff_school_prop>=0.95
{txt}(97,358 observations deleted)

{com}. 
. include do_files/sbac/create_prior_scores.doh
{txt}
{com}. **************** Prior Scores
. ******** ELA
. gen prior_ela_z_score = L3_cst_ela_z_score if inrange(year, `star_min_year' + 3, `star_max_year' + 3) & year!=2017
{txt}(1,113,021 missing values generated)

{com}. replace prior_ela_z_score = L3_sbac_ela_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3) & year!=2017
{txt}(344,053 real changes made)

{com}. replace prior_ela_z_score = L4_cst_ela_z_score if year==2017
{txt}(333,419 real changes made)

{com}. label var prior_ela_z_score "Prior ELA Z-Score"
{txt}
{com}. gen peer_prior_ela_z_score = peer_L3_cst_ela_z_score if inrange(year, `star_min_year' + 3, `star_max_year' + 3) & year!=2017
{txt}(976,464 missing values generated)

{com}. replace peer_prior_ela_z_score = peer_L3_sbac_ela_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3) & year!=2017
{txt}(525,703 real changes made)

{com}. replace peer_prior_ela_z_score = peer_L4_cst_ela_z_score if year==2017
{txt}(450,528 real changes made)

{com}. label var peer_prior_ela_z_score "Peer Avg. Prior ELA Z-Score"
{txt}
{com}. 
. ******** Math
. gen prior_math_z_score = L5_cst_math_z_score if inrange(year, `star_min_year' + 5, `star_max_year' + 5) & !inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(798,623 missing values generated)

{com}. replace prior_math_z_score = L3_sbac_math_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(344,849 real changes made)

{com}. label var prior_math_z_score "Prior Math Z-Score"
{txt}
{com}. gen peer_prior_math_z_score = peer_L5_cst_math_z_score if inrange(year, `star_min_year' + 5, `star_max_year' + 5) & !inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(525,936 missing values generated)

{com}. replace peer_prior_math_z_score = peer_L3_sbac_math_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(525,703 real changes made)

{com}. label var peer_prior_math_z_score "Peer Avg. Prior Math Z-Score"
{txt}
{com}. {txt}
{com}. 
. 
. * Save temporary dataset
. compress
{txt}  (0 bytes saved)

{com}. tempfile va_g11_dataset
{txt}
{com}. save `va_g11_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St192370.000002{rm}
saved
as .dta format
{p_end}

{com}. . 
.   // Standardize DK VA estimates created while controlling for both ELA and math VA
.   // No TFX, no peer effects
.   foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.     di "DK outcome = `outcome', DK VA estimated controlling for both subject VAs"
{txt}  3{com}. 
.     // load the dataset that contains the DK VA
.     use $vaprojdir/data/sbac/va_g11_`outcome'.dta, clear
{txt}  4{com}. 
.     foreach v of varlist va_cfr_* {c -(}
{txt}  5{com}.                 sum `v'
{txt}  6{com}.                 replace `v' = `v' - r(mean)
{txt}  7{com}.                 replace `v' = `v' / r(sd)
{txt}  8{com}.         {c )-}
{txt}  9{com}. 
.     compress
{txt} 10{com}.         tempfile va_cfr_g11_`outcome'
{txt} 11{com}.         save `va_cfr_g11_`outcome''
{txt} 12{com}. 
.   {c )-}
DK outcome = enr, DK VA estimated controlling for both subject VAs
{txt}(CST/SBAC Student Test Score Samples)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g1~nr {c |}{res}      4,898   -.0137124    .0875317  -.4264985    .211331
{txt}(4,898 real changes made)
(4,898 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~r_peer {c |}{res}      4,898   -.0002147    .0656924  -.2839798   .2267658
{txt}(4,898 real changes made)
(4,898 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~a {c |}{res}      4,881   -.0139085    .0811363  -.3725721   .2098051
{txt}(4,881 real changes made)
(4,881 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~a_peer {c |}{res}      4,881   -.0009312    .0631088  -.2554508   .2084118
{txt}(4,881 real changes made)
(4,881 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~h {c |}{res}      4,877   -.0123748    .0765165   -.355956   .1780685
{txt}(4,877 real changes made)
(4,877 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~h_peer {c |}{res}      4,877   -.0006284    .0612472  -.2493519   .2100194
{txt}(4,877 real changes made)
(4,877 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~k {c |}{res}      4,877   -.0124562    .0765221  -.3546917   .1775393
{txt}(4,877 real changes made)
(4,877 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~k_peer {c |}{res}      4,877   -.0007078     .061238  -.2494382   .2099323
{txt}(4,877 real changes made)
(4,877 real changes made)
  variable {bf}{res}n_g11_enr{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}n_g11_enr_ela{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}n_g11_enr_math{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}n_g11_enr_dk{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
{txt}  (119,832 bytes saved)
{p 0 4 2}
file {bf}
/home/tmp/St192370.000003{rm}
saved
as .dta format
{p_end}
DK outcome = enr_2year, DK VA estimated controlling for both subject VAs
(CST/SBAC Student Test Score Samples)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g1~ar {c |}{res}      4,898   -.0178963    .0974836  -.3061773   .3408356
{txt}(4,898 real changes made)
(4,898 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~r_peer {c |}{res}      4,898   -.0069576    .0764054   -.236739   .3031855
{txt}(4,898 real changes made)
(4,898 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~a {c |}{res}      4,881    -.017849    .0977671  -.3078484   .3415521
{txt}(4,881 real changes made)
(4,881 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~a_peer {c |}{res}      4,881   -.0061054    .0757365  -.2372659   .3118076
{txt}(4,881 real changes made)
(4,881 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~h {c |}{res}      4,877   -.0178199    .0971622  -.3151913   .3521057
{txt}(4,877 real changes made)
(4,877 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~h_peer {c |}{res}      4,877   -.0061587    .0747247  -.2351438    .330487
{txt}(4,877 real changes made)
(4,877 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~k {c |}{res}      4,877   -.0180515    .0970664  -.3083252   .3531532
{txt}(4,877 real changes made)
(4,877 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~k_peer {c |}{res}      4,877   -.0061819    .0748077   -.235287   .3308166
{txt}(4,877 real changes made)
(4,877 real changes made)
  variable {bf}{res}n_g11_enr_2year{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}n_g11_enr_2year_ela{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}n_g11_enr_2year_math{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}n_g11_enr_2year_dk{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
{txt}  (119,832 bytes saved)
{p 0 4 2}
file {bf}
/home/tmp/St192370.000004{rm}
saved
as .dta format
{p_end}
DK outcome = enr_4year, DK VA estimated controlling for both subject VAs
(CST/SBAC Student Test Score Samples)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g1~ar {c |}{res}      4,898    .0028291    .0985657   -.214585   .3787997
{txt}(4,898 real changes made)
(4,898 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~r_peer {c |}{res}      4,898    .0064507     .081468   -.196805   .3584578
{txt}(4,898 real changes made)
(4,898 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~a {c |}{res}      4,881    .0023092    .0919797  -.2253548   .3309709
{txt}(4,881 real changes made)
(4,881 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~a_peer {c |}{res}      4,881    .0047183    .0757175  -.2053517   .3172224
{txt}(4,881 real changes made)
(4,881 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~h {c |}{res}      4,877     .003703    .0845944  -.2699442   .3040403
{txt}(4,877 real changes made)
(4,877 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~h_peer {c |}{res}      4,877    .0050986    .0709491  -.2257987   .2813931
{txt}(4,877 real changes made)
(4,877 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~k {c |}{res}      4,877    .0038573    .0846927  -.2700091   .3067396
{txt}(4,877 real changes made)
(4,877 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cf~k_peer {c |}{res}      4,877    .0050172    .0708129  -.2256515   .2805482
{txt}(4,877 real changes made)
(4,877 real changes made)
  variable {bf}{res}n_g11_enr_4year{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}n_g11_enr_4year_ela{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}n_g11_enr_4year_math{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}n_g11_enr_4year_dk{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
{txt}  (119,832 bytes saved)
{p 0 4 2}
file {bf}
/home/tmp/St192370.000005{rm}
saved
as .dta format
{p_end}
{com}. 
. 
.   // pull the VA outcome sample temp dataset created above
.   use `va_g11_dataset', clear
{txt}(CST/SBAC Student Test Score Samples)
{com}. 
.   // merge on the DK VA estimates
.   foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.     di "merging `outcome' DK VA"
{txt}  3{com}. 
.     merge m:1 cdscode year using `va_cfr_g11_`outcome'' ///
>       , nogen keep(1 3) keepusing(va_cfr_g11*dk)
{txt}  4{com}.   {c )-}
merging enr DK VA
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           2,606
{txt}{col 9}from master{col 30}{res}           2,606{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}       1,782,258{txt}  
{col 5}{hline 41}
merging enr_2year DK VA
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           2,606
{txt}{col 9}from master{col 30}{res}           2,606{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}       1,782,258{txt}  
{col 5}{hline 41}
merging enr_4year DK VA
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           2,606
{txt}{col 9}from master{col 30}{res}           2,606{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}       1,782,258{txt}  
{col 5}{hline 41}
{com}. 
.   // save this dataset used for outcome on DK VA hetero by prior score regressions
.   compress
{txt}  (0 bytes saved)
{com}.   label data "Outcome VA dataset with merged on DK VA controlling for both subject VA"
.   save $vaprojdir/data/sbac/outcome_va_sample_with_dk_va.dta, replace
{txt}{p 0 4 2}
(file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sbac/outcome_va_sample_with_dk_va.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sbac/outcome_va_sample_with_dk_va.dta{rm}
saved
{p_end}
{com}. {c )-}
{txt}
{com}. 
. 
. use $vaprojdir/data/sbac/outcome_va_sample_with_dk_va.dta, clear
{txt}(Outcome VA dataset with merged on DK VA controlling for both subject VA)

{com}. 
. ********** regress enrollment outcomes on DK VA, matching outcomes on LHS and RHS
. /* no tfx, no peer effects */
. 
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   di "LHS = `outcome', RHS = `outcome' DK VA controlling for both subject VAs"
{txt}  3{com}. 
.   reg `outcome' va_cfr_g11_`outcome'_dk ///
>     i.year ///
>     `school_controls' ///
>     `demographic_controls' ///
>     `ela_score_controls' ///
>     `math_score_controls' ///
>     if touse_g11_`outcome'==1 ///
>     , cluster(cdscode)
{txt}  4{com}. 
.   //add mean of yvar to stored results
.   estadd ysumm, mean
{txt}  5{com}. 
.   estimates save $vaprojdir/estimates/sbac/reg_`outcome'_va_cfr_g11_`outcome'_dk.ster, replace
{txt}  6{com}. {c )-}
LHS = enr, RHS = enr DK VA controlling for both subject VAs

{txt}Linear regression                               Number of obs     = {res} 1,251,472
                                                {txt}F(37, 1271)       =  {res}  1219.34
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1335
                                                {txt}Root MSE          =    {res} .42532

{txt}{ralign 78:(Std. err. adjusted for {res:1,272} clusters in {res:cdscode})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         enr{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr~nr_dk {c |}{col 14}{res}{space 2} .0820161{col 26}{space 2} .0015489{col 37}{space 1}   52.95{col 46}{space 3}0.000{col 54}{space 4} .0789773{col 67}{space 3} .0850548
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0119186{col 26}{space 2} .0028132{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 54}{space 4} .0063996{col 67}{space 3} .0174375
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0181409{col 26}{space 2} .0024471{col 37}{space 1}   -7.41{col 46}{space 3}0.000{col 54}{space 4}-.0229417{col 67}{space 3}-.0133401
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0316417{col 26}{space 2} .0030941{col 37}{space 1}  -10.23{col 46}{space 3}0.000{col 54}{space 4}-.0377117{col 67}{space 3}-.0255716
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001739{col 26}{space 2} 3.72e-06{col 37}{space 1}  -46.72{col 46}{space 3}0.000{col 54}{space 4}-.0001812{col 67}{space 3}-.0001666
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0756395{col 26}{space 2}  .001386{col 37}{space 1}  -54.57{col 46}{space 3}0.000{col 54}{space 4}-.0783587{col 67}{space 3}-.0729204
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0616625{col 26}{space 2} .0027699{col 37}{space 1}   22.26{col 46}{space 3}0.000{col 54}{space 4} .0562285{col 67}{space 3} .0670966
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0018605{col 26}{space 2} .0021813{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-.0061399{col 67}{space 3} .0024188
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0244933{col 26}{space 2}  .003112{col 37}{space 1}    7.87{col 46}{space 3}0.000{col 54}{space 4} .0183881{col 67}{space 3} .0305986
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0071887{col 26}{space 2} .0027173{col 37}{space 1}   -2.65{col 46}{space 3}0.008{col 54}{space 4}-.0125196{col 67}{space 3}-.0018578
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0536795{col 26}{space 2} .0016021{col 37}{space 1}  -33.51{col 46}{space 3}0.000{col 54}{space 4}-.0568225{col 67}{space 3}-.0505366
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0484886{col 26}{space 2} .0028654{col 37}{space 1}  -16.92{col 46}{space 3}0.000{col 54}{space 4}-.0541101{col 67}{space 3}-.0428671
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} -.024968{col 26}{space 2} .0026947{col 37}{space 1}   -9.27{col 46}{space 3}0.000{col 54}{space 4}-.0302547{col 67}{space 3}-.0196814
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0772316{col 26}{space 2} .0018355{col 37}{space 1}   42.08{col 46}{space 3}0.000{col 54}{space 4} .0736306{col 67}{space 3} .0808325
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0643915{col 26}{space 2} .0017215{col 37}{space 1}   37.40{col 46}{space 3}0.000{col 54}{space 4} .0610141{col 67}{space 3} .0677689
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0648705{col 26}{space 2}  .001816{col 37}{space 1}   35.72{col 46}{space 3}0.000{col 54}{space 4} .0613078{col 67}{space 3} .0684333
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0648867{col 26}{space 2} .0021569{col 37}{space 1}   30.08{col 46}{space 3}0.000{col 54}{space 4} .0606552{col 67}{space 3} .0691182
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0145102{col 26}{space 2} .0009092{col 37}{space 1}  -15.96{col 46}{space 3}0.000{col 54}{space 4}-.0162939{col 67}{space 3}-.0127264
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0166554{col 26}{space 2} .0008919{col 37}{space 1}  -18.67{col 46}{space 3}0.000{col 54}{space 4}-.0184051{col 67}{space 3}-.0149057
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0099296{col 26}{space 2} .0009187{col 37}{space 1}  -10.81{col 46}{space 3}0.000{col 54}{space 4} -.011732{col 67}{space 3}-.0081272
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0105589{col 26}{space 2} .0008705{col 37}{space 1}  -12.13{col 46}{space 3}0.000{col 54}{space 4}-.0122667{col 67}{space 3}-.0088511
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0015395{col 26}{space 2} .0003701{col 37}{space 1}   -4.16{col 46}{space 3}0.000{col 54}{space 4}-.0022657{col 67}{space 3}-.0008134
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0001266{col 26}{space 2} .0003343{col 37}{space 1}    0.38{col 46}{space 3}0.705{col 54}{space 4}-.0005292{col 67}{space 3} .0007823
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0018229{col 26}{space 2} .0003255{col 37}{space 1}   -5.60{col 46}{space 3}0.000{col 54}{space 4}-.0024614{col 67}{space 3}-.0011843
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0044405{col 26}{space 2} .0005183{col 37}{space 1}   -8.57{col 46}{space 3}0.000{col 54}{space 4}-.0054573{col 67}{space 3}-.0034236
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0561639{col 26}{space 2} .0016665{col 37}{space 1}   33.70{col 46}{space 3}0.000{col 54}{space 4} .0528945{col 67}{space 3} .0594333
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .060488{col 26}{space 2} .0017119{col 37}{space 1}   35.33{col 46}{space 3}0.000{col 54}{space 4} .0571295{col 67}{space 3} .0638465
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0602871{col 26}{space 2} .0017913{col 37}{space 1}   33.66{col 46}{space 3}0.000{col 54}{space 4} .0567729{col 67}{space 3} .0638014
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .085034{col 26}{space 2} .0021814{col 37}{space 1}   38.98{col 46}{space 3}0.000{col 54}{space 4} .0807545{col 67}{space 3} .0893134
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0085482{col 26}{space 2} .0011087{col 37}{space 1}   -7.71{col 46}{space 3}0.000{col 54}{space 4}-.0107233{col 67}{space 3}-.0063731
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0119169{col 26}{space 2} .0010614{col 37}{space 1}  -11.23{col 46}{space 3}0.000{col 54}{space 4}-.0139993{col 67}{space 3}-.0098345
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0076347{col 26}{space 2} .0011088{col 37}{space 1}   -6.89{col 46}{space 3}0.000{col 54}{space 4}  -.00981{col 67}{space 3}-.0054595
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0011639{col 26}{space 2} .0008564{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-.0005163{col 67}{space 3} .0028441
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0007737{col 26}{space 2} .0004155{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 54}{space 4} -.001589{col 67}{space 3} .0000415
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.000025{col 26}{space 2} .0004389{col 37}{space 1}   -0.06{col 46}{space 3}0.955{col 54}{space 4}-.0008861{col 67}{space 3} .0008361
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.001272{col 26}{space 2} .0004434{col 37}{space 1}   -2.87{col 46}{space 3}0.004{col 54}{space 4} -.002142{col 67}{space 3} -.000402
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0068658{col 26}{space 2} .0005493{col 37}{space 1}  -12.50{col 46}{space 3}0.000{col 54}{space 4}-.0079434{col 67}{space 3}-.0057882
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.823583{col 26}{space 2} .0221427{col 37}{space 1}   82.36{col 46}{space 3}0.000{col 54}{space 4} 1.780143{col 67}{space 3} 1.867023
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}added scalars:
              e(ymean) =  {res}.70308005
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_va_cfr_g11_enr_dk.ster} saved
LHS = enr_2year, RHS = enr_2year DK VA controlling for both subject VAs

Linear regression                               Number of obs     = {res} 1,251,472
                                                {txt}F(37, 1271)       =  {res}  1089.40
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0794
                                                {txt}Root MSE          =    {res} .46449

{txt}{ralign 78:(Std. err. adjusted for {res:1,272} clusters in {res:cdscode})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_~2year_dk {c |}{col 14}{res}{space 2} .0985795{col 26}{space 2} .0006367{col 37}{space 1}  154.82{col 46}{space 3}0.000{col 54}{space 4} .0973304{col 67}{space 3} .0998287
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}  -.00674{col 26}{space 2} .0033075{col 37}{space 1}   -2.04{col 46}{space 3}0.042{col 54}{space 4}-.0132287{col 67}{space 3}-.0002512
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0334309{col 26}{space 2} .0023539{col 37}{space 1}  -14.20{col 46}{space 3}0.000{col 54}{space 4}-.0380489{col 67}{space 3}-.0288129
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0126343{col 26}{space 2}  .003409{col 37}{space 1}   -3.71{col 46}{space 3}0.000{col 54}{space 4}-.0193222{col 67}{space 3}-.0059463
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000923{col 26}{space 2} 3.51e-06{col 37}{space 1}  -26.30{col 46}{space 3}0.000{col 54}{space 4}-.0000992{col 67}{space 3}-.0000854
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0117834{col 26}{space 2} .0014427{col 37}{space 1}    8.17{col 46}{space 3}0.000{col 54}{space 4}  .008953{col 67}{space 3} .0146137
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0246977{col 26}{space 2} .0024466{col 37}{space 1}  -10.09{col 46}{space 3}0.000{col 54}{space 4}-.0294974{col 67}{space 3} -.019898
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} .0142732{col 26}{space 2} .0018017{col 37}{space 1}    7.92{col 46}{space 3}0.000{col 54}{space 4} .0107385{col 67}{space 3} .0178079
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0116797{col 26}{space 2} .0028168{col 37}{space 1}   -4.15{col 46}{space 3}0.000{col 54}{space 4}-.0172058{col 67}{space 3}-.0061536
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} -.002514{col 26}{space 2} .0027603{col 37}{space 1}   -0.91{col 46}{space 3}0.363{col 54}{space 4}-.0079292{col 67}{space 3} .0029012
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2} -.015353{col 26}{space 2} .0013442{col 37}{space 1}  -11.42{col 46}{space 3}0.000{col 54}{space 4}  -.01799{col 67}{space 3} -.012716
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0298464{col 26}{space 2} .0029523{col 37}{space 1}  -10.11{col 46}{space 3}0.000{col 54}{space 4}-.0356384{col 67}{space 3}-.0240544
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0256946{col 26}{space 2} .0031037{col 37}{space 1}    8.28{col 46}{space 3}0.000{col 54}{space 4} .0196057{col 67}{space 3} .0317836
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0608492{col 26}{space 2} .0021032{col 37}{space 1}  -28.93{col 46}{space 3}0.000{col 54}{space 4}-.0649752{col 67}{space 3}-.0567231
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0555405{col 26}{space 2} .0018915{col 37}{space 1}  -29.36{col 46}{space 3}0.000{col 54}{space 4}-.0592514{col 67}{space 3}-.0518296
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0542405{col 26}{space 2} .0019661{col 37}{space 1}  -27.59{col 46}{space 3}0.000{col 54}{space 4}-.0580976{col 67}{space 3}-.0503834
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0264518{col 26}{space 2} .0022367{col 37}{space 1}  -11.83{col 46}{space 3}0.000{col 54}{space 4}-.0308398{col 67}{space 3}-.0220637
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.037405{col 26}{space 2} .0010066{col 37}{space 1}  -37.16{col 46}{space 3}0.000{col 54}{space 4}-.0393798{col 67}{space 3}-.0354301
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.032204{col 26}{space 2} .0009811{col 37}{space 1}  -32.82{col 46}{space 3}0.000{col 54}{space 4}-.0341288{col 67}{space 3}-.0302793
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.027335{col 26}{space 2} .0009638{col 37}{space 1}  -28.36{col 46}{space 3}0.000{col 54}{space 4}-.0292259{col 67}{space 3}-.0254442
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0291272{col 26}{space 2} .0009637{col 37}{space 1}  -30.23{col 46}{space 3}0.000{col 54}{space 4}-.0310177{col 67}{space 3}-.0272366
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0096581{col 26}{space 2} .0004281{col 37}{space 1}   22.56{col 46}{space 3}0.000{col 54}{space 4} .0088183{col 67}{space 3}  .010498
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0086252{col 26}{space 2} .0003543{col 37}{space 1}   24.34{col 46}{space 3}0.000{col 54}{space 4} .0079301{col 67}{space 3} .0093202
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0074918{col 26}{space 2} .0003523{col 37}{space 1}   21.27{col 46}{space 3}0.000{col 54}{space 4} .0068006{col 67}{space 3} .0081829
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0025487{col 26}{space 2} .0005661{col 37}{space 1}    4.50{col 46}{space 3}0.000{col 54}{space 4}  .001438{col 67}{space 3} .0036594
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0633381{col 26}{space 2} .0020217{col 37}{space 1}  -31.33{col 46}{space 3}0.000{col 54}{space 4}-.0673043{col 67}{space 3} -.059372
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0619139{col 26}{space 2} .0021319{col 37}{space 1}  -29.04{col 46}{space 3}0.000{col 54}{space 4}-.0660963{col 67}{space 3}-.0577316
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0610109{col 26}{space 2} .0021494{col 37}{space 1}  -28.38{col 46}{space 3}0.000{col 54}{space 4}-.0652278{col 67}{space 3}-.0567941
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0519306{col 26}{space 2} .0025086{col 37}{space 1}  -20.70{col 46}{space 3}0.000{col 54}{space 4} -.056852{col 67}{space 3}-.0470092
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0274791{col 26}{space 2} .0012129{col 37}{space 1}  -22.66{col 46}{space 3}0.000{col 54}{space 4}-.0298586{col 67}{space 3}-.0250996
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0299099{col 26}{space 2} .0011872{col 37}{space 1}  -25.19{col 46}{space 3}0.000{col 54}{space 4} -.032239{col 67}{space 3}-.0275808
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0232279{col 26}{space 2}  .001197{col 37}{space 1}  -19.41{col 46}{space 3}0.000{col 54}{space 4}-.0255762{col 67}{space 3}-.0208796
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0306827{col 26}{space 2} .0009743{col 37}{space 1}  -31.49{col 46}{space 3}0.000{col 54}{space 4}-.0325941{col 67}{space 3}-.0287712
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0092075{col 26}{space 2} .0004704{col 37}{space 1}   19.57{col 46}{space 3}0.000{col 54}{space 4} .0082847{col 67}{space 3} .0101303
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0098022{col 26}{space 2} .0005097{col 37}{space 1}   19.23{col 46}{space 3}0.000{col 54}{space 4} .0088021{col 67}{space 3} .0108022
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0076779{col 26}{space 2}  .000491{col 37}{space 1}   15.64{col 46}{space 3}0.000{col 54}{space 4} .0067147{col 67}{space 3} .0086411
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0016433{col 26}{space 2} .0006563{col 37}{space 1}    2.50{col 46}{space 3}0.012{col 54}{space 4} .0003558{col 67}{space 3} .0029307
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .9924388{col 26}{space 2} .0216677{col 37}{space 1}   45.80{col 46}{space 3}0.000{col 54}{space 4} .9499304{col 67}{space 3} 1.034947
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}added scalars:
              e(ymean) =  {res}.37492329
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_2year_va_cfr_g11_enr_2year_dk.ster} saved
LHS = enr_4year, RHS = enr_4year DK VA controlling for both subject VAs

Linear regression                               Number of obs     = {res} 1,251,472
                                                {txt}F(37, 1271)       =  {res}  3309.46
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2562
                                                {txt}Root MSE          =    {res} .40496

{txt}{ralign 78:(Std. err. adjusted for {res:1,272} clusters in {res:cdscode})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_~4year_dk {c |}{col 14}{res}{space 2}  .089617{col 26}{space 2} .0012492{col 37}{space 1}   71.74{col 46}{space 3}0.000{col 54}{space 4} .0871664{col 67}{space 3} .0920677
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0175627{col 26}{space 2} .0020064{col 37}{space 1}    8.75{col 46}{space 3}0.000{col 54}{space 4} .0136265{col 67}{space 3} .0214989
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0140809{col 26}{space 2} .0024732{col 37}{space 1}    5.69{col 46}{space 3}0.000{col 54}{space 4} .0092289{col 67}{space 3}  .018933
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0203368{col 26}{space 2} .0027479{col 37}{space 1}   -7.40{col 46}{space 3}0.000{col 54}{space 4}-.0257277{col 67}{space 3}-.0149458
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000808{col 26}{space 2} 2.72e-06{col 37}{space 1}  -29.70{col 46}{space 3}0.000{col 54}{space 4}-.0000862{col 67}{space 3}-.0000755
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0874716{col 26}{space 2} .0011271{col 37}{space 1}  -77.61{col 46}{space 3}0.000{col 54}{space 4}-.0896829{col 67}{space 3}-.0852604
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0866824{col 26}{space 2} .0033145{col 37}{space 1}   26.15{col 46}{space 3}0.000{col 54}{space 4} .0801799{col 67}{space 3} .0931849
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0169686{col 26}{space 2} .0021777{col 37}{space 1}   -7.79{col 46}{space 3}0.000{col 54}{space 4}-.0212409{col 67}{space 3}-.0126962
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0351737{col 26}{space 2} .0035163{col 37}{space 1}   10.00{col 46}{space 3}0.000{col 54}{space 4} .0282753{col 67}{space 3} .0420721
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} -.004367{col 26}{space 2} .0027483{col 37}{space 1}   -1.59{col 46}{space 3}0.112{col 54}{space 4}-.0097587{col 67}{space 3} .0010248
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0385784{col 26}{space 2}   .00177{col 37}{space 1}  -21.80{col 46}{space 3}0.000{col 54}{space 4}-.0420508{col 67}{space 3}-.0351061
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0185772{col 26}{space 2} .0018444{col 37}{space 1}  -10.07{col 46}{space 3}0.000{col 54}{space 4}-.0221957{col 67}{space 3}-.0149588
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0502858{col 26}{space 2} .0021853{col 37}{space 1}  -23.01{col 46}{space 3}0.000{col 54}{space 4} -.054573{col 67}{space 3}-.0459986
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1365807{col 26}{space 2} .0017813{col 37}{space 1}   76.67{col 46}{space 3}0.000{col 54}{space 4}  .133086{col 67}{space 3} .1400754
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1225201{col 26}{space 2} .0017295{col 37}{space 1}   70.84{col 46}{space 3}0.000{col 54}{space 4} .1191271{col 67}{space 3} .1259132
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1170197{col 26}{space 2} .0018249{col 37}{space 1}   64.12{col 46}{space 3}0.000{col 54}{space 4} .1134395{col 67}{space 3} .1205998
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0911892{col 26}{space 2} .0019317{col 37}{space 1}   47.21{col 46}{space 3}0.000{col 54}{space 4} .0873994{col 67}{space 3} .0949789
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0226133{col 26}{space 2} .0007798{col 37}{space 1}   29.00{col 46}{space 3}0.000{col 54}{space 4} .0210835{col 67}{space 3} .0241431
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0160017{col 26}{space 2} .0007584{col 37}{space 1}   21.10{col 46}{space 3}0.000{col 54}{space 4} .0145138{col 67}{space 3} .0174896
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0172072{col 26}{space 2} .0007236{col 37}{space 1}   23.78{col 46}{space 3}0.000{col 54}{space 4} .0157876{col 67}{space 3} .0186267
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0183539{col 26}{space 2} .0007925{col 37}{space 1}   23.16{col 46}{space 3}0.000{col 54}{space 4} .0167991{col 67}{space 3} .0199087
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0111208{col 26}{space 2} .0003404{col 37}{space 1}  -32.67{col 46}{space 3}0.000{col 54}{space 4}-.0117886{col 67}{space 3} -.010453
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0086733{col 26}{space 2} .0002956{col 37}{space 1}  -29.34{col 46}{space 3}0.000{col 54}{space 4}-.0092532{col 67}{space 3}-.0080934
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0091763{col 26}{space 2} .0003118{col 37}{space 1}  -29.43{col 46}{space 3}0.000{col 54}{space 4} -.009788{col 67}{space 3}-.0085646
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0069498{col 26}{space 2} .0004761{col 37}{space 1}  -14.60{col 46}{space 3}0.000{col 54}{space 4}-.0078838{col 67}{space 3}-.0060159
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .119284{col 26}{space 2} .0018511{col 37}{space 1}   64.44{col 46}{space 3}0.000{col 54}{space 4} .1156525{col 67}{space 3} .1229154
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1223176{col 26}{space 2} .0019681{col 37}{space 1}   62.15{col 46}{space 3}0.000{col 54}{space 4} .1184564{col 67}{space 3} .1261787
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1211428{col 26}{space 2} .0019802{col 37}{space 1}   61.18{col 46}{space 3}0.000{col 54}{space 4}  .117258{col 67}{space 3} .1250276
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1381809{col 26}{space 2}  .002178{col 37}{space 1}   63.44{col 46}{space 3}0.000{col 54}{space 4}  .133908{col 67}{space 3} .1424538
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0187874{col 26}{space 2} .0009073{col 37}{space 1}   20.71{col 46}{space 3}0.000{col 54}{space 4} .0170076{col 67}{space 3} .0205673
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0180823{col 26}{space 2} .0008475{col 37}{space 1}   21.34{col 46}{space 3}0.000{col 54}{space 4} .0164197{col 67}{space 3} .0197449
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .015487{col 26}{space 2} .0008519{col 37}{space 1}   18.18{col 46}{space 3}0.000{col 54}{space 4} .0138158{col 67}{space 3} .0171582
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0322155{col 26}{space 2} .0007723{col 37}{space 1}   41.72{col 46}{space 3}0.000{col 54}{space 4} .0307004{col 67}{space 3} .0337305
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0099604{col 26}{space 2} .0004092{col 37}{space 1}  -24.34{col 46}{space 3}0.000{col 54}{space 4}-.0107632{col 67}{space 3}-.0091576
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0097663{col 26}{space 2} .0004338{col 37}{space 1}  -22.51{col 46}{space 3}0.000{col 54}{space 4}-.0106174{col 67}{space 3}-.0089152
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0089265{col 26}{space 2} .0004315{col 37}{space 1}  -20.69{col 46}{space 3}0.000{col 54}{space 4} -.009773{col 67}{space 3}-.0080801
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  -.00854{col 26}{space 2} .0005547{col 37}{space 1}  -15.40{col 46}{space 3}0.000{col 54}{space 4}-.0096281{col 67}{space 3}-.0074518
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .8269424{col 26}{space 2} .0162853{col 37}{space 1}   50.78{col 46}{space 3}0.000{col 54}{space 4} .7949933{col 67}{space 3} .8588914
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}added scalars:
              e(ymean) =  {res}.32815676
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_4year_va_cfr_g11_enr_4year_dk.ster} saved

{com}. 
. 
. ********** regress enrollment outcomes on dk va interacted with prior score deciles
. /* no tfx, no peer effects, matching outcome on LHS and RHS */
. 
. //create prior score quantiles
. xtile prior_ela_z_score_xtile = prior_ela_z_score, n(10)
{txt}
{com}. xtile prior_math_z_score_xtile = prior_math_z_score, n(10)
{txt}
{com}. 
. 
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   di "LHS = `outcome', RHS VA = `outcome' DK VA controlling for both subject VAs"
{txt}  3{com}. 
.   foreach prior_subject in ela math {c -(}
{txt}  4{com}.     di "interaction with prior `prior_subject' score deciles "
{txt}  5{com}. 
.     reg `outcome' c.va_cfr_g11_`outcome'_dk#i.prior_`prior_subject'_z_score_xtile ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       if touse_g11_`outcome'==1 ///
>       , cluster(cdscode)
{txt}  6{com}.     estadd ysumm, mean
{txt}  7{com}.     estimates save $vaprojdir/estimates/sbac/reg_`outcome'_va_cfr_g11_`outcome'_dk_hetero_prior_`prior_subject'.ster, replace
{txt}  8{com}.   {c )-}
{txt}  9{com}. {c )-}
LHS = enr, RHS VA = enr DK VA controlling for both subject VAs
interaction with prior ela score deciles 

{txt}Linear regression                               Number of obs     = {res} 1,251,472
                                                {txt}F(46, 1271)       =  {res}  1650.16
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1344
                                                {txt}Root MSE          =    {res} .42509

{txt}{ralign 78:(Std. err. adjusted for {res:1,272} clusters in {res:cdscode})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         enr{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prior_ela~le#{c |}
{space 10}c. {c |}
va_cfr~nr_dk {c |}
{space 9} 1  {c |}{col 14}{res}{space 2} .0927967{col 26}{space 2} .0018651{col 37}{space 1}   49.75{col 46}{space 3}0.000{col 54}{space 4} .0891376{col 67}{space 3} .0964558
{txt}{space 9} 2  {c |}{col 14}{res}{space 2} .0977704{col 26}{space 2} .0019311{col 37}{space 1}   50.63{col 46}{space 3}0.000{col 54}{space 4}  .093982{col 67}{space 3} .1015588
{txt}{space 9} 3  {c |}{col 14}{res}{space 2} .0956133{col 26}{space 2}  .002048{col 37}{space 1}   46.69{col 46}{space 3}0.000{col 54}{space 4} .0915956{col 67}{space 3} .0996311
{txt}{space 9} 4  {c |}{col 14}{res}{space 2} .0892497{col 26}{space 2} .0023856{col 37}{space 1}   37.41{col 46}{space 3}0.000{col 54}{space 4} .0845695{col 67}{space 3}   .09393
{txt}{space 9} 5  {c |}{col 14}{res}{space 2} .0866192{col 26}{space 2}  .002352{col 37}{space 1}   36.83{col 46}{space 3}0.000{col 54}{space 4}  .082005{col 67}{space 3} .0912334
{txt}{space 9} 6  {c |}{col 14}{res}{space 2} .0816843{col 26}{space 2} .0023618{col 37}{space 1}   34.59{col 46}{space 3}0.000{col 54}{space 4} .0770508{col 67}{space 3} .0863178
{txt}{space 9} 7  {c |}{col 14}{res}{space 2}  .076798{col 26}{space 2} .0022412{col 37}{space 1}   34.27{col 46}{space 3}0.000{col 54}{space 4}  .072401{col 67}{space 3} .0811949
{txt}{space 9} 8  {c |}{col 14}{res}{space 2} .0697356{col 26}{space 2} .0020235{col 37}{space 1}   34.46{col 46}{space 3}0.000{col 54}{space 4} .0657658{col 67}{space 3} .0737054
{txt}{space 9} 9  {c |}{col 14}{res}{space 2} .0559681{col 26}{space 2} .0020449{col 37}{space 1}   27.37{col 46}{space 3}0.000{col 54}{space 4} .0519564{col 67}{space 3} .0599798
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0370953{col 26}{space 2} .0018198{col 37}{space 1}   20.38{col 46}{space 3}0.000{col 54}{space 4} .0335251{col 67}{space 3} .0406656
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0120057{col 26}{space 2} .0028544{col 37}{space 1}    4.21{col 46}{space 3}0.000{col 54}{space 4} .0064058{col 67}{space 3} .0176057
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0182053{col 26}{space 2} .0024462{col 37}{space 1}   -7.44{col 46}{space 3}0.000{col 54}{space 4}-.0230043{col 67}{space 3}-.0134062
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0316154{col 26}{space 2} .0031135{col 37}{space 1}  -10.15{col 46}{space 3}0.000{col 54}{space 4}-.0377235{col 67}{space 3}-.0255072
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2} -.000172{col 26}{space 2} 3.68e-06{col 37}{space 1}  -46.72{col 46}{space 3}0.000{col 54}{space 4}-.0001792{col 67}{space 3}-.0001648
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0758475{col 26}{space 2} .0013821{col 37}{space 1}  -54.88{col 46}{space 3}0.000{col 54}{space 4}-.0785589{col 67}{space 3} -.073136
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0616155{col 26}{space 2} .0027041{col 37}{space 1}   22.79{col 46}{space 3}0.000{col 54}{space 4} .0563104{col 67}{space 3} .0669205
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0023897{col 26}{space 2} .0021911{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-.0066884{col 67}{space 3} .0019089
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0240973{col 26}{space 2} .0031027{col 37}{space 1}    7.77{col 46}{space 3}0.000{col 54}{space 4} .0180103{col 67}{space 3} .0301844
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0071194{col 26}{space 2} .0027115{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.0124389{col 67}{space 3}-.0017999
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0541415{col 26}{space 2} .0015906{col 37}{space 1}  -34.04{col 46}{space 3}0.000{col 54}{space 4}-.0572621{col 67}{space 3} -.051021
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0498471{col 26}{space 2} .0027739{col 37}{space 1}  -17.97{col 46}{space 3}0.000{col 54}{space 4}-.0552889{col 67}{space 3}-.0444052
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0261725{col 26}{space 2} .0026956{col 37}{space 1}   -9.71{col 46}{space 3}0.000{col 54}{space 4}-.0314608{col 67}{space 3}-.0208842
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0812439{col 26}{space 2} .0018246{col 37}{space 1}   44.53{col 46}{space 3}0.000{col 54}{space 4} .0776643{col 67}{space 3} .0848235
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0688078{col 26}{space 2} .0016952{col 37}{space 1}   40.59{col 46}{space 3}0.000{col 54}{space 4} .0654821{col 67}{space 3} .0721335
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0694179{col 26}{space 2} .0017954{col 37}{space 1}   38.66{col 46}{space 3}0.000{col 54}{space 4} .0658956{col 67}{space 3} .0729401
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0682834{col 26}{space 2} .0021436{col 37}{space 1}   31.85{col 46}{space 3}0.000{col 54}{space 4}  .064078{col 67}{space 3} .0724889
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.012277{col 26}{space 2} .0009025{col 37}{space 1}  -13.60{col 46}{space 3}0.000{col 54}{space 4}-.0140475{col 67}{space 3}-.0105064
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0141516{col 26}{space 2} .0008864{col 37}{space 1}  -15.97{col 46}{space 3}0.000{col 54}{space 4}-.0158906{col 67}{space 3}-.0124126
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0080663{col 26}{space 2} .0009114{col 37}{space 1}   -8.85{col 46}{space 3}0.000{col 54}{space 4}-.0098542{col 67}{space 3}-.0062783
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0081973{col 26}{space 2} .0008665{col 37}{space 1}   -9.46{col 46}{space 3}0.000{col 54}{space 4}-.0098972{col 67}{space 3}-.0064974
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0019921{col 26}{space 2} .0003586{col 37}{space 1}   -5.55{col 46}{space 3}0.000{col 54}{space 4}-.0026957{col 67}{space 3}-.0012885
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0004063{col 26}{space 2} .0003246{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-.0010432{col 67}{space 3} .0002306
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0023088{col 26}{space 2} .0003223{col 37}{space 1}   -7.16{col 46}{space 3}0.000{col 54}{space 4}-.0029412{col 67}{space 3}-.0016765
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0042393{col 26}{space 2} .0005189{col 37}{space 1}   -8.17{col 46}{space 3}0.000{col 54}{space 4}-.0052573{col 67}{space 3}-.0032213
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0560317{col 26}{space 2} .0016639{col 37}{space 1}   33.67{col 46}{space 3}0.000{col 54}{space 4} .0527673{col 67}{space 3} .0592961
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0603427{col 26}{space 2} .0017129{col 37}{space 1}   35.23{col 46}{space 3}0.000{col 54}{space 4} .0569823{col 67}{space 3} .0637031
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0603014{col 26}{space 2} .0017913{col 37}{space 1}   33.66{col 46}{space 3}0.000{col 54}{space 4} .0567872{col 67}{space 3} .0638156
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0850883{col 26}{space 2} .0021647{col 37}{space 1}   39.31{col 46}{space 3}0.000{col 54}{space 4} .0808415{col 67}{space 3} .0893352
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0078606{col 26}{space 2} .0011075{col 37}{space 1}   -7.10{col 46}{space 3}0.000{col 54}{space 4}-.0100334{col 67}{space 3}-.0056877
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  -.01115{col 26}{space 2} .0010598{col 37}{space 1}  -10.52{col 46}{space 3}0.000{col 54}{space 4}-.0132291{col 67}{space 3}-.0090709
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0070078{col 26}{space 2} .0011012{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-.0091681{col 67}{space 3}-.0048475
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .001758{col 26}{space 2} .0008428{col 37}{space 1}    2.09{col 46}{space 3}0.037{col 54}{space 4} .0001046{col 67}{space 3} .0034113
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0009434{col 26}{space 2} .0004156{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.0017587{col 67}{space 3} -.000128
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0001561{col 26}{space 2} .0004361{col 37}{space 1}   -0.36{col 46}{space 3}0.720{col 54}{space 4}-.0010117{col 67}{space 3} .0006995
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0014255{col 26}{space 2} .0004423{col 37}{space 1}   -3.22{col 46}{space 3}0.001{col 54}{space 4}-.0022932{col 67}{space 3}-.0005579
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0068205{col 26}{space 2} .0005413{col 37}{space 1}  -12.60{col 46}{space 3}0.000{col 54}{space 4}-.0078823{col 67}{space 3}-.0057586
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.811939{col 26}{space 2}   .02193{col 37}{space 1}   82.62{col 46}{space 3}0.000{col 54}{space 4} 1.768916{col 67}{space 3} 1.854962
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}added scalars:
              e(ymean) =  {res}.70308005
{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_va_cfr_g11_enr_dk_hetero_prior_ela.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_va_cfr_g11_enr_dk_hetero_prior_ela.ster} saved
interaction with prior math score deciles 

Linear regression                               Number of obs     = {res} 1,251,472
                                                {txt}F(46, 1271)       =  {res}  1683.18
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1344
                                                {txt}Root MSE          =    {res} .42509

{txt}{ralign 78:(Std. err. adjusted for {res:1,272} clusters in {res:cdscode})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         enr{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prior_mat~le#{c |}
{space 10}c. {c |}
va_cfr~nr_dk {c |}
{space 9} 1  {c |}{col 14}{res}{space 2}  .091298{col 26}{space 2} .0017424{col 37}{space 1}   52.40{col 46}{space 3}0.000{col 54}{space 4} .0878796{col 67}{space 3} .0947164
{txt}{space 9} 2  {c |}{col 14}{res}{space 2} .0969613{col 26}{space 2} .0019237{col 37}{space 1}   50.40{col 46}{space 3}0.000{col 54}{space 4} .0931872{col 67}{space 3} .1007353
{txt}{space 9} 3  {c |}{col 14}{res}{space 2} .0965219{col 26}{space 2} .0020314{col 37}{space 1}   47.52{col 46}{space 3}0.000{col 54}{space 4} .0925368{col 67}{space 3} .1005071
{txt}{space 9} 4  {c |}{col 14}{res}{space 2} .0917386{col 26}{space 2}  .002246{col 37}{space 1}   40.84{col 46}{space 3}0.000{col 54}{space 4} .0873323{col 67}{space 3}  .096145
{txt}{space 9} 5  {c |}{col 14}{res}{space 2} .0859696{col 26}{space 2}  .002208{col 37}{space 1}   38.94{col 46}{space 3}0.000{col 54}{space 4} .0816379{col 67}{space 3} .0903013
{txt}{space 9} 6  {c |}{col 14}{res}{space 2}  .083932{col 26}{space 2} .0023043{col 37}{space 1}   36.42{col 46}{space 3}0.000{col 54}{space 4} .0794112{col 67}{space 3} .0884527
{txt}{space 9} 7  {c |}{col 14}{res}{space 2} .0757789{col 26}{space 2} .0022212{col 37}{space 1}   34.12{col 46}{space 3}0.000{col 54}{space 4} .0714212{col 67}{space 3} .0801365
{txt}{space 9} 8  {c |}{col 14}{res}{space 2} .0702061{col 26}{space 2} .0021141{col 37}{space 1}   33.21{col 46}{space 3}0.000{col 54}{space 4} .0660586{col 67}{space 3} .0743536
{txt}{space 9} 9  {c |}{col 14}{res}{space 2} .0574874{col 26}{space 2} .0019269{col 37}{space 1}   29.83{col 46}{space 3}0.000{col 54}{space 4} .0537071{col 67}{space 3} .0612677
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0374684{col 26}{space 2} .0018162{col 37}{space 1}   20.63{col 46}{space 3}0.000{col 54}{space 4} .0339053{col 67}{space 3} .0410315
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0120641{col 26}{space 2} .0028501{col 37}{space 1}    4.23{col 46}{space 3}0.000{col 54}{space 4} .0064726{col 67}{space 3} .0176556
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0181975{col 26}{space 2} .0024444{col 37}{space 1}   -7.44{col 46}{space 3}0.000{col 54}{space 4} -.022993{col 67}{space 3}-.0134021
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.031326{col 26}{space 2} .0031149{col 37}{space 1}  -10.06{col 46}{space 3}0.000{col 54}{space 4}-.0374368{col 67}{space 3}-.0252151
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001717{col 26}{space 2} 3.68e-06{col 37}{space 1}  -46.67{col 46}{space 3}0.000{col 54}{space 4} -.000179{col 67}{space 3}-.0001645
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0758036{col 26}{space 2}  .001384{col 37}{space 1}  -54.77{col 46}{space 3}0.000{col 54}{space 4}-.0785188{col 67}{space 3}-.0730884
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}  .061937{col 26}{space 2} .0026974{col 37}{space 1}   22.96{col 46}{space 3}0.000{col 54}{space 4} .0566452{col 67}{space 3} .0672289
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0025693{col 26}{space 2} .0021871{col 37}{space 1}   -1.17{col 46}{space 3}0.240{col 54}{space 4}  -.00686{col 67}{space 3} .0017213
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0241822{col 26}{space 2} .0031035{col 37}{space 1}    7.79{col 46}{space 3}0.000{col 54}{space 4} .0180937{col 67}{space 3} .0302708
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0070584{col 26}{space 2} .0027115{col 37}{space 1}   -2.60{col 46}{space 3}0.009{col 54}{space 4}-.0123779{col 67}{space 3}-.0017389
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0539285{col 26}{space 2} .0015847{col 37}{space 1}  -34.03{col 46}{space 3}0.000{col 54}{space 4}-.0570375{col 67}{space 3}-.0508195
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0496815{col 26}{space 2} .0027842{col 37}{space 1}  -17.84{col 46}{space 3}0.000{col 54}{space 4}-.0551436{col 67}{space 3}-.0442194
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0261802{col 26}{space 2} .0026938{col 37}{space 1}   -9.72{col 46}{space 3}0.000{col 54}{space 4}-.0314649{col 67}{space 3}-.0208954
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0768864{col 26}{space 2} .0018336{col 37}{space 1}   41.93{col 46}{space 3}0.000{col 54}{space 4} .0732891{col 67}{space 3} .0804836
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0643212{col 26}{space 2} .0017158{col 37}{space 1}   37.49{col 46}{space 3}0.000{col 54}{space 4} .0609551{col 67}{space 3} .0676873
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0646288{col 26}{space 2} .0018072{col 37}{space 1}   35.76{col 46}{space 3}0.000{col 54}{space 4} .0610834{col 67}{space 3} .0681742
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0644574{col 26}{space 2} .0021557{col 37}{space 1}   29.90{col 46}{space 3}0.000{col 54}{space 4} .0602283{col 67}{space 3} .0686866
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.013884{col 26}{space 2}  .000912{col 37}{space 1}  -15.22{col 46}{space 3}0.000{col 54}{space 4}-.0156731{col 67}{space 3}-.0120949
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0159032{col 26}{space 2} .0008902{col 37}{space 1}  -17.87{col 46}{space 3}0.000{col 54}{space 4}-.0176496{col 67}{space 3}-.0141568
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0096307{col 26}{space 2} .0009143{col 37}{space 1}  -10.53{col 46}{space 3}0.000{col 54}{space 4}-.0114243{col 67}{space 3}-.0078371
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0101395{col 26}{space 2} .0008667{col 37}{space 1}  -11.70{col 46}{space 3}0.000{col 54}{space 4}-.0118397{col 67}{space 3}-.0084393
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0015698{col 26}{space 2} .0003664{col 37}{space 1}   -4.28{col 46}{space 3}0.000{col 54}{space 4}-.0022886{col 67}{space 3}-.0008509
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0000361{col 26}{space 2} .0003311{col 37}{space 1}    0.11{col 46}{space 3}0.913{col 54}{space 4}-.0006135{col 67}{space 3} .0006857
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0018328{col 26}{space 2} .0003237{col 37}{space 1}   -5.66{col 46}{space 3}0.000{col 54}{space 4}-.0024678{col 67}{space 3}-.0011977
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0043485{col 26}{space 2} .0005167{col 37}{space 1}   -8.42{col 46}{space 3}0.000{col 54}{space 4}-.0053621{col 67}{space 3}-.0033348
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0602074{col 26}{space 2} .0016495{col 37}{space 1}   36.50{col 46}{space 3}0.000{col 54}{space 4} .0569714{col 67}{space 3} .0634434
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0645985{col 26}{space 2} .0016918{col 37}{space 1}   38.18{col 46}{space 3}0.000{col 54}{space 4} .0612794{col 67}{space 3} .0679176
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0650206{col 26}{space 2} .0017942{col 37}{space 1}   36.24{col 46}{space 3}0.000{col 54}{space 4} .0615006{col 67}{space 3} .0685405
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0892586{col 26}{space 2} .0021552{col 37}{space 1}   41.42{col 46}{space 3}0.000{col 54}{space 4} .0850305{col 67}{space 3} .0934867
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0062788{col 26}{space 2} .0011133{col 37}{space 1}   -5.64{col 46}{space 3}0.000{col 54}{space 4} -.008463{col 67}{space 3}-.0040947
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0094916{col 26}{space 2} .0010672{col 37}{space 1}   -8.89{col 46}{space 3}0.000{col 54}{space 4}-.0115852{col 67}{space 3}-.0073979
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0053258{col 26}{space 2} .0010996{col 37}{space 1}   -4.84{col 46}{space 3}0.000{col 54}{space 4} -.007483{col 67}{space 3}-.0031686
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0035185{col 26}{space 2}   .00085{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .0018509{col 67}{space 3} .0051861
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0014582{col 26}{space 2} .0004159{col 37}{space 1}   -3.51{col 46}{space 3}0.000{col 54}{space 4}-.0022742{col 67}{space 3}-.0006422
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0006536{col 26}{space 2} .0004352{col 37}{space 1}   -1.50{col 46}{space 3}0.133{col 54}{space 4}-.0015075{col 67}{space 3} .0002002
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0020001{col 26}{space 2}  .000442{col 37}{space 1}   -4.53{col 46}{space 3}0.000{col 54}{space 4}-.0028672{col 67}{space 3} -.001133
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0068853{col 26}{space 2} .0005469{col 37}{space 1}  -12.59{col 46}{space 3}0.000{col 54}{space 4}-.0079582{col 67}{space 3}-.0058124
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.810319{col 26}{space 2} .0219345{col 37}{space 1}   82.53{col 46}{space 3}0.000{col 54}{space 4} 1.767288{col 67}{space 3} 1.853351
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}added scalars:
              e(ymean) =  {res}.70308005
{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_va_cfr_g11_enr_dk_hetero_prior_math.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_va_cfr_g11_enr_dk_hetero_prior_math.ster} saved
LHS = enr_2year, RHS VA = enr_2year DK VA controlling for both subject VAs
interaction with prior ela score deciles 

Linear regression                               Number of obs     = {res} 1,251,472
                                                {txt}F(46, 1271)       =  {res}  1256.76
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0802
                                                {txt}Root MSE          =    {res}  .4643

{txt}{ralign 78:(Std. err. adjusted for {res:1,272} clusters in {res:cdscode})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prior_ela~le#{c |}
{space 10}c. {c |}
va_~2year_dk {c |}
{space 9} 1  {c |}{col 14}{res}{space 2}  .088514{col 26}{space 2} .0024767{col 37}{space 1}   35.74{col 46}{space 3}0.000{col 54}{space 4} .0836551{col 67}{space 3} .0933729
{txt}{space 9} 2  {c |}{col 14}{res}{space 2} .1014779{col 26}{space 2} .0019489{col 37}{space 1}   52.07{col 46}{space 3}0.000{col 54}{space 4} .0976545{col 67}{space 3} .1053014
{txt}{space 9} 3  {c |}{col 14}{res}{space 2}  .109693{col 26}{space 2} .0015845{col 37}{space 1}   69.23{col 46}{space 3}0.000{col 54}{space 4} .1065843{col 67}{space 3} .1128016
{txt}{space 9} 4  {c |}{col 14}{res}{space 2} .1102064{col 26}{space 2} .0017279{col 37}{space 1}   63.78{col 46}{space 3}0.000{col 54}{space 4} .1068167{col 67}{space 3} .1135962
{txt}{space 9} 5  {c |}{col 14}{res}{space 2} .1125228{col 26}{space 2} .0017958{col 37}{space 1}   62.66{col 46}{space 3}0.000{col 54}{space 4} .1089996{col 67}{space 3} .1160459
{txt}{space 9} 6  {c |}{col 14}{res}{space 2} .1077012{col 26}{space 2} .0015355{col 37}{space 1}   70.14{col 46}{space 3}0.000{col 54}{space 4} .1046889{col 67}{space 3} .1107135
{txt}{space 9} 7  {c |}{col 14}{res}{space 2} .1066202{col 26}{space 2} .0018682{col 37}{space 1}   57.07{col 46}{space 3}0.000{col 54}{space 4} .1029551{col 67}{space 3} .1102852
{txt}{space 9} 8  {c |}{col 14}{res}{space 2} .0955105{col 26}{space 2} .0018358{col 37}{space 1}   52.03{col 46}{space 3}0.000{col 54}{space 4}  .091909{col 67}{space 3} .0991119
{txt}{space 9} 9  {c |}{col 14}{res}{space 2} .0851098{col 26}{space 2} .0020718{col 37}{space 1}   41.08{col 46}{space 3}0.000{col 54}{space 4} .0810452{col 67}{space 3} .0891743
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0612354{col 26}{space 2} .0018848{col 37}{space 1}   32.49{col 46}{space 3}0.000{col 54}{space 4} .0575377{col 67}{space 3} .0649331
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0067378{col 26}{space 2} .0034181{col 37}{space 1}   -1.97{col 46}{space 3}0.049{col 54}{space 4}-.0134435{col 67}{space 3}-.0000321
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0337133{col 26}{space 2} .0023336{col 37}{space 1}  -14.45{col 46}{space 3}0.000{col 54}{space 4}-.0382915{col 67}{space 3}-.0291351
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0128451{col 26}{space 2} .0034976{col 37}{space 1}   -3.67{col 46}{space 3}0.000{col 54}{space 4}-.0197068{col 67}{space 3}-.0059834
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000922{col 26}{space 2} 3.48e-06{col 37}{space 1}  -26.50{col 46}{space 3}0.000{col 54}{space 4} -.000099{col 67}{space 3}-.0000854
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0117194{col 26}{space 2} .0014407{col 37}{space 1}    8.13{col 46}{space 3}0.000{col 54}{space 4} .0088929{col 67}{space 3} .0145459
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0247334{col 26}{space 2} .0025031{col 37}{space 1}   -9.88{col 46}{space 3}0.000{col 54}{space 4}-.0296442{col 67}{space 3}-.0198227
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} .0147151{col 26}{space 2} .0017994{col 37}{space 1}    8.18{col 46}{space 3}0.000{col 54}{space 4} .0111849{col 67}{space 3} .0182452
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0108376{col 26}{space 2} .0028246{col 37}{space 1}   -3.84{col 46}{space 3}0.000{col 54}{space 4}-.0163789{col 67}{space 3}-.0052963
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0026357{col 26}{space 2} .0027579{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-.0080462{col 67}{space 3} .0027748
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0145418{col 26}{space 2} .0013568{col 37}{space 1}  -10.72{col 46}{space 3}0.000{col 54}{space 4}-.0172037{col 67}{space 3}-.0118799
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0299595{col 26}{space 2} .0029114{col 37}{space 1}  -10.29{col 46}{space 3}0.000{col 54}{space 4}-.0356712{col 67}{space 3}-.0242477
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0258771{col 26}{space 2} .0031281{col 37}{space 1}    8.27{col 46}{space 3}0.000{col 54}{space 4} .0197402{col 67}{space 3}  .032014
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0578037{col 26}{space 2} .0021307{col 37}{space 1}  -27.13{col 46}{space 3}0.000{col 54}{space 4}-.0619837{col 67}{space 3}-.0536237
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0523595{col 26}{space 2} .0019251{col 37}{space 1}  -27.20{col 46}{space 3}0.000{col 54}{space 4}-.0561363{col 67}{space 3}-.0485828
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0510858{col 26}{space 2} .0019865{col 37}{space 1}  -25.72{col 46}{space 3}0.000{col 54}{space 4} -.054983{col 67}{space 3}-.0471887
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0246427{col 26}{space 2} .0022265{col 37}{space 1}  -11.07{col 46}{space 3}0.000{col 54}{space 4}-.0290108{col 67}{space 3}-.0202746
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0354683{col 26}{space 2} .0009749{col 37}{space 1}  -36.38{col 46}{space 3}0.000{col 54}{space 4}-.0373809{col 67}{space 3}-.0335557
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.030435{col 26}{space 2} .0009586{col 37}{space 1}  -31.75{col 46}{space 3}0.000{col 54}{space 4}-.0323155{col 67}{space 3}-.0285544
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0253754{col 26}{space 2} .0009467{col 37}{space 1}  -26.80{col 46}{space 3}0.000{col 54}{space 4}-.0272326{col 67}{space 3}-.0235181
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0270038{col 26}{space 2} .0009411{col 37}{space 1}  -28.70{col 46}{space 3}0.000{col 54}{space 4}  -.02885{col 67}{space 3}-.0251576
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0093503{col 26}{space 2} .0004176{col 37}{space 1}   22.39{col 46}{space 3}0.000{col 54}{space 4} .0085311{col 67}{space 3} .0101695
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0081687{col 26}{space 2} .0003488{col 37}{space 1}   23.42{col 46}{space 3}0.000{col 54}{space 4} .0074843{col 67}{space 3}  .008853
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0070312{col 26}{space 2} .0003446{col 37}{space 1}   20.41{col 46}{space 3}0.000{col 54}{space 4} .0063552{col 67}{space 3} .0077072
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0026999{col 26}{space 2} .0005471{col 37}{space 1}    4.93{col 46}{space 3}0.000{col 54}{space 4} .0016265{col 67}{space 3} .0037733
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0634698{col 26}{space 2} .0020177{col 37}{space 1}  -31.46{col 46}{space 3}0.000{col 54}{space 4}-.0674282{col 67}{space 3}-.0595114
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0621947{col 26}{space 2} .0021296{col 37}{space 1}  -29.20{col 46}{space 3}0.000{col 54}{space 4}-.0663727{col 67}{space 3}-.0580167
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0612819{col 26}{space 2} .0021406{col 37}{space 1}  -28.63{col 46}{space 3}0.000{col 54}{space 4}-.0654814{col 67}{space 3}-.0570823
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0515829{col 26}{space 2} .0024761{col 37}{space 1}  -20.83{col 46}{space 3}0.000{col 54}{space 4}-.0564407{col 67}{space 3}-.0467251
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0273933{col 26}{space 2} .0012025{col 37}{space 1}  -22.78{col 46}{space 3}0.000{col 54}{space 4}-.0297524{col 67}{space 3}-.0250341
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0298184{col 26}{space 2} .0011765{col 37}{space 1}  -25.34{col 46}{space 3}0.000{col 54}{space 4}-.0321265{col 67}{space 3}-.0275103
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0230785{col 26}{space 2} .0011883{col 37}{space 1}  -19.42{col 46}{space 3}0.000{col 54}{space 4}-.0254098{col 67}{space 3}-.0207473
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0307286{col 26}{space 2} .0009512{col 37}{space 1}  -32.30{col 46}{space 3}0.000{col 54}{space 4}-.0325948{col 67}{space 3}-.0288624
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0091896{col 26}{space 2} .0004655{col 37}{space 1}   19.74{col 46}{space 3}0.000{col 54}{space 4} .0082764{col 67}{space 3} .0101027
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0098229{col 26}{space 2} .0005051{col 37}{space 1}   19.45{col 46}{space 3}0.000{col 54}{space 4}  .008832{col 67}{space 3} .0108137
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0076998{col 26}{space 2} .0004858{col 37}{space 1}   15.85{col 46}{space 3}0.000{col 54}{space 4} .0067469{col 67}{space 3} .0086528
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0014167{col 26}{space 2} .0006294{col 37}{space 1}    2.25{col 46}{space 3}0.025{col 54}{space 4} .0001819{col 67}{space 3} .0026515
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .9895141{col 26}{space 2} .0215073{col 37}{space 1}   46.01{col 46}{space 3}0.000{col 54}{space 4} .9473204{col 67}{space 3} 1.031708
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}added scalars:
              e(ymean) =  {res}.37492329
{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_2year_va_cfr_g11_enr_2year_dk_hetero_prior_ela.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_2year_va_cfr_g11_enr_2year_dk_hetero_prior_ela.ster} saved
interaction with prior math score deciles 

Linear regression                               Number of obs     = {res} 1,251,472
                                                {txt}F(46, 1271)       =  {res}  1232.30
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0802
                                                {txt}Root MSE          =    {res} .46431

{txt}{ralign 78:(Std. err. adjusted for {res:1,272} clusters in {res:cdscode})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prior_mat~le#{c |}
{space 10}c. {c |}
va_~2year_dk {c |}
{space 9} 1  {c |}{col 14}{res}{space 2} .0904619{col 26}{space 2} .0022236{col 37}{space 1}   40.68{col 46}{space 3}0.000{col 54}{space 4} .0860996{col 67}{space 3} .0948243
{txt}{space 9} 2  {c |}{col 14}{res}{space 2} .1007909{col 26}{space 2} .0019191{col 37}{space 1}   52.52{col 46}{space 3}0.000{col 54}{space 4}  .097026{col 67}{space 3} .1045558
{txt}{space 9} 3  {c |}{col 14}{res}{space 2} .1090043{col 26}{space 2} .0016792{col 37}{space 1}   64.91{col 46}{space 3}0.000{col 54}{space 4}   .10571{col 67}{space 3} .1122986
{txt}{space 9} 4  {c |}{col 14}{res}{space 2} .1101268{col 26}{space 2} .0017331{col 37}{space 1}   63.54{col 46}{space 3}0.000{col 54}{space 4} .1067267{col 67}{space 3} .1135269
{txt}{space 9} 5  {c |}{col 14}{res}{space 2} .1107113{col 26}{space 2} .0016328{col 37}{space 1}   67.81{col 46}{space 3}0.000{col 54}{space 4} .1075081{col 67}{space 3} .1139146
{txt}{space 9} 6  {c |}{col 14}{res}{space 2} .1083202{col 26}{space 2}  .001577{col 37}{space 1}   68.69{col 46}{space 3}0.000{col 54}{space 4} .1052263{col 67}{space 3}  .111414
{txt}{space 9} 7  {c |}{col 14}{res}{space 2} .1061384{col 26}{space 2} .0017855{col 37}{space 1}   59.45{col 46}{space 3}0.000{col 54}{space 4} .1026356{col 67}{space 3} .1096412
{txt}{space 9} 8  {c |}{col 14}{res}{space 2} .0989066{col 26}{space 2} .0018458{col 37}{space 1}   53.59{col 46}{space 3}0.000{col 54}{space 4} .0952855{col 67}{space 3} .1025277
{txt}{space 9} 9  {c |}{col 14}{res}{space 2}  .085693{col 26}{space 2} .0019669{col 37}{space 1}   43.57{col 46}{space 3}0.000{col 54}{space 4} .0818343{col 67}{space 3} .0895517
{txt}{space 9}10  {c |}{col 14}{res}{space 2}  .060972{col 26}{space 2} .0019103{col 37}{space 1}   31.92{col 46}{space 3}0.000{col 54}{space 4} .0572242{col 67}{space 3} .0647198
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0065242{col 26}{space 2} .0034184{col 37}{space 1}   -1.91{col 46}{space 3}0.057{col 54}{space 4}-.0132306{col 67}{space 3} .0001822
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0335598{col 26}{space 2} .0023319{col 37}{space 1}  -14.39{col 46}{space 3}0.000{col 54}{space 4}-.0381346{col 67}{space 3}-.0289849
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0125263{col 26}{space 2} .0034992{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0193912{col 67}{space 3}-.0056613
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000921{col 26}{space 2} 3.48e-06{col 37}{space 1}  -26.49{col 46}{space 3}0.000{col 54}{space 4}-.0000989{col 67}{space 3}-.0000853
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0116835{col 26}{space 2} .0014396{col 37}{space 1}    8.12{col 46}{space 3}0.000{col 54}{space 4} .0088592{col 67}{space 3} .0145078
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0247364{col 26}{space 2} .0025159{col 37}{space 1}   -9.83{col 46}{space 3}0.000{col 54}{space 4}-.0296723{col 67}{space 3}-.0198006
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} .0146327{col 26}{space 2} .0018037{col 37}{space 1}    8.11{col 46}{space 3}0.000{col 54}{space 4} .0110942{col 67}{space 3} .0181713
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0107926{col 26}{space 2} .0028246{col 37}{space 1}   -3.82{col 46}{space 3}0.000{col 54}{space 4}-.0163339{col 67}{space 3}-.0052512
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0026218{col 26}{space 2} .0027566{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4}-.0080298{col 67}{space 3} .0027862
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0145641{col 26}{space 2} .0013594{col 37}{space 1}  -10.71{col 46}{space 3}0.000{col 54}{space 4} -.017231{col 67}{space 3}-.0118973
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0304156{col 26}{space 2} .0029153{col 37}{space 1}  -10.43{col 46}{space 3}0.000{col 54}{space 4}-.0361351{col 67}{space 3}-.0246962
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0259948{col 26}{space 2} .0031247{col 37}{space 1}    8.32{col 46}{space 3}0.000{col 54}{space 4} .0198647{col 67}{space 3}  .032125
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0614235{col 26}{space 2} .0021038{col 37}{space 1}  -29.20{col 46}{space 3}0.000{col 54}{space 4}-.0655509{col 67}{space 3}-.0572961
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0557358{col 26}{space 2}  .001882{col 37}{space 1}  -29.61{col 46}{space 3}0.000{col 54}{space 4} -.059428{col 67}{space 3}-.0520436
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0543887{col 26}{space 2} .0019564{col 37}{space 1}  -27.80{col 46}{space 3}0.000{col 54}{space 4}-.0582268{col 67}{space 3}-.0505506
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0265642{col 26}{space 2} .0022249{col 37}{space 1}  -11.94{col 46}{space 3}0.000{col 54}{space 4}-.0309291{col 67}{space 3}-.0221993
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0373306{col 26}{space 2} .0010084{col 37}{space 1}  -37.02{col 46}{space 3}0.000{col 54}{space 4}-.0393089{col 67}{space 3}-.0353523
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0322417{col 26}{space 2} .0009818{col 37}{space 1}  -32.84{col 46}{space 3}0.000{col 54}{space 4}-.0341679{col 67}{space 3}-.0303155
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0273735{col 26}{space 2} .0009622{col 37}{space 1}  -28.45{col 46}{space 3}0.000{col 54}{space 4}-.0292611{col 67}{space 3}-.0254859
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0290325{col 26}{space 2} .0009579{col 37}{space 1}  -30.31{col 46}{space 3}0.000{col 54}{space 4}-.0309118{col 67}{space 3}-.0271532
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0097276{col 26}{space 2} .0004229{col 37}{space 1}   23.00{col 46}{space 3}0.000{col 54}{space 4} .0088979{col 67}{space 3} .0105573
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0085916{col 26}{space 2} .0003507{col 37}{space 1}   24.50{col 46}{space 3}0.000{col 54}{space 4} .0079036{col 67}{space 3} .0092796
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0074938{col 26}{space 2} .0003489{col 37}{space 1}   21.48{col 46}{space 3}0.000{col 54}{space 4} .0068093{col 67}{space 3} .0081783
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0025424{col 26}{space 2} .0005584{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 54}{space 4} .0014469{col 67}{space 3} .0036378
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0603688{col 26}{space 2} .0020155{col 37}{space 1}  -29.95{col 46}{space 3}0.000{col 54}{space 4}-.0643229{col 67}{space 3}-.0564147
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0591663{col 26}{space 2} .0021446{col 37}{space 1}  -27.59{col 46}{space 3}0.000{col 54}{space 4}-.0633735{col 67}{space 3} -.054959
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0582029{col 26}{space 2} .0021158{col 37}{space 1}  -27.51{col 46}{space 3}0.000{col 54}{space 4}-.0623538{col 67}{space 3}-.0540521
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0496473{col 26}{space 2} .0025347{col 37}{space 1}  -19.59{col 46}{space 3}0.000{col 54}{space 4}-.0546199{col 67}{space 3}-.0446748
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0253087{col 26}{space 2} .0011966{col 37}{space 1}  -21.15{col 46}{space 3}0.000{col 54}{space 4}-.0276563{col 67}{space 3}-.0229612
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0278274{col 26}{space 2} .0011661{col 37}{space 1}  -23.86{col 46}{space 3}0.000{col 54}{space 4}-.0301151{col 67}{space 3}-.0255396
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0207806{col 26}{space 2} .0011714{col 37}{space 1}  -17.74{col 46}{space 3}0.000{col 54}{space 4}-.0230787{col 67}{space 3}-.0184824
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.028896{col 26}{space 2} .0009212{col 37}{space 1}  -31.37{col 46}{space 3}0.000{col 54}{space 4}-.0307033{col 67}{space 3}-.0270887
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0086739{col 26}{space 2} .0004657{col 37}{space 1}   18.63{col 46}{space 3}0.000{col 54}{space 4} .0077604{col 67}{space 3} .0095875
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .009305{col 26}{space 2} .0005056{col 37}{space 1}   18.40{col 46}{space 3}0.000{col 54}{space 4} .0083131{col 67}{space 3} .0102969
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .007131{col 26}{space 2}  .000486{col 37}{space 1}   14.67{col 46}{space 3}0.000{col 54}{space 4} .0061775{col 67}{space 3} .0080845
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0014751{col 26}{space 2}  .000619{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0002608{col 67}{space 3} .0026895
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .9885673{col 26}{space 2} .0215038{col 37}{space 1}   45.97{col 46}{space 3}0.000{col 54}{space 4} .9463805{col 67}{space 3} 1.030754
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}added scalars:
              e(ymean) =  {res}.37492329
{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_2year_va_cfr_g11_enr_2year_dk_hetero_prior_math.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_2year_va_cfr_g11_enr_2year_dk_hetero_prior_math.ster} saved
LHS = enr_4year, RHS VA = enr_4year DK VA controlling for both subject VAs
interaction with prior ela score deciles 

Linear regression                               Number of obs     = {res} 1,251,472
                                                {txt}F(46, 1271)       =  {res}  3689.56
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2577
                                                {txt}Root MSE          =    {res} .40456

{txt}{ralign 78:(Std. err. adjusted for {res:1,272} clusters in {res:cdscode})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prior_ela~le#{c |}
{space 10}c. {c |}
va_~4year_dk {c |}
{space 9} 1  {c |}{col 14}{res}{space 2} .0409202{col 26}{space 2} .0018801{col 37}{space 1}   21.76{col 46}{space 3}0.000{col 54}{space 4} .0372317{col 67}{space 3} .0446087
{txt}{space 9} 2  {c |}{col 14}{res}{space 2} .0679018{col 26}{space 2}  .002178{col 37}{space 1}   31.18{col 46}{space 3}0.000{col 54}{space 4}  .063629{col 67}{space 3} .0721747
{txt}{space 9} 3  {c |}{col 14}{res}{space 2} .0845939{col 26}{space 2} .0022546{col 37}{space 1}   37.52{col 46}{space 3}0.000{col 54}{space 4} .0801708{col 67}{space 3} .0890171
{txt}{space 9} 4  {c |}{col 14}{res}{space 2} .0981031{col 26}{space 2} .0022916{col 37}{space 1}   42.81{col 46}{space 3}0.000{col 54}{space 4} .0936073{col 67}{space 3} .1025989
{txt}{space 9} 5  {c |}{col 14}{res}{space 2} .1049129{col 26}{space 2} .0020924{col 37}{space 1}   50.14{col 46}{space 3}0.000{col 54}{space 4}  .100808{col 67}{space 3} .1090178
{txt}{space 9} 6  {c |}{col 14}{res}{space 2} .1087262{col 26}{space 2} .0019528{col 37}{space 1}   55.68{col 46}{space 3}0.000{col 54}{space 4} .1048951{col 67}{space 3} .1125573
{txt}{space 9} 7  {c |}{col 14}{res}{space 2}  .110331{col 26}{space 2} .0021264{col 37}{space 1}   51.89{col 46}{space 3}0.000{col 54}{space 4} .1061593{col 67}{space 3} .1145027
{txt}{space 9} 8  {c |}{col 14}{res}{space 2} .1062911{col 26}{space 2} .0021613{col 37}{space 1}   49.18{col 46}{space 3}0.000{col 54}{space 4} .1020511{col 67}{space 3} .1105312
{txt}{space 9} 9  {c |}{col 14}{res}{space 2} .0982037{col 26}{space 2} .0020859{col 37}{space 1}   47.08{col 46}{space 3}0.000{col 54}{space 4} .0941115{col 67}{space 3} .1022958
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0683005{col 26}{space 2} .0020754{col 37}{space 1}   32.91{col 46}{space 3}0.000{col 54}{space 4} .0642288{col 67}{space 3} .0723722
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0175858{col 26}{space 2} .0020436{col 37}{space 1}    8.61{col 46}{space 3}0.000{col 54}{space 4} .0135766{col 67}{space 3}  .021595
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0138317{col 26}{space 2}  .002548{col 37}{space 1}    5.43{col 46}{space 3}0.000{col 54}{space 4}  .008833{col 67}{space 3} .0188304
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.020658{col 26}{space 2} .0028204{col 37}{space 1}   -7.32{col 46}{space 3}0.000{col 54}{space 4}-.0261912{col 67}{space 3}-.0151248
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000817{col 26}{space 2} 2.67e-06{col 37}{space 1}  -30.55{col 46}{space 3}0.000{col 54}{space 4} -.000087{col 67}{space 3}-.0000765
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0875246{col 26}{space 2} .0011254{col 37}{space 1}  -77.77{col 46}{space 3}0.000{col 54}{space 4}-.0897325{col 67}{space 3}-.0853168
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0869206{col 26}{space 2} .0032909{col 37}{space 1}   26.41{col 46}{space 3}0.000{col 54}{space 4} .0804645{col 67}{space 3} .0933767
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0167762{col 26}{space 2} .0021447{col 37}{space 1}   -7.82{col 46}{space 3}0.000{col 54}{space 4}-.0209838{col 67}{space 3}-.0125687
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}  .035787{col 26}{space 2} .0034821{col 37}{space 1}   10.28{col 46}{space 3}0.000{col 54}{space 4} .0289557{col 67}{space 3} .0426182
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0042631{col 26}{space 2} .0027363{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-.0096313{col 67}{space 3} .0011051
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0384001{col 26}{space 2} .0017509{col 37}{space 1}  -21.93{col 46}{space 3}0.000{col 54}{space 4}-.0418351{col 67}{space 3}-.0349652
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0185299{col 26}{space 2} .0016356{col 37}{space 1}  -11.33{col 46}{space 3}0.000{col 54}{space 4}-.0217388{col 67}{space 3}-.0153211
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0507002{col 26}{space 2} .0020972{col 37}{space 1}  -24.18{col 46}{space 3}0.000{col 54}{space 4}-.0548146{col 67}{space 3}-.0465858
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1377863{col 26}{space 2} .0017519{col 37}{space 1}   78.65{col 46}{space 3}0.000{col 54}{space 4} .1343493{col 67}{space 3} .1412233
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1234014{col 26}{space 2} .0017069{col 37}{space 1}   72.29{col 46}{space 3}0.000{col 54}{space 4} .1200527{col 67}{space 3} .1267501
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1175485{col 26}{space 2} .0018202{col 37}{space 1}   64.58{col 46}{space 3}0.000{col 54}{space 4} .1139777{col 67}{space 3} .1211194
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0922239{col 26}{space 2} .0018995{col 37}{space 1}   48.55{col 46}{space 3}0.000{col 54}{space 4} .0884974{col 67}{space 3} .0959504
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0221322{col 26}{space 2} .0007134{col 37}{space 1}   31.02{col 46}{space 3}0.000{col 54}{space 4} .0207326{col 67}{space 3} .0235317
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0154804{col 26}{space 2} .0007016{col 37}{space 1}   22.07{col 46}{space 3}0.000{col 54}{space 4} .0141041{col 67}{space 3} .0168568
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0171872{col 26}{space 2} .0007145{col 37}{space 1}   24.06{col 46}{space 3}0.000{col 54}{space 4} .0157855{col 67}{space 3} .0185888
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0182036{col 26}{space 2} .0007718{col 37}{space 1}   23.59{col 46}{space 3}0.000{col 54}{space 4} .0166895{col 67}{space 3} .0197177
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0111039{col 26}{space 2} .0003304{col 37}{space 1}  -33.60{col 46}{space 3}0.000{col 54}{space 4}-.0117522{col 67}{space 3}-.0104556
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0085674{col 26}{space 2} .0002924{col 37}{space 1}  -29.30{col 46}{space 3}0.000{col 54}{space 4}-.0091409{col 67}{space 3}-.0079938
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.009176{col 26}{space 2} .0003085{col 37}{space 1}  -29.74{col 46}{space 3}0.000{col 54}{space 4}-.0097812{col 67}{space 3}-.0085708
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0069365{col 26}{space 2} .0004513{col 37}{space 1}  -15.37{col 46}{space 3}0.000{col 54}{space 4}-.0078219{col 67}{space 3}-.0060511
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1188087{col 26}{space 2} .0018519{col 37}{space 1}   64.15{col 46}{space 3}0.000{col 54}{space 4} .1151755{col 67}{space 3} .1224419
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1219724{col 26}{space 2} .0019614{col 37}{space 1}   62.19{col 46}{space 3}0.000{col 54}{space 4} .1181245{col 67}{space 3} .1258203
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1209543{col 26}{space 2} .0019679{col 37}{space 1}   61.46{col 46}{space 3}0.000{col 54}{space 4} .1170936{col 67}{space 3} .1248149
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1376318{col 26}{space 2} .0021531{col 37}{space 1}   63.92{col 46}{space 3}0.000{col 54}{space 4} .1334077{col 67}{space 3} .1418559
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0189295{col 26}{space 2} .0008872{col 37}{space 1}   21.34{col 46}{space 3}0.000{col 54}{space 4} .0171889{col 67}{space 3}   .02067
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0180955{col 26}{space 2} .0008331{col 37}{space 1}   21.72{col 46}{space 3}0.000{col 54}{space 4} .0164611{col 67}{space 3}   .01973
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0155921{col 26}{space 2} .0008414{col 37}{space 1}   18.53{col 46}{space 3}0.000{col 54}{space 4} .0139414{col 67}{space 3} .0172429
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0322311{col 26}{space 2} .0007669{col 37}{space 1}   42.03{col 46}{space 3}0.000{col 54}{space 4} .0307265{col 67}{space 3} .0337357
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0099621{col 26}{space 2} .0004015{col 37}{space 1}  -24.81{col 46}{space 3}0.000{col 54}{space 4}-.0107497{col 67}{space 3}-.0091744
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0097389{col 26}{space 2} .0004272{col 37}{space 1}  -22.80{col 46}{space 3}0.000{col 54}{space 4}-.0105771{col 67}{space 3}-.0089008
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0089514{col 26}{space 2} .0004231{col 37}{space 1}  -21.16{col 46}{space 3}0.000{col 54}{space 4}-.0097814{col 67}{space 3}-.0081213
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0084174{col 26}{space 2} .0005385{col 37}{space 1}  -15.63{col 46}{space 3}0.000{col 54}{space 4}-.0094739{col 67}{space 3}-.0073608
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .8327797{col 26}{space 2} .0160237{col 37}{space 1}   51.97{col 46}{space 3}0.000{col 54}{space 4}  .801344{col 67}{space 3} .8642154
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}added scalars:
              e(ymean) =  {res}.32815676
{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_4year_va_cfr_g11_enr_4year_dk_hetero_prior_ela.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_4year_va_cfr_g11_enr_4year_dk_hetero_prior_ela.ster} saved
interaction with prior math score deciles 

Linear regression                               Number of obs     = {res} 1,251,472
                                                {txt}F(46, 1271)       =  {res}  3615.40
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2575
                                                {txt}Root MSE          =    {res}  .4046

{txt}{ralign 78:(Std. err. adjusted for {res:1,272} clusters in {res:cdscode})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
prior_mat~le#{c |}
{space 10}c. {c |}
va_~4year_dk {c |}
{space 9} 1  {c |}{col 14}{res}{space 2}  .044503{col 26}{space 2}  .001829{col 37}{space 1}   24.33{col 46}{space 3}0.000{col 54}{space 4} .0409148{col 67}{space 3} .0480913
{txt}{space 9} 2  {c |}{col 14}{res}{space 2} .0702778{col 26}{space 2} .0022878{col 37}{space 1}   30.72{col 46}{space 3}0.000{col 54}{space 4} .0657896{col 67}{space 3}  .074766
{txt}{space 9} 3  {c |}{col 14}{res}{space 2} .0853883{col 26}{space 2} .0020785{col 37}{space 1}   41.08{col 46}{space 3}0.000{col 54}{space 4} .0813106{col 67}{space 3} .0894659
{txt}{space 9} 4  {c |}{col 14}{res}{space 2} .0951597{col 26}{space 2} .0021491{col 37}{space 1}   44.28{col 46}{space 3}0.000{col 54}{space 4} .0909435{col 67}{space 3}  .099376
{txt}{space 9} 5  {c |}{col 14}{res}{space 2} .1024098{col 26}{space 2}  .002106{col 37}{space 1}   48.63{col 46}{space 3}0.000{col 54}{space 4} .0982782{col 67}{space 3} .1065414
{txt}{space 9} 6  {c |}{col 14}{res}{space 2} .1078456{col 26}{space 2} .0020034{col 37}{space 1}   53.83{col 46}{space 3}0.000{col 54}{space 4} .1039152{col 67}{space 3} .1117759
{txt}{space 9} 7  {c |}{col 14}{res}{space 2} .1106127{col 26}{space 2} .0022211{col 37}{space 1}   49.80{col 46}{space 3}0.000{col 54}{space 4} .1062553{col 67}{space 3} .1149701
{txt}{space 9} 8  {c |}{col 14}{res}{space 2} .1065074{col 26}{space 2} .0022042{col 37}{space 1}   48.32{col 46}{space 3}0.000{col 54}{space 4}  .102183{col 67}{space 3} .1108317
{txt}{space 9} 9  {c |}{col 14}{res}{space 2}  .097764{col 26}{space 2} .0020942{col 37}{space 1}   46.68{col 46}{space 3}0.000{col 54}{space 4} .0936555{col 67}{space 3} .1018725
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0668605{col 26}{space 2} .0020642{col 37}{space 1}   32.39{col 46}{space 3}0.000{col 54}{space 4} .0628109{col 67}{space 3} .0709101
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0175305{col 26}{space 2} .0020507{col 37}{space 1}    8.55{col 46}{space 3}0.000{col 54}{space 4} .0135074{col 67}{space 3} .0215535
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0136711{col 26}{space 2} .0025538{col 37}{space 1}    5.35{col 46}{space 3}0.000{col 54}{space 4} .0086609{col 67}{space 3} .0186813
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.020567{col 26}{space 2}  .002826{col 37}{space 1}   -7.28{col 46}{space 3}0.000{col 54}{space 4}-.0261111{col 67}{space 3} -.015023
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000818{col 26}{space 2} 2.68e-06{col 37}{space 1}  -30.51{col 46}{space 3}0.000{col 54}{space 4}-.0000871{col 67}{space 3}-.0000765
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0874106{col 26}{space 2} .0011269{col 37}{space 1}  -77.57{col 46}{space 3}0.000{col 54}{space 4}-.0896214{col 67}{space 3}-.0851997
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}  .086831{col 26}{space 2} .0032933{col 37}{space 1}   26.37{col 46}{space 3}0.000{col 54}{space 4} .0803701{col 67}{space 3} .0932919
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0168887{col 26}{space 2} .0021379{col 37}{space 1}   -7.90{col 46}{space 3}0.000{col 54}{space 4}-.0210829{col 67}{space 3}-.0126946
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0359721{col 26}{space 2} .0034749{col 37}{space 1}   10.35{col 46}{space 3}0.000{col 54}{space 4} .0291549{col 67}{space 3} .0427893
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0043717{col 26}{space 2} .0027342{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-.0097358{col 67}{space 3} .0009923
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0384541{col 26}{space 2} .0017535{col 37}{space 1}  -21.93{col 46}{space 3}0.000{col 54}{space 4}-.0418941{col 67}{space 3}-.0350141
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2} -.018477{col 26}{space 2} .0016777{col 37}{space 1}  -11.01{col 46}{space 3}0.000{col 54}{space 4}-.0217683{col 67}{space 3}-.0151856
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0506777{col 26}{space 2} .0021042{col 37}{space 1}  -24.08{col 46}{space 3}0.000{col 54}{space 4}-.0548058{col 67}{space 3}-.0465497
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1364912{col 26}{space 2} .0017861{col 37}{space 1}   76.42{col 46}{space 3}0.000{col 54}{space 4} .1329871{col 67}{space 3} .1399953
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1222878{col 26}{space 2} .0017307{col 37}{space 1}   70.66{col 46}{space 3}0.000{col 54}{space 4} .1188924{col 67}{space 3} .1256832
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .116721{col 26}{space 2}  .001827{col 37}{space 1}   63.89{col 46}{space 3}0.000{col 54}{space 4} .1131367{col 67}{space 3} .1203052
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0908989{col 26}{space 2} .0019221{col 37}{space 1}   47.29{col 46}{space 3}0.000{col 54}{space 4} .0871281{col 67}{space 3} .0946696
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0228743{col 26}{space 2} .0007679{col 37}{space 1}   29.79{col 46}{space 3}0.000{col 54}{space 4} .0213678{col 67}{space 3} .0243807
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0162142{col 26}{space 2} .0007433{col 37}{space 1}   21.81{col 46}{space 3}0.000{col 54}{space 4} .0147559{col 67}{space 3} .0176726
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0175355{col 26}{space 2} .0007175{col 37}{space 1}   24.44{col 46}{space 3}0.000{col 54}{space 4} .0161279{col 67}{space 3} .0189431
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0183926{col 26}{space 2}  .000786{col 37}{space 1}   23.40{col 46}{space 3}0.000{col 54}{space 4} .0168505{col 67}{space 3} .0199346
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re#{c |}
{space 10}c. {c |}
prior_ela~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0111537{col 26}{space 2} .0003321{col 37}{space 1}  -33.59{col 46}{space 3}0.000{col 54}{space 4}-.0118052{col 67}{space 3}-.0105022
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0086698{col 26}{space 2} .0002897{col 37}{space 1}  -29.93{col 46}{space 3}0.000{col 54}{space 4} -.009238{col 67}{space 3}-.0081015
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0092128{col 26}{space 2} .0003086{col 37}{space 1}  -29.86{col 46}{space 3}0.000{col 54}{space 4}-.0098181{col 67}{space 3}-.0086074
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0068996{col 26}{space 2} .0004683{col 37}{space 1}  -14.73{col 46}{space 3}0.000{col 54}{space 4}-.0078183{col 67}{space 3}-.0059809
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .120143{col 26}{space 2}  .001846{col 37}{space 1}   65.08{col 46}{space 3}0.000{col 54}{space 4} .1165214{col 67}{space 3} .1237645
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1232241{col 26}{space 2} .0019671{col 37}{space 1}   62.64{col 46}{space 3}0.000{col 54}{space 4} .1193649{col 67}{space 3} .1270832
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .121858{col 26}{space 2}  .001985{col 37}{space 1}   61.39{col 46}{space 3}0.000{col 54}{space 4} .1179637{col 67}{space 3} .1257522
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .138876{col 26}{space 2} .0021188{col 37}{space 1}   65.55{col 46}{space 3}0.000{col 54}{space 4} .1347193{col 67}{space 3} .1430327
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0180125{col 26}{space 2} .0008761{col 37}{space 1}   20.56{col 46}{space 3}0.000{col 54}{space 4} .0162938{col 67}{space 3} .0197313
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .017177{col 26}{space 2} .0008257{col 37}{space 1}   20.80{col 46}{space 3}0.000{col 54}{space 4} .0155571{col 67}{space 3} .0187968
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0151254{col 26}{space 2} .0008283{col 37}{space 1}   18.26{col 46}{space 3}0.000{col 54}{space 4} .0135004{col 67}{space 3} .0167503
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0321319{col 26}{space 2} .0007405{col 37}{space 1}   43.39{col 46}{space 3}0.000{col 54}{space 4} .0306792{col 67}{space 3} .0335847
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re#{c |}
{space 10}c. {c |}
prior_mat~re {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0098173{col 26}{space 2} .0004038{col 37}{space 1}  -24.31{col 46}{space 3}0.000{col 54}{space 4}-.0106095{col 67}{space 3}-.0090252
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0095859{col 26}{space 2} .0004299{col 37}{space 1}  -22.30{col 46}{space 3}0.000{col 54}{space 4}-.0104292{col 67}{space 3}-.0087426
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0088809{col 26}{space 2} .0004212{col 37}{space 1}  -21.08{col 46}{space 3}0.000{col 54}{space 4}-.0097072{col 67}{space 3}-.0080546
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0083895{col 26}{space 2} .0005175{col 37}{space 1}  -16.21{col 46}{space 3}0.000{col 54}{space 4}-.0094047{col 67}{space 3}-.0073742
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .8334285{col 26}{space 2} .0160476{col 37}{space 1}   51.93{col 46}{space 3}0.000{col 54}{space 4} .8019458{col 67}{space 3} .8649112
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}added scalars:
              e(ymean) =  {res}.32815676
{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_4year_va_cfr_g11_enr_4year_dk_hetero_prior_math.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sbac/reg_enr_4year_va_cfr_g11_enr_4year_dk_hetero_prior_math.ster} saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:   3810.43 /        1 =    3810.4310
{txt}
{com}. 
. set trace off
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/reg_out_va_cfr_dk.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 May 2022, 15:13:42
{txt}{.-}
{smcl}
{txt}{sf}{ul off}