-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/reg_out_va_sib_acs_dk.smcl
  log type:  smcl
 opened on:  10 May 2022, 18:28:27

. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative fil
> e paths  */
. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. macro list
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. //startomg timer
. timer on 1

. 
. 
. *****************************************************************************
> ***
. * begin main code
. 
. // load the resctricted outcome sample with sibling and acs controls
. use $vaprojdir/data/va_samples/va_sib_acs_out_restr_smp.dta, clear
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)

. 
. // merge in dk VA dataset
. foreach outcome in enr enr_2year enr_4year {
  2.   //merge to test score VA estimates dataset
.   merge m:1 cdscode year using ///
>    $vaprojdir/data/sib_acs_restr_smp/outcome_va/va_`outcome'_sib_acs_dk.dta /
> //
>    , nogen keep(1 3) keepusing(va_*)
  3.  // standardize the VA estimates into z scores
.  foreach va of varlist va_* {
  4.    sum `va'
  5.    replace `va' = `va' - r(mean)
  6.    replace `va' = `va' / r(sd)
  7.  }
  8. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,386
        from master                     2,386  
        from using                          0  

    Matched                           524,248  
    -----------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   va_ela_og |    524,388   -.0003011    .1103468  -.5653322   .4399461
(524,388 real changes made)
(524,388 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_acs |    524,388   -.0004134     .107964  -.5234845   .4466909
(524,388 real changes made)
(524,388 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_sib |    524,388   -.0003121    .1102197  -.5661247   .4382679
(524,388 real changes made)
(524,388 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_ela_both |    524,388   -.0004222    .1078355  -.5241211   .4465778
(524,388 real changes made)
(524,388 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_math_og |    524,543    6.62e-06    .1196964  -.5020869   .5799825
(524,543 real changes made)
(524,543 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_acs |    524,543   -.0003423     .109783  -.4349537   .6038504
(524,543 real changes made)
(524,543 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_sib |    524,543   -.0000109    .1194341  -.5044312    .579555
(524,543 real changes made)
(524,543 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_math_both |    524,543   -.0003559    .1095434  -.4363886   .6035805
(524,543 real changes made)
(524,543 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_og_dk |    524,171    .0003085    .0575552  -.2944262    .160456
(524,171 real changes made)
(524,171 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_acs~k |    524,171    .0002327    .0534439  -.2828415   .1527506
(524,171 real changes made)
(524,171 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_sib~k |    524,171    .0002821    .0574278  -.2928436   .1612421
(524,171 real changes made)
(524,171 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_bot~k |    524,171    .0002062    .0532256  -.2809072   .1534157
(524,171 real changes made)
(524,171 real changes made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,386
        from master                     2,386  
        from using                          0  

    Matched                           524,248  
    -----------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   va_ela_og |    524,388    4.60e-09           1  -5.120503    3.98967
(55,078 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_acs |    524,388   -8.95e-09           1  -4.844866   4.141235
(110,002 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_sib |    524,388   -7.99e-09           1  -5.133498   3.979143
(107,163 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_ela_both |    524,388    3.02e-09           1  -4.856461   4.145202
(23,522 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_math_og |    524,543    1.49e-08           1  -4.194726   4.845392
(210,194 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_acs |    524,543   -1.11e-08           1  -3.958825    5.50352
(100,594 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_sib |    524,543    5.83e-09           1   -4.22342     4.8526
(52,995 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_math_both |    524,543   -5.32e-09           1  -3.980456   5.513215
(49,540 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_og_dk |    524,171   -1.53e-09           1  -5.120903   2.782501
(11,097 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_acs~k |    524,171   -1.01e-08           1  -5.296657   2.853792
(114,467 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_sib~k |    524,171   -7.30e-09           1  -5.104243   2.802822
(49,823 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_bot~k |    524,171   -1.19e-08           1  -5.281539   2.878492
(115,665 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_~ar_og_dk |    524,171   -.0003717    .0872241  -.2900527   .3533054
(524,171 real changes made)
(524,171 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va~ar_acs_dk |    524,171   -.0001367     .075521  -.2575777    .307233
(524,171 real changes made)
(524,171 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va~ar_sib_dk |    524,171   -.0003142    .0854177  -.2865089   .3475834
(524,171 real changes made)
(524,171 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
v~ar_both_dk |    524,171   -.0000908    .0739518  -.2544641    .302814
(524,171 real changes made)
(524,171 real changes made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,386
        from master                     2,386  
        from using                          0  

    Matched                           524,248  
    -----------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   va_ela_og |    524,388    3.99e-09           1  -5.120503    3.98967
(55,078 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_acs |    524,388   -6.57e-09           1  -4.844866   4.141235
(54,238 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_ela_sib |    524,388   -5.71e-09           1  -5.133498   3.979143
(54,878 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_ela_both |    524,388    2.86e-09           1  -4.856461   4.145202
(23,522 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  va_math_og |    524,543    5.83e-09           1  -4.194726   4.845392
(52,138 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_acs |    524,543   -8.80e-09           1  -3.958825    5.50352
(100,594 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 va_math_sib |    524,543    5.13e-09           1   -4.22342     4.8526
(52,995 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_math_both |    524,543   -4.77e-09           1  -3.980456   5.513215
(49,540 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_og_dk |    524,171   -1.49e-09           1  -5.120903   2.782501
(11,097 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_acs~k |    524,171   -7.42e-09           1  -5.296657   2.853792
(54,220 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_sib~k |    524,171   -6.59e-09           1  -5.104243   2.802822
(49,823 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_bot~k |    524,171   -8.86e-09           1  -5.281539   2.878492
(115,665 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
~2year_og_dk |    524,171   -4.96e-09           1  -3.321112   4.054809
(39,217 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_2ye.. |    524,171   -4.31e-09           1  -3.408864   4.069987
(50,565 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_2ye.. |    524,171   -2.84e-09           1  -3.350533   4.072899
(20,839 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_2ye.. |    524,171   -1.65e-08           1  -3.439716   4.095975
(191,127 real changes made)
(0 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
~4year_og_dk |    524,171    .0003654    .0716565  -.3106381   .3297732
(524,171 real changes made)
(524,171 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_4ye.. |    524,171    .0002384    .0626649  -.2542978   .3049743
(524,171 real changes made)
(524,171 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_4ye.. |    524,171    .0003201    .0694908  -.3016558   .3183925
(524,171 real changes made)
(524,171 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_enr_4ye.. |    524,171    .0001911    .0607691  -.2472301   .2978873
(524,171 real changes made)
(524,171 real changes made)

. 
. ********** regress enrollment outcomes on deep knowledge outcome value added
. /* no tfx, no peer effects */
. 
. foreach outcome in enr enr_2year enr_4year {
  2.   di "LHS = `outcome', RHS = All 3 enrollment outcomes"
  3. 
.   //regressing on all 3 outcome VA's
.   foreach control in og acs sib both {
  4.     di "Deep Knowledge VA with `control' controls"
  5. 
.     reg `outcome' va_enr_`control'_dk va_enr_2year_`control'_dk va_enr_4year_
> `control'_dk ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       if touse_enr_dk==1 & touse_enr_2year_dk==1 & touse_enr_4year_dk==1 ///
>       , cluster(school_id)
  6.     //add mean of yvar to stored results
.     estadd ysumm, mean
  7.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/persistence/reg_
> `outcome'_va_allenr_`control'_dk.ster, replace
  8.   }
  9. }
LHS = enr, RHS = All 3 enrollment outcomes
Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     694.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1377
                                                Root MSE          =     .41327

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .0419952    .003783    11.10   0.000     .0345734    .0494169
~2year_og_dk |    .030859   .0052108     5.92   0.000     .0206361    .0410819
~4year_og_dk |   .0262628   .0043781     6.00   0.000     .0176735     .034852
             |
        year |
       2016  |   .0094315   .0041393     2.28   0.023     .0013107    .0175523
       2017  |  -.0192176   .0039076    -4.92   0.000    -.0268839   -.0115513
       2018  |  -.0295787   .0044556    -6.64   0.000    -.0383202   -.0208373
             |
         age |  -.0001463   5.68e-06   -25.77   0.000    -.0001574   -.0001351
             |
        male |
       Male  |  -.0690048   .0019278   -35.80   0.000    -.0727869   -.0652227
 1.eth_asian |   .0509884    .003289    15.50   0.000     .0445359     .057441
1.eth_hisp~c |  -.0202416   .0027682    -7.31   0.000    -.0256724   -.0148107
 1.eth_black |    .012974   .0048468     2.68   0.008     .0034652    .0224828
 1.eth_other |  -.0095615   .0038785    -2.47   0.014    -.0171708   -.0019523
             |
econ_disad~e |
Economic ..  |  -.0539875    .002167   -24.91   0.000    -.0582388   -.0497362
             |
limited_en~f |
Limited E..  |   -.054759   .0044241   -12.38   0.000    -.0634386   -.0460794
             |
    disabled |
   Disabled  |  -.0236276   .0041983    -5.63   0.000    -.0318641    -.015391
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0755855   .0028662    26.37   0.000     .0699624    .0812087
       2016  |   .0675619   .0026903    25.11   0.000     .0622837      .07284
       2017  |   .0718872   .0028588    25.15   0.000     .0662785     .077496
       2018  |   .0675389    .003739    18.06   0.000     .0602034    .0748744
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0172987   .0015272   -11.33   0.000    -.0202948   -.0143025
       2016  |  -.0216403   .0014061   -15.39   0.000     -.024399   -.0188817
       2017  |  -.0115821   .0015469    -7.49   0.000    -.0146169   -.0085474
       2018  |  -.0128615   .0015427    -8.34   0.000    -.0158881   -.0098348
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006604   .0005834    -1.13   0.258    -.0018048    .0004841
       2016  |   .0011582   .0005232     2.21   0.027     .0001318    .0021846
       2017  |  -.0018447   .0005313    -3.47   0.001    -.0028871   -.0008023
       2018  |  -.0046602   .0009227    -5.05   0.000    -.0064704   -.0028499
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538274   .0025844    20.83   0.000     .0487571    .0588977
       2016  |   .0585187   .0026613    21.99   0.000     .0532974    .0637399
       2017  |   .0553984   .0028207    19.64   0.000     .0498646    .0609322
       2018  |   .0834021   .0038031    21.93   0.000     .0759409    .0908633
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100415   .0018698    -5.37   0.000    -.0137099   -.0063731
       2016  |  -.0139658   .0016749    -8.34   0.000    -.0172517   -.0106799
       2017  |  -.0120611   .0018896    -6.38   0.000    -.0157683   -.0083538
       2018  |  -.0026984   .0015945    -1.69   0.091    -.0058266    .0004298
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0005522   .0006568    -0.84   0.401    -.0018407    .0007363
       2016  |   .0006595   .0006779     0.97   0.331    -.0006703    .0019894
       2017  |  -.0000282   .0007044    -0.04   0.968    -.0014102    .0013538
       2018  |  -.0059465   .0009385    -6.34   0.000    -.0077877   -.0041054
             |
       _cons |   1.691783   .0339831    49.78   0.000     1.625112    1.758453
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_va_allenr_og_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_og_dk.ster saved
Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     618.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1357
                                                Root MSE          =     .41375

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .0389617   .0041116     9.48   0.000     .0308952    .0470283
va_enr_2ye.. |   .0272729   .0053276     5.12   0.000     .0168208    .0377251
va_enr_4ye.. |   .0216329    .004549     4.76   0.000     .0127083    .0305574
             |
        year |
       2016  |   .0093051   .0041324     2.25   0.025     .0011977    .0174125
       2017  |  -.0186649   .0038794    -4.81   0.000    -.0262757    -.011054
       2018  |  -.0295258   .0044096    -6.70   0.000     -.038177   -.0208746
             |
         age |   -.000145   5.77e-06   -25.14   0.000    -.0001563   -.0001337
             |
        male |
       Male  |  -.0687537   .0019331   -35.57   0.000    -.0725461   -.0649612
 1.eth_asian |   .0558642   .0036757    15.20   0.000     .0486529    .0630755
1.eth_hisp~c |  -.0263894   .0029021    -9.09   0.000     -.032083   -.0206959
 1.eth_black |   .0081847    .004951     1.65   0.099    -.0015286    .0178981
 1.eth_other |  -.0093691   .0039516    -2.37   0.018    -.0171217   -.0016165
             |
econ_disad~e |
Economic ..  |  -.0618288   .0022782   -27.14   0.000    -.0662985   -.0573592
             |
limited_en~f |
Limited E..  |  -.0527579   .0045309   -11.64   0.000    -.0616471   -.0438687
             |
    disabled |
   Disabled  |  -.0203178   .0042584    -4.77   0.000    -.0286721   -.0119634
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0774302   .0028568    27.10   0.000     .0718255    .0830349
       2016  |   .0690063   .0026953    25.60   0.000     .0637184    .0742943
       2017  |   .0738119   .0028658    25.76   0.000     .0681895    .0794342
       2018  |   .0687433   .0037379    18.39   0.000     .0614099    .0760767
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174589    .001534   -11.38   0.000    -.0204683   -.0144494
       2016  |  -.0217473   .0014093   -15.43   0.000    -.0245121   -.0189825
       2017  |  -.0117158    .001549    -7.56   0.000    -.0147547   -.0086768
       2018  |  -.0131169   .0015453    -8.49   0.000    -.0161486   -.0100853
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006609   .0005833    -1.13   0.257    -.0018053    .0004835
       2016  |   .0012033   .0005281     2.28   0.023     .0001673    .0022393
       2017  |  -.0018681   .0005326    -3.51   0.000     -.002913   -.0008232
       2018  |  -.0046283   .0009251    -5.00   0.000    -.0064432   -.0028134
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0542012   .0025858    20.96   0.000     .0491281    .0592743
       2016  |   .0591759   .0026747    22.12   0.000     .0539285    .0644234
       2017  |   .0556824   .0028331    19.65   0.000     .0501242    .0612407
       2018  |   .0843275   .0038168    22.09   0.000     .0768395    .0918155
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0102864   .0018743    -5.49   0.000    -.0139634   -.0066093
       2016  |  -.0142609   .0016799    -8.49   0.000    -.0175567   -.0109652
       2017  |  -.0121057   .0018936    -6.39   0.000    -.0158207   -.0083907
       2018  |  -.0024619   .0015929    -1.55   0.122     -.005587    .0006632
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004398   .0006566    -0.67   0.503     -.001728    .0008484
       2016  |   .0007622   .0006798     1.12   0.262    -.0005716    .0020959
       2017  |   .0000321   .0007061     0.05   0.964    -.0013532    .0014173
       2018  |  -.0058158   .0009408    -6.18   0.000    -.0076616     -.00397
             |
       _cons |   1.689988   .0343806    49.16   0.000     1.622537    1.757438
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_va_allenr_acs_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_acs_dk.ster saved
Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     695.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1377
                                                Root MSE          =     .41327

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .0416463   .0038946    10.69   0.000     .0340056    .0492869
va_enr_2ye.. |   .0307664   .0052968     5.81   0.000     .0203747    .0411582
va_enr_4ye.. |   .0262958   .0044225     5.95   0.000     .0176194    .0349723
             |
        year |
       2016  |   .0093696   .0041448     2.26   0.024     .0012381    .0175011
       2017  |  -.0192454    .003907    -4.93   0.000    -.0269104   -.0115804
       2018  |  -.0296252   .0044552    -6.65   0.000    -.0383658   -.0208846
             |
         age |  -.0001462   5.68e-06   -25.72   0.000    -.0001573    -.000135
             |
        male |
       Male  |  -.0690081   .0019273   -35.81   0.000    -.0727892    -.065227
 1.eth_asian |   .0509403   .0032871    15.50   0.000     .0444914    .0573893
1.eth_hisp~c |  -.0201954   .0027658    -7.30   0.000    -.0256217   -.0147691
 1.eth_black |   .0129283    .004848     2.67   0.008     .0034171    .0224395
 1.eth_other |  -.0096036   .0038777    -2.48   0.013    -.0172111   -.0019961
             |
econ_disad~e |
Economic ..  |  -.0538164   .0021667   -24.84   0.000    -.0580672   -.0495656
             |
limited_en~f |
Limited E..  |  -.0546853   .0044283   -12.35   0.000    -.0633731   -.0459976
             |
    disabled |
   Disabled  |   -.023721   .0041967    -5.65   0.000    -.0319545   -.0154875
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0755709   .0028694    26.34   0.000     .0699416    .0812002
       2016  |   .0675077   .0026901    25.10   0.000     .0622301    .0727853
       2017  |   .0718614   .0028591    25.13   0.000     .0662521    .0774707
       2018  |   .0675535   .0037394    18.07   0.000     .0602174    .0748897
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0173096   .0015271   -11.33   0.000    -.0203056   -.0143136
       2016  |  -.0216703   .0014061   -15.41   0.000    -.0244289   -.0189117
       2017  |  -.0115952   .0015466    -7.50   0.000    -.0146294    -.008561
       2018  |  -.0128598   .0015422    -8.34   0.000    -.0158854   -.0098342
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006597   .0005833    -1.13   0.258    -.0018041    .0004847
       2016  |   .0011628   .0005231     2.22   0.026     .0001365     .002189
       2017  |  -.0018451   .0005313    -3.47   0.001    -.0028875   -.0008027
       2018  |  -.0046651   .0009224    -5.06   0.000    -.0064748   -.0028555
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538361   .0025866    20.81   0.000     .0487614    .0589108
       2016  |   .0585424   .0026632    21.98   0.000     .0533176    .0637672
       2017  |   .0554286   .0028213    19.65   0.000     .0498936    .0609635
       2018  |   .0833867   .0038031    21.93   0.000     .0759254     .090848
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100666   .0018702    -5.38   0.000    -.0137358   -.0063975
       2016  |  -.0139712   .0016748    -8.34   0.000     -.017257   -.0106854
       2017  |  -.0120875   .0018903    -6.39   0.000     -.015796   -.0083791
       2018  |  -.0027465   .0015944    -1.72   0.085    -.0058746    .0003816
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.000551   .0006568    -0.84   0.402    -.0018396    .0007376
       2016  |   .0006527   .0006779     0.96   0.336    -.0006772    .0019826
       2017  |  -.0000266   .0007046    -0.04   0.970     -.001409    .0013558
       2018  |  -.0059652   .0009386    -6.36   0.000    -.0078066   -.0041238
             |
       _cons |   1.691136   .0340178    49.71   0.000     1.624397    1.757875
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_va_allenr_sib_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_sib_dk.ster saved
Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     619.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1357
                                                Root MSE          =     .41375

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .0388518   .0042327     9.18   0.000     .0305477    .0471558
va_enr_2ye.. |   .0269577   .0054182     4.98   0.000     .0163278    .0375876
va_enr_4ye.. |   .0214995   .0045993     4.67   0.000     .0124763    .0305227
             |
        year |
       2016  |   .0092483   .0041384     2.23   0.026     .0011294    .0173673
       2017  |  -.0186953   .0038793    -4.82   0.000     -.026306   -.0110846
       2018  |  -.0295752   .0044098    -6.71   0.000    -.0382267   -.0209236
             |
         age |  -.0001449   5.77e-06   -25.10   0.000    -.0001563   -.0001336
             |
        male |
       Male  |  -.0687567   .0019327   -35.58   0.000    -.0725484    -.064965
 1.eth_asian |   .0558921   .0036716    15.22   0.000     .0486887    .0630954
1.eth_hisp~c |  -.0263745   .0028994    -9.10   0.000    -.0320628   -.0206862
 1.eth_black |   .0081571   .0049521     1.65   0.100    -.0015584    .0178726
 1.eth_other |  -.0093843   .0039518    -2.37   0.018    -.0171371   -.0016314
             |
econ_disad~e |
Economic ..  |  -.0616646    .002277   -27.08   0.000    -.0661318   -.0571975
             |
limited_en~f |
Limited E..  |  -.0526798   .0045357   -11.61   0.000    -.0615784   -.0437813
             |
    disabled |
   Disabled  |  -.0203916    .004257    -4.79   0.000    -.0287433     -.01204
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0774247   .0028596    27.08   0.000     .0718145    .0830349
       2016  |   .0689563   .0026948    25.59   0.000     .0636694    .0742433
       2017  |   .0737959   .0028661    25.75   0.000     .0681729    .0794188
       2018  |   .0687521   .0037383    18.39   0.000      .061418    .0760863
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174699    .001534   -11.39   0.000    -.0204794   -.0144604
       2016  |  -.0217767   .0014092   -15.45   0.000    -.0245414    -.019012
       2017  |  -.0117281   .0015487    -7.57   0.000    -.0147664   -.0086898
       2018  |   -.013117   .0015448    -8.49   0.000    -.0161478   -.0100863
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006606   .0005833    -1.13   0.258     -.001805    .0004838
       2016  |   .0012079   .0005279     2.29   0.022     .0001722    .0022436
       2017  |  -.0018688   .0005326    -3.51   0.000    -.0029137   -.0008238
       2018  |  -.0046326   .0009248    -5.01   0.000    -.0064469   -.0028182
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0542082    .002588    20.95   0.000     .0491308    .0592857
       2016  |   .0592002   .0026762    22.12   0.000     .0539499    .0644505
       2017  |   .0557057   .0028338    19.66   0.000     .0501461    .0612652
       2018  |   .0843162   .0038166    22.09   0.000     .0768285    .0918039
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0103093   .0018746    -5.50   0.000     -.013987   -.0066316
       2016  |  -.0142657   .0016798    -8.49   0.000    -.0175613   -.0109702
       2017  |  -.0121297   .0018943    -6.40   0.000     -.015846   -.0084133
       2018  |   -.002504   .0015927    -1.57   0.116    -.0056287    .0006207
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004382   .0006566    -0.67   0.505    -.0017264      .00085
       2016  |   .0007557   .0006798     1.11   0.267     -.000578    .0020895
       2017  |    .000034   .0007063     0.05   0.962    -.0013516    .0014196
       2018  |   -.005831   .0009407    -6.20   0.000    -.0076765   -.0039854
             |
       _cons |   1.689414   .0344093    49.10   0.000     1.621907    1.756921
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_va_allenr_both_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_allenr_both_dk.ster saved
LHS = enr_2year, RHS = All 3 enrollment outcomes
Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     627.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0877
                                                Root MSE          =     .45868

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |    .032302   .0044997     7.18   0.000     .0234741    .0411298
~2year_og_dk |   .0492508   .0062631     7.86   0.000     .0369633    .0615382
~4year_og_dk |   -.035414   .0051805    -6.84   0.000    -.0455774   -.0252505
             |
        year |
       2016  |  -.0070332   .0046221    -1.52   0.128    -.0161013    .0020349
       2017  |  -.0372253   .0041967    -8.87   0.000    -.0454586   -.0289919
       2018  |  -.0090559   .0048132    -1.88   0.060    -.0184988     .000387
             |
         age |  -.0000686   5.64e-06   -12.16   0.000    -.0000797   -.0000575
             |
        male |
       Male  |   .0205573   .0019964    10.30   0.000     .0166406    .0244739
 1.eth_asian |  -.0230996   .0033823    -6.83   0.000    -.0297353    -.016464
1.eth_hisp~c |   .0106965   .0027172     3.94   0.000     .0053657    .0160273
 1.eth_black |  -.0145448   .0047455    -3.06   0.002     -.023855   -.0052346
 1.eth_other |  -.0005926   .0045639    -0.13   0.897    -.0095465    .0083612
             |
econ_disad~e |
Economic ..  |  -.0110348    .002131    -5.18   0.000    -.0152156    -.006854
             |
limited_en~f |
Limited E..  |  -.0355306   .0044049    -8.07   0.000    -.0441724   -.0268888
             |
    disabled |
   Disabled  |   .0305416   .0048412     6.31   0.000     .0210439    .0400394
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0650154   .0031996   -20.32   0.000    -.0712927   -.0587382
       2016  |  -.0598994   .0029428   -20.35   0.000     -.065673   -.0541259
       2017  |  -.0521117   .0031229   -16.69   0.000    -.0582385   -.0459849
       2018  |  -.0290588   .0039009    -7.45   0.000     -.036712   -.0214057
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0391388   .0015896   -24.62   0.000    -.0422573   -.0360203
       2016  |  -.0376847   .0015661   -24.06   0.000    -.0407572   -.0346123
       2017  |  -.0280402   .0016159   -17.35   0.000    -.0312105   -.0248699
       2018  |  -.0310194   .0016047   -19.33   0.000    -.0341677   -.0278711
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0105658    .000625    16.91   0.000     .0093397    .0117919
       2016  |   .0106178   .0005216    20.36   0.000     .0095946    .0116411
       2017  |   .0078287    .000566    13.83   0.000     .0067183     .008939
       2018  |   .0044934   .0010212     4.40   0.000     .0024899    .0064969
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0663398   .0031575   -21.01   0.000    -.0725345   -.0601452
       2016  |  -.0682326   .0033528   -20.35   0.000    -.0748104   -.0616547
       2017  |  -.0679897   .0034047   -19.97   0.000    -.0746694   -.0613101
       2018  |   -.058903   .0042654   -13.81   0.000    -.0672713   -.0505347
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0257419   .0020168   -12.76   0.000    -.0296986   -.0217851
       2016  |  -.0309144   .0019203   -16.10   0.000    -.0346819    -.027147
       2017  |  -.0238981   .0020209   -11.83   0.000     -.027863   -.0199333
       2018  |  -.0338178   .0016845   -20.08   0.000    -.0371225    -.030513
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090605   .0007279    12.45   0.000     .0076325    .0104885
       2016  |   .0109556   .0007781    14.08   0.000     .0094289    .0124822
       2017  |   .0085955   .0007937    10.83   0.000     .0070383    .0101527
       2018  |    .003442   .0010634     3.24   0.001     .0013558    .0055282
             |
       _cons |   .8594989   .0346222    24.83   0.000     .7915742    .9274236
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_2year_va_allenr_og_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_og_dk.ster saved
Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     397.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0841
                                                Root MSE          =     .45959

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .0315816   .0048102     6.57   0.000     .0221445    .0410187
va_enr_2ye.. |    .042489   .0063538     6.69   0.000     .0300235    .0549545
va_enr_4ye.. |  -.0386657   .0052737    -7.33   0.000    -.0490121   -.0283192
             |
        year |
       2016  |  -.0071539   .0046542    -1.54   0.125     -.016285    .0019771
       2017  |   -.037108   .0042465    -8.74   0.000    -.0454392   -.0287769
       2018  |  -.0089702   .0048446    -1.85   0.064    -.0184747    .0005342
             |
         age |  -.0000693   5.74e-06   -12.07   0.000    -.0000806    -.000058
             |
        male |
       Male  |   .0208875   .0019963    10.46   0.000     .0169709     .024804
 1.eth_asian |  -.0156995   .0038035    -4.13   0.000    -.0231615   -.0082376
1.eth_hisp~c |   .0032667    .003057     1.07   0.285    -.0027309    .0092643
 1.eth_black |  -.0232802     .00493    -4.72   0.000    -.0329524   -.0136081
 1.eth_other |   .0005023   .0046053     0.11   0.913    -.0085328    .0095374
             |
econ_disad~e |
Economic ..  |  -.0127192   .0022383    -5.68   0.000    -.0171104   -.0083279
             |
limited_en~f |
Limited E..  |  -.0325979   .0046197    -7.06   0.000    -.0416613   -.0235345
             |
    disabled |
   Disabled  |   .0321419   .0048387     6.64   0.000      .022649    .0416349
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0634376   .0032052   -19.79   0.000    -.0697259   -.0571494
       2016  |  -.0581067   .0029672   -19.58   0.000    -.0639279   -.0522855
       2017  |   -.051118   .0031774   -16.09   0.000    -.0573517   -.0448843
       2018  |  -.0286832   .0039359    -7.29   0.000     -.036405   -.0209614
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0400453   .0015892   -25.20   0.000    -.0431631   -.0369275
       2016  |  -.0384771   .0015719   -24.48   0.000    -.0415609   -.0353934
       2017  |  -.0289769   .0016208   -17.88   0.000    -.0321568    -.025797
       2018  |  -.0316566   .0016115   -19.64   0.000    -.0348182    -.028495
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |      .0106   .0006266    16.92   0.000     .0093707    .0118293
       2016  |   .0106243   .0005253    20.23   0.000     .0095938    .0116548
       2017  |   .0079337   .0005681    13.96   0.000     .0068191    .0090482
       2018  |   .0044796   .0010217     4.38   0.000     .0024752     .006484
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0665132   .0031673   -21.00   0.000    -.0727271   -.0602992
       2016  |  -.0683155   .0033915   -20.14   0.000    -.0749693   -.0616618
       2017  |   -.068356   .0034325   -19.91   0.000    -.0750902   -.0616218
       2018  |  -.0574846   .0043358   -13.26   0.000     -.065991   -.0489782
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0269435   .0020228   -13.32   0.000     -.030912   -.0229749
       2016  |  -.0320344   .0019292   -16.60   0.000    -.0358193   -.0282495
       2017  |  -.0245391    .002033   -12.07   0.000    -.0285277   -.0205506
       2018  |  -.0346037   .0016902   -20.47   0.000    -.0379198   -.0312876
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0093038   .0007298    12.75   0.000      .007872    .0107356
       2016  |   .0111698   .0007835    14.26   0.000     .0096327    .0127068
       2017  |   .0086909   .0007975    10.90   0.000     .0071263    .0102555
       2018  |    .003172   .0010599     2.99   0.003     .0010927    .0052513
             |
       _cons |   .8686147   .0351837    24.69   0.000     .7995884    .9376411
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_2year_va_allenr_acs_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_acs_dk.ster saved
Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     617.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0876
                                                Root MSE          =      .4587

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .0329625   .0046734     7.05   0.000     .0237938    .0421312
va_enr_2ye.. |   .0484309   .0064101     7.56   0.000      .035855    .0610068
va_enr_4ye.. |  -.0360112   .0052627    -6.84   0.000     -.046336   -.0256865
             |
        year |
       2016  |    -.00704   .0046373    -1.52   0.129    -.0161378    .0020579
       2017  |  -.0372377   .0042004    -8.87   0.000    -.0454784    -.028997
       2018  |  -.0090836   .0048131    -1.89   0.059    -.0185263    .0003591
             |
         age |  -.0000686   5.64e-06   -12.17   0.000    -.0000797   -.0000576
             |
        male |
       Male  |   .0205542   .0019967    10.29   0.000      .016637    .0244714
 1.eth_asian |   -.022984   .0033848    -6.79   0.000    -.0296246   -.0163434
1.eth_hisp~c |   .0107031   .0027116     3.95   0.000     .0053832     .016023
 1.eth_black |  -.0145546   .0047488    -3.06   0.002    -.0238712    -.005238
 1.eth_other |  -.0004096   .0045596    -0.09   0.928     -.009355    .0085358
             |
econ_disad~e |
Economic ..  |  -.0110021   .0021326    -5.16   0.000    -.0151861   -.0068181
             |
limited_en~f |
Limited E..  |  -.0354752   .0044102    -8.04   0.000    -.0441274    -.026823
             |
    disabled |
   Disabled  |   .0305611   .0048411     6.31   0.000     .0210634    .0400587
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   -.065002   .0032021   -20.30   0.000    -.0712841   -.0587199
       2016  |  -.0599252   .0029414   -20.37   0.000    -.0656959   -.0541545
       2017  |  -.0522121   .0031245   -16.71   0.000    -.0583421   -.0460821
       2018  |  -.0291053   .0039003    -7.46   0.000    -.0367573   -.0214534
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0391387   .0015901   -24.61   0.000    -.0422583    -.036019
       2016  |  -.0376903   .0015658   -24.07   0.000    -.0407623   -.0346184
       2017  |  -.0280415   .0016158   -17.35   0.000    -.0312116   -.0248714
       2018  |  -.0310294   .0016047   -19.34   0.000    -.0341775   -.0278812
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0105627   .0006252    16.90   0.000     .0093362    .0117893
       2016  |   .0106219   .0005215    20.37   0.000     .0095989     .011645
       2017  |   .0078382    .000566    13.85   0.000     .0067278    .0089486
       2018  |   .0045006   .0010208     4.41   0.000     .0024979    .0065033
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0663627   .0031597   -21.00   0.000    -.0725615   -.0601638
       2016  |  -.0682721   .0033547   -20.35   0.000    -.0748537   -.0616905
       2017  |   -.068024   .0034047   -19.98   0.000    -.0747037   -.0613443
       2018  |  -.0588969   .0042652   -13.81   0.000    -.0672646   -.0505292
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.025754   .0020184   -12.76   0.000    -.0297139   -.0217941
       2016  |   -.030922   .0019215   -16.09   0.000    -.0346918   -.0271522
       2017  |   -.023914   .0020215   -11.83   0.000      -.02788   -.0199481
       2018  |  -.0338122   .0016852   -20.06   0.000    -.0371183    -.030506
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090678   .0007284    12.45   0.000     .0076389    .0104968
       2016  |   .0109567   .0007786    14.07   0.000     .0094291    .0124842
       2017  |   .0086031   .0007941    10.83   0.000     .0070451    .0101611
       2018  |   .0034439   .0010637     3.24   0.001      .001357    .0055307
             |
       _cons |   .8596969   .0346071    24.84   0.000     .7918018    .9275921
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_2year_va_allenr_sib_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_sib_dk.ster saved
Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =     397.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0840
                                                Root MSE          =     .45961

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .0322531   .0049787     6.48   0.000     .0224854    .0420208
va_enr_2ye.. |    .041694   .0065023     6.41   0.000     .0289373    .0544507
va_enr_4ye.. |  -.0392694   .0053538    -7.33   0.000    -.0497728   -.0287659
             |
        year |
       2016  |  -.0071585     .00467    -1.53   0.126    -.0163205    .0020036
       2017  |  -.0371095   .0042507    -8.73   0.000    -.0454488   -.0287701
       2018  |   -.008995   .0048448    -1.86   0.064    -.0184999    .0005099
             |
         age |  -.0000693   5.74e-06   -12.08   0.000    -.0000806   -.0000581
             |
        male |
       Male  |   .0208858   .0019967    10.46   0.000     .0169686     .024803
 1.eth_asian |  -.0156817    .003791    -4.14   0.000    -.0231193   -.0082441
1.eth_hisp~c |   .0032411   .0030468     1.06   0.288    -.0027364    .0092187
 1.eth_black |  -.0233374   .0049341    -4.73   0.000    -.0330176   -.0136572
 1.eth_other |   .0006582   .0046001     0.14   0.886    -.0083667    .0096831
             |
econ_disad~e |
Economic ..  |   -.012757   .0022371    -5.70   0.000    -.0171459    -.008368
             |
limited_en~f |
Limited E..  |  -.0325507   .0046241    -7.04   0.000    -.0416227   -.0234788
             |
    disabled |
   Disabled  |   .0321914   .0048398     6.65   0.000     .0226963    .0416865
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0634133   .0032077   -19.77   0.000    -.0697066   -.0571201
       2016  |  -.0581167   .0029654   -19.60   0.000    -.0639344   -.0522991
       2017  |  -.0512094    .003179   -16.11   0.000    -.0574463   -.0449724
       2018  |  -.0287207   .0039349    -7.30   0.000    -.0364405   -.0210009
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0400415   .0015901   -25.18   0.000     -.043161    -.036922
       2016  |   -.038478   .0015716   -24.48   0.000    -.0415613   -.0353947
       2017  |  -.0289739   .0016206   -17.88   0.000    -.0321534   -.0257945
       2018  |  -.0316658   .0016114   -19.65   0.000    -.0348273   -.0285043
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0105963   .0006269    16.90   0.000     .0093665    .0118262
       2016  |    .010628   .0005252    20.24   0.000     .0095977    .0116583
       2017  |   .0079427   .0005681    13.98   0.000     .0068281    .0090573
       2018  |   .0044874   .0010212     4.39   0.000     .0024839     .006491
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0665327   .0031698   -20.99   0.000    -.0727516   -.0603139
       2016  |  -.0683498   .0033933   -20.14   0.000    -.0750072   -.0616925
       2017  |  -.0683858   .0034329   -19.92   0.000    -.0751207   -.0616509
       2018  |  -.0574701   .0043349   -13.26   0.000    -.0659747   -.0489655
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0269526   .0020246   -13.31   0.000    -.0309246   -.0229807
       2016  |  -.0320392   .0019305   -16.60   0.000    -.0358266   -.0282518
       2017  |  -.0245532   .0020337   -12.07   0.000     -.028543   -.0205634
       2018  |  -.0345905   .0016909   -20.46   0.000    -.0379079   -.0312731
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0093109   .0007304    12.75   0.000      .007878    .0107438
       2016  |   .0111706   .0007839    14.25   0.000     .0096326    .0127086
       2017  |   .0086981    .000798    10.90   0.000     .0071326    .0102636
       2018  |   .0031753   .0010602     2.99   0.003     .0010953    .0052552
             |
       _cons |   .8687315   .0351585    24.71   0.000     .7997546    .9377083
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_2year_va_allenr_both_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_allenr_both_dk.ster saved
LHS = enr_4year, RHS = All 3 enrollment outcomes
Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =    2180.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2645
                                                Root MSE          =     .41342

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .0096932   .0044904     2.16   0.031     .0008837    .0185028
~2year_og_dk |  -.0183917   .0059926    -3.07   0.002    -.0301484    -.006635
~4year_og_dk |   .0616768    .005199    11.86   0.000     .0514769    .0718766
             |
        year |
       2016  |   .0164647   .0032618     5.05   0.000     .0100655    .0228639
       2017  |   .0180077   .0036586     4.92   0.000     .0108299    .0251854
       2018  |  -.0205229   .0039462    -5.20   0.000    -.0282648   -.0127809
             |
         age |  -.0000777   5.02e-06   -15.47   0.000    -.0000875   -.0000678
             |
        male |
       Male  |   -.089562   .0017054   -52.52   0.000    -.0929079   -.0862162
 1.eth_asian |   .0740881   .0041967    17.65   0.000     .0658547    .0823214
1.eth_hisp~c |   -.030938   .0030762   -10.06   0.000    -.0369731    -.024903
 1.eth_black |   .0275188   .0052208     5.27   0.000     .0172762    .0377615
 1.eth_other |  -.0089689   .0044859    -2.00   0.046    -.0177698    -.000168
             |
econ_disad~e |
Economic ..  |  -.0429527   .0025939   -16.56   0.000    -.0480416   -.0378639
             |
limited_en~f |
Limited E..  |  -.0192284   .0027997    -6.87   0.000    -.0247211   -.0137358
             |
    disabled |
   Disabled  |  -.0541692    .003341   -16.21   0.000    -.0607239   -.0476145
             |
        year#|
          c. |
prior_ela_~e |
       2015  |    .140601   .0026848    52.37   0.000     .1353337    .1458682
       2016  |   .1274613   .0026748    47.65   0.000     .1222137    .1327089
       2017  |    .123999   .0028491    43.52   0.000     .1184094    .1295886
       2018  |   .0965977   .0035392    27.29   0.000     .0896541    .1035413
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0218401   .0011898    18.36   0.000      .019506    .0241743
       2016  |   .0160444    .001228    13.07   0.000     .0136352    .0184535
       2017  |   .0164581   .0011627    14.16   0.000      .014177    .0187392
       2018  |   .0181579   .0013025    13.94   0.000     .0156026    .0207133
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112261   .0005175   -21.69   0.000    -.0122415   -.0102108
       2016  |  -.0094597   .0004839   -19.55   0.000     -.010409   -.0085103
       2017  |  -.0096734    .000501   -19.31   0.000    -.0106562   -.0086905
       2018  |  -.0091536   .0008242   -11.11   0.000    -.0107706   -.0075365
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1201672   .0027906    43.06   0.000     .1146923    .1256421
       2016  |   .1267512   .0029045    43.64   0.000      .121053    .1324495
       2017  |   .1233881   .0030811    40.05   0.000     .1173433     .129433
       2018  |   .1423051   .0036768    38.70   0.000     .1350916    .1495186
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0157004   .0014952    10.50   0.000      .012767    .0186338
       2016  |   .0169487   .0014081    12.04   0.000     .0141862    .0197111
       2017  |   .0118371    .001517     7.80   0.000     .0088608    .0148133
       2018  |   .0311194    .001236    25.18   0.000     .0286945    .0335442
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0096127   .0006097   -15.77   0.000     -.010809   -.0084165
       2016  |   -.010296   .0006658   -15.46   0.000    -.0116022   -.0089899
       2017  |  -.0086237   .0007098   -12.15   0.000    -.0100162   -.0072312
       2018  |  -.0093886   .0008549   -10.98   0.000    -.0110658   -.0077113
             |
       _cons |   .8322837   .0302243    27.54   0.000     .7729872    .8915802
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_4year_va_allenr_og_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_og_dk.ster saved
Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =    2161.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2619
                                                Root MSE          =     .41415

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .0073802   .0048636     1.52   0.129    -.0021616    .0169219
va_enr_2ye.. |  -.0152161   .0061638    -2.47   0.014    -.0273087   -.0031234
va_enr_4ye.. |   .0602985   .0054388    11.09   0.000     .0496281    .0709689
             |
        year |
       2016  |    .016459   .0033342     4.94   0.000     .0099176    .0230004
       2017  |   .0184432   .0036755     5.02   0.000     .0112323     .025654
       2018  |  -.0205556   .0039446    -5.21   0.000    -.0282944   -.0128167
             |
         age |  -.0000757   5.27e-06   -14.38   0.000    -.0000861   -.0000654
             |
        male |
       Male  |  -.0896411   .0017083   -52.47   0.000    -.0929926   -.0862896
 1.eth_asian |   .0715637   .0047738    14.99   0.000     .0621981    .0809293
1.eth_hisp~c |  -.0296561   .0034474    -8.60   0.000    -.0364196   -.0228927
 1.eth_black |    .031465   .0053712     5.86   0.000     .0209273    .0420026
 1.eth_other |  -.0098714   .0046282    -2.13   0.033    -.0189515   -.0007914
             |
econ_disad~e |
Economic ..  |  -.0491097   .0028283   -17.36   0.000    -.0546585   -.0435608
             |
limited_en~f |
Limited E..  |  -.0201601   .0028379    -7.10   0.000    -.0257277   -.0145925
             |
    disabled |
   Disabled  |  -.0524597   .0032798   -15.99   0.000    -.0588943   -.0460251
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1408678   .0026808    52.55   0.000     .1356085    .1461272
       2016  |    .127113   .0026867    47.31   0.000      .121842     .132384
       2017  |   .1249299   .0028722    43.50   0.000     .1192949    .1305648
       2018  |   .0974265    .003577    27.24   0.000     .0904089    .1044441
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0225864    .001178    19.17   0.000     .0202753    .0248976
       2016  |   .0167299   .0012188    13.73   0.000     .0143388     .019121
       2017  |   .0172612   .0011537    14.96   0.000     .0149977    .0195246
       2018  |   .0185397   .0013017    14.24   0.000     .0159859    .0210934
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112609   .0005185   -21.72   0.000    -.0122781   -.0102436
       2016  |   -.009421   .0004848   -19.43   0.000    -.0103722   -.0084698
       2017  |  -.0098018   .0005006   -19.58   0.000     -.010784   -.0088196
       2018  |  -.0091079    .000822   -11.08   0.000    -.0107206   -.0074953
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1207143   .0027907    43.26   0.000     .1152393    .1261894
       2016  |   .1274914   .0029491    43.23   0.000     .1217057    .1332772
       2017  |   .1240384   .0030881    40.17   0.000     .1179799     .130097
       2018  |   .1418121   .0037484    37.83   0.000     .1344581    .1491661
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0166571   .0014992    11.11   0.000     .0137158    .0195984
       2016  |   .0177735   .0014107    12.60   0.000     .0150058    .0205412
       2017  |   .0124334   .0015169     8.20   0.000     .0094574    .0154094
       2018  |   .0321418   .0012426    25.87   0.000     .0297039    .0345798
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097436   .0006106   -15.96   0.000    -.0109415   -.0085457
       2016  |  -.0104076   .0006688   -15.56   0.000    -.0117196   -.0090955
       2017  |  -.0086588   .0007115   -12.17   0.000    -.0100548   -.0072629
       2018  |  -.0089878   .0008477   -10.60   0.000    -.0106508   -.0073247
             |
       _cons |   .8213729   .0312352    26.30   0.000     .7600929    .8826528
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_4year_va_allenr_acs_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_acs_dk.ster saved
Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =    2207.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2644
                                                Root MSE          =     .41345

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .0086837   .0046866     1.85   0.064    -.0005109    .0178784
va_enr_2ye.. |  -.0176645   .0061804    -2.86   0.004    -.0297897   -.0055393
va_enr_4ye.. |   .0623071   .0053205    11.71   0.000     .0518689    .0727452
             |
        year |
       2016  |   .0164096   .0032793     5.00   0.000      .009976    .0228432
       2017  |   .0179923   .0036639     4.91   0.000     .0108041    .0251804
       2018  |  -.0205416   .0039475    -5.20   0.000    -.0282862    -.012797
             |
         age |  -.0000775   5.03e-06   -15.43   0.000    -.0000874   -.0000677
             |
        male |
       Male  |  -.0895624   .0017054   -52.52   0.000    -.0929082   -.0862165
 1.eth_asian |   .0739244   .0041913    17.64   0.000     .0657015    .0821472
1.eth_hisp~c |  -.0308985   .0030772   -10.04   0.000    -.0369357   -.0248613
 1.eth_black |   .0274829    .005235     5.25   0.000     .0172125    .0377534
 1.eth_other |  -.0091941   .0044734    -2.06   0.040    -.0179703   -.0004178
             |
econ_disad~e |
Economic ..  |  -.0428143   .0025989   -16.47   0.000     -.047913   -.0377156
             |
limited_en~f |
Limited E..  |  -.0192101   .0028082    -6.84   0.000    -.0247195   -.0137008
             |
    disabled |
   Disabled  |  -.0542821   .0033448   -16.23   0.000    -.0608442   -.0477199
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1405729   .0026865    52.33   0.000     .1353023    .1458435
       2016  |   .1274329   .0026735    47.67   0.000     .1221879     .132678
       2017  |   .1240735   .0028516    43.51   0.000      .118479    .1296681
       2018  |   .0966588   .0035404    27.30   0.000      .089713    .1036047
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0218291   .0011885    18.37   0.000     .0194974    .0241608
       2016  |     .01602   .0012291    13.03   0.000     .0136086    .0184315
       2017  |   .0164463   .0011635    14.14   0.000     .0141636    .0187289
       2018  |   .0181696   .0013033    13.94   0.000     .0156127    .0207264
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112224   .0005172   -21.70   0.000    -.0122371   -.0102078
       2016  |  -.0094592   .0004843   -19.53   0.000    -.0104094   -.0085089
       2017  |  -.0096833   .0005011   -19.32   0.000    -.0106665   -.0087002
       2018  |  -.0091658   .0008244   -11.12   0.000    -.0107831   -.0075484
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1201987   .0027946    43.01   0.000      .114716    .1256814
       2016  |   .1268145   .0029096    43.59   0.000     .1211063    .1325227
       2017  |   .1234526   .0030811    40.07   0.000     .1174077    .1294974
       2018  |   .1422836   .0036753    38.71   0.000      .135073    .1494941
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0156874   .0014971    10.48   0.000     .0127502    .0186245
       2016  |   .0169508   .0014088    12.03   0.000      .014187    .0197147
       2017  |   .0118265   .0015166     7.80   0.000     .0088512    .0148018
       2018  |   .0310656   .0012373    25.11   0.000     .0286382     .033493
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0096188   .0006101   -15.77   0.000    -.0108157   -.0084219
       2016  |   -.010304    .000666   -15.47   0.000    -.0116106   -.0089974
       2017  |  -.0086297   .0007101   -12.15   0.000    -.0100229   -.0072365
       2018  |   -.009409   .0008554   -11.00   0.000    -.0110872   -.0077309
             |
       _cons |   .8314392    .030251    27.48   0.000     .7720901    .8907882
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_4year_va_allenr_sib_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_sib_dk.ster saved
Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,867
                                                F(39, 1237)       =    2173.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2619
                                                Root MSE          =     .41417

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .0065987   .0050642     1.30   0.193    -.0033367    .0165341
va_enr_2ye.. |  -.0147363   .0063676    -2.31   0.021    -.0272287   -.0022439
va_enr_4ye.. |   .0607689   .0055632    10.92   0.000     .0498546    .0716832
             |
        year |
       2016  |   .0164068   .0033528     4.89   0.000      .009829    .0229847
       2017  |   .0184142   .0036796     5.00   0.000     .0111951    .0256332
       2018  |  -.0205802   .0039472    -5.21   0.000    -.0283242   -.0128362
             |
         age |  -.0000756   5.27e-06   -14.35   0.000     -.000086   -.0000653
             |
        male |
       Male  |  -.0896425   .0017082   -52.48   0.000    -.0929938   -.0862911
 1.eth_asian |   .0715737   .0047489    15.07   0.000     .0622571    .0808904
1.eth_hisp~c |  -.0296156   .0034438    -8.60   0.000    -.0363719   -.0228594
 1.eth_black |   .0314945   .0053806     5.85   0.000     .0209383    .0420507
 1.eth_other |  -.0100424   .0046146    -2.18   0.030    -.0190957   -.0009891
             |
econ_disad~e |
Economic ..  |  -.0489077   .0028278   -17.30   0.000    -.0544555   -.0433598
             |
limited_en~f |
Limited E..  |  -.0201291   .0028457    -7.07   0.000     -.025712   -.0145462
             |
    disabled |
   Disabled  |   -.052583   .0032836   -16.01   0.000    -.0590251   -.0461409
             |
        year#|
          c. |
prior_ela_~e |
       2015  |    .140838   .0026823    52.51   0.000     .1355757    .1461003
       2016  |   .1270731   .0026844    47.34   0.000     .1218066    .1323395
       2017  |   .1250052   .0028742    43.49   0.000     .1193664    .1306441
       2018  |   .0974728   .0035773    27.25   0.000     .0904545    .1044911
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0225716   .0011771    19.18   0.000     .0202622     .024881
       2016  |   .0167013     .00122    13.69   0.000     .0143078    .0190947
       2017  |   .0172459   .0011543    14.94   0.000     .0149812    .0195105
       2018  |   .0185488   .0013024    14.24   0.000     .0159935     .021104
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112569   .0005182   -21.72   0.000    -.0122735   -.0102403
       2016  |  -.0094202   .0004852   -19.41   0.000    -.0103721   -.0084682
       2017  |  -.0098115   .0005008   -19.59   0.000     -.010794   -.0088289
       2018  |    -.00912   .0008221   -11.09   0.000     -.010733   -.0075071
             |
        year#|
          c. |
prior_math~e |
       2015  |    .120741    .002795    43.20   0.000     .1152574    .1262245
       2016  |   .1275501   .0029536    43.19   0.000     .1217555    .1333446
       2017  |   .1240915   .0030884    40.18   0.000     .1180324    .1301506
       2018  |   .1417863   .0037458    37.85   0.000     .1344376     .149135
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0166433   .0015009    11.09   0.000     .0136988    .0195879
       2016  |   .0177735   .0014114    12.59   0.000     .0150045    .0205424
       2017  |   .0124235   .0015164     8.19   0.000     .0094486    .0153985
       2018  |   .0320865   .0012435    25.80   0.000     .0296469    .0345262
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097491   .0006109   -15.96   0.000    -.0109476   -.0085506
       2016  |  -.0104149    .000669   -15.57   0.000    -.0117273   -.0091024
       2017  |  -.0086641   .0007118   -12.17   0.000    -.0100607   -.0072676
       2018  |  -.0090062   .0008477   -10.62   0.000    -.0106693   -.0073431
             |
       _cons |   .8206823   .0312452    26.27   0.000     .7593828    .8819817
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_4year_va_allenr_both_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_allenr_both_dk.ster saved

. 
. 
. ********** regress enrollment outcomes on deep knowledge VA, matching outcome
> s on LHS and RHS
. /* no tfx, no peer effects */
. 
. foreach outcome in enr enr_2year enr_4year {
  2.   di "LHS = `outcome'"
  3. 
.   foreach control in og acs sib both {
  4.         di "RHS: Deep Knowledge VA with `control' controls"
  5. 
.         reg `outcome' va_`outcome'_`control'_dk ///
>           i.year ///
>           `school_controls' ///
>           `demographic_controls' ///
>           `ela_score_controls' ///
>           `math_score_controls' ///
>           if touse_`outcome'_dk==1 ///
>           , cluster(school_id)
  6.         //add mean of yvar to stored results
.         estadd ysumm, mean
  7.         estimates save $vaprojdir/estimates/sib_acs_restr_smp/persistence/
> reg_`outcome'_va_`outcome'_`control'_dk.ster, replace
  8.   }
  9. }
LHS = enr
RHS: Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =     722.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1374
                                                Root MSE          =     .41334

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .0640333   .0015591    41.07   0.000     .0609746    .0670921
             |
        year |
       2016  |   .0100099   .0041614     2.41   0.016     .0018457    .0181742
       2017  |  -.0182992   .0038949    -4.70   0.000    -.0259406   -.0106579
       2018  |  -.0284159   .0044082    -6.45   0.000    -.0370643   -.0197674
             |
         age |  -.0001466   5.70e-06   -25.72   0.000    -.0001578   -.0001354
             |
        male |
       Male  |  -.0689883   .0019249   -35.84   0.000    -.0727648   -.0652118
 1.eth_asian |   .0509729   .0032897    15.49   0.000     .0445189     .057427
1.eth_hisp~c |  -.0198775   .0027749    -7.16   0.000    -.0253216   -.0144335
 1.eth_black |    .013201   .0048513     2.72   0.007     .0036833    .0227188
 1.eth_other |  -.0095738   .0038776    -2.47   0.014    -.0171812   -.0019663
             |
econ_disad~e |
Economic ..  |  -.0540283   .0021596   -25.02   0.000    -.0582652   -.0497914
             |
limited_en~f |
Limited E..  |  -.0547812   .0044246   -12.38   0.000    -.0634619   -.0461006
             |
    disabled |
   Disabled  |  -.0237535   .0042046    -5.65   0.000    -.0320025   -.0155046
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0762519   .0028689    26.58   0.000     .0706235    .0818804
       2016  |   .0668622   .0026724    25.02   0.000     .0616192    .0721052
       2017  |   .0725925   .0028611    25.37   0.000     .0669792    .0782057
       2018  |   .0676843   .0037434    18.08   0.000     .0603402    .0750283
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0172299   .0015275   -11.28   0.000    -.0202268   -.0142331
       2016  |  -.0218662   .0014007   -15.61   0.000    -.0246141   -.0191183
       2017  |  -.0114939   .0015455    -7.44   0.000    -.0145259   -.0084618
       2018  |  -.0128111   .0015408    -8.31   0.000     -.015834   -.0097882
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006951   .0005828    -1.19   0.233    -.0018384    .0004483
       2016  |   .0012447   .0005197     2.39   0.017      .000225    .0022643
       2017  |  -.0019079   .0005315    -3.59   0.000    -.0029508   -.0008651
       2018  |   -.004685   .0009237    -5.07   0.000    -.0064972   -.0028729
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538043   .0025809    20.85   0.000     .0487408    .0588677
       2016  |   .0585737   .0026491    22.11   0.000     .0533765    .0637709
       2017  |   .0553817   .0028332    19.55   0.000     .0498232    .0609401
       2018  |   .0830365    .003807    21.81   0.000     .0755676    .0905054
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0099892   .0018665    -5.35   0.000     -.013651   -.0063273
       2016  |  -.0140022   .0016739    -8.36   0.000    -.0172863   -.0107181
       2017  |  -.0121089   .0018913    -6.40   0.000    -.0158194   -.0083984
       2018  |  -.0028666   .0015916    -1.80   0.072     -.005989    .0002559
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.000556    .000656    -0.85   0.397    -.0018429    .0007309
       2016  |   .0006448   .0006776     0.95   0.342    -.0006846    .0019741
       2017  |   3.40e-06   .0007051     0.00   0.996    -.0013799    .0013867
       2018  |   -.005981   .0009379    -6.38   0.000    -.0078209    -.004141
             |
       _cons |   1.693056   .0341093    49.64   0.000     1.626138    1.759975
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_va_enr_og_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_enr_og_dk.ster saved
RHS: Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =     643.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1355
                                                Root MSE          =      .4138

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .0592362   .0016807    35.25   0.000     .0559389    .0625335
             |
        year |
       2016  |   .0097569   .0041503     2.35   0.019     .0016144    .0178994
       2017  |  -.0180047   .0038634    -4.66   0.000    -.0255843    -.010425
       2018  |  -.0286277   .0043741    -6.54   0.000    -.0372092   -.0200463
             |
         age |  -.0001453   5.78e-06   -25.13   0.000    -.0001567    -.000134
             |
        male |
       Male  |  -.0687405   .0019311   -35.60   0.000     -.072529   -.0649519
 1.eth_asian |   .0559515   .0036854    15.18   0.000     .0487212    .0631817
1.eth_hisp~c |  -.0262318   .0028998    -9.05   0.000    -.0319209   -.0205428
 1.eth_black |   .0082077   .0049535     1.66   0.098    -.0015104    .0179259
 1.eth_other |  -.0093002   .0039572    -2.35   0.019    -.0170637   -.0015367
             |
econ_disad~e |
Economic ..  |  -.0619317   .0022596   -27.41   0.000    -.0663647   -.0574987
             |
limited_en~f |
Limited E..  |  -.0526831   .0045361   -11.61   0.000    -.0615824   -.0437838
             |
    disabled |
   Disabled  |  -.0205655   .0042629    -4.82   0.000    -.0289288   -.0122021
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0779339   .0028594    27.26   0.000     .0723241    .0835436
       2016  |   .0683882   .0026761    25.56   0.000      .063138    .0736384
       2017  |   .0743911   .0028701    25.92   0.000     .0687604    .0800219
       2018  |   .0688321   .0037425    18.39   0.000     .0614897    .0761745
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174424   .0015356   -11.36   0.000    -.0204551   -.0144298
       2016  |  -.0219624   .0014037   -15.65   0.000    -.0247163   -.0192084
       2017  |  -.0116679   .0015486    -7.53   0.000     -.014706   -.0086298
       2018  |  -.0130931    .001544    -8.48   0.000    -.0161222   -.0100639
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.000682   .0005831    -1.17   0.242     -.001826     .000462
       2016  |    .001274   .0005248     2.43   0.015     .0002445    .0023036
       2017  |  -.0019162   .0005332    -3.59   0.000    -.0029622   -.0008702
       2018  |  -.0046545   .0009258    -5.03   0.000    -.0064709   -.0028381
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0541658   .0025842    20.96   0.000      .049096    .0592356
       2016  |   .0591894   .0026633    22.22   0.000     .0539644    .0644144
       2017  |   .0556648   .0028429    19.58   0.000     .0500873    .0612422
       2018  |   .0839781   .0038181    22.00   0.000     .0764875    .0914687
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.010283   .0018708    -5.50   0.000    -.0139533   -.0066126
       2016  |  -.0143056   .0016795    -8.52   0.000    -.0176007   -.0110106
       2017  |  -.0121541   .0018955    -6.41   0.000    -.0158728   -.0084354
       2018  |  -.0026198   .0015916    -1.65   0.100    -.0057423    .0005027
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004379   .0006561    -0.67   0.505    -.0017251    .0008493
       2016  |   .0007592   .0006799     1.12   0.264    -.0005746     .002093
       2017  |   .0000694   .0007064     0.10   0.922    -.0013166    .0014554
       2018  |  -.0058433   .0009396    -6.22   0.000    -.0076866       -.004
             |
       _cons |   1.691422   .0344733    49.06   0.000     1.623789    1.759055
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_va_enr_acs_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_enr_acs_dk.ster saved
RHS: Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =     725.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1374
                                                Root MSE          =     .41334

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .0640484   .0015645    40.94   0.000     .0609791    .0671177
             |
        year |
       2016  |    .009941   .0041644     2.39   0.017     .0017709    .0181111
       2017  |  -.0183474   .0038957    -4.71   0.000    -.0259902   -.0107045
       2018  |   -.028492   .0044099    -6.46   0.000    -.0371437   -.0198403
             |
         age |  -.0001465   5.71e-06   -25.66   0.000    -.0001577   -.0001353
             |
        male |
       Male  |  -.0689942   .0019245   -35.85   0.000    -.0727699   -.0652186
 1.eth_asian |   .0508912   .0032891    15.47   0.000     .0444383     .057344
1.eth_hisp~c |  -.0198101   .0027708    -7.15   0.000    -.0252462    -.014374
 1.eth_black |   .0132066   .0048502     2.72   0.007     .0036911    .0227221
 1.eth_other |   -.009626    .003876    -2.48   0.013    -.0172303   -.0020217
             |
econ_disad~e |
Economic ..  |  -.0538456   .0021605   -24.92   0.000    -.0580843   -.0496069
             |
limited_en~f |
Limited E..  |  -.0547424   .0044281   -12.36   0.000    -.0634299    -.046055
             |
    disabled |
   Disabled  |  -.0238158   .0042028    -5.67   0.000    -.0320612   -.0155704
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0762273   .0028711    26.55   0.000     .0705945    .0818601
       2016  |   .0668258    .002673    25.00   0.000     .0615816    .0720699
       2017  |   .0725468   .0028601    25.37   0.000     .0669356     .078158
       2018  |    .067685   .0037441    18.08   0.000     .0603395    .0750304
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0172334   .0015275   -11.28   0.000    -.0202302   -.0142365
       2016  |  -.0218781   .0014007   -15.62   0.000    -.0246262   -.0191301
       2017  |  -.0114962   .0015449    -7.44   0.000    -.0145272   -.0084652
       2018  |  -.0128031   .0015403    -8.31   0.000    -.0158249   -.0097812
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006965   .0005827    -1.20   0.232    -.0018397    .0004467
       2016  |   .0012456   .0005197     2.40   0.017     .0002259    .0022652
       2017  |  -.0019091   .0005314    -3.59   0.000    -.0029516   -.0008667
       2018  |  -.0046865   .0009234    -5.08   0.000    -.0064982   -.0028749
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0538173   .0025835    20.83   0.000     .0487489    .0588858
       2016  |   .0586083    .002651    22.11   0.000     .0534073    .0638093
       2017  |   .0554024    .002834    19.55   0.000     .0498423    .0609624
       2018  |   .0830455   .0038073    21.81   0.000     .0755761    .0905149
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100046   .0018671    -5.36   0.000    -.0136676   -.0063417
       2016  |  -.0139971   .0016738    -8.36   0.000    -.0172808   -.0107134
       2017  |  -.0121273   .0018919    -6.41   0.000     -.015839   -.0084157
       2018  |  -.0028939   .0015918    -1.82   0.069    -.0060169    .0002291
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0005571    .000656    -0.85   0.396    -.0018441    .0007299
       2016  |   .0006359   .0006776     0.94   0.348    -.0006935    .0019653
       2017  |   1.38e-06   .0007054     0.00   0.998    -.0013825    .0013853
       2018  |  -.0059959   .0009379    -6.39   0.000     -.007836   -.0041558
             |
       _cons |   1.692229   .0341489    49.55   0.000     1.625233    1.759225
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_va_enr_sib_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_enr_sib_dk.ster saved
RHS: Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =     646.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1355
                                                Root MSE          =      .4138

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   .0592505   .0016791    35.29   0.000     .0559564    .0625446
             |
        year |
       2016  |   .0096913   .0041545     2.33   0.020     .0015406     .017842
       2017  |  -.0180543   .0038644    -4.67   0.000    -.0256358   -.0104729
       2018  |  -.0287034   .0043765    -6.56   0.000    -.0372896   -.0201173
             |
         age |  -.0001452   5.79e-06   -25.08   0.000    -.0001566   -.0001339
             |
        male |
       Male  |  -.0687459   .0019307   -35.61   0.000    -.0725336   -.0649581
 1.eth_asian |   .0559563   .0036802    15.20   0.000     .0487362    .0631764
1.eth_hisp~c |  -.0262037   .0028954    -9.05   0.000    -.0318842   -.0205232
 1.eth_black |   .0082113   .0049527     1.66   0.098    -.0015053     .017928
 1.eth_other |  -.0093264   .0039561    -2.36   0.019    -.0170878   -.0015651
             |
econ_disad~e |
Economic ..  |  -.0617315   .0022584   -27.33   0.000    -.0661622   -.0573007
             |
limited_en~f |
Limited E..  |  -.0526336   .0045399   -11.59   0.000    -.0615404   -.0437267
             |
    disabled |
   Disabled  |  -.0206158   .0042612    -4.84   0.000    -.0289758   -.0122558
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0779148   .0028614    27.23   0.000     .0723011    .0835284
       2016  |   .0683596   .0026765    25.54   0.000     .0631087    .0736105
       2017  |   .0743537   .0028694    25.91   0.000     .0687243     .079983
       2018  |   .0688271   .0037431    18.39   0.000     .0614836    .0761706
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0174488   .0015356   -11.36   0.000    -.0204614   -.0144362
       2016  |  -.0219759   .0014038   -15.65   0.000      -.02473   -.0192217
       2017  |   -.011674    .001548    -7.54   0.000    -.0147111    -.008637
       2018  |  -.0130889   .0015435    -8.48   0.000    -.0161171   -.0100608
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0006834    .000583    -1.17   0.241    -.0018272    .0004605
       2016  |   .0012748   .0005247     2.43   0.015     .0002453    .0023043
       2017  |  -.0019172    .000533    -3.60   0.000    -.0029629   -.0008715
       2018  |  -.0046559   .0009257    -5.03   0.000    -.0064719   -.0028399
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0541759   .0025867    20.94   0.000      .049101    .0592507
       2016  |   .0592217    .002665    22.22   0.000     .0539933    .0644501
       2017  |    .055679   .0028437    19.58   0.000     .0501001     .061258
       2018  |   .0839916   .0038182    22.00   0.000     .0765008    .0914824
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0103003   .0018714    -5.50   0.000    -.0139717   -.0066289
       2016  |  -.0143033   .0016793    -8.52   0.000    -.0175979   -.0110087
       2017  |  -.0121727   .0018961    -6.42   0.000    -.0158926   -.0084528
       2018  |  -.0026477   .0015917    -1.66   0.096    -.0057704     .000475
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004381   .0006561    -0.67   0.504    -.0017253    .0008492
       2016  |   .0007511   .0006799     1.10   0.269    -.0005827    .0020849
       2017  |   .0000677   .0007067     0.10   0.924    -.0013189    .0014542
       2018  |   -.005857   .0009394    -6.23   0.000    -.0077001    -.004014
             |
       _cons |    1.69068   .0345034    49.00   0.000     1.622989    1.758372
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_va_enr_both_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_va_enr_both_dk.ster saved
LHS = enr_2year
RHS: Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =     562.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0873
                                                Root MSE          =      .4588

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
~2year_og_dk |   .0910003   .0008763   103.85   0.000     .0892812    .0927195
             |
        year |
       2016  |  -.0078915     .00483    -1.63   0.103    -.0173673    .0015844
       2017  |    -.03836   .0039775    -9.64   0.000    -.0461633   -.0305567
       2018  |  -.0106274    .004892    -2.17   0.030    -.0202249   -.0010299
             |
         age |  -.0000682   5.66e-06   -12.04   0.000    -.0000793   -.0000571
             |
        male |
       Male  |   .0205786   .0020004    10.29   0.000      .016654    .0245032
 1.eth_asian |  -.0229088   .0034006    -6.74   0.000    -.0295803   -.0162373
1.eth_hisp~c |   .0098207    .002732     3.59   0.000     .0044608    .0151806
 1.eth_black |  -.0153627     .00475    -3.23   0.001    -.0246816   -.0060437
 1.eth_other |  -.0006742   .0045542    -0.15   0.882     -.009609    .0082605
             |
econ_disad~e |
Economic ..  |  -.0115448   .0021244    -5.43   0.000    -.0157127   -.0073769
             |
limited_en~f |
Limited E..  |  -.0353317   .0044258    -7.98   0.000    -.0440146   -.0266488
             |
    disabled |
   Disabled  |   .0309276   .0048513     6.38   0.000       .02141    .0404452
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0657204   .0032238   -20.39   0.000    -.0720451   -.0593956
       2016  |  -.0587514   .0029535   -19.89   0.000     -.064546   -.0529569
       2017  |  -.0530033   .0031346   -16.91   0.000    -.0591531   -.0468535
       2018  |  -.0291143   .0039167    -7.43   0.000    -.0367985   -.0214302
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0392686   .0015993   -24.55   0.000    -.0424062    -.036131
       2016  |  -.0374093    .001572   -23.80   0.000    -.0404934   -.0343251
       2017  |  -.0281759    .001618   -17.41   0.000    -.0313502   -.0250015
       2018  |  -.0311023    .001608   -19.34   0.000     -.034257   -.0279476
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0106163   .0006274    16.92   0.000     .0093854    .0118473
       2016  |   .0105001   .0005227    20.09   0.000     .0094747    .0115256
       2017  |   .0079165   .0005672    13.96   0.000     .0068038    .0090293
       2018  |   .0045216   .0010219     4.42   0.000     .0025167    .0065264
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0662066   .0031742   -20.86   0.000     -.072434   -.0599792
       2016  |  -.0681374   .0033487   -20.35   0.000    -.0747072   -.0615676
       2017  |  -.0678596   .0034074   -19.92   0.000    -.0745446   -.0611746
       2018  |  -.0581843   .0042879   -13.57   0.000    -.0665968   -.0497719
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.025881   .0020215   -12.80   0.000    -.0298469   -.0219151
       2016  |  -.0309219   .0019215   -16.09   0.000    -.0346916   -.0271522
       2017  |  -.0238663   .0020188   -11.82   0.000    -.0278269   -.0199056
       2018  |  -.0335876   .0016852   -19.93   0.000    -.0368937   -.0302814
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090701   .0007294    12.44   0.000     .0076391    .0105011
       2016  |    .010975   .0007775    14.12   0.000     .0094496    .0125005
       2017  |   .0085474   .0007944    10.76   0.000      .006989    .0101059
       2018  |   .0034527   .0010654     3.24   0.001     .0013624     .005543
             |
       _cons |   .8584926   .0347563    24.70   0.000     .7903048    .9266803
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_2year_va_enr_2year_og_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_enr_2year_og_dk.ster saved
RHS: Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =     408.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0836
                                                Root MSE          =     .45972

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye.. |   .0850129   .0012806    66.39   0.000     .0825006    .0875252
             |
        year |
       2016  |  -.0079027   .0048745    -1.62   0.105    -.0174659    .0016604
       2017  |  -.0383448   .0040252    -9.53   0.000    -.0462418   -.0304478
       2018  |  -.0105928   .0049225    -2.15   0.032    -.0202502   -.0009354
             |
         age |  -.0000689   5.76e-06   -11.96   0.000    -.0000802   -.0000576
             |
        male |
       Male  |    .020873   .0020004    10.43   0.000     .0169484    .0247977
 1.eth_asian |  -.0154899   .0038236    -4.05   0.000    -.0229913   -.0079884
1.eth_hisp~c |   .0025866   .0030941     0.84   0.403    -.0034837    .0086569
 1.eth_black |   -.023718   .0049405    -4.80   0.000    -.0334107   -.0140253
 1.eth_other |   .0006812   .0046034     0.15   0.882    -.0083502    .0097126
             |
econ_disad~e |
Economic ..  |  -.0129351   .0022487    -5.75   0.000    -.0173468   -.0085234
             |
limited_en~f |
Limited E..  |  -.0324273   .0046047    -7.04   0.000    -.0414613   -.0233934
             |
    disabled |
   Disabled  |   .0322151   .0048319     6.67   0.000     .0227355    .0416946
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0643127   .0032265   -19.93   0.000    -.0706426   -.0579828
       2016  |  -.0572026   .0029785   -19.21   0.000     -.063046   -.0513591
       2017  |  -.0521275   .0031896   -16.34   0.000    -.0583851   -.0458698
       2018  |  -.0288623   .0039614    -7.29   0.000    -.0366341   -.0210906
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0401533   .0015932   -25.20   0.000    -.0432789   -.0370277
       2016  |  -.0382327   .0015771   -24.24   0.000    -.0413268   -.0351385
       2017  |  -.0291905   .0016211   -18.01   0.000    -.0323708   -.0260102
       2018  |  -.0317304   .0016149   -19.65   0.000    -.0348986   -.0285622
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0106541   .0006281    16.96   0.000     .0094218    .0118864
       2016  |   .0105213   .0005262    20.00   0.000      .009489    .0115536
       2017  |   .0080382   .0005687    14.14   0.000     .0069225    .0091538
       2018  |   .0045177   .0010228     4.42   0.000      .002511    .0065244
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0665814   .0031787   -20.95   0.000    -.0728177   -.0603451
       2016  |  -.0684742   .0033925   -20.18   0.000    -.0751299   -.0618185
       2017  |  -.0684019   .0034308   -19.94   0.000    -.0751329    -.061671
       2018  |  -.0571885    .004363   -13.11   0.000    -.0657483   -.0486287
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0270212   .0020226   -13.36   0.000    -.0309893   -.0230531
       2016  |  -.0319929   .0019283   -16.59   0.000     -.035776   -.0282099
       2017  |  -.0245149     .00203   -12.08   0.000    -.0284975   -.0205324
       2018  |  -.0344339   .0016915   -20.36   0.000    -.0377523   -.0311154
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0093307     .00073    12.78   0.000     .0078984    .0107629
       2016  |   .0112067    .000782    14.33   0.000     .0096725    .0127408
       2017  |   .0086713   .0007976    10.87   0.000     .0071065    .0102362
       2018  |   .0032373   .0010632     3.04   0.002     .0011515    .0053231
             |
       _cons |   .8672933   .0352889    24.58   0.000     .7980606     .936526
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_2year_va_enr_2year_acs_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_enr_2year_acs_dk.ster saved
RHS: Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =     555.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0872
                                                Root MSE          =     .45882

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye.. |   .0909203   .0008863   102.59   0.000     .0891815     .092659
             |
        year |
       2016  |  -.0078865   .0048425    -1.63   0.104    -.0173869    .0016139
       2017  |   -.038379   .0039739    -9.66   0.000    -.0461752   -.0305827
       2018  |  -.0106357   .0048859    -2.18   0.030    -.0202212   -.0010502
             |
         age |  -.0000682   5.66e-06   -12.06   0.000    -.0000793   -.0000571
             |
        male |
       Male  |   .0205704   .0020005    10.28   0.000     .0166457    .0244951
 1.eth_asian |  -.0227944   .0034064    -6.69   0.000    -.0294774   -.0161114
1.eth_hisp~c |   .0098764    .002729     3.62   0.000     .0045224    .0152304
 1.eth_black |  -.0153287    .004753    -3.23   0.001    -.0246535   -.0060039
 1.eth_other |  -.0004698   .0045517    -0.10   0.918    -.0093998    .0084601
             |
econ_disad~e |
Economic ..  |  -.0114313   .0021269    -5.37   0.000    -.0156041   -.0072585
             |
limited_en~f |
Limited E..  |  -.0352739   .0044268    -7.97   0.000    -.0439588    -.026589
             |
    disabled |
   Disabled  |   .0308877   .0048491     6.37   0.000     .0213744     .040401
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0657427   .0032262   -20.38   0.000    -.0720723   -.0594132
       2016  |  -.0588166   .0029519   -19.92   0.000     -.064608   -.0530253
       2017  |  -.0530994   .0031365   -16.93   0.000    -.0592528   -.0469461
       2018  |  -.0291681   .0039158    -7.45   0.000    -.0368505   -.0214858
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0392684   .0015992   -24.56   0.000    -.0424058   -.0361309
       2016  |  -.0374219   .0015711   -23.82   0.000    -.0405042   -.0343397
       2017  |  -.0281836   .0016178   -17.42   0.000    -.0313576   -.0250096
       2018  |  -.0311176    .001608   -19.35   0.000    -.0342723   -.0279629
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0106155   .0006276    16.91   0.000     .0093842    .0118468
       2016  |   .0105068   .0005225    20.11   0.000     .0094816     .011532
       2017  |    .007927   .0005672    13.98   0.000     .0068142    .0090397
       2018  |    .004526   .0010215     4.43   0.000     .0025219    .0065301
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0662479   .0031755   -20.86   0.000    -.0724778    -.060018
       2016  |  -.0682188   .0033503   -20.36   0.000    -.0747917   -.0616458
       2017  |  -.0678965   .0034069   -19.93   0.000    -.0745804   -.0612126
       2018  |  -.0582349   .0042886   -13.58   0.000    -.0666486   -.0498212
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0258892   .0020222   -12.80   0.000    -.0298565   -.0219219
       2016  |  -.0309293   .0019228   -16.09   0.000    -.0347016   -.0271569
       2017  |  -.0238815   .0020194   -11.83   0.000    -.0278433   -.0199197
       2018  |  -.0335994   .0016856   -19.93   0.000    -.0369064   -.0302924
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090784   .0007298    12.44   0.000     .0076468    .0105101
       2016  |   .0109781    .000778    14.11   0.000     .0094517    .0125046
       2017  |   .0085585   .0007948    10.77   0.000     .0069992    .0101178
       2018  |   .0034578    .001066     3.24   0.001     .0013664    .0055492
             |
       _cons |   .8587341   .0347272    24.73   0.000     .7906034    .9268649
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_2year_va_enr_2year_sib_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_enr_2year_sib_dk.ster saved
RHS: Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =     406.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0835
                                                Root MSE          =     .45974

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye.. |   .0848983   .0012874    65.95   0.000     .0823726     .087424
             |
        year |
       2016  |   -.007902   .0048862    -1.62   0.106    -.0174882    .0016842
       2017  |  -.0383578   .0040234    -9.53   0.000    -.0462512   -.0304643
       2018  |  -.0106102   .0049155    -2.16   0.031    -.0202538   -.0009667
             |
         age |  -.0000689   5.75e-06   -11.97   0.000    -.0000802   -.0000576
             |
        male |
       Male  |   .0208676   .0020006    10.43   0.000     .0169427    .0247925
 1.eth_asian |  -.0154441   .0038156    -4.05   0.000    -.0229299   -.0079584
1.eth_hisp~c |   .0025765   .0030879     0.83   0.404    -.0034816    .0086345
 1.eth_black |  -.0237494   .0049458    -4.80   0.000    -.0334525   -.0140462
 1.eth_other |   .0008527   .0046011     0.19   0.853     -.008174    .0098794
             |
econ_disad~e |
Economic ..  |  -.0129512   .0022489    -5.76   0.000    -.0173632   -.0085392
             |
limited_en~f |
Limited E..  |  -.0323603   .0046049    -7.03   0.000    -.0413945   -.0233261
             |
    disabled |
   Disabled  |     .03222   .0048316     6.67   0.000      .022741    .0416991
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0643128   .0032287   -19.92   0.000    -.0706471   -.0579785
       2016  |  -.0572504   .0029767   -19.23   0.000    -.0630903   -.0514104
       2017  |  -.0521987   .0031914   -16.36   0.000    -.0584598   -.0459376
       2018  |  -.0288954   .0039603    -7.30   0.000     -.036665   -.0211258
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0401505   .0015933   -25.20   0.000    -.0432763   -.0370246
       2016  |  -.0382443   .0015761   -24.26   0.000    -.0413364   -.0351521
       2017  |  -.0291943   .0016209   -18.01   0.000    -.0323743   -.0260144
       2018  |  -.0317449   .0016148   -19.66   0.000     -.034913   -.0285768
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    .010653   .0006283    16.95   0.000     .0094203    .0118857
       2016  |   .0105285    .000526    20.02   0.000     .0094966    .0115605
       2017  |   .0080476   .0005687    14.15   0.000     .0069319    .0091632
       2018  |   .0045225   .0010224     4.42   0.000     .0025166    .0065284
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0666157   .0031804   -20.95   0.000    -.0728554   -.0603761
       2016  |   -.068542   .0033939   -20.20   0.000    -.0752005   -.0618835
       2017  |  -.0684291   .0034309   -19.95   0.000      -.07516   -.0616981
       2018  |  -.0572304   .0043631   -13.12   0.000    -.0657902   -.0486705
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0270271   .0020233   -13.36   0.000    -.0309967   -.0230576
       2016  |  -.0319976   .0019295   -16.58   0.000    -.0357831    -.028212
       2017  |  -.0245288   .0020307   -12.08   0.000    -.0285128   -.0205447
       2018  |  -.0344372   .0016919   -20.35   0.000    -.0377565   -.0311179
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0093394   .0007304    12.79   0.000     .0079064    .0107723
       2016  |   .0112097   .0007825    14.33   0.000     .0096745    .0127449
       2017  |   .0086829   .0007981    10.88   0.000     .0071171    .0102488
       2018  |   .0032454   .0010637     3.05   0.002     .0011585    .0053324
             |
       _cons |   .8673837   .0352542    24.60   0.000     .7982191    .9365482
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_2year_va_enr_2year_both_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_2year_va_enr_2year_both_dk.ster saved
LHS = enr_4year
RHS: Deep Knowledge VA with og controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =    2296.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2644
                                                Root MSE          =     .41345

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
~4year_og_dk |   .0759549   .0014553    52.19   0.000     .0730998    .0788101
             |
        year |
       2016  |   .0162399   .0031841     5.10   0.000     .0099931    .0224868
       2017  |   .0173834   .0038192     4.55   0.000     .0098906    .0248761
       2018  |  -.0211506   .0040343    -5.24   0.000    -.0290653   -.0132358
             |
         age |  -.0000774   5.01e-06   -15.46   0.000    -.0000872   -.0000676
             |
        male |
       Male  |  -.0896357   .0017068   -52.52   0.000    -.0929842   -.0862872
 1.eth_asian |   .0737157   .0042106    17.51   0.000     .0654551    .0819763
1.eth_hisp~c |  -.0304751    .003052    -9.99   0.000    -.0364627   -.0244875
 1.eth_black |   .0282865   .0051878     5.45   0.000     .0181086    .0384645
 1.eth_other |  -.0089267    .004494    -1.99   0.047    -.0177435     -.00011
             |
econ_disad~e |
Economic ..  |   -.042164    .002575   -16.37   0.000    -.0472159   -.0371121
             |
limited_en~f |
Limited E..  |  -.0195509   .0027942    -7.00   0.000    -.0250327   -.0140691
             |
    disabled |
   Disabled  |  -.0542635    .003362   -16.14   0.000    -.0608594   -.0476676
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1399659   .0026741    52.34   0.000     .1347195    .1452122
       2016  |   .1276087   .0026777    47.66   0.000     .1223553     .132862
       2017  |   .1235456   .0028422    43.47   0.000     .1179696    .1291216
       2018  |   .0963451   .0035354    27.25   0.000     .0894089    .1032812
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0218897   .0011847    18.48   0.000     .0195653     .024214
       2016  |   .0162606    .001229    13.23   0.000     .0138494    .0186718
       2017  |   .0164849   .0011611    14.20   0.000     .0142069    .0187629
       2018  |   .0181667   .0013029    13.94   0.000     .0156106    .0207228
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112174    .000518   -21.65   0.000    -.0122337   -.0102011
       2016  |  -.0095113    .000486   -19.57   0.000    -.0104648   -.0085578
       2017  |  -.0096502   .0004999   -19.30   0.000     -.010631   -.0086694
       2018  |  -.0091293   .0008235   -11.09   0.000    -.0107449   -.0075137
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1200863   .0027852    43.12   0.000      .114622    .1255505
       2016  |   .1265383   .0029177    43.37   0.000     .1208141    .1322624
       2017  |   .1232829    .003079    40.04   0.000     .1172423    .1293235
       2018  |   .1422742   .0036625    38.85   0.000     .1350889    .1494596
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0158048   .0014944    10.58   0.000      .012873    .0187366
       2016  |   .0170737   .0014097    12.11   0.000      .014308    .0198394
       2017  |   .0119381   .0015169     7.87   0.000     .0089621    .0149141
       2018  |   .0312585   .0012328    25.35   0.000     .0288398    .0336772
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.009628   .0006097   -15.79   0.000    -.0108241   -.0084318
       2016  |  -.0102981   .0006667   -15.45   0.000    -.0116062   -.0089901
       2017  |  -.0086469   .0007089   -12.20   0.000    -.0100378   -.0072561
       2018  |  -.0093164   .0008486   -10.98   0.000    -.0109813   -.0076515
             |
       _cons |   .8300379   .0301498    27.53   0.000     .7708875    .8891883
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_4year_va_enr_4year_og_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_enr_4year_og_dk.ster saved
RHS: Deep Knowledge VA with acs controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =    2231.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2618
                                                Root MSE          =     .41418

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye.. |   .0717844   .0016488    43.54   0.000     .0685496    .0750191
             |
        year |
       2016  |    .016327    .003272     4.99   0.000     .0099077    .0227462
       2017  |   .0179442    .003805     4.72   0.000     .0104792    .0254091
       2018  |  -.0210384   .0040161    -5.24   0.000    -.0289175   -.0131594
             |
         age |  -.0000754   5.26e-06   -14.33   0.000    -.0000857   -.0000651
             |
        male |
       Male  |  -.0897079   .0017057   -52.59   0.000    -.0930543   -.0863615
 1.eth_asian |   .0714952   .0048221    14.83   0.000     .0620348    .0809556
1.eth_hisp~c |  -.0294395   .0034385    -8.56   0.000    -.0361855   -.0226935
 1.eth_black |   .0320674   .0053487     6.00   0.000     .0215739    .0425609
 1.eth_other |  -.0097709   .0046471    -2.10   0.036     -.018888   -.0006537
             |
econ_disad~e |
Economic ..  |  -.0485683   .0027958   -17.37   0.000    -.0540534   -.0430832
             |
limited_en~f |
Limited E..  |  -.0203986   .0028394    -7.18   0.000    -.0259692   -.0148279
             |
    disabled |
   Disabled  |  -.0524246   .0032916   -15.93   0.000    -.0588824   -.0459668
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1403772   .0026652    52.67   0.000     .1351485     .145606
       2016  |   .1272229   .0026898    47.30   0.000     .1219459    .1324999
       2017  |   .1246387   .0028678    43.46   0.000     .1190124     .130265
       2018  |   .0972204   .0035733    27.21   0.000     .0902101    .1042307
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    .022641   .0011749    19.27   0.000     .0203359    .0249461
       2016  |   .0169109   .0012201    13.86   0.000     .0145172    .0193046
       2017  |   .0172746   .0011521    14.99   0.000     .0150144    .0195348
       2018  |   .0185396   .0013017    14.24   0.000     .0159859    .0210933
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112578   .0005196   -21.67   0.000    -.0122771   -.0102385
       2016  |  -.0094583    .000487   -19.42   0.000    -.0104138   -.0085028
       2017  |  -.0097843   .0004999   -19.57   0.000     -.010765   -.0088036
       2018  |  -.0090813    .000821   -11.06   0.000     -.010692   -.0074705
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1206043   .0027867    43.28   0.000     .1151371    .1260714
       2016  |   .1272581   .0029562    43.05   0.000     .1214584    .1330578
       2017  |   .1238962   .0030834    40.18   0.000     .1178468    .1299456
       2018  |   .1417237   .0037311    37.98   0.000     .1344037    .1490437
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0167665   .0015003    11.18   0.000     .0138231      .01971
       2016  |   .0178818    .001414    12.65   0.000     .0151078    .0206559
       2017  |   .0125232    .001519     8.24   0.000     .0095431    .0155033
       2018  |   .0322563   .0012423    25.96   0.000      .029819    .0346936
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097495   .0006108   -15.96   0.000    -.0109477   -.0085513
       2016  |  -.0104028   .0006697   -15.53   0.000    -.0117166   -.0090889
       2017  |  -.0086722   .0007105   -12.21   0.000    -.0100662   -.0072782
       2018  |  -.0089043   .0008396   -10.60   0.000    -.0105515    -.007257
             |
       _cons |   .8190647   .0312163    26.24   0.000      .757822    .8803075
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_4year_va_enr_4year_acs_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_enr_4year_acs_dk.ster saved
RHS: Deep Knowledge VA with sib controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =    2324.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2643
                                                Root MSE          =     .41349

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye.. |   .0757771   .0014706    51.53   0.000     .0728919    .0786623
             |
        year |
       2016  |   .0162226   .0032098     5.05   0.000     .0099254    .0225199
       2017  |   .0173784   .0038167     4.55   0.000     .0098905    .0248663
       2018  |  -.0211202   .0040316    -5.24   0.000    -.0290298   -.0132106
             |
         age |  -.0000772   5.01e-06   -15.41   0.000    -.0000871   -.0000674
             |
        male |
       Male  |  -.0896479   .0017067   -52.53   0.000    -.0929963   -.0862995
 1.eth_asian |   .0734923   .0042072    17.47   0.000     .0652383    .0817464
1.eth_hisp~c |  -.0302974   .0030551    -9.92   0.000    -.0362911   -.0243036
 1.eth_black |   .0284123   .0052045     5.46   0.000     .0182017    .0386228
 1.eth_other |  -.0091354   .0044819    -2.04   0.042    -.0179283   -.0003425
             |
econ_disad~e |
Economic ..  |  -.0418638   .0025824   -16.21   0.000    -.0469302   -.0367974
             |
limited_en~f |
Limited E..  |  -.0195793   .0028012    -6.99   0.000     -.025075   -.0140836
             |
    disabled |
   Disabled  |  -.0544366   .0033675   -16.17   0.000    -.0610432   -.0478301
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1399061   .0026761    52.28   0.000     .1346559    .1451563
       2016  |    .127497   .0026769    47.63   0.000     .1222452    .1327488
       2017  |   .1236336   .0028441    43.47   0.000     .1180539    .1292134
       2018  |   .0963804   .0035377    27.24   0.000     .0894398    .1033209
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    .021894   .0011837    18.50   0.000     .0195716    .0242163
       2016  |   .0162372   .0012305    13.20   0.000     .0138231    .0186513
       2017  |   .0164844   .0011619    14.19   0.000     .0142049    .0187638
       2018  |   .0181838   .0013036    13.95   0.000     .0156262    .0207413
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112158   .0005178   -21.66   0.000    -.0122317      -.0102
       2016  |  -.0095068   .0004864   -19.54   0.000    -.0104612   -.0085525
       2017  |  -.0096637   .0005001   -19.32   0.000    -.0106448   -.0086826
       2018  |  -.0091419   .0008237   -11.10   0.000    -.0107578   -.0075259
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1200941   .0027906    43.04   0.000     .1146193    .1255689
       2016  |   .1265585   .0029238    43.29   0.000     .1208224    .1322946
       2017  |   .1233274   .0030803    40.04   0.000     .1172843    .1293705
       2018  |   .1421787   .0036623    38.82   0.000     .1349938    .1493636
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0158142   .0014963    10.57   0.000     .0128787    .0187497
       2016  |   .0170905   .0014102    12.12   0.000     .0143239    .0198571
       2017  |   .0119356   .0015162     7.87   0.000     .0089609    .0149103
       2018  |   .0311961   .0012341    25.28   0.000      .028775    .0336172
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0096361   .0006101   -15.80   0.000     -.010833   -.0084392
       2016  |  -.0103077   .0006669   -15.46   0.000    -.0116161   -.0089992
       2017  |  -.0086509   .0007092   -12.20   0.000    -.0100423   -.0072595
       2018  |  -.0093295   .0008488   -10.99   0.000    -.0109948   -.0076642
             |
       _cons |   .8289873   .0301718    27.48   0.000     .7697937     .888181
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_4year_va_enr_4year_sib_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_enr_4year_sib_dk.ster saved
RHS: Deep Knowledge VA with both controls

Linear regression                               Number of obs     =    431,867
                                                F(37, 1237)       =    2244.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2617
                                                Root MSE          =     .41421

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye.. |   .0716522   .0016567    43.25   0.000     .0684021    .0749024
             |
        year |
       2016  |   .0163007   .0032961     4.95   0.000     .0098342    .0227673
       2017  |   .0179171   .0038034     4.71   0.000     .0104553     .025379
       2018  |  -.0210328   .0040154    -5.24   0.000    -.0289106   -.0131549
             |
         age |  -.0000753   5.26e-06   -14.30   0.000    -.0000856   -.0000649
             |
        male |
       Male  |  -.0897178   .0017056   -52.60   0.000    -.0930641   -.0863715
 1.eth_asian |   .0715023    .004803    14.89   0.000     .0620794    .0809252
1.eth_hisp~c |  -.0293382   .0034368    -8.54   0.000    -.0360808   -.0225957
 1.eth_black |    .032192   .0053603     6.01   0.000     .0216757    .0427082
 1.eth_other |  -.0099245    .004635    -2.14   0.032    -.0190178   -.0008312
             |
econ_disad~e |
Economic ..  |  -.0482839   .0027981   -17.26   0.000    -.0537735   -.0427942
             |
limited_en~f |
Limited E..  |  -.0203899   .0028481    -7.16   0.000    -.0259774   -.0148023
             |
    disabled |
   Disabled  |  -.0525697   .0032966   -15.95   0.000    -.0590372   -.0461021
             |
        year#|
          c. |
prior_ela_~e |
       2015  |     .14033   .0026671    52.62   0.000     .1350975    .1455625
       2016  |   .1271285   .0026883    47.29   0.000     .1218543    .1324026
       2017  |   .1247376   .0028693    43.47   0.000     .1191084    .1303667
       2018  |   .0972513   .0035745    27.21   0.000     .0902387     .104264
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0226367   .0011744    19.28   0.000     .0203327    .0249407
       2016  |   .0168837   .0012218    13.82   0.000     .0144866    .0192808
       2017  |   .0172679   .0011526    14.98   0.000     .0150068    .0195291
       2018  |   .0185504   .0013025    14.24   0.000     .0159951    .0211056
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112555   .0005193   -21.67   0.000    -.0122743   -.0102366
       2016  |  -.0094545   .0004875   -19.39   0.000     -.010411    -.008498
       2017  |   -.009797      .0005   -19.59   0.000    -.0107779    -.008816
       2018  |  -.0090932   .0008212   -11.07   0.000    -.0107043    -.007482
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1206139   .0027922    43.20   0.000      .115136    .1260918
       2016  |   .1272845   .0029619    42.97   0.000     .1214735    .1330954
       2017  |   .1239334    .003085    40.17   0.000     .1178811    .1299857
       2018  |   .1416475   .0037297    37.98   0.000     .1343302    .1489648
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0167688    .001502    11.16   0.000     .0138222    .0197155
       2016  |   .0178918   .0014144    12.65   0.000     .0151169    .0206668
       2017  |   .0125204   .0015184     8.25   0.000     .0095416    .0154992
       2018  |   .0321972   .0012432    25.90   0.000     .0297582    .0346363
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0097558   .0006111   -15.96   0.000    -.0109548   -.0085569
       2016  |  -.0104105   .0006698   -15.54   0.000    -.0117246   -.0090963
       2017  |  -.0086755   .0007108   -12.20   0.000      -.01007   -.0072809
       2018  |  -.0089148   .0008396   -10.62   0.000     -.010562   -.0072677
             |
       _cons |   .8181617   .0312305    26.20   0.000     .7568911    .8794323
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/reg_enr_4year_va_enr_4year_both_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/reg_enr_4year_va_enr_4year_both_dk.ster saved

. 
. 
. 
. 
. ********** regress enrollment outcomes on dk va interacted with prior score d
> eciles
. /* no tfx, no peer effects, matching outcome on LHS and RHS */
. 
. //create prior score quantiles
. xtile prior_ela_z_score_xtile = prior_ela_z_score, n(10)

. xtile prior_math_z_score_xtile = prior_math_z_score, n(10)

. 
. // 3 outcomes, 4 DK VA specifications, 2 prior subjects = 24 regressions
. foreach outcome in enr enr_2year enr_4year {
  2.     di "LHS = `outcome'"
  3. 
.     foreach control in og acs sib both {
  4.       di "RHS DK VA: Deep Knowledge VA with `control' controls"
  5. 
.       foreach prior_subject in ela math {
  6.         di "interaction with prior `prior_subject' score deciles "
  7. 
.         reg `outcome' c.va_`outcome'_`control'_dk#i.prior_`prior_subject'_z_s
> core_xtile ///
>           i.year ///
>           `school_controls' ///
>           `demographic_controls' ///
>           `ela_score_controls' ///
>           `math_score_controls' ///
>           if touse_`outcome'_dk==1 ///
>           , cluster(cdscode)
  8.         estadd ysumm, mean
  9. 
.         estimates save $vaprojdir/estimates/sib_acs_restr_smp/persistence/het
> _reg_`outcome'_va_`outcome'_`control'_dk_x_prior_`prior_subject'.ster, replac
> e
 10. 
.       }
 11.     }
 12. }
LHS = enr
RHS DK VA: Deep Knowledge VA with og controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     907.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1387
                                                Root MSE          =     .41303

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_og_dk |
          1  |   .0777166    .002526    30.77   0.000      .072761    .0826722
          2  |   .0814103   .0026047    31.26   0.000     .0763002    .0865203
          3  |   .0755194   .0026878    28.10   0.000     .0702462    .0807926
          4  |   .0751666   .0026351    28.53   0.000     .0699969    .0803364
          5  |   .0667727    .002712    24.62   0.000      .061452    .0720934
          6  |   .0619007   .0024352    25.42   0.000     .0571231    .0666784
          7  |   .0594039   .0023823    24.94   0.000     .0547301    .0640778
          8  |   .0484523   .0023831    20.33   0.000     .0437769    .0531276
          9  |   .0384834   .0025943    14.83   0.000     .0333937     .043573
         10  |     .02269    .002174    10.44   0.000     .0184248    .0269551
             |
        year |
       2016  |   .0101254   .0042425     2.39   0.017     .0018021    .0184486
       2017  |  -.0186375   .0039115    -4.76   0.000    -.0263114   -.0109636
       2018  |  -.0283247   .0044534    -6.36   0.000    -.0370617   -.0195877
             |
         age |  -.0001445   5.70e-06   -25.36   0.000    -.0001557   -.0001333
             |
        male |
       Male  |   -.069356   .0019207   -36.11   0.000    -.0731243   -.0655878
 1.eth_asian |   .0502787    .003203    15.70   0.000     .0439947    .0565627
1.eth_hisp~c |  -.0206589   .0027867    -7.41   0.000    -.0261261   -.0151918
 1.eth_black |   .0125383   .0048294     2.60   0.010     .0030636    .0220129
 1.eth_other |  -.0098162   .0038532    -2.55   0.011    -.0173758   -.0022566
             |
econ_disad~e |
Economic ..  |  -.0541545   .0021215   -25.53   0.000    -.0583166   -.0499923
             |
limited_en~f |
Limited E..  |  -.0552308   .0042907   -12.87   0.000    -.0636487    -.046813
             |
    disabled |
   Disabled  |  -.0257579   .0041878    -6.15   0.000    -.0339739   -.0175418
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0772321   .0028659    26.95   0.000     .0716096    .0828546
       2016  |   .0677303   .0026638    25.43   0.000     .0625043    .0729563
       2017  |   .0745837   .0027812    26.82   0.000     .0691273      .08004
       2018  |   .0678229   .0037369    18.15   0.000     .0604915    .0751543
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   -.015403   .0015354   -10.03   0.000    -.0184154   -.0123906
       2016  |  -.0200663   .0014082   -14.25   0.000     -.022829   -.0173036
       2017  |  -.0099941   .0015373    -6.50   0.000    -.0130102    -.006978
       2018  |  -.0110475   .0015417    -7.17   0.000    -.0140721   -.0080228
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0008699   .0005767    -1.51   0.132    -.0020014    .0002616
       2016  |   .0010223   .0005067     2.02   0.044     .0000282    .0020164
       2017  |  -.0021929   .0005253    -4.17   0.000    -.0032236   -.0011623
       2018  |  -.0043087   .0009221    -4.67   0.000    -.0061177   -.0024997
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0535718   .0025742    20.81   0.000     .0485216     .058622
       2016  |   .0582768   .0026511    21.98   0.000     .0530756     .063478
       2017  |   .0552799   .0028301    19.53   0.000     .0497276    .0608323
       2018  |   .0829064   .0037899    21.88   0.000      .075471    .0903418
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0092914   .0018593    -5.00   0.000    -.0129392   -.0056437
       2016  |  -.0130938   .0016648    -7.86   0.000      -.01636   -.0098276
       2017  |   -.011424   .0018868    -6.05   0.000    -.0151256   -.0077224
       2018  |  -.0022483   .0015824    -1.42   0.156    -.0053528    .0008562
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0007713   .0006529    -1.18   0.238    -.0020521    .0005096
       2016  |   .0004527   .0006746     0.67   0.502    -.0008708    .0017762
       2017  |  -.0002013   .0007054    -0.29   0.775    -.0015852    .0011826
       2018  |  -.0059316   .0009381    -6.32   0.000     -.007772   -.0040913
             |
       _cons |   1.681466   .0341063    49.30   0.000     1.614553    1.748378
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_va_enr_og_dk_x_prior_ela.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_og_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     909.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1386
                                                Root MSE          =     .41306

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_og_dk |
          1  |   .0784349   .0024184    32.43   0.000     .0736903    .0831796
          2  |   .0784562   .0025788    30.42   0.000     .0733969    .0835156
          3  |   .0787273   .0027007    29.15   0.000     .0734287    .0840258
          4  |   .0718402    .002741    26.21   0.000     .0664628    .0772177
          5  |   .0687676   .0027112    25.36   0.000     .0634484    .0740867
          6  |   .0628574   .0023976    26.22   0.000     .0581535    .0675613
          7  |   .0595016    .002513    23.68   0.000     .0545714    .0644319
          8  |   .0491173    .002334    21.04   0.000     .0445384    .0536963
          9  |   .0357623   .0025025    14.29   0.000     .0308526    .0406719
         10  |   .0282936   .0022205    12.74   0.000     .0239371      .03265
             |
        year |
       2016  |   .0102251   .0042303     2.42   0.016     .0019257    .0185244
       2017  |   -.018419   .0039126    -4.71   0.000    -.0260951   -.0107429
       2018  |  -.0277703   .0044554    -6.23   0.000    -.0365113   -.0190293
             |
         age |  -.0001445   5.70e-06   -25.37   0.000    -.0001557   -.0001334
             |
        male |
       Male  |  -.0692311   .0019223   -36.01   0.000    -.0730024   -.0654598
 1.eth_asian |   .0507719   .0032031    15.85   0.000     .0444878     .057056
1.eth_hisp~c |  -.0207434   .0027836    -7.45   0.000    -.0262046   -.0152823
 1.eth_black |   .0129016   .0048203     2.68   0.008     .0034447    .0223586
 1.eth_other |  -.0096984   .0038669    -2.51   0.012    -.0172848   -.0021119
             |
econ_disad~e |
Economic ..  |  -.0540872   .0021226   -25.48   0.000    -.0582515   -.0499229
             |
limited_en~f |
Limited E..  |  -.0551123   .0043038   -12.81   0.000    -.0635559   -.0466687
             |
    disabled |
   Disabled  |  -.0257259   .0041871    -6.14   0.000    -.0339404   -.0175114
             |
        year#|
          c. |
prior_ela~re |
       2015  |    .075961   .0028665    26.50   0.000     .0703372    .0815848
       2016  |   .0668709   .0026634    25.11   0.000     .0616455    .0720963
       2017  |   .0724467   .0028572    25.36   0.000     .0668413    .0780521
       2018  |   .0671674   .0037394    17.96   0.000     .0598312    .0745036
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0163633   .0015369   -10.65   0.000    -.0193785    -.013348
       2016  |  -.0209958   .0014023   -14.97   0.000     -.023747   -.0182446
       2017  |  -.0109814    .001533    -7.16   0.000     -.013989   -.0079738
       2018  |  -.0122968   .0015348    -8.01   0.000    -.0153079   -.0092858
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0007428   .0005784    -1.28   0.199    -.0018775    .0003919
       2016  |   .0011096   .0005139     2.16   0.031     .0001015    .0021178
       2017  |  -.0019622   .0005273    -3.72   0.000    -.0029967   -.0009277
       2018  |  -.0046357   .0009194    -5.04   0.000    -.0064396   -.0028319
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0546004   .0025556    21.37   0.000     .0495867    .0596141
       2016  |   .0587757   .0025715    22.86   0.000     .0537307    .0638207
       2017  |   .0569409    .002828    20.13   0.000     .0513927    .0624891
       2018  |   .0840572   .0037622    22.34   0.000     .0766763    .0914381
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0082601   .0018631    -4.43   0.000    -.0119153   -.0046049
       2016  |  -.0122327    .001677    -7.29   0.000    -.0155227   -.0089427
       2017  |  -.0106038   .0018791    -5.64   0.000    -.0142904   -.0069172
       2018  |  -.0013335   .0015868    -0.84   0.401    -.0044466    .0017796
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0010258   .0006553    -1.57   0.118    -.0023114    .0002599
       2016  |     .00031   .0006729     0.46   0.645    -.0010101      .00163
       2017  |  -.0004303   .0006988    -0.62   0.538    -.0018013    .0009407
       2018  |  -.0058917   .0009459    -6.23   0.000    -.0077475   -.0040359
             |
       _cons |   1.681098    .034108    49.29   0.000     1.614182    1.748014
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_va_enr_og_dk_x_prior_math.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_og_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with acs controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     770.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1366
                                                Root MSE          =     .41353

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_acs~k |
          1  |   .0724221   .0024587    29.46   0.000     .0675985    .0772458
          2  |   .0755396   .0026658    28.34   0.000     .0703095    .0807696
          3  |   .0702151    .002759    25.45   0.000     .0648023    .0756279
          4  |   .0692844   .0027026    25.64   0.000     .0639822    .0745866
          5  |   .0619094   .0027988    22.12   0.000     .0564183    .0674004
          6  |   .0567125    .002546    22.28   0.000     .0517175    .0617074
          7  |   .0548612    .002503    21.92   0.000     .0499507    .0597717
          8  |      .0442   .0024783    17.83   0.000     .0393379    .0490621
          9  |   .0366829   .0026535    13.82   0.000     .0314771    .0418887
         10  |   .0234432   .0020358    11.52   0.000     .0194493    .0274372
             |
        year |
       2016  |   .0098664   .0042285     2.33   0.020     .0015705    .0181623
       2017  |  -.0183473   .0038779    -4.73   0.000    -.0259554   -.0107393
       2018  |    -.02849   .0044169    -6.45   0.000    -.0371554   -.0198246
             |
         age |  -.0001433   5.78e-06   -24.81   0.000    -.0001546   -.0001319
             |
        male |
       Male  |  -.0689693   .0019291   -35.75   0.000    -.0727539   -.0651847
 1.eth_asian |   .0541742   .0034871    15.54   0.000     .0473328    .0610156
1.eth_hisp~c |  -.0270349   .0029107    -9.29   0.000    -.0327454   -.0213243
 1.eth_black |   .0077464   .0049285     1.57   0.116    -.0019228    .0174156
 1.eth_other |  -.0096375   .0039148    -2.46   0.014    -.0173179   -.0019572
             |
econ_disad~e |
Economic ..  |  -.0616061   .0022163   -27.80   0.000    -.0659543   -.0572579
             |
limited_en~f |
Limited E..  |  -.0529265   .0044096   -12.00   0.000    -.0615776   -.0442754
             |
    disabled |
   Disabled  |  -.0216522   .0042506    -5.09   0.000    -.0299914    -.013313
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0786228   .0028666    27.43   0.000     .0729988    .0842468
       2016  |   .0690055   .0026902    25.65   0.000     .0637276    .0742834
       2017  |   .0758094   .0028109    26.97   0.000     .0702948    .0813241
       2018  |   .0693841   .0037431    18.54   0.000     .0620405    .0767277
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   -.016404   .0015416   -10.64   0.000    -.0194285   -.0133795
       2016  |  -.0209534   .0014059   -14.90   0.000    -.0237116   -.0181953
       2017  |  -.0110444   .0015475    -7.14   0.000    -.0140803   -.0080084
       2018  |  -.0121427   .0015442    -7.86   0.000    -.0151723   -.0091131
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0008371    .000579    -1.45   0.148     -.001973    .0002987
       2016  |   .0010596   .0005126     2.07   0.039      .000054    .0020652
       2017  |  -.0021095   .0005297    -3.98   0.000    -.0031488   -.0010702
       2018  |  -.0045644   .0009236    -4.94   0.000    -.0063764   -.0027525
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0541103   .0025811    20.96   0.000     .0490464    .0591741
       2016  |   .0590936   .0026661    22.16   0.000      .053863    .0643243
       2017  |   .0557442   .0028439    19.60   0.000     .0501648    .0613236
       2018  |   .0842654   .0038006    22.17   0.000      .076809    .0917218
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0099076   .0018666    -5.31   0.000    -.0135697   -.0062456
       2016  |  -.0137307   .0016708    -8.22   0.000    -.0170086   -.0104528
       2017  |  -.0117554   .0018938    -6.21   0.000     -.015471   -.0080399
       2018  |  -.0024658    .001584    -1.56   0.120    -.0055733    .0006417
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0006445   .0006551    -0.98   0.325    -.0019297    .0006407
       2016  |   .0005621   .0006767     0.83   0.406    -.0007654    .0018897
       2017  |  -.0001503   .0007076    -0.21   0.832    -.0015386     .001238
       2018  |  -.0060137   .0009377    -6.41   0.000    -.0078533   -.0041741
             |
       _cons |   1.679786   .0344123    48.81   0.000     1.612273    1.747299
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_va_enr_acs_dk_x_prior_ela.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_acs_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     776.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1366
                                                Root MSE          =     .41354

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_acs~k |
          1  |    .073172   .0024081    30.39   0.000     .0684476    .0778963
          2  |   .0733779   .0026052    28.17   0.000     .0682668     .078489
          3  |   .0741326   .0026356    28.13   0.000      .068962    .0793033
          4  |   .0669284   .0027217    24.59   0.000     .0615888     .072268
          5  |   .0631965   .0028055    22.53   0.000     .0576925    .0687005
          6  |   .0577425   .0025202    22.91   0.000     .0527983    .0626868
          7  |   .0552667   .0025765    21.45   0.000      .050212    .0603214
          8  |   .0446534   .0025047    17.83   0.000     .0397393    .0495674
          9  |   .0323921   .0026127    12.40   0.000     .0272662    .0375179
         10  |   .0276885   .0020421    13.56   0.000     .0236821    .0316949
             |
        year |
       2016  |   .0099377   .0042196     2.36   0.019     .0016594    .0182161
       2017  |  -.0181159   .0038795    -4.67   0.000     -.025727   -.0105048
       2018  |  -.0281872   .0044192    -6.38   0.000    -.0368572   -.0195171
             |
         age |  -.0001432   5.77e-06   -24.80   0.000    -.0001545   -.0001319
             |
        male |
       Male  |  -.0689286   .0019287   -35.74   0.000    -.0727125   -.0651446
 1.eth_asian |   .0544815    .003486    15.63   0.000     .0476425    .0613206
1.eth_hisp~c |  -.0270662   .0029089    -9.30   0.000     -.032773   -.0213593
 1.eth_black |   .0079921   .0049232     1.62   0.105    -.0016666    .0176508
 1.eth_other |  -.0095303   .0039315    -2.42   0.015    -.0172435   -.0018172
             |
econ_disad~e |
Economic ..  |  -.0614779   .0022125   -27.79   0.000    -.0658185   -.0571373
             |
limited_en~f |
Limited E..  |  -.0529275   .0044207   -11.97   0.000    -.0616004   -.0442545
             |
    disabled |
   Disabled  |  -.0216642   .0042497    -5.10   0.000    -.0300016   -.0133267
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0777411   .0028572    27.21   0.000     .0721356    .0833467
       2016  |   .0684654   .0026663    25.68   0.000     .0632344    .0736963
       2017  |   .0743306   .0028661    25.93   0.000     .0687078    .0799535
       2018  |   .0685777   .0037409    18.33   0.000     .0612384     .075917
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0169527   .0015438   -10.98   0.000    -.0199814   -.0139239
       2016  |   -.021444   .0014048   -15.26   0.000    -.0242002   -.0186879
       2017  |  -.0115347   .0015384    -7.50   0.000    -.0145528   -.0085165
       2018  |  -.0128052   .0015392    -8.32   0.000    -.0158251   -.0097854
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0007282   .0005807    -1.25   0.210    -.0018676    .0004111
       2016  |   .0011291   .0005174     2.18   0.029     .0001141    .0021441
       2017  |   -.001952   .0005291    -3.69   0.000      -.00299   -.0009139
       2018  |  -.0046549    .000922    -5.05   0.000    -.0064637   -.0028462
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0548434   .0025643    21.39   0.000     .0498124    .0598743
       2016  |   .0594675    .002597    22.90   0.000     .0543724    .0645625
       2017  |   .0570583   .0028545    19.99   0.000      .051458    .0626586
       2018  |   .0853262   .0037782    22.58   0.000     .0779137    .0927386
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0092765    .001869    -4.96   0.000    -.0129433   -.0056098
       2016  |   -.013212   .0016765    -7.88   0.000    -.0165011   -.0099229
       2017  |  -.0113499   .0018882    -6.01   0.000    -.0150542   -.0076455
       2018  |  -.0019428   .0015874    -1.22   0.221    -.0050572    .0011716
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0008213   .0006564    -1.25   0.211    -.0021092    .0004665
       2016  |   .0004519   .0006743     0.67   0.503    -.0008711    .0017748
       2017  |    -.00031   .0007016    -0.44   0.659    -.0016864    .0010664
       2018  |  -.0060603   .0009408    -6.44   0.000    -.0079061   -.0042145
             |
       _cons |   1.679108   .0344181    48.79   0.000     1.611583    1.746632
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_va_enr_acs_dk_x_prior_math.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_acs_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with sib controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     907.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1387
                                                Root MSE          =     .41303

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_sib~k |
          1  |   .0776993   .0025416    30.57   0.000      .072713    .0826856
          2  |   .0813613   .0026037    31.25   0.000     .0762532    .0864695
          3  |    .075517   .0026903    28.07   0.000     .0702389     .080795
          4  |   .0750942   .0026435    28.41   0.000      .069908    .0802805
          5  |   .0667913   .0027139    24.61   0.000      .061467    .0721157
          6  |     .06187   .0024449    25.31   0.000     .0570734    .0666666
          7  |   .0593314   .0023878    24.85   0.000     .0546469     .064016
          8  |   .0484316   .0023926    20.24   0.000     .0437377    .0531256
          9  |   .0385257   .0025976    14.83   0.000     .0334295    .0436219
         10  |   .0227193   .0021812    10.42   0.000     .0184401    .0269985
             |
        year |
       2016  |    .010049   .0042449     2.37   0.018      .001721    .0183771
       2017  |   -.018687   .0039121    -4.78   0.000    -.0263622   -.0110118
       2018  |  -.0284117   .0044547    -6.38   0.000    -.0371513   -.0196722
             |
         age |  -.0001444   5.71e-06   -25.31   0.000    -.0001556   -.0001332
             |
        male |
       Male  |  -.0693617   .0019204   -36.12   0.000    -.0731293   -.0655942
 1.eth_asian |   .0502636   .0032068    15.67   0.000     .0439721     .056555
1.eth_hisp~c |  -.0205864   .0027829    -7.40   0.000    -.0260462   -.0151266
 1.eth_black |   .0125362   .0048289     2.60   0.010     .0030625      .02201
 1.eth_other |  -.0098636   .0038528    -2.56   0.011    -.0174224   -.0023049
             |
econ_disad~e |
Economic ..  |  -.0539893   .0021231   -25.43   0.000    -.0581546    -.049824
             |
limited_en~f |
Limited E..  |  -.0551765   .0042935   -12.85   0.000    -.0635998   -.0467531
             |
    disabled |
   Disabled  |   -.025825   .0041857    -6.17   0.000    -.0340369   -.0176131
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0771928   .0028682    26.91   0.000     .0715657      .08282
       2016  |   .0677019   .0026643    25.41   0.000     .0624749    .0729289
       2017  |   .0745411   .0027805    26.81   0.000     .0690861    .0799961
       2018  |    .067822   .0037376    18.15   0.000     .0604893    .0751547
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0154001   .0015355   -10.03   0.000    -.0184125   -.0123876
       2016  |  -.0200643   .0014086   -14.24   0.000    -.0228277   -.0173008
       2017  |   -.009981   .0015368    -6.49   0.000    -.0129959    -.006966
       2018  |  -.0110303    .001541    -7.16   0.000    -.0140537    -.008007
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0008681   .0005767    -1.51   0.132    -.0019994    .0002633
       2016  |   .0010237   .0005067     2.02   0.044     .0000295    .0020178
       2017  |  -.0021934   .0005251    -4.18   0.000    -.0032236   -.0011633
       2018  |  -.0043066   .0009218    -4.67   0.000    -.0061151   -.0024981
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0535787   .0025768    20.79   0.000     .0485233     .058634
       2016  |   .0583073    .002653    21.98   0.000     .0531024    .0635122
       2017  |   .0552924   .0028307    19.53   0.000      .049739    .0608458
       2018  |   .0829012   .0037902    21.87   0.000     .0754652    .0903372
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0093067   .0018598    -5.00   0.000    -.0129555   -.0056579
       2016  |  -.0130879   .0016646    -7.86   0.000    -.0163538   -.0098221
       2017  |  -.0114422   .0018873    -6.06   0.000    -.0151448   -.0077395
       2018  |  -.0022631   .0015827    -1.43   0.153    -.0053681    .0008419
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0007689   .0006529    -1.18   0.239    -.0020498     .000512
       2016  |    .000446   .0006746     0.66   0.509    -.0008774    .0017694
       2017  |   -.000199   .0007057    -0.28   0.778    -.0015834    .0011855
       2018  |  -.0059371   .0009381    -6.33   0.000    -.0077775   -.0040967
             |
       _cons |   1.680825   .0341427    49.23   0.000      1.61384    1.747809
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_va_enr_sib_dk_x_prior_ela.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_sib_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     909.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1386
                                                Root MSE          =     .41306

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_sib~k |
          1  |   .0784854   .0024239    32.38   0.000     .0737299    .0832408
          2  |   .0783874   .0025875    30.29   0.000     .0733111    .0834638
          3  |   .0786855   .0027132    29.00   0.000     .0733625    .0840084
          4  |   .0718359   .0027421    26.20   0.000     .0664562    .0772157
          5  |   .0687062    .002722    25.24   0.000     .0633661    .0740464
          6  |   .0628611   .0024055    26.13   0.000     .0581418    .0675804
          7  |   .0594149   .0025196    23.58   0.000     .0544717    .0643581
          8  |   .0491192   .0023359    21.03   0.000     .0445363     .053702
          9  |   .0358364   .0025067    14.30   0.000     .0309184    .0407543
         10  |   .0283197   .0022353    12.67   0.000     .0239344     .032705
             |
        year |
       2016  |   .0101466   .0042325     2.40   0.017     .0018429    .0184503
       2017  |  -.0184685   .0039132    -4.72   0.000    -.0261458   -.0107913
       2018  |  -.0278499   .0044567    -6.25   0.000    -.0365934   -.0191063
             |
         age |  -.0001444   5.70e-06   -25.32   0.000    -.0001556   -.0001332
             |
        male |
       Male  |  -.0692368   .0019219   -36.03   0.000    -.0730072   -.0654663
 1.eth_asian |   .0507564   .0032068    15.83   0.000      .044465    .0570478
1.eth_hisp~c |  -.0206696   .0027798    -7.44   0.000    -.0261233    -.015216
 1.eth_black |   .0129031   .0048198     2.68   0.008     .0034471     .022359
 1.eth_other |   -.009743   .0038663    -2.52   0.012    -.0173283   -.0021577
             |
econ_disad~e |
Economic ..  |   -.053925   .0021244   -25.38   0.000    -.0580927   -.0497572
             |
limited_en~f |
Limited E..  |  -.0550595   .0043069   -12.78   0.000    -.0635092   -.0466098
             |
    disabled |
   Disabled  |  -.0257958    .004185    -6.16   0.000    -.0340063   -.0175852
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0759372   .0028685    26.47   0.000     .0703096    .0815647
       2016  |   .0668394    .002664    25.09   0.000      .061613    .0720658
       2017  |   .0723982   .0028563    25.35   0.000     .0667945    .0780018
       2018  |   .0671672   .0037399    17.96   0.000       .05983    .0745044
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0163605    .001537   -10.64   0.000     -.019376    -.013345
       2016  |  -.0209987   .0014025   -14.97   0.000    -.0237503   -.0182472
       2017  |  -.0109758   .0015326    -7.16   0.000    -.0139825   -.0079691
       2018  |  -.0122876   .0015343    -8.01   0.000    -.0152977   -.0092774
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0007436   .0005783    -1.29   0.199    -.0018782    .0003909
       2016  |   .0011107   .0005139     2.16   0.031     .0001024    .0021189
       2017  |  -.0019625   .0005271    -3.72   0.000    -.0029966   -.0009283
       2018  |  -.0046381   .0009191    -5.05   0.000    -.0064413   -.0028348
             |
        year#|
          c. |
prior_mat~re |
       2015  |     .05459   .0025567    21.35   0.000     .0495741     .059606
       2016  |   .0588003   .0025725    22.86   0.000     .0537533    .0638473
       2017  |   .0569555   .0028282    20.14   0.000      .051407    .0625041
       2018  |    .084057   .0037623    22.34   0.000     .0766758    .0914382
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0082698   .0018635    -4.44   0.000    -.0119257   -.0046139
       2016  |   -.012217   .0016765    -7.29   0.000    -.0155062   -.0089278
       2017  |  -.0106128   .0018798    -5.65   0.000    -.0143008   -.0069248
       2018  |  -.0013407   .0015869    -0.84   0.398    -.0044539    .0017726
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0010233   .0006552    -1.56   0.119    -.0023088    .0002622
       2016  |   .0003021   .0006727     0.45   0.653    -.0010177    .0016218
       2017  |  -.0004298   .0006992    -0.61   0.539    -.0018015    .0009418
       2018  |   -.005897   .0009461    -6.23   0.000    -.0077531   -.0040409
             |
       _cons |   1.680464   .0341431    49.22   0.000     1.613479    1.747449
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_va_enr_sib_dk_x_prior_math.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_sib_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with both controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     773.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1366
                                                Root MSE          =     .41354

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_bot~k |
          1  |   .0724016   .0024724    29.28   0.000     .0675509    .0772522
          2  |    .075494   .0026629    28.35   0.000     .0702696    .0807184
          3  |   .0702088   .0027602    25.44   0.000     .0647937     .075624
          4  |    .069214   .0027074    25.56   0.000     .0639023    .0745256
          5  |   .0619225   .0027993    22.12   0.000     .0564307    .0674144
          6  |   .0566672   .0025523    22.20   0.000     .0516599    .0616745
          7  |   .0547982   .0024984    21.93   0.000     .0498966    .0596998
          8  |   .0441819   .0024816    17.80   0.000     .0393134    .0490505
          9  |   .0367415   .0026537    13.85   0.000     .0315354    .0419477
         10  |   .0234917   .0020419    11.51   0.000     .0194858    .0274976
             |
        year |
       2016  |   .0097936   .0042322     2.31   0.021     .0014905    .0180968
       2017  |  -.0183991   .0038788    -4.74   0.000    -.0260089   -.0107892
       2018  |  -.0285754    .004419    -6.47   0.000    -.0372448   -.0199059
             |
         age |  -.0001432   5.78e-06   -24.77   0.000    -.0001545   -.0001318
             |
        male |
       Male  |  -.0689744   .0019287   -35.76   0.000    -.0727583   -.0651904
 1.eth_asian |   .0542261   .0034884    15.54   0.000     .0473822    .0610699
1.eth_hisp~c |  -.0270031   .0029067    -9.29   0.000    -.0327058   -.0213005
 1.eth_black |   .0077423   .0049282     1.57   0.116    -.0019262    .0174109
 1.eth_other |  -.0096608   .0039148    -2.47   0.014    -.0173411   -.0019805
             |
econ_disad~e |
Economic ..  |   -.061423   .0022161   -27.72   0.000    -.0657708   -.0570753
             |
limited_en~f |
Limited E..  |  -.0528579    .004413   -11.98   0.000    -.0615157   -.0442002
             |
    disabled |
   Disabled  |  -.0217088   .0042486    -5.11   0.000     -.030044   -.0133737
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0785872   .0028688    27.39   0.000     .0729589    .0842155
       2016  |   .0689815   .0026907    25.64   0.000     .0637027    .0742603
       2017  |   .0757733   .0028107    26.96   0.000     .0702589    .0812876
       2018  |   .0693769   .0037438    18.53   0.000      .062032    .0767218
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0164061   .0015415   -10.64   0.000    -.0194303   -.0133818
       2016  |  -.0209562   .0014062   -14.90   0.000     -.023715   -.0181974
       2017  |  -.0110372   .0015468    -7.14   0.000    -.0140719   -.0080025
       2018  |  -.0121301   .0015435    -7.86   0.000    -.0151582   -.0091019
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   -.000835   .0005789    -1.44   0.149    -.0019707    .0003007
       2016  |   .0010612   .0005126     2.07   0.039     .0000556    .0020668
       2017  |  -.0021095   .0005295    -3.98   0.000    -.0031485   -.0010706
       2018  |  -.0045622   .0009233    -4.94   0.000    -.0063737   -.0027508
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0541156   .0025837    20.95   0.000     .0490468    .0591844
       2016  |   .0591225   .0026678    22.16   0.000     .0538886    .0643564
       2017  |   .0557513   .0028443    19.60   0.000     .0501711    .0613316
       2018  |    .084267   .0038009    22.17   0.000     .0768101    .0917238
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   -.009925   .0018671    -5.32   0.000     -.013588    -.006262
       2016  |  -.0137282   .0016705    -8.22   0.000    -.0170056   -.0104508
       2017  |  -.0117734   .0018945    -6.21   0.000    -.0154902   -.0080567
       2018  |  -.0024838   .0015841    -1.57   0.117    -.0055916    .0006241
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0006415   .0006551    -0.98   0.328    -.0019268    .0006437
       2016  |   .0005561   .0006766     0.82   0.411    -.0007713    .0018836
       2017  |  -.0001481   .0007079    -0.21   0.834    -.0015369    .0012407
       2018  |  -.0060194   .0009377    -6.42   0.000     -.007859   -.0041798
             |
       _cons |   1.679198   .0344401    48.76   0.000     1.611631    1.746766
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_va_enr_both_dk_x_prior_ela.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_both_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     779.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1366
                                                Root MSE          =     .41354

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
         enr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_bot~k |
          1  |   .0732344   .0024108    30.38   0.000     .0685046    .0779642
          2  |   .0733025   .0026115    28.07   0.000     .0681791    .0784259
          3  |   .0740906    .002643    28.03   0.000     .0689052    .0792759
          4  |   .0669108   .0027235    24.57   0.000     .0615676     .072254
          5  |   .0631221    .002812    22.45   0.000     .0576053    .0686388
          6  |   .0577427   .0025235    22.88   0.000      .052792    .0626934
          7  |    .055165   .0025764    21.41   0.000     .0501105    .0602196
          8  |    .044653   .0025019    17.85   0.000     .0397446    .0495615
          9  |   .0324698   .0026149    12.42   0.000     .0273398    .0375999
         10  |   .0277343   .0020528    13.51   0.000      .023707    .0317617
             |
        year |
       2016  |   .0098623    .004223     2.34   0.020     .0015773    .0181473
       2017  |  -.0181672   .0038803    -4.68   0.000    -.0257799   -.0105545
       2018  |  -.0282668   .0044212    -6.39   0.000    -.0369407   -.0195929
             |
         age |  -.0001431   5.78e-06   -24.76   0.000    -.0001545   -.0001318
             |
        male |
       Male  |  -.0689334   .0019284   -35.75   0.000    -.0727166   -.0651501
 1.eth_asian |    .054535   .0034876    15.64   0.000     .0476928    .0613773
1.eth_hisp~c |   -.027032   .0029048    -9.31   0.000    -.0327309    -.021333
 1.eth_black |   .0079916   .0049228     1.62   0.105    -.0016664    .0176496
 1.eth_other |  -.0095504   .0039314    -2.43   0.015    -.0172633   -.0018375
             |
econ_disad~e |
Economic ..  |  -.0612988   .0022125   -27.71   0.000    -.0656394   -.0569582
             |
limited_en~f |
Limited E..  |  -.0528622   .0044243   -11.95   0.000    -.0615422   -.0441821
             |
    disabled |
   Disabled  |   -.021724   .0042478    -5.11   0.000    -.0300577   -.0133904
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .0777232    .002859    27.19   0.000     .0721143    .0833321
       2016  |   .0684413   .0026666    25.67   0.000     .0632097    .0736729
       2017  |   .0742894   .0028655    25.93   0.000     .0686677    .0799111
       2018  |   .0685711   .0037413    18.33   0.000     .0612311    .0759111
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0169534   .0015438   -10.98   0.000    -.0199821   -.0139247
       2016  |  -.0214493   .0014051   -15.27   0.000    -.0242059   -.0186926
       2017  |  -.0115337   .0015378    -7.50   0.000    -.0145508   -.0085167
       2018  |  -.0127983   .0015388    -8.32   0.000    -.0158172   -.0097794
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0007289   .0005806    -1.26   0.210    -.0018681    .0004102
       2016  |     .00113   .0005174     2.18   0.029     .0001149    .0021452
       2017  |  -.0019517   .0005289    -3.69   0.000    -.0029894    -.000914
       2018  |  -.0046565   .0009217    -5.05   0.000    -.0064647   -.0028483
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .0548294   .0025655    21.37   0.000     .0497962    .0598626
       2016  |   .0594896   .0025978    22.90   0.000      .054393    .0645862
       2017  |   .0570685   .0028547    19.99   0.000     .0514679    .0626692
       2018  |   .0853331   .0037783    22.59   0.000     .0779205    .0927457
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0092905   .0018694    -4.97   0.000    -.0129581    -.005623
       2016  |  -.0132014    .001676    -7.88   0.000    -.0164895   -.0099133
       2017  |  -.0113606    .001889    -6.01   0.000    -.0150666   -.0076546
       2018  |  -.0019549   .0015875    -1.23   0.218    -.0050694    .0011596
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0008177   .0006564    -1.25   0.213    -.0021054      .00047
       2016  |   .0004448   .0006741     0.66   0.509    -.0008777    .0017674
       2017  |  -.0003094   .0007019    -0.44   0.659    -.0016865    .0010677
       2018  |   -.006066   .0009409    -6.45   0.000    -.0079118   -.0042201
             |
       _cons |   1.678535   .0344448    48.73   0.000     1.610959    1.746112
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .72793013
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_va_enr_both_dk_x_prior_math.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_va_enr_both_dk_x_prior_math.ster saved
LHS = enr_2year
RHS DK VA: Deep Knowledge VA with og controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     691.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0882
                                                Root MSE          =     .45856

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
~2year_og_dk |
          1  |   .0815194   .0029914    27.25   0.000     .0756505    .0873882
          2  |   .1021759   .0026595    38.42   0.000     .0969582    .1073936
          3  |   .0993008   .0026755    37.12   0.000     .0940519    .1045498
          4  |   .1057521   .0025397    41.64   0.000     .1007694    .1107347
          5  |   .1052355   .0025464    41.33   0.000     .1002399    .1102312
          6  |   .0997822   .0026046    38.31   0.000     .0946723    .1048921
          7  |   .0963312   .0024889    38.70   0.000     .0914482    .1012142
          8  |    .085078   .0027402    31.05   0.000     .0797021     .090454
          9  |   .0762225   .0025607    29.77   0.000     .0711988    .0812462
         10  |   .0549835   .0021983    25.01   0.000     .0506707    .0592963
             |
        year |
       2016  |  -.0078054   .0049951    -1.56   0.118    -.0176052    .0019944
       2017  |  -.0387921   .0039791    -9.75   0.000    -.0465987   -.0309855
       2018  |  -.0106981   .0050036    -2.14   0.033    -.0205145   -.0008817
             |
         age |  -.0000683   5.64e-06   -12.11   0.000    -.0000794   -.0000573
             |
        male |
       Male  |    .020509   .0020008    10.25   0.000     .0165837    .0244343
 1.eth_asian |  -.0225144   .0034565    -6.51   0.000    -.0292958   -.0157331
1.eth_hisp~c |   .0108431   .0027267     3.98   0.000     .0054937    .0161925
 1.eth_black |  -.0141544   .0047592    -2.97   0.003    -.0234914   -.0048173
 1.eth_other |  -.0011412     .00455    -0.25   0.802    -.0100677    .0077854
             |
econ_disad~e |
Economic ..  |  -.0102727   .0021332    -4.82   0.000    -.0144578   -.0060876
             |
limited_en~f |
Limited E..  |  -.0363196   .0043827    -8.29   0.000    -.0449179   -.0277213
             |
    disabled |
   Disabled  |   .0311601   .0048848     6.38   0.000     .0215767    .0407435
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0641957   .0032357   -19.84   0.000    -.0705437   -.0578477
       2016  |  -.0571468   .0029683   -19.25   0.000    -.0629702   -.0513234
       2017  |  -.0512547   .0031014   -16.53   0.000    -.0573392   -.0451702
       2018  |  -.0281467   .0039203    -7.18   0.000    -.0358378   -.0204556
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0389299   .0015586   -24.98   0.000    -.0419878   -.0358721
       2016  |  -.0374081   .0015454   -24.21   0.000    -.0404401   -.0343761
       2017  |  -.0277259   .0016225   -17.09   0.000    -.0309091   -.0245426
       2018  |  -.0307313   .0016059   -19.14   0.000    -.0338819   -.0275806
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0106885   .0006194    17.26   0.000     .0094732    .0119038
       2016  |   .0104245   .0005164    20.19   0.000     .0094115    .0114376
       2017  |   .0077981   .0005618    13.88   0.000     .0066958    .0089003
       2018  |   .0046148   .0010016     4.61   0.000     .0026498    .0065798
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0664267   .0031699   -20.96   0.000    -.0726456   -.0602078
       2016  |  -.0685404   .0033423   -20.51   0.000    -.0750977   -.0619832
       2017  |  -.0681828   .0034029   -20.04   0.000    -.0748589   -.0615067
       2018  |   -.058145   .0042572   -13.66   0.000    -.0664972   -.0497928
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0259024   .0020101   -12.89   0.000     -.029846   -.0219587
       2016  |  -.0308163   .0019069   -16.16   0.000    -.0345574   -.0270753
       2017  |  -.0237237   .0020094   -11.81   0.000    -.0276659   -.0197814
       2018  |  -.0336963   .0016748   -20.12   0.000    -.0369821   -.0304106
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0090665   .0007252    12.50   0.000     .0076437    .0104893
       2016  |   .0110303   .0007718    14.29   0.000     .0095161    .0125444
       2017  |   .0085803     .00079    10.86   0.000     .0070304    .0101302
       2018  |   .0033564   .0010385     3.23   0.001     .0013191    .0053938
             |
       _cons |   .8581403   .0346336    24.78   0.000     .7901933    .9260874
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_2year_va_enr_2year_og_dk_x_prior_ela.ster n
> ot found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_og_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     684.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0884
                                                Root MSE          =     .45852

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
~2year_og_dk |
          1  |   .0833666    .002919    28.56   0.000     .0776398    .0890934
          2  |    .096163   .0025743    37.36   0.000     .0911126    .1012134
          3  |   .1048624   .0025098    41.78   0.000     .0999385    .1097863
          4  |   .1049118   .0025606    40.97   0.000     .0998882    .1099354
          5  |   .1010157   .0024169    41.79   0.000      .096274    .1057575
          6  |   .1026582   .0024941    41.16   0.000     .0977652    .1075513
          7  |   .0986103   .0024734    39.87   0.000     .0937578    .1034628
          8  |   .0895425   .0023352    38.34   0.000     .0849611    .0941239
          9  |   .0757322   .0029483    25.69   0.000      .069948    .0815164
         10  |   .0490874   .0022068    22.24   0.000     .0447579    .0534169
             |
        year |
       2016  |  -.0076874   .0050068    -1.54   0.125    -.0175103    .0021354
       2017  |  -.0385812   .0039874    -9.68   0.000    -.0464041   -.0307584
       2018  |  -.0105293   .0050134    -2.10   0.036    -.0203651   -.0006935
             |
         age |  -.0000683   5.64e-06   -12.10   0.000    -.0000793   -.0000572
             |
        male |
       Male  |   .0204169   .0019966    10.23   0.000     .0164998    .0243341
 1.eth_asian |  -.0224496   .0034976    -6.42   0.000    -.0293114   -.0155878
1.eth_hisp~c |    .010769   .0027302     3.94   0.000     .0054127    .0161253
 1.eth_black |  -.0140075   .0047582    -2.94   0.003    -.0233426   -.0046725
 1.eth_other |  -.0010661   .0045459    -0.23   0.815    -.0099846    .0078525
             |
econ_disad~e |
Economic ..  |  -.0103287   .0021368    -4.83   0.000    -.0145209   -.0061365
             |
limited_en~f |
Limited E..  |  -.0363098   .0043877    -8.28   0.000     -.044918   -.0277017
             |
    disabled |
   Disabled  |   .0311668   .0048813     6.38   0.000     .0215903    .0407433
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0664392   .0032331   -20.55   0.000    -.0727821   -.0600963
       2016  |  -.0588137   .0029378   -20.02   0.000    -.0645773   -.0530502
       2017  |   -.053207   .0031282   -17.01   0.000    -.0593442   -.0470698
       2018  |  -.0293635   .0039016    -7.53   0.000    -.0370179   -.0217091
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0391145    .001606   -24.36   0.000    -.0422652   -.0359638
       2016  |  -.0373387   .0015751   -23.70   0.000    -.0404289   -.0342484
       2017  |  -.0281516   .0016118   -17.47   0.000    -.0313138   -.0249894
       2018  |  -.0311022   .0016016   -19.42   0.000    -.0342444   -.0279599
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107291    .000621    17.28   0.000     .0095107    .0119474
       2016  |   .0104108   .0005165    20.15   0.000     .0093974    .0114242
       2017  |   .0079051    .000564    14.02   0.000     .0067987    .0090115
       2018  |   .0045454   .0010098     4.50   0.000     .0025643    .0065265
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0644273   .0031644   -20.36   0.000    -.0706355   -.0582191
       2016  |  -.0671443   .0033357   -20.13   0.000    -.0736886      -.0606
       2017  |  -.0667931   .0033624   -19.86   0.000    -.0733897   -.0601965
       2018  |  -.0570607   .0042682   -13.37   0.000    -.0654344    -.048687
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |    -.02556   .0019661   -13.00   0.000    -.0294172   -.0217028
       2016  |  -.0308592   .0018733   -16.47   0.000    -.0345344   -.0271839
       2017  |  -.0234066   .0019821   -11.81   0.000    -.0272954   -.0195179
       2018  |   -.033386   .0016465   -20.28   0.000    -.0366163   -.0301557
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0089787   .0007173    12.52   0.000     .0075714    .0103859
       2016  |   .0110977   .0007658    14.49   0.000     .0095953       .0126
       2017  |   .0086152   .0007802    11.04   0.000     .0070845    .0101459
       2018  |   .0034011   .0010256     3.32   0.001     .0013889    .0054132
             |
       _cons |   .8576537   .0346396    24.76   0.000     .7896949    .9256126
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_2year_va_enr_2year_og_dk_x_prior_math.ster 
> not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_og_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with acs controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     546.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0844
                                                Root MSE          =     .45952

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_2ye.. |
          1  |   .0767316   .0031236    24.57   0.000     .0706034    .0828598
          2  |     .09601   .0030076    31.92   0.000     .0901094    .1019106
          3  |   .0917688   .0029541    31.07   0.000     .0859732    .0975643
          4  |   .0985172   .0027014    36.47   0.000     .0932173     .103817
          5  |   .0985407    .002752    35.81   0.000     .0931417    .1039398
          6  |   .0924769   .0028102    32.91   0.000     .0869635    .0979903
          7  |   .0899456   .0027128    33.16   0.000     .0846234    .0952678
          8  |   .0784058   .0029438    26.63   0.000     .0726304    .0841812
          9  |   .0715148   .0027819    25.71   0.000      .066057    .0769726
         10  |   .0518364   .0024505    21.15   0.000     .0470287     .056644
             |
        year |
       2016  |  -.0077884   .0050397    -1.55   0.122    -.0176757    .0020988
       2017  |   -.038731   .0040333    -9.60   0.000    -.0466437   -.0308182
       2018  |  -.0105997   .0050319    -2.11   0.035    -.0204717   -.0007278
             |
         age |  -.0000689   5.75e-06   -11.99   0.000    -.0000801   -.0000576
             |
        male |
       Male  |    .020834   .0020018    10.41   0.000     .0169067    .0247614
 1.eth_asian |  -.0156079   .0038736    -4.03   0.000    -.0232075   -.0080084
1.eth_hisp~c |   .0031013   .0030878     1.00   0.315    -.0029566    .0091593
 1.eth_black |  -.0230452     .00494    -4.67   0.000    -.0327369   -.0133536
 1.eth_other |    .000293   .0046093     0.06   0.949    -.0087499     .009336
             |
econ_disad~e |
Economic ..  |  -.0120529   .0022617    -5.33   0.000      -.01649   -.0076158
             |
limited_en~f |
Limited E..  |  -.0329988   .0045705    -7.22   0.000    -.0419656    -.024032
             |
    disabled |
   Disabled  |   .0323351   .0048546     6.66   0.000     .0228109    .0418594
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0632078   .0032434   -19.49   0.000    -.0695709   -.0568447
       2016  |  -.0560647   .0029951   -18.72   0.000    -.0619408   -.0501886
       2017  |  -.0507856   .0031524   -16.11   0.000    -.0569702    -.044601
       2018  |  -.0281815   .0039702    -7.10   0.000    -.0359705   -.0203925
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0398506   .0015612   -25.53   0.000    -.0429134   -.0367877
       2016  |  -.0382904   .0015585   -24.57   0.000    -.0413481   -.0352327
       2017  |  -.0288012   .0016175   -17.81   0.000    -.0319745   -.0256279
       2018  |  -.0314403   .0016106   -19.52   0.000    -.0346001   -.0282804
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107159    .000623    17.20   0.000     .0094936    .0119382
       2016  |   .0104529   .0005216    20.04   0.000     .0094297    .0114762
       2017  |   .0079312   .0005634    14.08   0.000     .0068259    .0090364
       2018  |   .0045627   .0010064     4.53   0.000     .0025883     .006537
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0667465   .0031723   -21.04   0.000    -.0729702   -.0605227
       2016  |  -.0688149   .0033883   -20.31   0.000    -.0754624   -.0621674
       2017  |  -.0686753   .0034238   -20.06   0.000    -.0753923   -.0619582
       2018  |  -.0570337   .0043384   -13.15   0.000    -.0655451   -.0485222
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0270118   .0020142   -13.41   0.000    -.0309635   -.0230601
       2016  |  -.0318758    .001916   -16.64   0.000    -.0356348   -.0281169
       2017  |  -.0243497   .0020238   -12.03   0.000    -.0283202   -.0203792
       2018  |  -.0345505   .0016842   -20.51   0.000    -.0378547   -.0312463
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0093172   .0007272    12.81   0.000     .0078905    .0107439
       2016  |   .0112506   .0007775    14.47   0.000     .0097253    .0127759
       2017  |   .0086991   .0007938    10.96   0.000     .0071417    .0102565
       2018  |   .0031159   .0010428     2.99   0.003       .00107    .0051617
             |
       _cons |   .8665235   .0352004    24.62   0.000     .7974643    .9355826
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_2year_va_enr_2year_acs_dk_x_prior_ela.ster 
> not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_acs_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     531.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0845
                                                Root MSE          =     .45949

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_2ye.. |
          1  |   .0789066   .0031635    24.94   0.000     .0727002     .085113
          2  |   .0904314   .0027507    32.88   0.000     .0850349    .0958279
          3  |   .0979217   .0027367    35.78   0.000     .0925526    .1032909
          4  |   .0978038   .0027072    36.13   0.000     .0924925     .103115
          5  |    .093505   .0026397    35.42   0.000     .0883262    .0986837
          6  |    .095541   .0028662    33.33   0.000     .0899178    .1011642
          7  |   .0912941   .0027404    33.31   0.000     .0859178    .0966705
          8  |   .0827872    .002568    32.24   0.000     .0777491    .0878253
          9  |   .0706109   .0032957    21.43   0.000     .0641452    .0770766
         10  |   .0464672   .0024944    18.63   0.000     .0415734     .051361
             |
        year |
       2016  |  -.0076751   .0050488    -1.52   0.129    -.0175802      .00223
       2017  |  -.0385187   .0040413    -9.53   0.000    -.0464473   -.0305901
       2018  |  -.0104791    .005039    -2.08   0.038     -.020365   -.0005931
             |
         age |  -.0000688   5.74e-06   -11.98   0.000    -.0000801   -.0000576
             |
        male |
       Male  |   .0207629   .0019995    10.38   0.000     .0168401    .0246856
 1.eth_asian |  -.0156812   .0039028    -4.02   0.000     -.023338   -.0080243
1.eth_hisp~c |   .0030424   .0030927     0.98   0.325    -.0030251      .00911
 1.eth_black |  -.0229096   .0049428    -4.63   0.000    -.0326067   -.0132125
 1.eth_other |   .0003791   .0046047     0.08   0.934    -.0086548     .009413
             |
econ_disad~e |
Economic ..  |  -.0121074   .0022677    -5.34   0.000    -.0165565   -.0076584
             |
limited_en~f |
Limited E..  |   -.033022   .0045696    -7.23   0.000    -.0419871   -.0240569
             |
    disabled |
   Disabled  |   .0323004   .0048536     6.65   0.000     .0227782    .0418226
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0648548   .0032333   -20.06   0.000    -.0711982   -.0585114
       2016  |  -.0572107   .0029639   -19.30   0.000    -.0630255   -.0513959
       2017  |  -.0522268   .0031839   -16.40   0.000    -.0584732   -.0459805
       2018  |   -.029055   .0039481    -7.36   0.000    -.0368007   -.0213093
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0399951   .0016003   -24.99   0.000    -.0431346   -.0368555
       2016  |  -.0382014   .0015793   -24.19   0.000    -.0412997    -.035103
       2017  |  -.0291601    .001614   -18.07   0.000    -.0323265   -.0259937
       2018  |   -.031675   .0016081   -19.70   0.000    -.0348299   -.0285201
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107492   .0006228    17.26   0.000     .0095273    .0119711
       2016  |   .0104405   .0005208    20.05   0.000     .0094188    .0114622
       2017  |   .0080242    .000566    14.18   0.000     .0069138    .0091346
       2018  |   .0045531   .0010126     4.50   0.000     .0025665    .0065397
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0652547   .0031764   -20.54   0.000    -.0714865   -.0590228
       2016  |  -.0677861   .0033776   -20.07   0.000    -.0744125   -.0611597
       2017  |  -.0676228   .0033947   -19.92   0.000    -.0742828   -.0609627
       2018  |  -.0563349   .0043455   -12.96   0.000    -.0648602   -.0478097
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0267032   .0019738   -13.53   0.000    -.0305756   -.0228307
       2016  |  -.0319018   .0018861   -16.91   0.000    -.0356021   -.0282015
       2017  |  -.0240829   .0020054   -12.01   0.000    -.0280172   -.0201486
       2018  |  -.0343578   .0016608   -20.69   0.000    -.0376161   -.0310995
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0092272   .0007197    12.82   0.000     .0078153    .0106391
       2016  |   .0112813   .0007726    14.60   0.000     .0097656     .012797
       2017  |    .008715   .0007864    11.08   0.000     .0071722    .0102579
       2018  |   .0031133   .0010334     3.01   0.003     .0010858    .0051407
             |
       _cons |   .8662337   .0352029    24.61   0.000     .7971698    .9352976
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_2year_va_enr_2year_acs_dk_x_prior_math.ster
>  not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_acs_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with sib controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     682.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0881
                                                Root MSE          =     .45858

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_2ye.. |
          1  |   .0816557    .002992    27.29   0.000     .0757859    .0875256
          2  |   .1023127   .0026593    38.47   0.000     .0970954      .10753
          3  |   .0992013   .0026759    37.07   0.000     .0939515    .1044511
          4  |   .1056194   .0025422    41.55   0.000     .1006318     .110607
          5  |   .1051641   .0025581    41.11   0.000     .1001453    .1101828
          6  |   .0995685   .0026213    37.98   0.000     .0944257    .1047113
          7  |   .0961939   .0025004    38.47   0.000     .0912884    .1010993
          8  |   .0849422   .0027484    30.91   0.000     .0795501    .0903342
          9  |   .0760188   .0025753    29.52   0.000     .0709663    .0810713
         10  |   .0548697   .0022038    24.90   0.000     .0505461    .0591933
             |
        year |
       2016  |  -.0078004    .005009    -1.56   0.120    -.0176275    .0020267
       2017  |  -.0388095   .0039751    -9.76   0.000    -.0466083   -.0310108
       2018  |   -.010704   .0049975    -2.14   0.032    -.0205085   -.0008995
             |
         age |  -.0000684   5.64e-06   -12.12   0.000    -.0000794   -.0000573
             |
        male |
       Male  |   .0204982   .0020008    10.25   0.000     .0165728    .0244235
 1.eth_asian |  -.0223939   .0034638    -6.47   0.000    -.0291895   -.0155983
1.eth_hisp~c |    .010901   .0027239     4.00   0.000      .005557    .0162449
 1.eth_black |  -.0141197   .0047617    -2.97   0.003    -.0234617   -.0047778
 1.eth_other |   -.000938   .0045485    -0.21   0.837    -.0098616    .0079855
             |
econ_disad~e |
Economic ..  |  -.0101491   .0021359    -4.75   0.000    -.0143396   -.0059587
             |
limited_en~f |
Limited E..  |   -.036278   .0043833    -8.28   0.000    -.0448775   -.0276784
             |
    disabled |
   Disabled  |    .031105   .0048824     6.37   0.000     .0215263    .0406837
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0642112   .0032384   -19.83   0.000    -.0705645   -.0578578
       2016  |  -.0572032   .0029667   -19.28   0.000    -.0630236   -.0513828
       2017  |   -.051332   .0031022   -16.55   0.000    -.0574182   -.0452458
       2018  |  -.0282015   .0039193    -7.20   0.000    -.0358908   -.0205122
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0389173   .0015585   -24.97   0.000    -.0419748   -.0358598
       2016  |  -.0374067   .0015448   -24.21   0.000    -.0404375    -.034376
       2017  |  -.0277219   .0016221   -17.09   0.000    -.0309042   -.0245396
       2018  |  -.0307329   .0016061   -19.14   0.000    -.0338838    -.027582
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0106852   .0006195    17.25   0.000     .0094699    .0119006
       2016  |   .0104298   .0005163    20.20   0.000     .0094169    .0114428
       2017  |   .0078049   .0005618    13.89   0.000     .0067029     .008907
       2018  |   .0046238   .0010011     4.62   0.000     .0026598    .0065878
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0664742   .0031709   -20.96   0.000     -.072695   -.0602533
       2016  |  -.0686318   .0033442   -20.52   0.000    -.0751926   -.0620709
       2017  |  -.0682232   .0034019   -20.05   0.000    -.0748973    -.061549
       2018  |  -.0582001   .0042576   -13.67   0.000    -.0665531   -.0498472
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0259038   .0020109   -12.88   0.000     -.029849   -.0219585
       2016  |  -.0308142   .0019078   -16.15   0.000    -.0345572   -.0270712
       2017  |  -.0237323   .0020099   -11.81   0.000    -.0276754   -.0197891
       2018  |  -.0337063    .001675   -20.12   0.000    -.0369924   -.0304201
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0090727   .0007256    12.50   0.000      .007649    .0104963
       2016  |   .0110333   .0007723    14.29   0.000     .0095182    .0125484
       2017  |   .0085889   .0007903    10.87   0.000     .0070385    .0101394
       2018  |   .0033623   .0010387     3.24   0.001     .0013244    .0054002
             |
       _cons |   .8583054   .0346052    24.80   0.000     .7904139    .9261968
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_2year_va_enr_2year_sib_dk_x_prior_ela.ster 
> not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_sib_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     678.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0883
                                                Root MSE          =     .45854

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_2ye.. |
          1  |   .0834895   .0029243    28.55   0.000     .0777524    .0892267
          2  |   .0962151   .0025707    37.43   0.000     .0911717    .1012585
          3  |   .1048587   .0025115    41.75   0.000     .0999314     .109786
          4  |   .1049286   .0025633    40.93   0.000     .0998997    .1099575
          5  |    .100857   .0024275    41.55   0.000     .0960946    .1056194
          6  |   .1025913    .002511    40.86   0.000     .0976649    .1075177
          7  |   .0984706   .0024924    39.51   0.000     .0935807    .1033605
          8  |   .0892899   .0023429    38.11   0.000     .0846934    .0938863
          9  |   .0755578   .0029549    25.57   0.000     .0697606    .0813549
         10  |   .0489261   .0022139    22.10   0.000     .0445826    .0532695
             |
        year |
       2016  |  -.0076822   .0050211    -1.53   0.126     -.017533    .0021686
       2017  |  -.0386024   .0039834    -9.69   0.000    -.0464173   -.0307874
       2018  |  -.0105354   .0050074    -2.10   0.036    -.0203593   -.0007114
             |
         age |  -.0000683   5.64e-06   -12.11   0.000    -.0000793   -.0000572
             |
        male |
       Male  |   .0204055   .0019966    10.22   0.000     .0164884    .0243227
 1.eth_asian |  -.0223293   .0035055    -6.37   0.000    -.0292066    -.015452
1.eth_hisp~c |   .0108265   .0027276     3.97   0.000     .0054753    .0161777
 1.eth_black |  -.0139648   .0047608    -2.93   0.003     -.023305   -.0046247
 1.eth_other |  -.0008615   .0045442    -0.19   0.850    -.0097768    .0080537
             |
econ_disad~e |
Economic ..  |  -.0102012   .0021396    -4.77   0.000    -.0143988   -.0060037
             |
limited_en~f |
Limited E..  |  -.0362641   .0043884    -8.26   0.000    -.0448737   -.0276545
             |
    disabled |
   Disabled  |   .0311113   .0048788     6.38   0.000     .0215396     .040683
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0664639   .0032358   -20.54   0.000    -.0728122   -.0601156
       2016  |  -.0588847    .002936   -20.06   0.000    -.0646448   -.0531245
       2017  |  -.0533107   .0031299   -17.03   0.000    -.0594511   -.0471702
       2018  |   -.029429   .0039007    -7.54   0.000    -.0370816   -.0217763
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   -.039105   .0016057   -24.35   0.000    -.0422552   -.0359548
       2016  |  -.0373447    .001574   -23.73   0.000    -.0404327   -.0342568
       2017  |  -.0281542   .0016115   -17.47   0.000    -.0313159   -.0249926
       2018  |  -.0311129   .0016015   -19.43   0.000    -.0342549   -.0279708
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107265   .0006212    17.27   0.000     .0095078    .0119451
       2016  |   .0104163   .0005164    20.17   0.000     .0094032    .0114293
       2017  |   .0079141   .0005639    14.03   0.000     .0068078    .0090204
       2018  |   .0045521   .0010093     4.51   0.000     .0025719    .0065322
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0644626   .0031658   -20.36   0.000    -.0706735   -.0582516
       2016  |  -.0672178   .0033362   -20.15   0.000     -.073763   -.0606725
       2017  |  -.0668084    .003362   -19.87   0.000    -.0734042   -.0602125
       2018  |  -.0571021   .0042684   -13.38   0.000    -.0654763    -.048728
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0255578   .0019669   -12.99   0.000    -.0294166    -.021699
       2016  |  -.0308503   .0018747   -16.46   0.000    -.0345282   -.0271723
       2017  |  -.0234061   .0019822   -11.81   0.000    -.0272949   -.0195172
       2018  |  -.0333861    .001646   -20.28   0.000    -.0366153   -.0301568
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0089834   .0007177    12.52   0.000     .0075753    .0103915
       2016  |   .0111015   .0007663    14.49   0.000     .0095982    .0126048
       2017  |   .0086214   .0007805    11.05   0.000     .0070902    .0101526
       2018  |   .0034088   .0010258     3.32   0.001     .0013962    .0054214
             |
       _cons |   .8577655   .0346111    24.78   0.000     .7898626    .9256685
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_2year_va_enr_2year_sib_dk_x_prior_math.ster
>  not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_sib_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with both controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     543.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0843
                                                Root MSE          =     .45954

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_2ye.. |
          1  |   .0767824   .0031256    24.57   0.000     .0706503    .0829144
          2  |   .0960833   .0030068    31.96   0.000     .0901843    .1019823
          3  |   .0916205   .0029508    31.05   0.000     .0858313    .0974097
          4  |   .0983343   .0027093    36.29   0.000     .0930189    .1036497
          5  |   .0984395   .0027644    35.61   0.000     .0930162    .1038629
          6  |   .0922396   .0028264    32.63   0.000     .0866945    .0977847
          7  |   .0897952   .0027239    32.97   0.000     .0844511    .0951392
          8  |   .0782939   .0029503    26.54   0.000     .0725058     .084082
          9  |   .0713298   .0027919    25.55   0.000     .0658523    .0768072
         10  |   .0517403   .0024504    21.11   0.000     .0469329    .0565478
             |
        year |
       2016  |  -.0077885   .0050527    -1.54   0.123    -.0177012    .0021243
       2017  |  -.0387422   .0040312    -9.61   0.000     -.046651   -.0308334
       2018  |  -.0106156   .0050247    -2.11   0.035    -.0204735   -.0007578
             |
         age |  -.0000689   5.74e-06   -12.00   0.000    -.0000801   -.0000576
             |
        male |
       Male  |   .0208274   .0020019    10.40   0.000     .0168999    .0247549
 1.eth_asian |   -.015559   .0038681    -4.02   0.000    -.0231477   -.0079703
1.eth_hisp~c |   .0030921   .0030818     1.00   0.316     -.002954    .0091382
 1.eth_black |  -.0230758   .0049452    -4.67   0.000    -.0327777    -.013374
 1.eth_other |   .0004616   .0046075     0.10   0.920    -.0085779     .009501
             |
econ_disad~e |
Economic ..  |  -.0120594    .002262    -5.33   0.000    -.0164972   -.0076217
             |
limited_en~f |
Limited E..  |  -.0329418     .00457    -7.21   0.000    -.0419077   -.0239759
             |
    disabled |
   Disabled  |   .0323353   .0048542     6.66   0.000     .0228118    .0418587
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0632061    .003246   -19.47   0.000    -.0695744   -.0568378
       2016  |  -.0561069   .0029935   -18.74   0.000    -.0619798    -.050234
       2017  |  -.0508451   .0031535   -16.12   0.000    -.0570319   -.0446584
       2018  |  -.0282137    .003969    -7.11   0.000    -.0360005   -.0204269
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0398428   .0015612   -25.52   0.000    -.0429058   -.0367799
       2016  |  -.0382947   .0015574   -24.59   0.000    -.0413502   -.0352393
       2017  |  -.0288008   .0016171   -17.81   0.000    -.0319733   -.0256283
       2018  |  -.0314475   .0016106   -19.53   0.000    -.0346073   -.0282877
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107128   .0006231    17.19   0.000     .0094903    .0119354
       2016  |    .010459   .0005214    20.06   0.000     .0094362    .0114819
       2017  |   .0079378   .0005633    14.09   0.000     .0068327     .009043
       2018  |    .004569   .0010058     4.54   0.000     .0025957    .0065423
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0667843   .0031738   -21.04   0.000     -.073011   -.0605576
       2016  |  -.0688901   .0033899   -20.32   0.000    -.0755407   -.0622395
       2017  |  -.0687035   .0034234   -20.07   0.000    -.0754198   -.0619871
       2018  |  -.0570756   .0043381   -13.16   0.000    -.0655864   -.0485647
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0270146   .0020151   -13.41   0.000    -.0309681   -.0230612
       2016  |  -.0318743    .001917   -16.63   0.000    -.0356351   -.0281134
       2017  |    -.02436   .0020245   -12.03   0.000    -.0283317   -.0203882
       2018  |  -.0345552   .0016844   -20.51   0.000    -.0378598   -.0312505
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0093241   .0007277    12.81   0.000     .0078966    .0107517
       2016  |   .0112536    .000778    14.47   0.000     .0097273    .0127799
       2017  |   .0087082   .0007942    10.97   0.000     .0071502    .0102663
       2018  |   .0031233    .001043     2.99   0.003      .001077    .0051697
             |
       _cons |   .8665369   .0351644    24.64   0.000     .7975485    .9355253
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_2year_va_enr_2year_both_dk_x_prior_ela.ster
>  not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_both_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =     529.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0844
                                                Root MSE          =     .45951

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_2year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_2ye.. |
          1  |   .0789677   .0031682    24.93   0.000     .0727521    .0851832
          2  |   .0904113   .0027476    32.91   0.000     .0850209    .0958017
          3  |   .0978771   .0027348    35.79   0.000     .0925117    .1032425
          4  |   .0977714   .0027117    36.06   0.000     .0924513    .1030914
          5  |   .0932953   .0026514    35.19   0.000     .0880936     .098497
          6  |   .0954508   .0028835    33.10   0.000     .0897937    .1011079
          7  |   .0911375   .0027603    33.02   0.000     .0857222    .0965528
          8  |   .0825524   .0025759    32.05   0.000     .0774989     .087606
          9  |   .0704548   .0032976    21.37   0.000     .0639853    .0769242
         10  |   .0463232   .0024953    18.56   0.000     .0414277    .0512188
             |
        year |
       2016  |  -.0076754   .0050622    -1.52   0.130    -.0176068     .002256
       2017  |  -.0385336   .0040393    -9.54   0.000    -.0464583    -.030609
       2018  |  -.0104969   .0050319    -2.09   0.037    -.0203689   -.0006249
             |
         age |  -.0000688   5.74e-06   -11.99   0.000    -.0000801   -.0000576
             |
        male |
       Male  |   .0207546   .0019996    10.38   0.000     .0168317    .0246775
 1.eth_asian |  -.0156344   .0038984    -4.01   0.000    -.0232827   -.0079862
1.eth_hisp~c |   .0030316   .0030868     0.98   0.326    -.0030244    .0090876
 1.eth_black |  -.0229357   .0049481    -4.64   0.000    -.0326433    -.013228
 1.eth_other |   .0005486   .0046029     0.12   0.905    -.0084818     .009579
             |
econ_disad~e |
Economic ..  |  -.0121096   .0022681    -5.34   0.000    -.0165593   -.0076599
             |
limited_en~f |
Limited E..  |  -.0329626   .0045693    -7.21   0.000     -.041927   -.0239982
             |
    disabled |
   Disabled  |   .0323002   .0048532     6.66   0.000     .0227788    .0418216
             |
        year#|
          c. |
prior_ela~re |
       2015  |  -.0648546   .0032358   -20.04   0.000    -.0712029   -.0585063
       2016  |  -.0572611   .0029619   -19.33   0.000     -.063072   -.0514502
       2017  |  -.0523013   .0031854   -16.42   0.000    -.0585507   -.0460518
       2018  |   -.029094    .003947    -7.37   0.000    -.0368375   -.0213505
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0399876   .0016002   -24.99   0.000     -.043127   -.0368482
       2016  |  -.0382101    .001578   -24.21   0.000     -.041306   -.0351142
       2017  |  -.0291626   .0016137   -18.07   0.000    -.0323284   -.0259967
       2018  |  -.0316875    .001608   -19.71   0.000    -.0348422   -.0285328
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0107463    .000623    17.25   0.000     .0095239    .0119686
       2016  |   .0104464   .0005205    20.07   0.000     .0094252    .0114676
       2017  |    .008032    .000566    14.19   0.000     .0069217    .0091424
       2018  |   .0045588   .0010121     4.50   0.000     .0025731    .0065445
             |
        year#|
          c. |
prior_mat~re |
       2015  |  -.0652876   .0031782   -20.54   0.000    -.0715228   -.0590523
       2016  |  -.0678485   .0033779   -20.09   0.000    -.0744756   -.0612214
       2017  |   -.067634   .0033951   -19.92   0.000    -.0742948   -.0609733
       2018  |  -.0563671   .0043449   -12.97   0.000    -.0648913   -.0478428
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0267053   .0019748   -13.52   0.000    -.0305796    -.022831
       2016  |  -.0318951   .0018873   -16.90   0.000    -.0355979   -.0281924
       2017  |  -.0240866   .0020057   -12.01   0.000    -.0280216   -.0201516
       2018  |  -.0343566   .0016602   -20.69   0.000    -.0376138   -.0310994
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0092328   .0007201    12.82   0.000       .00782    .0106456
       2016  |   .0112844    .000773    14.60   0.000     .0097678     .012801
       2017  |   .0087215   .0007867    11.09   0.000     .0071781     .010265
       2018  |   .0031204   .0010335     3.02   0.003     .0010927     .005148
             |
       _cons |   .8661935   .0351667    24.63   0.000     .7972005    .9351865
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36070596
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_2year_va_enr_2year_both_dk_x_prior_math.ste
> r not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_2year_va_enr_2year_both_dk_x_prior_math.ster saved
LHS = enr_4year
RHS DK VA: Deep Knowledge VA with og controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =    2410.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2656
                                                Root MSE          =     .41312

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
~4year_og_dk |
          1  |    .040338   .0022348    18.05   0.000     .0359535    .0447225
          2  |   .0666755   .0027461    24.28   0.000     .0612879    .0720631
          3  |   .0765961   .0027123    28.24   0.000     .0712749    .0819174
          4  |   .0822458   .0028507    28.85   0.000     .0766531    .0878386
          5  |   .0873582   .0026506    32.96   0.000     .0821579    .0925584
          6  |   .0918218   .0028608    32.10   0.000     .0862091    .0974344
          7  |   .0955764   .0027871    34.29   0.000     .0901083    .1010444
          8  |   .0874894   .0025215    34.70   0.000     .0825426    .0924362
          9  |   .0762507   .0026616    28.65   0.000      .071029    .0814723
         10  |    .052317   .0023271    22.48   0.000     .0477515    .0568825
             |
        year |
       2016  |   .0164546   .0032325     5.09   0.000     .0101129    .0227963
       2017  |   .0171514   .0039198     4.38   0.000     .0094613    .0248415
       2018  |  -.0214553    .004129    -5.20   0.000    -.0295559   -.0133547
             |
         age |  -.0000783   5.00e-06   -15.65   0.000    -.0000881   -.0000685
             |
        male |
       Male  |  -.0897493   .0016998   -52.80   0.000    -.0930842   -.0864144
 1.eth_asian |   .0739226   .0041998    17.60   0.000      .065683    .0821622
1.eth_hisp~c |  -.0302543   .0030248   -10.00   0.000    -.0361885     -.02432
 1.eth_black |   .0282716   .0051982     5.44   0.000     .0180733    .0384699
 1.eth_other |   -.008442   .0044738    -1.89   0.059     -.017219     .000335
             |
econ_disad~e |
Economic ..  |  -.0419969   .0025579   -16.42   0.000    -.0470152   -.0369785
             |
limited_en~f |
Limited E..  |  -.0201838   .0026775    -7.54   0.000    -.0254367   -.0149309
             |
    disabled |
   Disabled  |  -.0544916   .0033198   -16.41   0.000    -.0610046   -.0479786
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1405022     .00267    52.62   0.000     .1352639    .1457405
       2016  |   .1276612   .0026593    48.01   0.000     .1224441    .1328784
       2017  |   .1234651   .0028301    43.63   0.000     .1179128    .1290173
       2018  |   .0960605   .0035312    27.20   0.000     .0891326    .1029883
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0218948    .001124    19.48   0.000     .0196896       .0241
       2016  |   .0163493   .0011937    13.70   0.000     .0140073    .0186913
       2017  |   .0171659   .0011479    14.95   0.000     .0149138     .019418
       2018  |      .0187   .0012626    14.81   0.000      .016223    .0211771
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0112164   .0005086   -22.05   0.000    -.0122143   -.0102185
       2016  |  -.0094374   .0004842   -19.49   0.000    -.0103874   -.0084874
       2017  |  -.0097245   .0004958   -19.61   0.000    -.0106973   -.0087517
       2018  |  -.0088472    .000807   -10.96   0.000    -.0104304    -.007264
             |
        year#|
          c. |
prior_mat~re |
       2015  |    .119849   .0027858    43.02   0.000     .1143837    .1253143
       2016  |   .1265021   .0029066    43.52   0.000     .1207997    .1322046
       2017  |   .1232448   .0030717    40.12   0.000     .1172184    .1292711
       2018  |   .1418243   .0036376    38.99   0.000     .1346878    .1489608
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0162267   .0014766    10.99   0.000     .0133298    .0191236
       2016  |   .0171367   .0014015    12.23   0.000      .014387    .0198863
       2017  |   .0121833   .0015096     8.07   0.000     .0092216    .0151449
       2018  |   .0313527   .0012221    25.66   0.000     .0289551    .0337503
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0097402    .000601   -16.21   0.000    -.0109192   -.0085612
       2016  |  -.0103408   .0006618   -15.63   0.000    -.0116392   -.0090424
       2017  |  -.0087313   .0007049   -12.39   0.000    -.0101143   -.0073483
       2018  |  -.0092397   .0008278   -11.16   0.000    -.0108637   -.0076157
             |
       _cons |   .8353711   .0301799    27.68   0.000     .7761617    .8945805
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_4year_va_enr_4year_og_dk_x_prior_ela.ster n
> ot found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_og_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =    2330.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2655
                                                Root MSE          =     .41314

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
~4year_og_dk |
          1  |   .0414352   .0021805    19.00   0.000     .0371573     .045713
          2  |    .064508    .002877    22.42   0.000     .0588637    .0701523
          3  |    .080817   .0027412    29.48   0.000     .0754391    .0861948
          4  |   .0819359   .0026103    31.39   0.000     .0768148    .0870571
          5  |   .0874708   .0027763    31.51   0.000      .082024    .0929176
          6  |   .0912268   .0029487    30.94   0.000     .0854418    .0970118
          7  |    .094135   .0027004    34.86   0.000     .0888371     .099433
          8  |   .0861456   .0027257    31.60   0.000     .0807981    .0914932
          9  |   .0738616    .002784    26.53   0.000     .0683996    .0793236
         10  |   .0512779   .0021989    23.32   0.000     .0469638    .0555919
             |
        year |
       2016  |   .0163737   .0032471     5.04   0.000     .0100032    .0227442
       2017  |    .016963   .0039369     4.31   0.000     .0092392    .0246868
       2018  |  -.0214255   .0041421    -5.17   0.000    -.0295517   -.0132992
             |
         age |  -.0000781   5.00e-06   -15.63   0.000     -.000088   -.0000683
             |
        male |
       Male  |   -.089573   .0017044   -52.55   0.000    -.0929169   -.0862291
 1.eth_asian |   .0738339   .0042109    17.53   0.000     .0655727    .0820951
1.eth_hisp~c |  -.0303789   .0030169   -10.07   0.000    -.0362977   -.0244601
 1.eth_black |   .0283256   .0051834     5.46   0.000     .0181564    .0384949
 1.eth_other |  -.0084533   .0044713    -1.89   0.059    -.0172253    .0003188
             |
econ_disad~e |
Economic ..  |  -.0420491   .0025606   -16.42   0.000    -.0470728   -.0370254
             |
limited_en~f |
Limited E..  |  -.0198687   .0027023    -7.35   0.000    -.0251702   -.0145671
             |
    disabled |
   Disabled  |  -.0546031   .0033131   -16.48   0.000     -.061103   -.0481031
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1398172    .002678    52.21   0.000     .1345633    .1450711
       2016  |   .1273353   .0026751    47.60   0.000     .1220871    .1325835
       2017  |   .1232121   .0028459    43.30   0.000     .1176289    .1287954
       2018  |   .0959466     .00352    27.26   0.000     .0890407    .1028525
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0221592   .0011706    18.93   0.000     .0198627    .0244557
       2016  |   .0163744   .0012216    13.40   0.000     .0139778     .018771
       2017  |   .0167601   .0011561    14.50   0.000     .0144919    .0190282
       2018  |    .018221   .0012921    14.10   0.000      .015686    .0207561
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0112503   .0005105   -22.04   0.000    -.0122518   -.0102488
       2016  |  -.0094581   .0004817   -19.64   0.000    -.0104032   -.0085131
       2017  |  -.0096623   .0004956   -19.49   0.000    -.0106347   -.0086899
       2018  |  -.0090231   .0008151   -11.07   0.000    -.0106222   -.0074241
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1203747   .0027772    43.34   0.000     .1149262    .1258232
       2016  |   .1268731   .0029167    43.50   0.000     .1211509    .1325954
       2017  |   .1233432    .003089    39.93   0.000      .117283    .1294035
       2018  |   .1420238   .0035921    39.54   0.000     .1349765    .1490712
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0157889   .0014477    10.91   0.000     .0129486    .0186291
       2016  |   .0169226   .0013743    12.31   0.000     .0142264    .0196187
       2017  |   .0125478   .0014886     8.43   0.000     .0096273    .0154684
       2018  |   .0318001   .0012039    26.41   0.000     .0294383     .034162
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0096069   .0006048   -15.88   0.000    -.0107936   -.0084203
       2016  |  -.0102987   .0006603   -15.60   0.000    -.0115941   -.0090032
       2017  |  -.0087954   .0007032   -12.51   0.000    -.0101749   -.0074159
       2018  |  -.0090745   .0008137   -11.15   0.000    -.0106709    -.007478
             |
       _cons |   .8346836   .0301797    27.66   0.000     .7754747    .8938926
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_4year_va_enr_4year_og_dk_x_prior_math.ster 
> not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_og_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with acs controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =    2249.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2629
                                                Root MSE          =     .41389

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_4ye.. |
          1  |    .038775   .0021825    17.77   0.000     .0344932    .0430568
          2  |   .0637943   .0027134    23.51   0.000     .0584709    .0691178
          3  |   .0722321   .0027116    26.64   0.000     .0669123    .0775518
          4  |   .0775246    .002849    27.21   0.000     .0719352     .083114
          5  |   .0828698   .0027583    30.04   0.000     .0774583    .0882813
          6  |   .0874595   .0028809    30.36   0.000     .0818074    .0931115
          7  |   .0896928   .0031216    28.73   0.000     .0835687     .095817
          8  |   .0820272    .002788    29.42   0.000     .0765575    .0874968
          9  |   .0715059   .0029586    24.17   0.000     .0657015    .0773104
         10  |   .0498517   .0024594    20.27   0.000     .0450267    .0546767
             |
        year |
       2016  |   .0164833   .0033297     4.95   0.000     .0099507    .0230158
       2017  |   .0177563   .0039036     4.55   0.000     .0100978    .0254148
       2018  |  -.0212835   .0041087    -5.18   0.000    -.0293442   -.0132228
             |
         age |  -.0000761   5.25e-06   -14.48   0.000    -.0000864   -.0000658
             |
        male |
       Male  |  -.0897999   .0017011   -52.79   0.000    -.0931373   -.0864624
 1.eth_asian |   .0713714   .0047821    14.92   0.000     .0619894    .0807534
1.eth_hisp~c |  -.0294925   .0034074    -8.66   0.000    -.0361775   -.0228076
 1.eth_black |   .0317559   .0053537     5.93   0.000     .0212527    .0422592
 1.eth_other |  -.0095331   .0046253    -2.06   0.040    -.0186075   -.0004588
             |
econ_disad~e |
Economic ..  |  -.0485793   .0027802   -17.47   0.000    -.0540337   -.0431249
             |
limited_en~f |
Limited E..  |  -.0204859    .002736    -7.49   0.000    -.0258536   -.0151182
             |
    disabled |
   Disabled  |  -.0525898   .0032564   -16.15   0.000    -.0589784   -.0462011
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1406227   .0026479    53.11   0.000     .1354279    .1458176
       2016  |   .1270434   .0026667    47.64   0.000     .1218116    .1322751
       2017  |   .1241999   .0028555    43.49   0.000     .1185978    .1298021
       2018  |   .0967983   .0035643    27.16   0.000     .0898055     .103791
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0225428    .001127    20.00   0.000     .0203318    .0247539
       2016  |   .0168778   .0011926    14.15   0.000     .0145381    .0192176
       2017  |   .0178243   .0011359    15.69   0.000     .0155958    .0200527
       2018  |   .0189535   .0012748    14.87   0.000     .0164524    .0214546
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0113016   .0005104   -22.14   0.000    -.0123029   -.0103003
       2016  |  -.0094231   .0004843   -19.46   0.000    -.0103732   -.0084731
       2017  |  -.0098908   .0004954   -19.97   0.000    -.0108627   -.0089189
       2018  |  -.0089557   .0008123   -11.03   0.000    -.0105493    -.007362
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1205649   .0027903    43.21   0.000     .1150906    .1260391
       2016  |   .1274109   .0029554    43.11   0.000     .1216128     .133209
       2017  |   .1240601   .0030787    40.30   0.000     .1180201    .1301001
       2018  |    .141577   .0037165    38.09   0.000     .1342857    .1488684
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0171076   .0014818    11.54   0.000     .0142004    .0200148
       2016  |   .0179181   .0014042    12.76   0.000     .0151632    .0206729
       2017  |   .0127499   .0015133     8.43   0.000     .0097811    .0157187
       2018  |   .0322554   .0012324    26.17   0.000     .0298376    .0346733
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0098905   .0006029   -16.41   0.000    -.0110733   -.0087078
       2016  |  -.0104831   .0006662   -15.73   0.000    -.0117902    -.009176
       2017  |  -.0088169   .0007089   -12.44   0.000    -.0102076   -.0074262
       2018  |  -.0089203   .0008277   -10.78   0.000    -.0105442   -.0072965
             |
       _cons |    .823508   .0312343    26.37   0.000       .76223     .884786
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_4year_va_enr_4year_acs_dk_x_prior_ela.ster 
> not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_acs_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =    2191.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2628
                                                Root MSE          =      .4139

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_4ye.. |
          1  |   .0394687   .0021886    18.03   0.000     .0351748    .0437625
          2  |   .0623764   .0028159    22.15   0.000     .0568519    .0679008
          3  |   .0771562   .0026109    29.55   0.000     .0720339    .0822786
          4  |   .0778297   .0026228    29.67   0.000     .0726841    .0829753
          5  |   .0827834   .0028826    28.72   0.000     .0771281    .0884387
          6  |   .0865843   .0031793    27.23   0.000     .0803468    .0928218
          7  |   .0892518   .0028404    31.42   0.000     .0836792    .0948244
          8  |    .079662   .0030638    26.00   0.000     .0736511    .0856728
          9  |    .068274   .0032766    20.84   0.000     .0618457    .0747024
         10  |   .0485579   .0024387    19.91   0.000     .0437735    .0533423
             |
        year |
       2016  |   .0163957   .0033477     4.90   0.000      .009828    .0229634
       2017  |   .0174953   .0039231     4.46   0.000     .0097986     .025192
       2018  |  -.0213388   .0041244    -5.17   0.000    -.0294304   -.0132473
             |
         age |  -.0000759   5.25e-06   -14.45   0.000    -.0000862   -.0000656
             |
        male |
       Male  |  -.0896636   .0017048   -52.59   0.000    -.0930083    -.086319
 1.eth_asian |   .0711978   .0047627    14.95   0.000     .0618538    .0805417
1.eth_hisp~c |  -.0295859   .0034013    -8.70   0.000    -.0362589   -.0229129
 1.eth_black |    .031753   .0053473     5.94   0.000     .0212621    .0422438
 1.eth_other |  -.0095088    .004621    -2.06   0.040    -.0185747   -.0004429
             |
econ_disad~e |
Economic ..  |  -.0485163   .0027788   -17.46   0.000    -.0539679   -.0430647
             |
limited_en~f |
Limited E..  |  -.0204203   .0027588    -7.40   0.000    -.0258328   -.0150078
             |
    disabled |
   Disabled  |  -.0526501     .00325   -16.20   0.000    -.0590261    -.046274
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1403155   .0026662    52.63   0.000     .1350847    .1455464
       2016  |   .1271141   .0026842    47.36   0.000      .121848    .1323802
       2017  |   .1245348   .0028705    43.38   0.000     .1189032    .1301664
       2018  |   .0970606   .0035612    27.26   0.000      .090074    .1040472
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0227989   .0011623    19.61   0.000     .0205186    .0250792
       2016  |   .0169328   .0012129    13.96   0.000     .0145533    .0193123
       2017  |   .0174834   .0011474    15.24   0.000     .0152323    .0197344
       2018  |    .018555   .0012916    14.37   0.000     .0160211    .0210889
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0113161   .0005114   -22.13   0.000    -.0123194   -.0103128
       2016  |  -.0094365   .0004816   -19.59   0.000    -.0103813   -.0084917
       2017  |  -.0098361   .0004959   -19.83   0.000     -.010809   -.0088631
       2018  |  -.0090496   .0008164   -11.09   0.000    -.0106513    -.007448
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1207111   .0027787    43.44   0.000     .1152596    .1261625
       2016  |   .1274556   .0029574    43.10   0.000     .1216534    .1332577
       2017  |    .123767   .0030858    40.11   0.000      .117713     .129821
       2018  |   .1415216   .0036813    38.44   0.000     .1342993    .1487439
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0166882   .0014473    11.53   0.000     .0138488    .0195276
       2016  |   .0177623   .0013718    12.95   0.000     .0150709    .0204537
       2017  |   .0131995   .0014995     8.80   0.000     .0102577    .0161412
       2018  |   .0326365   .0012153    26.85   0.000     .0302522    .0350209
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0097865   .0006047   -16.18   0.000    -.0109728   -.0086002
       2016  |  -.0104882   .0006649   -15.78   0.000    -.0117926   -.0091839
       2017  |  -.0089462   .0007076   -12.64   0.000    -.0103344   -.0075581
       2018  |  -.0088685   .0008186   -10.83   0.000    -.0104745   -.0072624
             |
       _cons |   .8224852   .0312208    26.34   0.000     .7612336    .8837367
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_4year_va_enr_4year_acs_dk_x_prior_math.ster
>  not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_acs_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with sib controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =    2442.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2655
                                                Root MSE          =     .41316

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_4ye.. |
          1  |   .0402567   .0022511    17.88   0.000     .0358404     .044673
          2  |   .0665435   .0027502    24.20   0.000     .0611479    .0719391
          3  |   .0763975   .0027323    27.96   0.000     .0710371     .081758
          4  |   .0819399   .0028756    28.50   0.000     .0762983    .0875814
          5  |   .0871589   .0026693    32.65   0.000      .081922    .0923957
          6  |   .0915771   .0028782    31.82   0.000     .0859303    .0972238
          7  |   .0954596   .0028137    33.93   0.000     .0899396    .1009797
          8  |    .087328    .002516    34.71   0.000     .0823919    .0922642
          9  |   .0760897   .0026462    28.75   0.000     .0708981    .0812812
         10  |   .0521622    .002305    22.63   0.000       .04764    .0566845
             |
        year |
       2016  |    .016433    .003261     5.04   0.000     .0100354    .0228307
       2017  |    .017152   .0039165     4.38   0.000     .0094683    .0248357
       2018  |  -.0214364   .0041255    -5.20   0.000    -.0295302   -.0133426
             |
         age |  -.0000781   5.00e-06   -15.61   0.000    -.0000879   -.0000683
             |
        male |
       Male  |  -.0897639   .0016998   -52.81   0.000    -.0930988    -.086429
 1.eth_asian |   .0737055   .0041969    17.56   0.000     .0654715    .0819394
1.eth_hisp~c |  -.0300654   .0030273    -9.93   0.000    -.0360047   -.0241261
 1.eth_black |   .0284164   .0052149     5.45   0.000     .0181854    .0386474
 1.eth_other |  -.0086548   .0044614    -1.94   0.053    -.0174077     .000098
             |
econ_disad~e |
Economic ..  |  -.0416904   .0025651   -16.25   0.000    -.0467229    -.036658
             |
limited_en~f |
Limited E..  |  -.0202216   .0026851    -7.53   0.000    -.0254895   -.0149538
             |
    disabled |
   Disabled  |  -.0546376   .0033262   -16.43   0.000    -.0611633   -.0481119
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1404622   .0026725    52.56   0.000      .135219    .1457054
       2016  |   .1275815   .0026586    47.99   0.000     .1223655    .1327974
       2017  |   .1235592    .002832    43.63   0.000     .1180031    .1291153
       2018  |   .0961109   .0035331    27.20   0.000     .0891793    .1030425
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0218865   .0011236    19.48   0.000     .0196822    .0240907
       2016  |   .0163241   .0011944    13.67   0.000     .0139808    .0186674
       2017  |   .0171651   .0011483    14.95   0.000     .0149124    .0194179
       2018  |   .0187236   .0012625    14.83   0.000     .0162466    .0212006
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0112071   .0005085   -22.04   0.000    -.0122047   -.0102095
       2016  |  -.0094272   .0004845   -19.46   0.000    -.0103777   -.0084767
       2017  |  -.0097353   .0004959   -19.63   0.000    -.0107083   -.0087624
       2018  |  -.0088439   .0008068   -10.96   0.000    -.0104267   -.0072611
             |
        year#|
          c. |
prior_mat~re |
       2015  |    .119856   .0027909    42.95   0.000     .1143806    .1253315
       2016  |   .1265179   .0029126    43.44   0.000     .1208036    .1322322
       2017  |   .1232851   .0030729    40.12   0.000     .1172565    .1293137
       2018  |   .1416959   .0036369    38.96   0.000     .1345607     .148831
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0162301   .0014783    10.98   0.000     .0133298    .0191304
       2016  |   .0171428   .0014019    12.23   0.000     .0143923    .0198932
       2017  |   .0121779   .0015091     8.07   0.000     .0092173    .0151386
       2018  |   .0312876    .001223    25.58   0.000     .0288881     .033687
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0097453   .0006013   -16.21   0.000     -.010925   -.0085657
       2016  |  -.0103445    .000662   -15.63   0.000    -.0116432   -.0090458
       2017  |  -.0087325   .0007052   -12.38   0.000    -.0101159    -.007349
       2018  |  -.0092407   .0008276   -11.17   0.000    -.0108644   -.0076169
             |
       _cons |   .8343285   .0302002    27.63   0.000     .7750792    .8935778
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_4year_va_enr_4year_sib_dk_x_prior_ela.ster 
> not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_sib_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =    2350.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2654
                                                Root MSE          =     .41318

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_4ye.. |
          1  |   .0413175   .0021818    18.94   0.000     .0370371    .0455979
          2  |   .0644015   .0028865    22.31   0.000     .0587386    .0700645
          3  |   .0807243   .0027631    29.22   0.000     .0753034    .0861451
          4  |   .0816877   .0026322    31.03   0.000     .0765236    .0868518
          5  |   .0871846   .0028011    31.13   0.000     .0816891      .09268
          6  |   .0909328   .0029769    30.55   0.000     .0850924    .0967732
          7  |   .0938082   .0027192    34.50   0.000     .0884734    .0991431
          8  |   .0860136   .0027187    31.64   0.000     .0806798    .0913474
          9  |   .0738009   .0027668    26.67   0.000     .0683727    .0792291
         10  |   .0512017   .0021915    23.36   0.000     .0469023     .055501
             |
        year |
       2016  |   .0163538   .0032763     4.99   0.000     .0099261    .0227814
       2017  |   .0169584   .0039332     4.31   0.000      .009242    .0246748
       2018  |  -.0214091   .0041388    -5.17   0.000    -.0295289   -.0132893
             |
         age |   -.000078   5.01e-06   -15.59   0.000    -.0000878   -.0000682
             |
        male |
       Male  |  -.0895874   .0017043   -52.57   0.000     -.092931   -.0862437
 1.eth_asian |    .073631   .0042091    17.49   0.000     .0653732    .0818889
1.eth_hisp~c |  -.0301861   .0030197   -10.00   0.000    -.0361104   -.0242619
 1.eth_black |    .028467   .0052002     5.47   0.000     .0182649    .0386692
 1.eth_other |  -.0086571   .0044585    -1.94   0.052    -.0174042      .00009
             |
econ_disad~e |
Economic ..  |   -.041748   .0025678   -16.26   0.000    -.0467857   -.0367103
             |
limited_en~f |
Limited E..  |  -.0198997   .0027097    -7.34   0.000    -.0252159   -.0145836
             |
    disabled |
   Disabled  |  -.0547476   .0033187   -16.50   0.000    -.0612585   -.0482366
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1397402   .0026798    52.15   0.000     .1344827    .1449978
       2016  |   .1272094   .0026741    47.57   0.000      .121963    .1324557
       2017  |   .1233023    .002848    43.29   0.000     .1177149    .1288898
       2018  |   .0959859   .0035225    27.25   0.000     .0890752    .1028967
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0221535   .0011695    18.94   0.000     .0198591     .024448
       2016  |    .016341   .0012226    13.37   0.000     .0139424    .0187396
       2017  |   .0167574   .0011568    14.49   0.000     .0144879    .0190268
       2018  |   .0182319    .001293    14.10   0.000     .0156951    .0207687
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0112427   .0005104   -22.03   0.000     -.012244   -.0102413
       2016  |   -.009448    .000482   -19.60   0.000    -.0103937   -.0085024
       2017  |  -.0096738   .0004958   -19.51   0.000    -.0106465    -.008701
       2018  |  -.0090325   .0008153   -11.08   0.000     -.010632   -.0074331
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1204117   .0027821    43.28   0.000     .1149534    .1258699
       2016  |   .1269101   .0029231    43.42   0.000     .1211753    .1326448
       2017  |   .1233831   .0030896    39.93   0.000     .1173216    .1294445
       2018  |   .1419197    .003592    39.51   0.000     .1348726    .1489668
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0157843   .0014524    10.87   0.000     .0129347    .0186338
       2016  |   .0169246   .0013763    12.30   0.000     .0142244    .0196249
       2017  |   .0125399   .0014887     8.42   0.000     .0096193    .0154605
       2018  |   .0317482   .0012055    26.34   0.000     .0293833    .0341132
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0096076   .0006056   -15.86   0.000    -.0107958   -.0084194
       2016  |  -.0102965   .0006607   -15.59   0.000    -.0115926   -.0090003
       2017  |  -.0087954   .0007034   -12.50   0.000    -.0101755   -.0074154
       2018  |  -.0090664   .0008137   -11.14   0.000    -.0106628   -.0074701
             |
       _cons |    .833711   .0302004    27.61   0.000     .7744614    .8929607
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_4year_va_enr_4year_sib_dk_x_prior_math.ster
>  not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_sib_dk_x_prior_math.ster saved
RHS DK VA: Deep Knowledge VA with both controls
interaction with prior ela score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =    2265.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2628
                                                Root MSE          =     .41392

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_ela~le#|
          c. |
va_enr_4ye.. |
          1  |   .0387115   .0021978    17.61   0.000     .0343997    .0430233
          2  |   .0636948   .0027125    23.48   0.000     .0583731    .0690165
          3  |   .0720729    .002727    26.43   0.000     .0667229    .0774229
          4  |   .0772495   .0028695    26.92   0.000     .0716198    .0828791
          5  |    .082711   .0027779    29.77   0.000     .0772611    .0881609
          6  |   .0872309   .0029045    30.03   0.000     .0815326    .0929292
          7  |   .0896388   .0031354    28.59   0.000     .0834876      .09579
          8  |   .0819384   .0027827    29.45   0.000     .0764791    .0873977
          9  |   .0714231   .0029365    24.32   0.000     .0656621    .0771841
         10  |   .0497666   .0024349    20.44   0.000     .0449896    .0545437
             |
        year |
       2016  |   .0164531   .0033565     4.90   0.000      .009868    .0230381
       2017  |   .0177335   .0039013     4.55   0.000     .0100796    .0253873
       2018  |  -.0212886   .0041074    -5.18   0.000    -.0293468   -.0132304
             |
         age |   -.000076   5.26e-06   -14.45   0.000    -.0000863   -.0000656
             |
        male |
       Male  |   -.089812   .0017011   -52.80   0.000    -.0931494   -.0864746
 1.eth_asian |   .0713879   .0047644    14.98   0.000     .0620407    .0807351
1.eth_hisp~c |  -.0293825   .0034056    -8.63   0.000    -.0360639   -.0227011
 1.eth_black |   .0318951   .0053655     5.94   0.000     .0213686    .0424216
 1.eth_other |  -.0096899   .0046133    -2.10   0.036    -.0187408   -.0006391
             |
econ_disad~e |
Economic ..  |  -.0482883   .0027819   -17.36   0.000    -.0537462   -.0428305
             |
limited_en~f |
Limited E..  |  -.0204873    .002744    -7.47   0.000    -.0258708   -.0151039
             |
    disabled |
   Disabled  |  -.0527153   .0032623   -16.16   0.000    -.0591156    -.046315
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1405896   .0026503    53.05   0.000     .1353901    .1457891
       2016  |   .1269717   .0026653    47.64   0.000     .1217427    .1322008
       2017  |   .1242967   .0028572    43.50   0.000     .1186912    .1299021
       2018  |    .096838   .0035651    27.16   0.000     .0898438    .1038323
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0225282   .0011268    19.99   0.000     .0203176    .0247388
       2016  |   .0168504   .0011936    14.12   0.000     .0145087    .0191921
       2017  |   .0178197   .0011364    15.68   0.000     .0155903    .0200492
       2018  |   .0189703   .0012747    14.88   0.000     .0164695    .0214712
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0112937   .0005102   -22.14   0.000    -.0122946   -.0102928
       2016  |  -.0094151   .0004845   -19.43   0.000    -.0103658   -.0084645
       2017  |  -.0099021   .0004955   -19.99   0.000    -.0108742     -.00893
       2018  |  -.0089553    .000812   -11.03   0.000    -.0105484   -.0073621
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1205749   .0027956    43.13   0.000     .1150902    .1260597
       2016  |   .1274362   .0029612    43.04   0.000     .1216267    .1332457
       2017  |   .1240962   .0030801    40.29   0.000     .1180534    .1301389
       2018  |   .1414776   .0037146    38.09   0.000       .13419    .1487653
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |   .0171072   .0014833    11.53   0.000     .0141972    .0200173
       2016  |    .017921   .0014046    12.76   0.000     .0151653    .0206767
       2017  |   .0127459   .0015128     8.43   0.000      .009778    .0157139
       2018  |   .0321954   .0012331    26.11   0.000     .0297761    .0346147
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0098954   .0006033   -16.40   0.000    -.0110789   -.0087119
       2016  |  -.0104871   .0006665   -15.74   0.000    -.0117946   -.0091796
       2017  |  -.0088187   .0007091   -12.44   0.000    -.0102099   -.0074275
       2018  |  -.0089228   .0008274   -10.78   0.000     -.010546   -.0072996
             |
       _cons |   .8226269   .0312476    26.33   0.000     .7613229     .883931
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_4year_va_enr_4year_both_dk_x_prior_ela.ster
>  not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_both_dk_x_prior_ela.ster saved
interaction with prior math score deciles 

Linear regression                               Number of obs     =    431,867
                                                F(46, 1237)       =    2199.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2627
                                                Root MSE          =     .41393

                            (Std. err. adjusted for 1,238 clusters in cdscode)
------------------------------------------------------------------------------
             |               Robust
   enr_4year | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prior_mat~le#|
          c. |
va_enr_4ye.. |
          1  |    .039391    .002188    18.00   0.000     .0350985    .0436836
          2  |   .0623099   .0028213    22.09   0.000     .0567749    .0678449
          3  |   .0771196   .0026317    29.30   0.000     .0719565    .0822827
          4  |   .0776006   .0026382    29.41   0.000     .0724248    .0827764
          5  |   .0825227   .0028982    28.47   0.000     .0768367    .0882086
          6  |   .0863346   .0032019    26.96   0.000     .0800528    .0926165
          7  |   .0889701   .0028638    31.07   0.000     .0833517    .0945886
          8  |   .0795658   .0030603    26.00   0.000     .0735618    .0855697
          9  |   .0682818   .0032538    20.99   0.000     .0618982    .0746654
         10  |   .0485557    .002422    20.05   0.000     .0438041    .0533074
             |
        year |
       2016  |   .0163667    .003375     4.85   0.000     .0097454    .0229881
       2017  |   .0174669   .0039203     4.46   0.000     .0097758     .025158
       2018  |  -.0213445   .0041232    -5.18   0.000    -.0294337   -.0132554
             |
         age |  -.0000758   5.26e-06   -14.42   0.000    -.0000861   -.0000655
             |
        male |
       Male  |  -.0896755   .0017047   -52.61   0.000    -.0930198   -.0863311
 1.eth_asian |   .0712249   .0047476    15.00   0.000     .0619108    .0805391
1.eth_hisp~c |  -.0294728   .0033999    -8.67   0.000     -.036143   -.0228025
 1.eth_black |    .031889   .0053597     5.95   0.000      .021374    .0424041
 1.eth_other |  -.0096561   .0046087    -2.10   0.036    -.0186978   -.0006143
             |
econ_disad~e |
Economic ..  |  -.0482312   .0027809   -17.34   0.000    -.0536871   -.0427754
             |
limited_en~f |
Limited E..  |  -.0204124   .0027672    -7.38   0.000    -.0258413   -.0149835
             |
    disabled |
   Disabled  |  -.0527735    .003255   -16.21   0.000    -.0591594   -.0463875
             |
        year#|
          c. |
prior_ela~re |
       2015  |   .1402529   .0026681    52.57   0.000     .1350185    .1454873
       2016  |   .1270075   .0026827    47.34   0.000     .1217444    .1322707
       2017  |   .1246374   .0028721    43.40   0.000     .1190028    .1302721
       2018  |   .0970956   .0035625    27.25   0.000     .0901063    .1040848
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |   .0227874   .0011617    19.62   0.000     .0205083    .0250666
       2016  |   .0168982    .001214    13.92   0.000     .0145165    .0192799
       2017  |   .0174767   .0011478    15.23   0.000     .0152248    .0197287
       2018  |   .0185616   .0012925    14.36   0.000     .0160259    .0210972
             |
        year#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re#|
          c. |
prior_ela~re |
       2015  |  -.0113089   .0005113   -22.12   0.000    -.0123121   -.0103058
       2016  |  -.0094278   .0004819   -19.56   0.000    -.0103733   -.0084824
       2017  |  -.0098475   .0004961   -19.85   0.000    -.0108208   -.0088743
       2018  |  -.0090587   .0008165   -11.09   0.000    -.0106607   -.0074568
             |
        year#|
          c. |
prior_mat~re |
       2015  |   .1207438   .0027838    43.37   0.000     .1152823    .1262054
       2016  |    .127495   .0029635    43.02   0.000     .1216809    .1333091
       2017  |   .1237971   .0030867    40.11   0.000     .1177414    .1298528
       2018  |   .1414377   .0036796    38.44   0.000     .1342189    .1486566
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |     .01668   .0014517    11.49   0.000     .0138319    .0195281
       2016  |   .0177629   .0013738    12.93   0.000     .0150676    .0204582
       2017  |   .0131949   .0014996     8.80   0.000     .0102529     .016137
       2018  |   .0325879   .0012168    26.78   0.000     .0302007    .0349752
             |
        year#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re#|
          c. |
prior_mat~re |
       2015  |  -.0097875   .0006054   -16.17   0.000    -.0109753   -.0085997
       2016  |  -.0104879   .0006652   -15.77   0.000     -.011793   -.0091828
       2017  |   -.008948   .0007078   -12.64   0.000    -.0103366   -.0075593
       2018  |  -.0088641   .0008183   -10.83   0.000    -.0104695   -.0072586
             |
       _cons |   .8216658   .0312352    26.31   0.000     .7603859    .8829457
------------------------------------------------------------------------------

added scalars:
              e(ymean) =  .36722417
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/persistence/het_reg_enr_4year_va_enr_4year_both_dk_x_prior_math.ste
> r not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/persistence/het_reg_enr_4year_va_enr_4year_both_dk_x_prior_math.ster saved

. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:    184.92 /        1 =     184.9240

. 
. set trace off

. cd $projdir
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/reg_out_va_sib_acs_dk.smcl
  log type:  smcl
 closed on:  10 May 2022, 18:31:32
-------------------------------------------------------------------------------
