{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvaregs/createsiblingvasample.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Oct 2021, 14:59:59
{txt}
{com}. 
. 
. //set a timer for this do file to see how long it runs
. timer on 1
{txt}
{com}. 
. 
. 
. ********************************************************************************
. //create sibling college outcome vars
. //First load the k12 test score sample matched to postsecondary outcome data
. 
. use `k12_postsecondary_out_merge', clear
{txt}(Full K-12 test scores merged to postsecondary outcomes)

{com}. //collapse to ssid level
. collapse (max) enr enr_2year enr_4year, by(state_student_id)
{res}{txt}
{com}. 
. //merge on unique family id
. merge 1:1 state_student_id using `ufamilyxwalk'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       8,718,171
{txt}{col 9}from master{col 30}{res}       8,590,681{txt}  (_merge==1)
{col 9}from using{col 30}{res}         127,490{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       3,957,189{txt}  (_merge==3)
{col 5}{hline 41}

{com}. /*
> Result                      Number of obs
>     -----------------------------------------
>     Not matched                     8,718,171
>         from master                 8,590,681  (_merge==1)
>         from using                    127,490  (_merge==2)
> 
>     Matched                         3,957,189  (_merge==3)
>     -----------------------------------------
> 
>  */
. 
. //keep only the sample of matched siblings
. drop if missing(ufamilyid)
{txt}(8,590,681 observations deleted)

{com}. //mark sibling sample for merged observations
. gen sibling_out_sample = 0
{txt}
{com}. replace sibling_out_sample = 1 if _merge==3
{txt}(3,957,189 real changes made)

{com}. label var sibling_out_sample "Indicator for sibling sample with matched postsecondary outcomes"
{txt}
{com}. drop _merge
{txt}
{com}. 
. /* NEED TO CREATE PROPS ENROLLED FOR OLDER SIBLINGS  */
. //number of siblings total in the family ranges from 1 to 10, so max number of older siblings is 9
. 
. /* this rangestat command calculates the sum of the variable for observations in
> the interval between birth_order - lower_bound and birth_order - 1, which is all the older siblings  */
. /* NOTE: rangestat treats missing enr vars as 0 */
. 
. sort ufamilyid birth_order
{txt}
{com}. gen lower_bound = -numsiblings_older
{txt}
{com}. local outcomes enr enr_2year enr_4year
{txt}
{com}. foreach i of local outcomes {c -(}
{txt}  2{com}.   rangestat (sum) `i', interval(birth_order, lower_bound, -1) by(ufamilyid)
{txt}  3{com}.   rename `i'_sum numsiblings_older_`i'
{txt}  4{com}.   label var numsiblings_older_`i' "Number of older siblings with `i'==1"
{txt}  5{com}.   gen propsiblings_older_`i' = numsiblings_older_`i' / numsiblings_older
{txt}  6{com}.   label var propsiblings_older_`i' "Proportion of older siblings with `i'==1"
{txt}  7{com}. {c )-}
{res}{txt}(1,714,556 missing values generated)
{res}{txt}(1,714,556 missing values generated)
{res}{txt}(1,714,556 missing values generated)

{com}. 
. 
. //create sibling outcomes crosswalk
. compress
  {txt}variable {bf}{res}sibling_out_sample{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}lower_bound{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}numsiblings_older_enr{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}numsiblings_older_enr_2year{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}numsiblings_older_enr_4year{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
{txt}  (110,286,333 bytes saved)

{com}. label data "Sibling enrollment outcomes crosswalk organized by unique families"
{txt}
{com}. save $projdir/dta/siblingxwalk/sibling_out_xwalk
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
.  timer off 1
{txt}
{com}.  timer list
{res}   1:    185.50 /        1 =     185.5030
{txt}
{com}.  log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvaregs/createsiblingvasample.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}20 Oct 2021, 15:03:04
{txt}{.-}
{smcl}
{txt}{sf}{ul off}