{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/siblingvasamples.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Apr 2022, 02:27:58
{txt}
{com}. 
. /* file path macros  */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh
{txt}
{com}. ********************************************************************************
. /* Macros for common core VA project folder file paths, and relevant datasets to make it possible
> to use Matt's doh files  */
. ********************************************************************************
. ********************************************************************************
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
. //adapted matt do files
. local vaprojdofiles "$vaprojdir/do_files"
{txt}
{com}. 
. local ca_ed_lab "/home/research/ca_ed_lab"
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores"
{txt}
{com}. local public_access "/home/research/ca_ed_lab/data/public_access"
{txt}
{com}. local k12_public_schools "/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools"
{txt}
{com}. local k12_test_scores_public "/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores"
{txt}
{com}. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"
{txt}
{com}. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"
{txt}
{com}. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"
{txt}
{com}. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"
{txt}
{com}. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"
{txt}
{com}. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecondary_out_merge"
{txt}
{com}. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"
{txt}
{com}. {txt}
{com}. 
. //set a timer for this do file to see how long it runs
. timer on 1
{txt}
{com}. 
. 
. ********************************************************************************
. /* This first block of code is directly taken from Matt's touse_Va.do */
. 
. **********
. * Macros *
. **********
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh
{txt}
{com}. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. #delimit ;
{txt}delimiter now ;
{com}. #delimit cr
{txt}delimiter now cr
{com}. macro list
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_6:{space 12}{res}{res}.7097029923018954
{p_end}
{txt}{p 0 16}
S_5:{space 12}{res}{res}4
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.379339567907114
{p_end}
{txt}{p 0 16}
ReS_jv2:{space 8}{res}{res}__000006 __000007 __000008 __000009 __00000A __00000B __00000C __00000D __00000E __00000F __00000G __00000H __00000I __00000J __00000K
{p_end}
{txt}{p 0 16}
dropv:{space 10}{res}{res}_cdscode_x
{p_end}
{txt}{p 0 16}
n_offset:{space 7}{res}{res}0
{p_end}
{txt}{p 0 16}
sort:{space 11}{res}{res}0
{p_end}
{txt}{p 0 16}
dots:{space 11}{res}{res}nois _dots 5 0
{p_end}
{txt}{p 0 16}
dotss:{space 10}{res}{res}nois _dots 0, title(Survey results being calculated)
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.0104764158075594
{p_end}
{txt}{p 0 16}
ReS_Call:{space 7}{res}{res}version 16.1:
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_ca_ed_lab:{space 5}{res}{res}/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files
{p_end}
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. *****************
. * Begin Do File *
. *****************
. **************** Create VA Dataset
. use merge_id_k12_test_scores all_students_sample first_scores_sample ///
>         dataset test cdscode school_id state_student_id year grade ///
>         cohort_size ///
>         sbac_ela_z_score sbac_math_z_score ///
>         `va_control_vars' ///
>         using `k12_test_scores'/k12_test_scores_clean.dta, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. mark touse
{txt}
{com}. 
. * Merge to lagged scores
. merge 1:1 merge_id_k12_test_scores using `k12_test_scores'/k12_lag_test_scores_clean.dta, nogen keep(1 3) ///
>         keepusing( ///
>                 L3_cst_ela_z_score ///
>                 L3_sbac_ela_z_score ///
>                 L4_cst_ela_z_score ///
>                 L3_sbac_math_z_score ///
>                 L4_sbac_math_z_score ///
>                 L5_cst_math_z_score ///
>                 L6_cst_math_z_score ///
>         )
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to peer scores
. merge 1:1 merge_id_k12_test_scores using `k12_test_scores'/k12_peer_test_scores_clean.dta, nogen keep(1 3) ///
>         keepusing( ///
>                 `peer_demographic_controls' ///
>                 peer_L3_cst_ela_z_score ///
>                 peer_L3_sbac_ela_z_score ///
>                 peer_L4_cst_ela_z_score ///
>                 peer_L3_sbac_math_z_score ///
>                 peer_L4_sbac_math_z_score ///
>                 peer_L5_cst_math_z_score ///
>                 peer_L6_cst_math_z_score ///
>         )
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  
{col 5}{hline 41}

{com}. 
. * Merge to school grade spans
. merge m:1 cdscode year using `k12_test_scores_public'/k12_diff_school_prop_schyr.dta ///
>         , gen(merge_grade_span) keepusing(gr11_*_diff_school_prop) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         445,910
{txt}{col 9}from master{col 30}{res}         445,910{txt}  (merge_grade_span==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_grade_span==2)

{col 5}Matched{col 30}{res}      78,176,233{txt}  (merge_grade_span==3)
{col 5}{hline 41}

{com}. 
. * Merge to median cohort sizes
. merge m:1 cdscode using `k12_test_scores_public'/k12_cohort_size_sch.dta ///
>         , gen(merge_cohort_size) keepusing(med_cohort_size_first_scores) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      78,622,143{txt}  (merge_cohort_size==3)
{col 5}{hline 41}

{com}. 
. * Keep conventional schools
. merge m:1 cdscode using `k12_public_schools'/k12_public_schools_clean.dta ///
>         , gen(merge_public_schools) keepusing(conventional_school) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       1,432,257
{txt}{col 9}from master{col 30}{res}       1,432,257{txt}  (merge_public_schools==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_public_schools==2)

{col 5}Matched{col 30}{res}      77,189,886{txt}  (merge_public_schools==3)
{col 5}{hline 41}

{com}. replace touse = 0 if conventional_school!=1
{txt}(3,908,486 real changes made)

{com}. 
. * Exclude schools where more than 25 percent of students are receiving special education services
. 
. * Drop if a student is receiving instruction at home, in a hospital, or in a school serving disabled students solely
. 
. * Drop if 10 or fewer students per school
. replace touse = 0 if cohort_size<=10
{txt}(474,064 real changes made)

{com}. 
. 
. 
. 
. ******** Postsecondary Outcomes
. do $vaprojdir/do_files/merge_k12_postsecondary.doh enr_only
{txt}
{com}. version 16.1
{txt}
{com}. 
. *****************************************************
. * First created by Matthew Naven on June 11, 2018 *
. *****************************************************
. 
. local crosswalks "/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks/"
{txt}
{com}. 
. ***************
. * Description *
. ***************
. /*
> This file merges the K-12 data to the postsecondary data.
> */
. 
. 
. **********
. * Macros *
. **********
. args enr_only
{txt}
{com}. 
. local min_nsc_hs_grad_year "2010"
{txt}
{com}. local max_nsc_hs_grad_year "2019"
{txt}
{com}. 
. local min_nsc_enr_year "2010"
{txt}
{com}. local max_nsc_enr_year "2020"
{txt}
{com}. 
. local min_nsc_deg_year "2011"
{txt}
{com}. local max_nsc_deg_year "2020"
{txt}
{com}. 
. local min_ccc_enr_year "1993"
{txt}
{com}. local max_ccc_enr_year "2017"
{txt}
{com}. 
. local min_ccc_deg_year "1993"
{txt}
{com}. local max_ccc_deg_year "2016"
{txt}
{com}. 
. local min_csu_app_year "2002"
{txt}
{com}. local max_csu_app_year "2017"
{txt}
{com}. 
. local min_csu_enr_year "2002"
{txt}
{com}. local max_csu_enr_year "2017"
{txt}
{com}. 
. local min_csu_deg_year "2002"
{txt}
{com}. local max_csu_deg_year "2016"
{txt}
{com}. 
. 
. *****************
. * Begin Do File *
. *****************
. **** K-12 Variables
. gen year_grad_hs = year + (12 - grade)
{txt}(446,511 missing values generated)

{com}. gen year_college = year + (13 - grade)
{txt}(446,511 missing values generated)

{com}. 
. 
. 
. 
. **** Merge to K-12/NSC crosswalk
. gen k12_nsc_match = 0
{txt}
{com}. gen k12_nsc_2010_2017_match = 0
{txt}
{com}. /*gen k12_nsc_2010_2018_match = 0*/
. gen k12_nsc_2018cde_match = 0
{txt}
{com}. gen k12_nsc_2019cde_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}year_grad_hs{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}year_college{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}k12_nsc_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2010_2017_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2018cde_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_nsc_2019cde_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (1,257,954,288 bytes saved)

{com}. 
. 
. ** NSC
. merge m:1 state_student_id      using `crosswalks'/nsc_outcomes_crosswalk_ssid.dta, gen(merge_k12_nsc_ssid) keep(1 3 4 5) update
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      40,618,118
{txt}{col 9}from master{col 30}{res}      40,618,118{txt}  (merge_k12_nsc_ssid==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==2)

{col 5}Matched{col 30}{res}      38,004,025
{txt}{col 9}not updated{col 30}{res}      38,004,025{txt}  (merge_k12_nsc_ssid==3)
{col 9}missing updated{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==4)
{col 9}nonmissing conflict{col 30}{res}               0{txt}  (merge_k12_nsc_ssid==5)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. replace k12_nsc_match = 1 if inlist(merge_k12_nsc_ssid, 3, 4, 5)
{txt}(38,004,025 real changes made)

{com}. drop merge_k12_nsc_ssid
{txt}
{com}. 
. 
. 
. ** Edit NSC Variables
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist "nsc_enr nsc_enr_lt2year nsc_enr_2year nsc_enr_4year nsc_enr_ontime nsc_enr_ontime_lt2year nsc_enr_ontime_2year nsc_enr_ontime_4year"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist "nsc_*"
. {c )-}
{txt}
{com}. * Replace NSC variables with missing if no chance of matching to the NSC data
. foreach v of varlist `varlist' {c -(}
{txt}  2{com}.         replace `v' = . if k12_nsc_match==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         * Replace NSC persistence variables with missing if never enrolled
.         foreach v of varlist nsc_persist_year2 nsc_persist_year3 nsc_persist_year4 {c -(}
{txt}  2{com}.                 replace `v' = . if nsc_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 4 {c -(}
{txt}  2{com}.                 * Replace NSC persistence variables with 0 if they could have matched to the NSC data but didn't
.                 replace nsc_persist_year`t' = 0 if nsc_enr==1 & nsc_persist_year`t'!=1 & k12_nsc_match==1 & year_grad_hs + (`t' - 1)<=`max_nsc_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC persistence variables with missing if they could not have matched to the NSC data
.                 replace nsc_persist_year`t' = . if nsc_enr==1 & /*nsc_persist_year`t'!=1 &*/ k12_nsc_match==1 & year_grad_hs + (`t' - 1)>`max_nsc_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_lt2year {c -(}
{txt}  2{com}.                 * Replace NSC less-than-2-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 2<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC less-than-2-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 2>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_2year {c -(}
{txt}  2{com}.                 * Replace NSC 2-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 3<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC 2-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 3>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist nsc_deg_4year {c -(}
{txt}  2{com}.                 * Replace NSC 4-year degree variable with 0 if they could have matched to the NSC data but didn't
.                 replace `v' = 0 if `v'!=1 & k12_nsc_match==1 & year_grad_hs + 6<=`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace NSC 4-year degree variable with missing if they could not have matched to the NSC data
.                 replace `v' = . if /*`v'!=1 &*/ k12_nsc_match==1 & year_grad_hs + 6>`max_nsc_deg_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * NSC degree receipt conditional on enrollment
.         gen nsc_enr_deg_lt2year = nsc_deg_lt2year if nsc_enr_lt2year==1
.         gen nsc_enr_deg_2year = nsc_deg_2year if nsc_enr_2year==1
.         gen nsc_enr_deg_4year = nsc_deg_4year if nsc_enr_4year==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. 
. 
. **** Merge to K-12/CCC crosswalk
. gen k12_ccc_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}k12_ccc_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (235,866,429 bytes saved)

{com}. 
. merge m:1 state_student_id ///
>         using `crosswalks'/k12_ccc_crosswalk.dta ///
>         , gen(merge_k12_ccc) keep(1 3) keepusing(student_id)
{res}{txt}(label {bf:{txt}male} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      58,447,747
{txt}{col 9}from master{col 30}{res}      58,447,747{txt}  (merge_k12_ccc==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_ccc==2)

{col 5}Matched{col 30}{res}      20,174,396{txt}  (merge_k12_ccc==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. replace k12_ccc_match = 1 if merge_k12_ccc==3
{txt}(20,174,396 real changes made)

{com}. drop merge_k12_ccc
{txt}
{com}. 
. 
. **** Merge to CCC data
. count if !mi(student_id)
  {res}20,174,396
{txt}
{com}. 
. merge m:1 student_id ///
>         using `crosswalks'/ccc_outcomes_crosswalk.dta ///
>         , gen(merge_k12_ccc) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      63,124,201
{txt}{col 9}from master{col 30}{res}      63,124,201{txt}  (merge_k12_ccc==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_ccc==2)

{col 5}Matched{col 30}{res}      15,497,942{txt}  (merge_k12_ccc==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. ** Edit CCC Variables
. foreach v of varlist ccc_enr {c -(}
{txt}  2{com}.         * Replace CCC enrollment with 0 if could have matched to the CCC data but didn't
.         replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_ccc_enr_year', `max_ccc_enr_year')
{txt}  3{com}.         * Replace CCC enrollment with missing if could not have matched to the CCC data
.         replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_ccc_enr_year', `max_ccc_enr_year')
{txt}  4{com}. {c )-}
{txt}(34,923,079 real changes made)
(5,008,197 real changes made, 5,008,197 to missing)

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. * CCC on-time enrollment
. gen ccc_enr_ontime = 1 if ccc_enr==1 ///
>         & (ccc_enr_start_year==year_grad_hs & inlist(ccc_enr_start_term, 5, 6, 7, 8)) ///
>         | (ccc_enr_start_year==year_grad_hs + 1 & inlist(ccc_enr_start_term, 1, 2, 3, 4))
{txt}(73,900,307 missing values generated)

{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         * Replace CCC remediation and persistence variables with missing if never enrolled
.         foreach v of varlist ccc_remediation ccc_ela_remediation ccc_math_remediation ///
>                 ccc_persist_year2 ccc_persist_year3 ///
>                 ccc_deg ccc_deg_c ccc_deg_a ccc_deg_b {c -(}
{txt}  2{com}.                 replace `v' = . if ccc_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 3 {c -(}
{txt}  2{com}.                 * Replace CCC persistence variables with 0 if they could have matched to the CCC data but didn't
.                 replace ccc_persist_year`t' = 0 if ccc_enr==1 & ccc_persist_year`t'!=1 & k12_ccc_match==1 & year_grad_hs + (`t' - 1)<=`max_ccc_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace CCC persistence variables with missing if they could not have matched to the CCC data
.                 replace ccc_persist_year`t' = . if ccc_enr==1 & /*ccc_persist_year`t'!=1 &*/ k12_ccc_match==1 & year_grad_hs + (`t' - 1)>`max_ccc_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist ccc_deg ccc_deg_c ccc_deg_a ccc_deg_b {c -(}
{txt}  2{com}.                 * Replace CCC degree variable with 0 if they could have matched to the CCC data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs + 3, `min_ccc_deg_year', `max_ccc_deg_year')
{txt}  3{com}.                 * Replace CCC degree variable with missing if they could not have matched to the CCC data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs + 3, `min_ccc_deg_year', `max_ccc_deg_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. 
. 
. **** Merge to K-12/CSU crosswalk
. gen k12_csu_match = 0
{txt}
{com}. compress
  {txt}variable {bf}{res}ccc_enr_year{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}ccc_enr_ontime{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}k12_csu_match{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (550,355,001 bytes saved)

{com}. 
. merge m:1 state_student_id ///
>         using `crosswalks'/k12_csu_crosswalk.dta ///
>         , gen(merge_k12_csu) keep(1 3) keepusing(idunique)
{res}{txt}(label {bf:{txt}male} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      70,021,720
{txt}{col 9}from master{col 30}{res}      70,021,720{txt}  (merge_k12_csu==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_csu==2)

{col 5}Matched{col 30}{res}       8,600,423{txt}  (merge_k12_csu==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. replace k12_csu_match = 1 if merge_k12_csu==3
{txt}(8,600,423 real changes made)

{com}. drop merge_k12_csu
{txt}
{com}. 
. 
. **** Merge to CSU data
. count if !mi(idunique)
  {res}8,600,423
{txt}
{com}. 
. merge m:1 idunique ///
>         using `crosswalks'/csu_outcomes_crosswalk.dta ///
>         , gen(merge_k12_csu) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      70,021,720
{txt}{col 9}from master{col 30}{res}      70,021,720{txt}  (merge_k12_csu==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_csu==2)

{col 5}Matched{col 30}{res}       8,600,423{txt}  (merge_k12_csu==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. ** Edit CSU Variables
. foreach v of varlist csu_enr {c -(}
{txt}  2{com}.         * Replace CSU enrollment with 0 if could have matched to the CSU data but didn't
.         replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_csu_enr_year', `max_csu_enr_year')
{txt}  3{com}.         * Replace CSU enrollment with missing if could not have matched to the CSU data
.         replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_csu_enr_year', `max_csu_enr_year')
{txt}  4{com}. {c )-}
{txt}(36,886,821 real changes made)
(74,420 real changes made, 74,420 to missing)

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. * CSU on-time enrollment
. gen csu_enr_ontime = 1 if csu_enr==1 ///
>         & (csu_enr_start_year==year_grad_hs & inlist(csu_enr_start_term, 3, 4)) ///
>         | (csu_enr_start_year==year_grad_hs + 1 & inlist(csu_enr_start_term, 1, 2))
{txt}(75,940,909 missing values generated)

{com}. 
. if "`enr_only'"!="enr_only" {c -(}
.         foreach v of varlist csu_applied csu_applied_multiple csu_accepted {c -(}
{txt}  2{com}.                 * Replace CSU application with 0 if could have matched to the CSU data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs, `min_csu_app_year', `max_csu_app_year')
{txt}  3{com}.                 * Replace CSU application with missing if could not have matched to the CSU data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs, `min_csu_app_year', `max_csu_app_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * Replace CSU acceptance with missing if never applied
.         foreach v of varlist csu_accepted {c -(}
{txt}  2{com}.                 replace `v' = . if csu_applied!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         * Replace CSU remediation and persistence variables with missing if never enrolled
.         foreach v of varlist ///
>                 csu_eng_remediation csu_math_remediation csu_first_maj_stem csu_first_maj_other csu_first_maj_undecided ///
>                 csu_persist_year2 csu_persist_year3 csu_persist_year4 ///
>                 csu_deg csu_deg_stem csu_deg_other {c -(}
{txt}  2{com}.                 replace `v' = . if csu_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. 
.         forvalues t = 2 (1) 4 {c -(}
{txt}  2{com}.                 * Replace CSU persistence variables with 0 if they could have matched to the CSU data but didn't
.                 replace csu_persist_year`t' = 0 if csu_enr==1 & csu_persist_year`t'!=1 & k12_csu_match==1 & year_grad_hs + (`t' - 1)<=`max_csu_enr_year' & !mi(year_grad_hs)
{txt}  3{com}.                 * Replace CSU persistence variables with missing if they could not have matched to the CSU data
.                 replace csu_persist_year`t' = . if csu_enr==1 & /*csu_persist_year`t'!=1 &*/ k12_csu_match==1 & year_grad_hs + (`t' - 1)>`max_csu_enr_year' & !mi(year_grad_hs)
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         foreach v of varlist csu_deg csu_deg_stem csu_deg_other {c -(}
{txt}  2{com}.                 * Replace CSU degree variable with 0 if they could have matched to the CSU data but didn't
.                 replace `v' = 0 if `v'!=1 & inrange(year_grad_hs + 6, `min_csu_deg_year', `max_csu_deg_year')
{txt}  3{com}.                 * Replace CSU degree variable with missing if they could not have matched to the CSU data
.                 replace `v' = . if /*`v'!=1 &*/ !inrange(year_grad_hs + 6, `min_csu_deg_year', `max_csu_deg_year')
{txt}  4{com}.         {c )-}
.         tab grade year
. 
.         * CSU degree receipt conditional on STEM major
.         gen csu_maj_stem_deg_stem = csu_deg_stem if csu_first_maj_stem==1
.         gen csu_maj_stem_deg_other = csu_deg_other if csu_first_maj_stem==1
. 
.         * Replace CSU degree receipt conditional on STEM major with missing if never enrolled
.         foreach v of varlist ///
>                 csu_maj_stem_deg_stem csu_maj_stem_deg_other {c -(}
{txt}  2{com}.                 replace `v' = . if csu_enr!=1
{txt}  3{com}.         {c )-}
.         tab grade year
. {c )-}
{txt}
{com}. 
. 
. 
. 
. **** Drop observations that had no chance of matching to CCC/CSU data
. compress
  {txt}variable {bf}{res}csu_enr_ontime{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (235,866,429 bytes saved)

{com}. merge m:1 state_student_id ///
>         using `crosswalks'/k12_unique_crosswalk.dta ///
>         , gen(merge_k12_unique) keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       9,212,150
{txt}{col 9}from master{col 30}{res}       9,212,150{txt}  (merge_k12_unique==1)
{col 9}from using{col 30}{res}               0{txt}  (merge_k12_unique==2)

{col 5}Matched{col 30}{res}      69,409,993{txt}  (merge_k12_unique==3)
{col 5}{hline 41}

{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist_ccc "ccc_enr_*"
.         local varlist_csu "csu_enr_*"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist_ccc "ccc_*"
.         local varlist_csu "csu_*"
. {c )-}
{txt}
{com}. * Replace CCC variables with missing if could not have matched to the CCC data due to non-unique name/birth date/sex
. foreach v of varlist `varlist_ccc' {c -(}
{txt}  2{com}.         replace `v' = . if k12_ccc_match==0 & uniq_first_last_bday_sex==0
{txt}  3{com}.         replace `v' = . if k12_ccc_match==0 & uniq_first3_last3_bday_sex==0 & inrange(year_grad_hs, 1993, 2011)
{txt}  4{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist_ccc
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. * Replace CSU variables with missing if could not have matched to the CSU data due to non-unique name/birth date/sex
. foreach v of varlist `varlist_csu' {c -(}
{txt}  2{com}.         replace `v' = . if k12_csu_match==0 & uniq_first_last_bday_sex_middle==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. macro drop _varlist_csu
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. 
. 
. **** All college outcomes
. * Enrollment
. gen enr = 1 if nsc_enr==1 /*| ccc_enr==1 | csu_enr==1*/
{txt}(52,966,330 missing values generated)

{com}. replace enr = 0 if nsc_enr==0 & ccc_enr!=1 & csu_enr!=1
{txt}(11,147,887 real changes made)

{com}. label var enr "Enrolled at a Postsecondary Institution"
{txt}
{com}. 
. gen enr_ontime = 1 if nsc_enr_ontime==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(53,621,620 missing values generated)

{com}. replace enr_ontime = 0 if nsc_enr_ontime==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(14,587,596 real changes made)

{com}. label var enr_ontime "Enrolled at a Postsecondary Institution"
{txt}
{com}. 
. gen enr_2year = 1 if nsc_enr_2year==1 | nsc_enr_lt2year==1 | ccc_enr==1
{txt}(55,710,846 missing values generated)

{com}. replace enr_2year = 0 if nsc_enr_2year==0 & nsc_enr_lt2year==0 & ccc_enr!=1
{txt}(17,886,521 real changes made)

{com}. label var enr_2year "Enrolled at a 2-Year College"
{txt}
{com}. 
. gen enr_ontime_2year = 1 if nsc_enr_ontime_2year==1 | nsc_enr_ontime_lt2year==1 | ccc_enr_ontime==1
{txt}(63,628,812 missing values generated)

{com}. replace enr_ontime_2year = 0 if nsc_enr_ontime_2year==0 & nsc_enr_ontime_lt2year==0 & ccc_enr_ontime!=1
{txt}(24,146,974 real changes made)

{com}. label var enr_ontime_2year "Enrolled at a 2-Year College"
{txt}
{com}. 
. gen enr_4year = 1 if nsc_enr_4year==1 | csu_enr==1
{txt}(65,379,218 missing values generated)

{com}. replace enr_4year = 0 if nsc_enr_4year==0 & csu_enr!=1
{txt}(25,711,651 real changes made)

{com}. label var enr_4year "Enrolled at a 4-Year University"
{txt}
{com}. 
. replace enr_2year = 0 if enr_4year==1
{txt}(6,504,291 real changes made)

{com}. 
. gen enr_ontime_4year = 1 if nsc_enr_ontime_4year==1 | csu_enr_ontime==1
{txt}(67,984,757 missing values generated)

{com}. replace enr_ontime_4year = 0 if nsc_enr_ontime_4year==0 & csu_enr_ontime!=1
{txt}(27,828,790 real changes made)

{com}. label var enr_ontime_4year "Enrolled at a 4-Year University"
{txt}
{com}. 
. replace enr_ontime_2year = 0 if enr_ontime_4year==1
{txt}(1,078,008 real changes made)

{com}. 
. gen enr_pub = 1 if nsc_enr_pub==1 | ccc_enr==1 | csu_enr==1
{txt}(50,040,850 missing values generated)

{com}. replace enr_pub = 0 if nsc_enr_pub==0 & ccc_enr!=1 & csu_enr!=1
{txt}(12,766,044 real changes made)

{com}. label var enr_pub "Enrolled at a Public Institution"
{txt}
{com}. 
. gen enr_ontime_pub = 1 if nsc_enr_ontime_pub==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(55,653,540 missing values generated)

{com}. replace enr_ontime_pub = 0 if nsc_enr_ontime_pub==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(16,619,516 real changes made)

{com}. label var enr_ontime_pub "Enrolled at a Public Institution"
{txt}
{com}. 
. gen enr_priv = 1 if nsc_enr_priv==1
{txt}(75,436,815 missing values generated)

{com}. replace enr_priv = 0 if nsc_enr_priv==0
{txt}(34,818,697 real changes made)

{com}. label var enr_priv "Enrolled at a Private Institution"
{txt}
{com}. 
. replace enr_pub = 0 if enr_priv==1
{txt}(1,567,171 real changes made)

{com}. 
. gen enr_ontime_priv = 1 if nsc_enr_ontime_priv==1
{txt}(76,432,094 missing values generated)

{com}. replace enr_ontime_priv = 0 if nsc_enr_ontime_priv==0
{txt}(35,813,976 real changes made)

{com}. label var enr_ontime_priv "Enrolled at a Private Institution"
{txt}
{com}. 
. replace enr_ontime_pub = 0 if enr_ontime_priv==1
{txt}(158,129 real changes made)

{com}. 
. gen enr_instate = 1 if nsc_enr_instate==1 | ccc_enr==1 | csu_enr==1
{txt}(50,301,200 missing values generated)

{com}. replace enr_instate = 0 if nsc_enr_instate==0 & ccc_enr!=1 & csu_enr!=1
{txt}(13,026,394 real changes made)

{com}. label var enr_instate "Enrolled at a CA Institution"
{txt}
{com}. 
. gen enr_ontime_instate = 1 if nsc_enr_ontime_instate==1 | ccc_enr_ontime==1 | csu_enr_ontime==1
{txt}(55,816,352 missing values generated)

{com}. replace enr_ontime_instate = 0 if nsc_enr_ontime_instate==0 & ccc_enr_ontime!=1 & csu_enr_ontime!=1
{txt}(16,782,328 real changes made)

{com}. label var enr_ontime_instate "Enrolled at a CA Institution"
{txt}
{com}. 
. gen enr_outstate = 1 if nsc_enr_outstate==1
{txt}(75,323,148 missing values generated)

{com}. replace enr_outstate = 0 if nsc_enr_outstate==0
{txt}(34,705,030 real changes made)

{com}. label var enr_outstate "Enrolled at an Out-of-State Institution"
{txt}
{com}. 
. replace enr_instate = 0 if enr_outstate==1
{txt}(1,420,630 real changes made)

{com}. 
. gen enr_ontime_outstate = 1 if nsc_enr_ontime_outstate==1
{txt}(76,276,937 missing values generated)

{com}. replace enr_ontime_outstate = 0 if nsc_enr_ontime_outstate==0
{txt}(35,658,819 real changes made)

{com}. label var enr_ontime_outstate "Enrolled at an Out-of-State Institution"
{txt}
{com}. 
. replace enr_ontime_instate = 0 if enr_ontime_outstate==1
{txt}(150,584 real changes made)

{com}. 
. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. * Persistence
. if "`enr_only'"!="enr_only" {c -(}
.         gen persist_year2 = 1 if nsc_persist_year2==1 | ccc_persist_year2==1 | csu_persist_year2==1
.         replace persist_year2 = 0 if nsc_persist_year2==0 & ccc_persist_year2!=1 & csu_persist_year2!=1
.         label var persist_year2 "Persisted to Year 2"
. 
.         gen persist_year3 = 1 if nsc_persist_year3==1 | ccc_persist_year3==1 | csu_persist_year3==1
.         replace persist_year3 = 0 if nsc_persist_year3==0 & ccc_persist_year3!=1 & csu_persist_year3!=1
.         label var persist_year3 "Persisted to Year 3"
. 
.         gen persist_year4 = 1 if nsc_persist_year4==1 /*| ccc_persist_year4==1*/ | csu_persist_year4==1
.         replace persist_year4 = 0 if nsc_persist_year4==0 /*& ccc_persist_year4!=1*/ & csu_persist_year4!=1
.         label var persist_year4 "Persisted to Year 4"
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. * Degree
. if "`enr_only'"!="enr_only" {c -(}
.         gen deg = 1 if nsc_deg==1 | ccc_deg==1 | csu_deg==1
.         replace deg = 0 if nsc_deg==0 & ccc_deg!=1 & csu_deg!=1
.         label var deg "Received a College Degree"
. 
.         gen deg_2year = 1 if nsc_deg_2year==1 | ccc_deg==1
.         replace deg_2year = 0 if nsc_deg_2year==0 & ccc_deg!=1
.         label var deg_2year "Received a 2-Year College Degree"
. 
.         gen deg_4year = 1 if nsc_deg_4year==1 | csu_deg==1
.         replace deg_4year = 0 if nsc_deg_4year==0 & csu_deg!=1
.         label var deg_4year "Received a 4-Year College Degree"
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. * Use only NSC sample + values of 1 from other samples
. if "`enr_only'"=="enr_only" {c -(}
.         local varlist "enr enr_2year enr_4year enr_pub enr_priv enr_instate enr_outstate enr_ontime enr_ontime_2year enr_ontime_4year enr_ontime_pub enr_ontime_priv enr_ontime_instate enr_ontime_outstate"
. {c )-}
{txt}
{com}. else if "`enr_only'"!="enr_only" {c -(}
.         local varlist "enr enr_2year enr_4year enr_pub enr_priv enr_instate enr_outstate enr_ontime enr_ontime_2year enr_ontime_4year enr_ontime_pub enr_ontime_priv enr_ontime_instate enr_ontime_outstate deg deg_2year deg_4year"
. {c )-}
{txt}
{com}. foreach v of varlist `varlist' {c -(}
{txt}  2{com}.         replace `v' = . if /*`v'==0 &*/ k12_nsc_match==0
{txt}  3{com}. {c )-}
{txt}(0 real changes made)
(3,343,312 real changes made, 3,343,312 to missing)
(950,551 real changes made, 950,551 to missing)
(3,343,312 real changes made, 3,343,312 to missing)
(0 real changes made)
(3,343,312 real changes made, 3,343,312 to missing)
(0 real changes made)
(1,584,094 real changes made, 1,584,094 to missing)
(1,584,094 real changes made, 1,584,094 to missing)
(462,151 real changes made, 462,151 to missing)
(1,584,094 real changes made, 1,584,094 to missing)
(0 real changes made)
(1,584,094 real changes made, 1,584,094 to missing)
(0 real changes made)

{com}. macro drop _varlist
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. * CCC
. if "`enr_only'"!="enr_only" {c -(}
.         gen ccc_transfer_4year = 1 if ccc_enr==1 & enr_4year==1
.         replace ccc_transfer_4year = 0 if ccc_enr==1 & enr_4year==0
.         replace ccc_transfer_4year = . ///
>                 if (inlist(ccc_enr_start_year, `max_ccc_enr_year') & inlist(ccc_enr_start_term, 7, 8)) ///
>                 | (inlist(ccc_enr_start_year, `max_ccc_enr_year' + 1) & inlist(ccc_enr_start_term, 1, 2, 3, 4, 5, 6))
.         label var ccc_transfer_4year "Transfered to 4-Year University"
. 
.         replace ccc_persist_year2 = 1 if ccc_persist_year2==0 & ccc_transfer_4year==1
.         replace ccc_persist_year3 = 1 if ccc_persist_year3==0 & ccc_transfer_4year==1
.         replace ccc_deg = 1 if ccc_deg==0 & ccc_transfer_4year==1
.         replace ccc_deg_a = 1 if ccc_deg_a==0 & ccc_transfer_4year==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
. 
. * CSU
. if "`enr_only'"!="enr_only" {c -(}
.         gen csu_transfer_uc = 1 if csu_enr==1 & nsc_enr_uc==1
.         replace csu_transfer_uc = 0 if csu_enr==1 & nsc_enr_uc==0
.         replace csu_transfer_uc = . ///
>                 if (inlist(csu_enr_start_year, `max_csu_enr_year') & inlist(csu_enr_start_term, 4)) ///
>                 | (inlist(csu_enr_start_year, `max_csu_enr_year' + 1) & inlist(csu_enr_start_term, 1, 2, 3))
.         label var csu_transfer_uc "Transfered to a University of California"
. 
.         gen csu_transfer_ucplus = 1 if csu_enr==1 & nsc_enr_ucplus==1
.         replace csu_transfer_ucplus = 0 if csu_enr==1 & nsc_enr_ucplus==0
.         replace csu_transfer_ucplus = . ///
>                 if (inlist(csu_enr_start_year, `max_csu_enr_year') & inlist(csu_enr_start_term, 4)) ///
>                 | (inlist(csu_enr_start_year, `max_csu_enr_year' + 1) & inlist(csu_enr_start_term, 1, 2, 3))
.         label var csu_transfer_ucplus "Transfered to a University of California +"
. 
.         replace csu_persist_year2 = 1 if csu_persist_year2==0 & csu_transfer_ucplus==1
.         replace csu_persist_year3 = 1 if csu_persist_year3==0 & csu_transfer_ucplus==1
. {c )-}
{txt}
{com}. tab grade year

           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2003       2004       2005       2006       2007 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   494,177    487,523    476,367    470,413    484,418 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   499,772    495,472    484,511    473,896    481,513 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   508,797    511,007    505,440    489,753    487,048 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   494,159    497,292    496,146    488,666    478,481 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   500,184    493,950    493,875    491,346    484,892 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   519,757    518,924    509,807    504,022    501,594 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   477,659    503,933    501,506    492,281    491,243 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   510,725    516,648    535,450    535,419    526,034 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   458,177    476,105    482,259    502,705    500,734 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   404,855    419,125    434,682    440,277    469,021 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,868,262  4,919,979  4,920,043  4,888,778  4,904,978 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2008       2009       2010       2011       2012 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   489,091    481,092    477,606    483,618    485,135 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   477,271    480,639    473,733    471,973    476,890 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   482,271    478,382    474,542    477,792    474,382 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   476,433    472,137    468,559    474,646    468,929 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   480,302    471,630    468,325    466,779    471,619 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   498,879    490,793    482,145    478,291    474,153 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   490,985    488,058    480,471    473,610    469,747 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   522,733    526,190    518,632    510,690    498,467 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   495,999    498,203    499,817    497,097    488,589 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   472,617    474,154    478,165    480,215    477,126 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0          0          0          0 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,886,581  4,861,278  4,821,995  4,814,711  4,785,037 {txt}{c |}{res}78,175,632 


           {txt}{c |}                Year of Spring Semester
     Grade {c |}      2013       2015       2016       2017       2018 {c |}     Total
{hline 11}{c +}{hline 55}{c +}{hline 10}
         0 {c |}{res}         0          0          1          4          0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         0          0          1          2          0 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}   488,956      2,210      2,935      2,171      1,372 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   480,152    490,476    480,279    470,945    446,465 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   480,484    478,478    495,656    476,253    470,521 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   467,252    943,465    968,084    976,692    938,837 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   466,351    471,558    480,305    479,849    495,306 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   479,024    467,291    479,180    477,981    480,533 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   467,499    930,621    942,422    946,953    943,694 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}   493,701      1,184     10,064      2,695     13,213 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}   481,578    939,516    494,522    401,916     17,389 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   475,645    479,654    488,163    527,563    617,543 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}         0          0      2,863     74,250    481,842 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 55}{c +}{hline 10}
     Total {c |}{res} 4,780,642  5,204,453  4,844,475  4,837,274  4,906,715 {txt}{c |}{res}78,175,632 


           {txt}{c |}  Year of
           {c |}   Spring
           {c |}  Semester
     Grade {c |}      2019 {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
         0 {c |}{res}         0 {txt}{c |}{res}         5 
{txt}         1 {c |}{res}         2 {txt}{c |}{res}         5 
{txt}         2 {c |}{res}        11 {txt}{c |}{res} 5,327,095 
{txt}         3 {c |}{res}   469,126 {txt}{c |}{res} 7,653,113 
{txt}         4 {c |}{res}   460,155 {txt}{c |}{res} 7,750,961 
{txt}         5 {c |}{res}   941,782 {txt}{c |}{res}10,051,560 
{txt}         6 {c |}{res}   479,793 {txt}{c |}{res} 7,696,064 
{txt}         7 {c |}{res}   495,519 {txt}{c |}{res} 7,857,893 
{txt}         8 {c |}{res}   960,715 {txt}{c |}{res}10,061,397 
{txt}         9 {c |}{res}     6,739 {txt}{c |}{res} 5,728,584 
{txt}        10 {c |}{res}    34,166 {txt}{c |}{res} 7,268,772 
{txt}        11 {c |}{res}   748,666 {txt}{c |}{res} 7,887,471 
{txt}        12 {c |}{res}   333,757 {txt}{c |}{res}   892,712 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res} 4,930,431 {txt}{c |}{res}78,175,632 
{txt}
{com}. 
{txt}end of do-file

{com}. drop enr enr_2year enr_4year
{txt}
{com}. rename enr_ontime enr
{res}{txt}
{com}. rename enr_ontime_2year enr_2year
{res}{txt}
{com}. rename enr_ontime_4year enr_4year
{res}{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ******************************** 11th Grade (8th Grade ELA Controls, 6th Grade Math Controls)
. gen diff_school_prop = gr11_L3_diff_school_prop if year!=2017
{txt}(61,559,451 missing values generated)

{com}. replace diff_school_prop = gr11_L4_diff_school_prop if year==2017
{txt}(1,161,483 real changes made)

{com}. 
. **************** Prior Scores
. ******** ELA
. gen prior_ela_z_score = L3_cst_ela_z_score if inrange(year, `star_min_year' + 3, `star_max_year' + 3) & year!=2017
{txt}(55,815,950 missing values generated)

{com}. replace prior_ela_z_score = L3_sbac_ela_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3) & year!=2017
{txt}(3,393,213 real changes made)

{com}. replace prior_ela_z_score = L4_cst_ela_z_score if year==2017
{txt}(1,607,819 real changes made)

{com}. label var prior_ela_z_score "Prior ELA Z-Score"
{txt}
{com}. gen peer_prior_ela_z_score = peer_L3_cst_ela_z_score if inrange(year, `star_min_year' + 3, `star_max_year' + 3) & year!=2017
{txt}(44,592,802 missing values generated)

{com}. replace peer_prior_ela_z_score = peer_L3_sbac_ela_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3) & year!=2017
{txt}(5,229,934 real changes made)

{com}. replace peer_prior_ela_z_score = peer_L4_cst_ela_z_score if year==2017
{txt}(2,445,454 real changes made)

{com}. label var peer_prior_ela_z_score "Peer Avg. Prior ELA Z-Score"
{txt}
{com}. 
. ******** Math
. gen prior_math_z_score = L5_cst_math_z_score if inrange(year, `star_min_year' + 5, `star_max_year' + 5) & !inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(65,671,085 missing values generated)

{com}. replace prior_math_z_score = L3_sbac_math_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(3,402,278 real changes made)

{com}. label var prior_math_z_score "Prior Math Z-Score"
{txt}
{com}. gen peer_prior_math_z_score = peer_L5_cst_math_z_score if inrange(year, `star_min_year' + 5, `star_max_year' + 5) & !inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(57,785,234 missing values generated)

{com}. replace peer_prior_math_z_score = peer_L3_sbac_math_z_score if inrange(year, `caaspp_min_year' + 3, `caaspp_max_year' + 3)
{txt}(5,229,954 real changes made)

{com}. label var peer_prior_math_z_score "Peer Avg. Prior Math Z-Score"
{txt}
{com}. 
. **** Test Score Sample
. foreach subject in ela math {c -(}
{txt}  2{com}.         mark touse_g11_`subject' ///
>                 if grade==11 & dataset=="CAASPP" & inrange(year, `test_score_min_year', `test_score_max_year') ///
>                 & diff_school_prop>=0.95
{txt}  3{com}.         markout touse_g11_`subject' ///
>                 sbac_`subject'_z_score ///
>                 school_id i.year ///
>                 `school_controls' ///
>                 `demographic_controls' ///
>                 `ela_score_controls' ///
>                 `math_score_controls' ///
>                 `peer_demographic_controls' ///
>                 `peer_ela_score_controls' ///
>                 `peer_math_score_controls'
{txt}  4{com}. 
.         replace touse_g11_`subject' = 0 if touse==0
{txt}  5{com}. 
.         egen n_g11_`subject' = count(state_student_id) ///
>                 if touse_g11_`subject'==1 ///
>                 , by(cdscode year)
{txt}  6{com}.         replace touse_g11_`subject' = 0 if n_g11_`subject'<7
{txt}  7{com}. {c )-}
{txt}(106,943 real changes made)
(77,389,513 missing values generated)
(252 real changes made)
(105,663 real changes made)
(77,394,853 missing values generated)
(259 real changes made)

{com}. 
. **** Postsecondary Outcomes Sample
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.         mark touse_g11_`outcome' ///
>                 if grade==11 & dataset=="CAASPP" & inrange(year, `outcome_min_year', `outcome_max_year') ///
>                 & diff_school_prop>=0.95
{txt}  3{com}.         markout touse_g11_`outcome' ///
>                 `outcome' ///
>                 school_id i.year ///
>                 `school_controls' ///
>                 `demographic_controls' ///
>                 `ela_score_controls' ///
>                 `math_score_controls' ///
>                 `peer_demographic_controls' ///
>                 `peer_ela_score_controls' ///
>                 `peer_math_score_controls'
{txt}  4{com}. 
.         replace touse_g11_`outcome' = 0 if touse==0
{txt}  5{com}. 
.         egen n_g11_`outcome' = count(state_student_id) ///
>                 if touse_g11_`outcome'==1 ///
>                 , by(cdscode year)
{txt}  6{com}.         replace touse_g11_`outcome' = 0 if n_g11_`outcome'<7
{txt}  7{com}. {c )-}
{txt}(110,186 real changes made)
(77,366,365 missing values generated)
(234 real changes made)
(110,186 real changes made)
(77,366,365 missing values generated)
(234 real changes made)
(110,186 real changes made)
(77,366,365 missing values generated)
(234 real changes made)

{com}. 
. 
. ********************************************************************************
. /* Merge onto sibling outcomes xwalk  */
. 
. merge m:1 state_student_id using `sibling_out_xwalk'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      49,674,635
{txt}{col 9}from master{col 30}{res}      49,674,635{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}      28,947,508{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. keep state_student_id merge_id_k12_test_scores touse* sibling_out_sample sibling_full_sample
{txt}
{com}. 
. compress
{txt}  (0 bytes saved)

{com}. save $projdir/dta/common_core_va/va_sibling_samples, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_sibling_samples.dta{rm}
saved
{p_end}

{com}. 
. cd $projdir
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{txt}
{com}. 
. timer off 1
{txt}
{com}. timer list
{res}   1:   4493.46 /        1 =    4493.4630
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/siblingvasamples.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 9 Apr 2022, 03:42:51
{txt}{.-}
{smcl}
{txt}{sf}{ul off}