{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 May 2022, 22:01:34
{txt}
{com}. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. #delimit ;
{txt}delimiter now ;
{com}. #delimit cr
{txt}delimiter now cr
{com}. macro list
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}{p 0 16}
_setlimit:{space 6}{res}{res}0
{p_end}
{txt}{p 0 16}
_1:{space 13}{res}{res}0
{p_end}
{txt}{p 0 16}
_0:{space 13}{res}{res}0
{p_end}
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. 
. ********************************************************************************
. 
. 
. //load the VA grade 11 sample
. use `va_g11_dataset', clear
{txt}(Test Score Grade 11 VA Sample)

{com}. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk', nogen keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         884,570
{txt}{col 9}from master{col 30}{res}         884,570{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}         900,294{txt}  
{col 5}{hline 41}

{com}. 
. drop if mi(has_older_sibling_enr_2year)
{txt}(884,570 observations deleted)

{com}. drop if mi(has_older_sibling_enr_4year)
{txt}(0 observations deleted)

{com}. 
. compress
  {txt}variable {bf}{res}age{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (1,800,588 bytes saved)

{com}. tempfile va_g11_sibling_dataset
{txt}
{com}. save `va_g11_sibling_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St16505.000001{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. ********************************************************************************
. *********** VA estimates for VA samples matched to siblings sample
. ********************************************************************************
. 
. 
. if `setlimit' == 0 {c -(}
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
. {c )-}
{txt}
{com}. else {c -(}
.   local drift_limit = `setlimit'
. {c )-}
{txt}
{com}. 
. foreach subject in ela math {c -(}
{txt}  2{com}. 
. 
.     /* load the VA g11 subject sample with siblings outcome sample
>      (those who have at least one older sibling matched to the postsecondary
>    outcomes) */
.     use `va_g11_sibling_dataset' if touse_g11_`subject'==1 & sibling_out_sample == 1, clear
{txt}  3{com}. 
.     ******************************************************************************
.     ************ Value added estimation with no peer controls ********************
.     ****** No TFX, without sibling college going controls
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`subject'_nosibctrl.ster, replace)
{txt}  4{com}. 
.     //rename the first time to make sure indep var names for spec test are all the same
.     rename tv va_cfr_g11_`subject'
{txt}  5{com}.         rename score_r sbac_g11_`subject'_r
{txt}  6{com}. 
. 
.     ************ specification test: regressing score residuals on VA estimates
.     ******* No peer controls
.     ******** sibling sample without sibling controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
{txt}  7{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_nocontrol.ster, replace
{txt}  8{com}.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_nocontrol.ster, replace
{txt}  9{com}. 
.     //rename again to distinguish between nocontrol and with control va estimates
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
{txt} 10{com}.     rename sbac_g11_`subject'_r sbac_g11_`subject'_r_nosibctrl
{txt} 11{com}.     label var va_cfr_g11_`subject'_nosibctrl "`subject' VA with family FE without TFX without sibling control"
{txt} 12{com}.     label var sbac_g11_`subject'_r_nosibctrl "`subject' score residual with family FE without TFX without sibling control"
{txt} 13{com}. 
.     ****** No TFX (teacher fixed effects), include sibling controls
.     vam sbac_`subject'_z_score ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`subject'.ster, replace)
{txt} 14{com}. 
. 
.     rename tv va_cfr_g11_`subject'
{txt} 15{com}.         rename score_r sbac_g11_`subject'_r
{txt} 16{com}. 
.     ************ specification test: regressing score residuals on VA estimates
.     ******* No peer controls
.     ******** sibling sample with sibling controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
{txt} 17{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 18{com}.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 19{com}. 
. 
. 
.     label var va_cfr_g11_`subject' "`subject' VA with family FE without TFX"
{txt} 20{com}.     label var sbac_g11_`subject'_r "`subject' score residual with family FE without TFX"
{txt} 21{com}. 
. /*
>     ****** With TFX, and TFX is added back in the the VA estimates
>     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_tfx_g11_`subject'
>     drop score_r
>     label var va_tfx_g11_`subject' "`subject' VA with family FE with TFX"
> 
> 
>  */
. 
. 
. 
. 
. 
. 
. 
.     ******************************************************************************
.     ************ Value added estimation with peer controls ********************
.     ****** No TFX (teacher fixed effects)
.     /* vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_cfr_g11_`subject'_peer
>     rename score_r sbac_g11_`subject'_r_peer
>     label var va_cfr_g11_`subject'_peer "`subject' VA with family FE with TFX"
>     label var sbac_g11_`subject'_r_peer "`subject' score residual with family FE with TFX"
> 
> 
>     ****** With TFX
>     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_tfx_g11_`subject'_peer
>     drop score_r */
. 
. 
.     ******************************************************************************
.     ************ specification test: regressing score residuals on VA estimates
. 
.     /* ******* With peer controls
>     reg sbac_g11_`subject'_r_peer va_cfr_g11_`subject'_peer, cluster(school_id)
>     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_peer_sibling.ster, replace */
. 
. 
. 
. 
.     ******************************************************************************
.     /* CFR Forecast Bias Test */
.     ***** leave out variable is sibling controls
.     **no peer controls
.     gen sbac_g11_`subject'_r_d = sbac_g11_`subject'_r_nosibctrl - sbac_g11_`subject'_r
{txt} 22{com}.     //var rename gymnastics to make sure the indep var names are all the same when making tables later
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_temp
{txt} 23{com}.     rename va_cfr_g11_`subject'_nosibctrl va_cfr_g11_`subject'
{txt} 24{com}. 
.     reg sbac_g11_`subject'_r_d va_cfr_g11_`subject',    cluster(school_id)
{txt} 25{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 26{com}.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 27{com}. 
.     //roll back the rename gymnastics to restore original var names
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
{txt} 28{com}.     rename va_cfr_g11_`subject'_temp va_cfr_g11_`subject'
{txt} 29{com}. 
. 
.     **************** Save Value Added Estimates
.     collapse (firstnm) va_* ///
>                 (mean) sbac_*_r* ///
>                 (sum) n_g11_`subject' = touse_g11_`subject' ///
>       if sibling_full_sample == 1 & sibling_out_sample == 1 ///
>                 , by(school_id cdscode grade year)
{txt} 30{com}.     //save to my personal folder
.         save $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibling.dta, replace
{txt} 31{com}.     //save to VA project folder
.     save $vaprojdir/data/sibling_va/test_score_va/va_g11_`subject'_sibling.dta, replace
{txt} 32{com}. 
. 
. {c )-}
{txt}(Test Score Grade 11 VA Sample)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   677,254
{txt}{hline 13}{c +}{hline 34}   F(36, 677217)   = {res} 28471.16
{txt}       Model {c |} {res} 329901.804        36  9163.93899   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 217974.086   677,217  .321867416   {txt}R-squared       ={res}    0.6021
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6021
{txt}       Total {c |} {res} 547875.889   677,253  .808967829   {txt}Root MSE        =   {res} .56733

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0499644{col 26}{space 2} .0027484{col 37}{space 1}   18.18{col 46}{space 3}0.000{col 54}{space 4} .0445776{col 67}{space 3} .0553512
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0676601{col 26}{space 2} .0027356{col 37}{space 1}   24.73{col 46}{space 3}0.000{col 54}{space 4} .0622985{col 67}{space 3} .0730217
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0710576{col 26}{space 2} .0027417{col 37}{space 1}  -25.92{col 46}{space 3}0.000{col 54}{space 4}-.0764313{col 67}{space 3} -.065684
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003426{col 26}{space 2} 4.88e-06{col 37}{space 1}  -70.14{col 46}{space 3}0.000{col 54}{space 4}-.0003522{col 67}{space 3} -.000333
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0902902{col 26}{space 2} .0014094{col 37}{space 1}  -64.06{col 46}{space 3}0.000{col 54}{space 4}-.0930527{col 67}{space 3}-.0875278
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1036863{col 26}{space 2}  .002264{col 37}{space 1}   45.80{col 46}{space 3}0.000{col 54}{space 4} .0992489{col 67}{space 3} .1081236
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0050762{col 26}{space 2} .0019297{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.0088584{col 67}{space 3} -.001294
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1444525{col 26}{space 2} .0037981{col 37}{space 1}  -38.03{col 46}{space 3}0.000{col 54}{space 4}-.1518967{col 67}{space 3}-.1370083
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0043308{col 26}{space 2} .0042032{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4}-.0039074{col 67}{space 3} .0125689
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0366117{col 26}{space 2} .0016359{col 37}{space 1}  -22.38{col 46}{space 3}0.000{col 54}{space 4} -.039818{col 67}{space 3}-.0334053
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2115924{col 26}{space 2} .0036819{col 37}{space 1}  -57.47{col 46}{space 3}0.000{col 54}{space 4}-.2188087{col 67}{space 3} -.204376
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1861937{col 26}{space 2} .0037187{col 37}{space 1}  -50.07{col 46}{space 3}0.000{col 54}{space 4}-.1934822{col 67}{space 3}-.1789052
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6117768{col 26}{space 2} .0027977{col 37}{space 1}  218.67{col 46}{space 3}0.000{col 54}{space 4} .6062934{col 67}{space 3} .6172602
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .593261{col 26}{space 2} .0027254{col 37}{space 1}  217.68{col 46}{space 3}0.000{col 54}{space 4} .5879193{col 67}{space 3} .5986027
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5819387{col 26}{space 2} .0028658{col 37}{space 1}  203.07{col 46}{space 3}0.000{col 54}{space 4} .5763219{col 67}{space 3} .5875555
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5727827{col 26}{space 2} .0034906{col 37}{space 1}  164.09{col 46}{space 3}0.000{col 54}{space 4} .5659413{col 67}{space 3} .5796241
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0002419{col 26}{space 2} .0014746{col 37}{space 1}    0.16{col 46}{space 3}0.870{col 54}{space 4}-.0026483{col 67}{space 3} .0031321
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0138144{col 26}{space 2} .0014878{col 37}{space 1}   -9.29{col 46}{space 3}0.000{col 54}{space 4}-.0167304{col 67}{space 3}-.0108984
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0132171{col 26}{space 2} .0014998{col 37}{space 1}   -8.81{col 46}{space 3}0.000{col 54}{space 4}-.0161566{col 67}{space 3}-.0102775
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0110561{col 26}{space 2} .0015063{col 37}{space 1}    7.34{col 46}{space 3}0.000{col 54}{space 4} .0081038{col 67}{space 3} .0140084
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275553{col 26}{space 2} .0006825{col 37}{space 1}  -40.37{col 46}{space 3}0.000{col 54}{space 4}-.0288931{col 67}{space 3}-.0262176
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0226716{col 26}{space 2} .0006239{col 37}{space 1}  -36.34{col 46}{space 3}0.000{col 54}{space 4}-.0238944{col 67}{space 3}-.0214489
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0236694{col 26}{space 2} .0006071{col 37}{space 1}  -38.99{col 46}{space 3}0.000{col 54}{space 4}-.0248592{col 67}{space 3}-.0224796
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0294713{col 26}{space 2} .0009879{col 37}{space 1}  -29.83{col 46}{space 3}0.000{col 54}{space 4}-.0314076{col 67}{space 3} -.027535
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1695626{col 26}{space 2}  .002779{col 37}{space 1}   61.01{col 46}{space 3}0.000{col 54}{space 4} .1641157{col 67}{space 3} .1750094
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1896512{col 26}{space 2} .0028265{col 37}{space 1}   67.10{col 46}{space 3}0.000{col 54}{space 4} .1841112{col 67}{space 3} .1951911
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1889889{col 26}{space 2} .0029484{col 37}{space 1}   64.10{col 46}{space 3}0.000{col 54}{space 4} .1832101{col 67}{space 3} .1947678
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2478465{col 26}{space 2} .0035318{col 37}{space 1}   70.18{col 46}{space 3}0.000{col 54}{space 4} .2409242{col 67}{space 3} .2547687
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0045974{col 26}{space 2} .0018502{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.0082238{col 67}{space 3}-.0009711
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0127122{col 26}{space 2} .0018014{col 37}{space 1}   -7.06{col 46}{space 3}0.000{col 54}{space 4}-.0162428{col 67}{space 3}-.0091815
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0071678{col 26}{space 2} .0018429{col 37}{space 1}   -3.89{col 46}{space 3}0.000{col 54}{space 4}-.0107798{col 67}{space 3}-.0035559
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0042888{col 26}{space 2} .0014656{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .0014163{col 67}{space 3} .0071613
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0031236{col 26}{space 2} .0007616{col 37}{space 1}   -4.10{col 46}{space 3}0.000{col 54}{space 4}-.0046164{col 67}{space 3}-.0016309
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0035752{col 26}{space 2} .0008052{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-.0051535{col 67}{space 3} -.001997
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0066743{col 26}{space 2} .0007956{col 37}{space 1}   -8.39{col 46}{space 3}0.000{col 54}{space 4}-.0082336{col 67}{space 3}-.0051149
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.005854{col 26}{space 2} .0009793{col 37}{space 1}   -5.98{col 46}{space 3}0.000{col 54}{space 4}-.0077734{col 67}{space 3}-.0039346
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.270121{col 26}{space 2} .0299192{col 37}{space 1}   75.88{col 46}{space 3}0.000{col 54}{space 4}  2.21148{col 67}{space 3} 2.328761
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela_nosibctrl.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.5673336 .18211037 .53731111 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0199303169   .5743741184          3541{txt}  {c |}
  2 {c |}  {res}.0151232796   .4358772714          2299{txt}  {c |}
  3 {c |}  {res}.0085328264   .2388976851          1105{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0199303169{txt}  {c |}
  2 {c |}  {res}.0151232796{txt}  {c |}
  3 {c |}  {res}.0151232796{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   675,586
                                                {txt}F(1, 1275)        =  {res}  2114.68
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0410
                                                {txt}Root MSE          =    {res} .55544

{txt}{ralign 78:(Std. err. adjusted for {res:1,276} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_e~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~a {c |}{col 14}{res}{space 2} .9820442{col 26}{space 2} .0213554{col 37}{space 1}   45.99{col 46}{space 3}0.000{col 54}{space 4} .9401486{col 67}{space 3}  1.02394
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0002073{col 26}{space 2} .0012526{col 37}{space 1}   -0.17{col 46}{space 3}0.869{col 54}{space 4}-.0026646{col 67}{space 3} .0022501
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster} saved
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   677,254
{txt}{hline 13}{c +}{hline 34}   F(38, 677215)   = {res} 26986.67
{txt}       Model {c |} {res} 329970.233        38  8683.42718   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 217905.656   677,215  .321767321   {txt}R-squared       ={res}    0.6023
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6022
{txt}       Total {c |} {res} 547875.889   677,253  .808967829   {txt}Root MSE        =   {res} .56725

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0498498{col 26}{space 2} .0027482{col 37}{space 1}   18.14{col 46}{space 3}0.000{col 54}{space 4} .0444634{col 67}{space 3} .0552361
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0673758{col 26}{space 2} .0027359{col 37}{space 1}   24.63{col 46}{space 3}0.000{col 54}{space 4} .0620135{col 67}{space 3} .0727382
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.071269{col 26}{space 2} .0027432{col 37}{space 1}  -25.98{col 46}{space 3}0.000{col 54}{space 4}-.0766456{col 67}{space 3}-.0658924
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0175035{col 26}{space 2} .0026999{col 37}{space 1}   -6.48{col 46}{space 3}0.000{col 54}{space 4}-.0227952{col 67}{space 3}-.0122119
{txt}1.has_~4year {c |}{col 14}{res}{space 2}  .039867{col 26}{space 2} .0029653{col 37}{space 1}   13.44{col 46}{space 3}0.000{col 54}{space 4}  .034055{col 67}{space 3} .0456789
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003419{col 26}{space 2} 4.89e-06{col 37}{space 1}  -69.98{col 46}{space 3}0.000{col 54}{space 4}-.0003514{col 67}{space 3}-.0003323
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0903183{col 26}{space 2} .0014092{col 37}{space 1}  -64.09{col 46}{space 3}0.000{col 54}{space 4}-.0930803{col 67}{space 3}-.0875563
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1032116{col 26}{space 2} .0022649{col 37}{space 1}   45.57{col 46}{space 3}0.000{col 54}{space 4} .0987725{col 67}{space 3} .1076507
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} -.004525{col 26}{space 2} .0019299{col 37}{space 1}   -2.34{col 46}{space 3}0.019{col 54}{space 4}-.0083076{col 67}{space 3}-.0007424
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} -.144409{col 26}{space 2} .0037975{col 37}{space 1}  -38.03{col 46}{space 3}0.000{col 54}{space 4} -.151852{col 67}{space 3}-.1369659
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0046592{col 26}{space 2} .0042026{col 37}{space 1}    1.11{col 46}{space 3}0.268{col 54}{space 4}-.0035778{col 67}{space 3} .0128962
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0366289{col 26}{space 2}  .001636{col 37}{space 1}  -22.39{col 46}{space 3}0.000{col 54}{space 4}-.0398356{col 67}{space 3}-.0334223
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2114748{col 26}{space 2} .0036813{col 37}{space 1}  -57.45{col 46}{space 3}0.000{col 54}{space 4}-.2186901{col 67}{space 3}-.2042595
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1860965{col 26}{space 2} .0037182{col 37}{space 1}  -50.05{col 46}{space 3}0.000{col 54}{space 4}-.1933841{col 67}{space 3}-.1788088
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6114396{col 26}{space 2} .0027974{col 37}{space 1}  218.57{col 46}{space 3}0.000{col 54}{space 4} .6059567{col 67}{space 3} .6169225
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5929491{col 26}{space 2} .0027252{col 37}{space 1}  217.58{col 46}{space 3}0.000{col 54}{space 4} .5876078{col 67}{space 3} .5982904
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5815692{col 26}{space 2} .0028657{col 37}{space 1}  202.94{col 46}{space 3}0.000{col 54}{space 4} .5759525{col 67}{space 3} .5871858
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5722926{col 26}{space 2} .0034902{col 37}{space 1}  163.97{col 46}{space 3}0.000{col 54}{space 4} .5654519{col 67}{space 3} .5791333
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}   .00022{col 26}{space 2} .0014744{col 37}{space 1}    0.15{col 46}{space 3}0.881{col 54}{space 4}-.0026698{col 67}{space 3} .0031099
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.013837{col 26}{space 2} .0014876{col 37}{space 1}   -9.30{col 46}{space 3}0.000{col 54}{space 4}-.0167526{col 67}{space 3}-.0109213
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0132133{col 26}{space 2} .0014996{col 37}{space 1}   -8.81{col 46}{space 3}0.000{col 54}{space 4}-.0161525{col 67}{space 3}-.0102741
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0110797{col 26}{space 2} .0015061{col 37}{space 1}    7.36{col 46}{space 3}0.000{col 54}{space 4} .0081278{col 67}{space 3} .0140316
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275112{col 26}{space 2} .0006824{col 37}{space 1}  -40.31{col 46}{space 3}0.000{col 54}{space 4}-.0288488{col 67}{space 3}-.0261737
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0226352{col 26}{space 2} .0006238{col 37}{space 1}  -36.29{col 46}{space 3}0.000{col 54}{space 4}-.0238577{col 67}{space 3}-.0214126
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0236356{col 26}{space 2}  .000607{col 37}{space 1}  -38.94{col 46}{space 3}0.000{col 54}{space 4}-.0248252{col 67}{space 3}-.0224459
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0293958{col 26}{space 2} .0009878{col 37}{space 1}  -29.76{col 46}{space 3}0.000{col 54}{space 4}-.0313318{col 67}{space 3}-.0274597
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1690369{col 26}{space 2} .0027789{col 37}{space 1}   60.83{col 46}{space 3}0.000{col 54}{space 4} .1635904{col 67}{space 3} .1744833
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .188978{col 26}{space 2} .0028265{col 37}{space 1}   66.86{col 46}{space 3}0.000{col 54}{space 4} .1834381{col 67}{space 3} .1945179
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1883251{col 26}{space 2} .0029483{col 37}{space 1}   63.87{col 46}{space 3}0.000{col 54}{space 4} .1825465{col 67}{space 3} .1941038
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2470745{col 26}{space 2} .0035317{col 37}{space 1}   69.96{col 46}{space 3}0.000{col 54}{space 4} .2401525{col 67}{space 3} .2539964
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0046344{col 26}{space 2} .0018499{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.0082602{col 67}{space 3}-.0010085
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0127756{col 26}{space 2} .0018011{col 37}{space 1}   -7.09{col 46}{space 3}0.000{col 54}{space 4}-.0163057{col 67}{space 3}-.0092454
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0071923{col 26}{space 2} .0018426{col 37}{space 1}   -3.90{col 46}{space 3}0.000{col 54}{space 4}-.0108037{col 67}{space 3}-.0035809
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0041748{col 26}{space 2} .0014655{col 37}{space 1}    2.85{col 46}{space 3}0.004{col 54}{space 4} .0013025{col 67}{space 3} .0070471
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0030776{col 26}{space 2} .0007615{col 37}{space 1}   -4.04{col 46}{space 3}0.000{col 54}{space 4}-.0045702{col 67}{space 3}-.0015851
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0035084{col 26}{space 2} .0008051{col 37}{space 1}   -4.36{col 46}{space 3}0.000{col 54}{space 4}-.0050865{col 67}{space 3}-.0019304
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0066265{col 26}{space 2} .0007955{col 37}{space 1}   -8.33{col 46}{space 3}0.000{col 54}{space 4}-.0081856{col 67}{space 3}-.0050673
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0057665{col 26}{space 2} .0009792{col 37}{space 1}   -5.89{col 46}{space 3}0.000{col 54}{space 4}-.0076857{col 67}{space 3}-.0038473
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  2.26474{col 26}{space 2} .0299302{col 37}{space 1}   75.67{col 46}{space 3}0.000{col 54}{space 4} 2.206078{col 67}{space 3} 2.323403
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.56724538 .18200216 .53725463 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0198934192   .5739685075          3541{txt}  {c |}
  2 {c |}  {res} .015092812   .4354752096          2299{txt}  {c |}
  3 {c |}  {res}.0084986285   .2381615671          1105{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0198934192{txt}  {c |}
  2 {c |}  {res} .015092812{txt}  {c |}
  3 {c |}  {res} .015092812{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   675,586
                                                {txt}F(1, 1275)        =  {res}  2110.09
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0409
                                                {txt}Root MSE          =    {res} .55538

{txt}{ralign 78:(Std. err. adjusted for {res:1,276} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_e~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~a {c |}{col 14}{res}{space 2} .9819345{col 26}{space 2} .0213763{col 37}{space 1}   45.94{col 46}{space 3}0.000{col 54}{space 4}  .939998{col 67}{space 3} 1.023871
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0002035{col 26}{space 2} .0012535{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-.0026626{col 67}{space 3} .0022555
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster} saved
{res}
{txt}Linear regression                               Number of obs     = {res}   675,586
                                                {txt}F(1, 1275)        =  {res}    20.94
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res} .01005

{txt}{ralign 78:(Std. err. adjusted for {res:1,276} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_e~d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~a {c |}{col 14}{res}{space 2} .0010195{col 26}{space 2} .0002228{col 37}{space 1}    4.58{col 46}{space 3}0.000{col 54}{space 4} .0005824{col 67}{space 3} .0014566
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-7.85e-07{col 26}{space 2} .0000279{col 37}{space 1}   -0.03{col 46}{space 3}0.978{col 54}{space 4}-.0000556{col 67}{space 3}  .000054
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_ela_sibling.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/test_score_va/va_g11_ela_sibling.dta{rm}
saved
{p_end}
(Test Score Grade 11 VA Sample)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   674,462
{txt}{hline 13}{c +}{hline 34}   F(36, 674425)   = {res} 37012.66
{txt}       Model {c |} {res} 400184.449        36  11116.2347   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 202554.093   674,425  .300335979   {txt}R-squared       ={res}    0.6639
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6639
{txt}       Total {c |} {res} 602738.541   674,461  .893659591   {txt}Root MSE        =   {res} .54803

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}   .05854{col 26}{space 2} .0026615{col 37}{space 1}   22.00{col 46}{space 3}0.000{col 54}{space 4} .0533236{col 67}{space 3} .0637563
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0686921{col 26}{space 2} .0026501{col 37}{space 1}   25.92{col 46}{space 3}0.000{col 54}{space 4}  .063498{col 67}{space 3} .0738862
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0883919{col 26}{space 2} .0026544{col 37}{space 1}  -33.30{col 46}{space 3}0.000{col 54}{space 4}-.0935944{col 67}{space 3}-.0831894
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003538{col 26}{space 2} 4.73e-06{col 37}{space 1}  -74.82{col 46}{space 3}0.000{col 54}{space 4}-.0003631{col 67}{space 3}-.0003445
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}  .052894{col 26}{space 2} .0013642{col 37}{space 1}   38.77{col 46}{space 3}0.000{col 54}{space 4} .0502202{col 67}{space 3} .0555679
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1902327{col 26}{space 2} .0021907{col 37}{space 1}   86.83{col 46}{space 3}0.000{col 54}{space 4}  .185939{col 67}{space 3} .1945265
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0668171{col 26}{space 2} .0018686{col 37}{space 1}  -35.76{col 46}{space 3}0.000{col 54}{space 4}-.0704794{col 67}{space 3}-.0631548
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1697084{col 26}{space 2} .0036767{col 37}{space 1}  -46.16{col 46}{space 3}0.000{col 54}{space 4}-.1769147{col 67}{space 3}-.1625022
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0057796{col 26}{space 2}  .004072{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-.0022015{col 67}{space 3} .0137606
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0650642{col 26}{space 2} .0015838{col 37}{space 1}  -41.08{col 46}{space 3}0.000{col 54}{space 4}-.0681685{col 67}{space 3}-.0619599
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0853626{col 26}{space 2} .0035675{col 37}{space 1}  -23.93{col 46}{space 3}0.000{col 54}{space 4}-.0923547{col 67}{space 3}-.0783705
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1559783{col 26}{space 2} .0036066{col 37}{space 1}  -43.25{col 46}{space 3}0.000{col 54}{space 4}-.1630471{col 67}{space 3}-.1489095
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3460793{col 26}{space 2} .0027089{col 37}{space 1}  127.76{col 46}{space 3}0.000{col 54}{space 4} .3407699{col 67}{space 3} .3513887
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3328641{col 26}{space 2}  .002639{col 37}{space 1}  126.13{col 46}{space 3}0.000{col 54}{space 4} .3276918{col 67}{space 3} .3380365
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3021307{col 26}{space 2} .0027744{col 37}{space 1}  108.90{col 46}{space 3}0.000{col 54}{space 4} .2966929{col 67}{space 3} .3075685
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1877411{col 26}{space 2} .0033763{col 37}{space 1}   55.61{col 46}{space 3}0.000{col 54}{space 4} .1811236{col 67}{space 3} .1943586
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0241664{col 26}{space 2} .0014326{col 37}{space 1}   16.87{col 46}{space 3}0.000{col 54}{space 4} .0213586{col 67}{space 3} .0269742
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0056111{col 26}{space 2}  .001441{col 37}{space 1}    3.89{col 46}{space 3}0.000{col 54}{space 4} .0027867{col 67}{space 3} .0084354
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0197895{col 26}{space 2} .0014526{col 37}{space 1}   13.62{col 46}{space 3}0.000{col 54}{space 4} .0169424{col 67}{space 3} .0226366
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0001293{col 26}{space 2}  .001457{col 37}{space 1}   -0.09{col 46}{space 3}0.929{col 54}{space 4} -.002985{col 67}{space 3} .0027264
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0156205{col 26}{space 2} .0006613{col 37}{space 1}  -23.62{col 46}{space 3}0.000{col 54}{space 4}-.0169166{col 67}{space 3}-.0143244
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0104033{col 26}{space 2} .0006037{col 37}{space 1}  -17.23{col 46}{space 3}0.000{col 54}{space 4}-.0115865{col 67}{space 3}-.0092201
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0133383{col 26}{space 2} .0005876{col 37}{space 1}  -22.70{col 46}{space 3}0.000{col 54}{space 4}  -.01449{col 67}{space 3}-.0121866
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0065435{col 26}{space 2} .0009548{col 37}{space 1}   -6.85{col 46}{space 3}0.000{col 54}{space 4}-.0084149{col 67}{space 3}-.0046721
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4873828{col 26}{space 2} .0026899{col 37}{space 1}  181.19{col 46}{space 3}0.000{col 54}{space 4} .4821107{col 67}{space 3} .4926549
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .509296{col 26}{space 2} .0027366{col 37}{space 1}  186.10{col 46}{space 3}0.000{col 54}{space 4} .5039323{col 67}{space 3} .5146596
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .532375{col 26}{space 2} .0028544{col 37}{space 1}  186.51{col 46}{space 3}0.000{col 54}{space 4} .5267805{col 67}{space 3} .5379695
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6711163{col 26}{space 2} .0034189{col 37}{space 1}  196.29{col 46}{space 3}0.000{col 54}{space 4} .6644153{col 67}{space 3} .6778174
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0240714{col 26}{space 2}  .001793{col 37}{space 1}   13.43{col 46}{space 3}0.000{col 54}{space 4} .0205572{col 67}{space 3} .0275857
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0046303{col 26}{space 2} .0017438{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} .0012126{col 67}{space 3}  .008048
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0006828{col 26}{space 2} .0017864{col 37}{space 1}   -0.38{col 46}{space 3}0.702{col 54}{space 4}-.0041841{col 67}{space 3} .0028184
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0777338{col 26}{space 2} .0014196{col 37}{space 1}   54.76{col 46}{space 3}0.000{col 54}{space 4} .0749514{col 67}{space 3} .0805163
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0227705{col 26}{space 2} .0007368{col 37}{space 1}  -30.90{col 46}{space 3}0.000{col 54}{space 4}-.0242147{col 67}{space 3}-.0213264
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0202824{col 26}{space 2} .0007792{col 37}{space 1}  -26.03{col 46}{space 3}0.000{col 54}{space 4}-.0218095{col 67}{space 3}-.0187552
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0213844{col 26}{space 2} .0007705{col 37}{space 1}  -27.76{col 46}{space 3}0.000{col 54}{space 4}-.0228945{col 67}{space 3}-.0198743
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0265723{col 26}{space 2} .0009485{col 37}{space 1}  -28.01{col 46}{space 3}0.000{col 54}{space 4}-.0284315{col 67}{space 3}-.0247132
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.248523{col 26}{space 2} .0289643{col 37}{space 1}   77.63{col 46}{space 3}0.000{col 54}{space 4} 2.191754{col 67}{space 3} 2.305292
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_math_nosibctrl.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.54802918 .16390201 .52294561 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0194658737   .6783396224          3534{txt}  {c |}
  2 {c |}  {res}.0154052278   .5463185172          2296{txt}  {c |}
  3 {c |}  {res}.0098236127   .3639788075          1105{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0194658737{txt}  {c |}
  2 {c |}  {res}.0154052278{txt}  {c |}
  3 {c |}  {res}.0154052278{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   672,870
                                                {txt}F(1, 1273)        =  {res}  4237.24
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0479
                                                {txt}Root MSE          =    {res} .53469

{txt}{ralign 78:(Std. err. adjusted for {res:1,274} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_m~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~h {c |}{col 14}{res}{space 2} .9690228{col 26}{space 2} .0148865{col 37}{space 1}   65.09{col 46}{space 3}0.000{col 54}{space 4}  .939818{col 67}{space 3} .9982275
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.000864{col 26}{space 2} .0008938{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-.0026175{col 67}{space 3} .0008894
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster} saved
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   674,462
{txt}{hline 13}{c +}{hline 34}   F(38, 674423)   = {res} 35112.12
{txt}       Model {c |} {res}  400366.82        38   10535.969   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 202371.721   674,423  .300066459   {txt}R-squared       ={res}    0.6642
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6642
{txt}       Total {c |} {res} 602738.541   674,461  .893659591   {txt}Root MSE        =   {res} .54778

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0583161{col 26}{space 2} .0026605{col 37}{space 1}   21.92{col 46}{space 3}0.000{col 54}{space 4} .0531017{col 67}{space 3} .0635305
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}   .06815{col 26}{space 2} .0026497{col 37}{space 1}   25.72{col 46}{space 3}0.000{col 54}{space 4} .0629567{col 67}{space 3} .0733433
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0888705{col 26}{space 2} .0026551{col 37}{space 1}  -33.47{col 46}{space 3}0.000{col 54}{space 4}-.0940743{col 67}{space 3}-.0836666
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0257658{col 26}{space 2}  .002612{col 37}{space 1}   -9.86{col 46}{space 3}0.000{col 54}{space 4}-.0308854{col 67}{space 3}-.0206463
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0664619{col 26}{space 2} .0028684{col 37}{space 1}   23.17{col 46}{space 3}0.000{col 54}{space 4}   .06084{col 67}{space 3} .0720837
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003525{col 26}{space 2} 4.73e-06{col 37}{space 1}  -74.55{col 46}{space 3}0.000{col 54}{space 4}-.0003617{col 67}{space 3}-.0003432
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0528537{col 26}{space 2} .0013636{col 37}{space 1}   38.76{col 46}{space 3}0.000{col 54}{space 4}  .050181{col 67}{space 3} .0555263
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}  .189382{col 26}{space 2}  .002191{col 37}{space 1}   86.44{col 46}{space 3}0.000{col 54}{space 4} .1850878{col 67}{space 3} .1936762
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0659531{col 26}{space 2} .0018682{col 37}{space 1}  -35.30{col 46}{space 3}0.000{col 54}{space 4}-.0696147{col 67}{space 3}-.0622915
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1696506{col 26}{space 2} .0036751{col 37}{space 1}  -46.16{col 46}{space 3}0.000{col 54}{space 4}-.1768536{col 67}{space 3}-.1624476
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0063197{col 26}{space 2} .0040703{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4} -.001658{col 67}{space 3} .0142973
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0651353{col 26}{space 2} .0015835{col 37}{space 1}  -41.13{col 46}{space 3}0.000{col 54}{space 4}-.0682389{col 67}{space 3}-.0620317
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0851729{col 26}{space 2} .0035659{col 37}{space 1}  -23.89{col 46}{space 3}0.000{col 54}{space 4} -.092162{col 67}{space 3}-.0781839
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} -.155758{col 26}{space 2} .0036051{col 37}{space 1}  -43.21{col 46}{space 3}0.000{col 54}{space 4}-.1628239{col 67}{space 3}-.1486922
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3455483{col 26}{space 2} .0027079{col 37}{space 1}  127.61{col 46}{space 3}0.000{col 54}{space 4}  .340241{col 67}{space 3} .3508557
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3323749{col 26}{space 2} .0026381{col 37}{space 1}  125.99{col 46}{space 3}0.000{col 54}{space 4} .3272044{col 67}{space 3} .3375454
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3015533{col 26}{space 2} .0027736{col 37}{space 1}  108.72{col 46}{space 3}0.000{col 54}{space 4} .2961173{col 67}{space 3} .3069894
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1869776{col 26}{space 2}  .003375{col 37}{space 1}   55.40{col 46}{space 3}0.000{col 54}{space 4} .1803628{col 67}{space 3} .1935925
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0241348{col 26}{space 2}  .001432{col 37}{space 1}   16.85{col 46}{space 3}0.000{col 54}{space 4} .0213282{col 67}{space 3} .0269415
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .005581{col 26}{space 2} .0014404{col 37}{space 1}    3.87{col 46}{space 3}0.000{col 54}{space 4} .0027578{col 67}{space 3} .0084042
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0198104{col 26}{space 2}  .001452{col 37}{space 1}   13.64{col 46}{space 3}0.000{col 54}{space 4} .0169645{col 67}{space 3} .0226563
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0000811{col 26}{space 2} .0014564{col 37}{space 1}   -0.06{col 46}{space 3}0.956{col 54}{space 4}-.0029356{col 67}{space 3} .0027734
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0155503{col 26}{space 2}  .000661{col 37}{space 1}  -23.53{col 46}{space 3}0.000{col 54}{space 4}-.0168458{col 67}{space 3}-.0142548
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.010345{col 26}{space 2} .0006034{col 37}{space 1}  -17.14{col 46}{space 3}0.000{col 54}{space 4}-.0115277{col 67}{space 3}-.0091623
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0132864{col 26}{space 2} .0005874{col 37}{space 1}  -22.62{col 46}{space 3}0.000{col 54}{space 4}-.0144376{col 67}{space 3}-.0121352
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0064213{col 26}{space 2} .0009544{col 37}{space 1}   -6.73{col 46}{space 3}0.000{col 54}{space 4}-.0082918{col 67}{space 3}-.0045507
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4865136{col 26}{space 2} .0026889{col 37}{space 1}  180.93{col 46}{space 3}0.000{col 54}{space 4} .4812434{col 67}{space 3} .4917838
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5081895{col 26}{space 2} .0027358{col 37}{space 1}  185.76{col 46}{space 3}0.000{col 54}{space 4} .5028275{col 67}{space 3} .5135516
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5312935{col 26}{space 2} .0028535{col 37}{space 1}  186.19{col 46}{space 3}0.000{col 54}{space 4} .5257007{col 67}{space 3} .5368862
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6698344{col 26}{space 2} .0034178{col 37}{space 1}  195.98{col 46}{space 3}0.000{col 54}{space 4} .6631356{col 67}{space 3} .6765332
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0240231{col 26}{space 2} .0017922{col 37}{space 1}   13.40{col 46}{space 3}0.000{col 54}{space 4} .0205104{col 67}{space 3} .0275359
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0045412{col 26}{space 2}  .001743{col 37}{space 1}    2.61{col 46}{space 3}0.009{col 54}{space 4}  .001125{col 67}{space 3} .0079574
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0007193{col 26}{space 2} .0017856{col 37}{space 1}   -0.40{col 46}{space 3}0.687{col 54}{space 4}-.0042191{col 67}{space 3} .0027804
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0775742{col 26}{space 2} .0014191{col 37}{space 1}   54.66{col 46}{space 3}0.000{col 54}{space 4} .0747928{col 67}{space 3} .0803556
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0226939{col 26}{space 2} .0007365{col 37}{space 1}  -30.81{col 46}{space 3}0.000{col 54}{space 4}-.0241375{col 67}{space 3}-.0212504
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0201758{col 26}{space 2} .0007788{col 37}{space 1}  -25.90{col 46}{space 3}0.000{col 54}{space 4}-.0217023{col 67}{space 3}-.0186493
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0213052{col 26}{space 2} .0007701{col 37}{space 1}  -27.66{col 46}{space 3}0.000{col 54}{space 4}-.0228146{col 67}{space 3}-.0197957
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0264218{col 26}{space 2} .0009481{col 37}{space 1}  -27.87{col 46}{space 3}0.000{col 54}{space 4}-.0282801{col 67}{space 3}-.0245634
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.238644{col 26}{space 2} .0289663{col 37}{space 1}   77.28{col 46}{space 3}0.000{col 54}{space 4} 2.181871{col 67}{space 3} 2.295417
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_math.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.54778322 .16371553 .52274629 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0194140802   .6779384445          3534{txt}  {c |}
  2 {c |}  {res} .015356176   .5457502346          2296{txt}  {c |}
  3 {c |}  {res}.0097630068   .3626400715          1105{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0194140802{txt}  {c |}
  2 {c |}  {res} .015356176{txt}  {c |}
  3 {c |}  {res} .015356176{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   672,870
                                                {txt}F(1, 1273)        =  {res}  4234.93
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0477
                                                {txt}Root MSE          =    {res} .53449

{txt}{ralign 78:(Std. err. adjusted for {res:1,274} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_m~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~h {c |}{col 14}{res}{space 2} .9686532{col 26}{space 2} .0148849{col 37}{space 1}   65.08{col 46}{space 3}0.000{col 54}{space 4} .9394516{col 67}{space 3} .9978548
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0008575{col 26}{space 2} .0008948{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-.0026129{col 67}{space 3}  .000898
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_math_sibling.ster} saved
{res}
{txt}Linear regression                               Number of obs     = {res}   672,870
                                                {txt}F(1, 1273)        =  {res}    16.31
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res} .01644

{txt}{ralign 78:(Std. err. adjusted for {res:1,274} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_m~d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~h {c |}{col 14}{res}{space 2} .0014631{col 26}{space 2} .0003623{col 37}{space 1}    4.04{col 46}{space 3}0.000{col 54}{space 4} .0007523{col 67}{space 3} .0021739
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.99e-06{col 26}{space 2}  .000046{col 37}{space 1}   -0.04{col 46}{space 3}0.965{col 54}{space 4}-.0000922{col 67}{space 3} .0000882
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_math_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_math_sibling.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_math_sibling.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/test_score_va/va_g11_math_sibling.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. 
. set trace off
{txt}
{com}. 
. timer off 1
{txt}
{com}. timer list
{res}   1:     31.23 /        1 =      31.2300
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 May 2022, 22:02:05
{txt}{.-}
{smcl}
{txt}{sf}{ul off}