-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_out_dk.smcl
  log type:  smcl
 opened on:   3 May 2022, 22:31:16

. 
.  /* change directory to common_core_va project directory for all value added
>  do files because some called subroutines written by Matt may use relative fi
> le paths  */
.  cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
.  /* file path macros for datasets */
.  include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
.  //run Matt's do helper file to set the local macros for VA project
.  include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
.  macro list
T_gm_fix_span:  0
S_4:            .003900032715465
S_2:            300
S_3:            .020595561559967
S_1:            epanechnikov
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
.  //startomg timer
.  timer on 1

. 
. 
. 
. 
. *****************************************************************************
> ***
. *start the main code
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)

. 
. // deep knowledge controls for sibling acs restricted sample
. local sib_acs_dk_controls va_ela_og va_math_og

. 
. 
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* Deep Knowledge Outcome VA controlling for ela and math VA, 4 specification
> s  */
. foreach outcome in enr enr_2year enr_4year {
  2.   // load the resctricted sample with sibling and acs controls and test sc
> ore VA
.   use $vaprojdir/data/va_samples/va_sib_acs_out_restr_smp.dta if touse_`outco
> me'_dk==1, clear
  3. 
. 
.   ***************************************************************************
> *****
.   /* Primary outcome DK va specification, no tfx, no peer fx, no sibling ctrl
> , no acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _og_dk.ster, replace)
  4. 
.   // rename the va estimates and the residuals
.   rename tv va_`outcome'_og_dk
  5.   rename score_r `outcome'_r_og_dk
  6.   label var va_`outcome'_og_dk "``outcome'_str' DK VA OG Specification"
  7.   label var `outcome'_r_og_dk "Outcome Residual from ``outcome'_str' DK VA
>  OG Specification"
  8. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_og_dk va_`outcome'_og_dk, cluster(school_id)
  9. 
.   // save spec test estimates
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_og_dk.ster, replace
 10. 
. 
. 
. 
.   ***************************************************************************
> *****
.   /* Outcome DK VA, no tfx, no peer fx, no sibling ctrl, with acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `census_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _acs_dk.ster, replace)
 11. 
.   // rename va estimates and score residuals
.   rename tv va_`outcome'_acs_dk
 12.   rename score_r `outcome'_r_acs_dk
 13.   label var va_`outcome'_acs_dk "``outcome'_str' DK VA with Census Control
> s"
 14.   label var `outcome'_r_acs_dk "Outcome Residual from ``outcome'_str' DK V
> A with Census Controls"
 15. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_acs_dk va_`outcome'_acs_dk, cluster(school_id)
 16. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_acs_dk.ster, replace
 17. 
. 
.   *******************
.   // forecast bias test for ACS leave out vars
. 
.   // difference in outcome residuals
.   gen `outcome'_r_d_og_acs_dk = `outcome'_r_og_dk - `outcome'_r_acs_dk
 18.   // fb test
.   reg `outcome'_r_d_og_acs_dk va_`outcome'_og_dk, cluster(school_id)
 19.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test
> _`outcome'_acs_og_dk.ster, replace
 20. 
. 
. 
.   ***************************************************************************
> *****
.   /* Outcome DK VA, no tfx, no peer fx, with sibling ctrl, no acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `sibling_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _sib_dk.ster, replace)
 21. 
.   //rename va estimates sand score residuals
.   rename tv va_`outcome'_sib_dk
 22.   rename score_r `outcome'_r_sib_dk
 23.   label var va_`outcome'_sib_dk "``outcome'_str' DK VA with Sibling Contro
> ls"
 24.   label var `outcome'_r_sib_dk "Outcome Residual from ``outcome'_str' DK V
> A with Sibling Controls"
 25. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_sib_dk va_`outcome'_sib_dk, cluster(school_id)
 26. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_sib_dk.ster, replace
 27. 
. 
.   *******************
.   // forecast bias test for sibling controls as leave out vars
.   // difference in outcome residuals
.   gen `outcome'_r_d_og_sib_dk = `outcome'_r_og_dk - `outcome'_r_sib_dk
 28.   // fb test
.   reg `outcome'_r_d_og_sib_dk va_`outcome'_og_dk, cluster(school_id)
 29.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test
> _`outcome'_sib_og_dk.ster, replace
 30. 
. 
. 
. 
.   ***************************************************************************
> *****
.   /* Outcome DK VA, no tfx, no peer fx, with sibling ctrl, with acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `sibling_controls' ///
>       `census_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _both_dk.ster, replace)
 31. 
.   //rename va estimates sand outcome residuals
.   rename tv va_`outcome'_both_dk
 32.   rename score_r `outcome'_r_both_dk
 33.   label var va_`outcome'_both_dk "``outcome'_str' DK VA with Sibling and C
> ensus Controls"
 34.   label var `outcome'_r_both_dk "Outcome Residual from ``outcome'_str' DK 
> VA with Sibling and Census Controls"
 35. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_both_dk va_`outcome'_both_dk, cluster(school_id)
 36. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_both_dk.ster, replace
 37. 
. 
.   *******************
.   // forecast bias test for sibling controls as leave out vars against specif
> ication with only census controls
.   // difference in outcome residuals with census controls and residuals with 
> both census and sibling controls
.   gen `outcome'_r_d_acs_both_dk = `outcome'_r_acs_dk - `outcome'_r_both_dk
 38.   // fb test
.   reg `outcome'_r_d_acs_both_dk va_`outcome'_acs_dk, cluster(school_id)
 39.   //naming convention: forecast bias test for leave out variables being si
> bling controls, against VA with only acs controls
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`o
> utcome'_sib_acs_dk.ster, replace
 40. 
.   *******************
.   // forecast bias test for census controls as leave out vars against specifi
> cation with only sibling controls
.   // difference in outcome residuals with census controls and residuals with 
> both census and sibling controls
.   gen `outcome'_r_d_sib_both_dk = `outcome'_r_sib_dk - `outcome'_r_both_dk
 41.   // fb test
.   reg `outcome'_r_d_sib_both_dk va_`outcome'_sib_dk, cluster(school_id)
 42.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test
> _`outcome'_acs_sib_dk.ster, replace
 43. 
. 
. 
. 
.   ********* Save VA estimates
.   collapse (firstnm) va_* ///
>     (mean) `outcome'* ///
>     (sum) n_g11_`outcome'_dk = touse_`outcome'_dk ///
>     , by(school_id cdscode grade year)
 44.   // save to VA project data folder
.   save $vaprojdir/data/sib_acs_restr_smp/outcome_va/va_`outcome'_sib_acs_dk.d
> ta, replace
 45. 
. 
. }
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(38, 431862)   =   1576.17
       Model |  10418.8444        38  274.180116   Prob > F        =    0.0000
    Residual |  75124.0349   431,862  .173953798   R-squared       =    0.1218
-------------+----------------------------------   Adj R-squared   =    0.1217
       Total |  85542.8793   431,900  .198061772   Root MSE        =    .41708

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0418761   .0075201     5.57   0.000      .027137    .0566152
  va_math_og |   .1774572   .0070345    25.23   0.000     .1636697    .1912447
             |
        year |
       2016  |   .0087231    .002527     3.45   0.001     .0037703    .0136759
       2017  |  -.0161703   .0025363    -6.38   0.000    -.0211414   -.0111991
       2018  |  -.0286931   .0025602   -11.21   0.000    -.0337111   -.0236751
             |
         age |  -.0001448   4.60e-06   -31.46   0.000    -.0001538   -.0001358
             |
        male |
       Male  |  -.0681531   .0012986   -52.48   0.000    -.0706983   -.0656079
 1.eth_asian |   .0522458   .0020319    25.71   0.000     .0482635    .0562282
1.eth_hisp~c |  -.0293616   .0017847   -16.45   0.000    -.0328595   -.0258637
 1.eth_black |   .0064173   .0035941     1.79   0.074     -.000627    .0134617
 1.eth_other |  -.0120159   .0038624    -3.11   0.002    -.0195861   -.0044456
             |
econ_disad~e |
Economic ..  |  -.0645309   .0015153   -42.59   0.000    -.0675008   -.0615609
             |
limited_en~f |
Limited E..  |  -.0485254   .0034708   -13.98   0.000    -.0553281   -.0417227
             |
    disabled |
   Disabled  |  -.0214025    .003395    -6.30   0.000    -.0280567   -.0147484
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0798068   .0025527    31.26   0.000     .0748036      .08481
       2016  |   .0688765   .0024884    27.68   0.000     .0639993    .0737537
       2017  |   .0736855   .0026402    27.91   0.000     .0685107    .0788603
       2018  |   .0710125   .0032934    21.56   0.000     .0645577    .0774674
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0183036   .0013527   -13.53   0.000    -.0209548   -.0156524
       2016  |  -.0227683   .0013534   -16.82   0.000    -.0254209   -.0201156
       2017  |  -.0122672   .0014134    -8.68   0.000    -.0150374    -.009497
       2018  |   -.012806   .0014101    -9.08   0.000    -.0155698   -.0100422
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0005367   .0006107    -0.88   0.380    -.0017336    .0006602
       2016  |   .0012981   .0005605     2.32   0.021     .0001996    .0023966
       2017  |  -.0018018    .000558    -3.23   0.001    -.0028955   -.0007081
       2018  |  -.0049446   .0009254    -5.34   0.000    -.0067583   -.0031309
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0568929   .0025391    22.41   0.000     .0519164    .0618694
       2016  |   .0627786   .0025783    24.35   0.000     .0577253     .067832
       2017  |   .0587864   .0027133    21.67   0.000     .0534683    .0641044
       2018  |   .0859029   .0033125    25.93   0.000     .0794104    .0923954
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0118271   .0016954    -6.98   0.000      -.01515   -.0085042
       2016  |  -.0156595   .0016518    -9.48   0.000     -.018897   -.0124219
       2017  |  -.0129236   .0017415    -7.42   0.000     -.016337   -.0095102
       2018  |  -.0038589   .0013804    -2.80   0.005    -.0065645   -.0011533
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0005131   .0006871    -0.75   0.455    -.0018598    .0008336
       2016  |   .0006021    .000729     0.83   0.409    -.0008266    .0020309
       2017  |  -.0001929    .000733    -0.26   0.792    -.0016296    .0012438
       2018  |  -.0069134   .0009095    -7.60   0.000     -.008696   -.0051307
             |
       _cons |   1.693309   .0281886    60.07   0.000      1.63806    1.748558
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_og_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41707769 .07567853 .41015431 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0046022867    .596398312          3403  |
  2 |  .0039859216   .5340644306          2215  |
  3 |  .0032783977   .4549988879          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0046022867  |
  2 |  .0039859216  |
  3 |  .0039859216  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =    3436.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0198
                                                Root MSE          =     .41291

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
 enr_r_og_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   1.046697   .0178562    58.62   0.000     1.011665    1.081729
       _cons |   -.001598   .0004125    -3.87   0.000    -.0024073   -.0007887
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/outcome_va/spec_test_enr_og_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(45, 431855)   =   1386.59
       Model |  10799.3412        45   239.98536   Prob > F        =    0.0000
    Residual |  74743.5381   431,855  .173075542   R-squared       =    0.1262
-------------+----------------------------------   Adj R-squared   =    0.1262
       Total |  85542.8793   431,900  .198061772   Root MSE        =    .41602

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0769152   .0075898    10.13   0.000     .0620394    .0917911
  va_math_og |   .1187175   .0072268    16.43   0.000     .1045532    .1328818
             |
        year |
       2016  |   .0088182   .0025222     3.50   0.000     .0038748    .0137616
       2017  |  -.0161618   .0025366    -6.37   0.000    -.0211335   -.0111901
       2018  |  -.0274226   .0025672   -10.68   0.000    -.0324542    -.022391
             |
         age |  -.0001499   4.60e-06   -32.61   0.000     -.000159   -.0001409
             |
        male |
       Male  |  -.0690985   .0012956   -53.33   0.000    -.0716378   -.0665592
 1.eth_asian |   .0472874   .0022872    20.67   0.000     .0428046    .0517703
1.eth_hisp~c |    -.00249   .0019768    -1.26   0.208    -.0063644    .0013844
 1.eth_black |   .0293729    .003761     7.81   0.000     .0220016    .0367443
 1.eth_other |  -.0092573   .0038674    -2.39   0.017    -.0168372   -.0016774
             |
econ_disad~e |
Economic ..  |  -.0398243   .0016142   -24.67   0.000    -.0429881   -.0366604
             |
limited_en~f |
Limited E..  |   -.048731   .0034634   -14.07   0.000    -.0555191   -.0419429
             |
    disabled |
   Disabled  |   -.029351   .0033909    -8.66   0.000    -.0359971   -.0227049
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0749543   .0025488    29.41   0.000     .0699588    .0799498
       2016  |    .064312   .0024846    25.88   0.000     .0594422    .0691818
       2017  |   .0675857    .002637    25.63   0.000     .0624172    .0727542
       2018  |    .067386   .0032863    20.51   0.000     .0609449    .0738271
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0182264   .0013495   -13.51   0.000    -.0208714   -.0155814
       2016  |  -.0226348   .0013502   -16.76   0.000    -.0252813   -.0199884
       2017  |  -.0122911   .0014101    -8.72   0.000    -.0150549   -.0095273
       2018  |  -.0124682   .0014067    -8.86   0.000    -.0152253   -.0097112
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0004703   .0006091    -0.77   0.440    -.0016642    .0007236
       2016  |   .0012989   .0005591     2.32   0.020     .0002031    .0023946
       2017  |  -.0016102   .0005566    -2.89   0.004    -.0027012   -.0005192
       2018  |  -.0049461   .0009231    -5.36   0.000    -.0067553   -.0031369
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0556678   .0025331    21.98   0.000     .0507031    .0606325
       2016  |   .0616359   .0025721    23.96   0.000     .0565947    .0666771
       2017  |   .0581907   .0027069    21.50   0.000     .0528853    .0634962
       2018  |   .0828947   .0033051    25.08   0.000     .0764168    .0893726
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0113577   .0016915    -6.71   0.000    -.0146731   -.0080423
       2016  |  -.0151531    .001648    -9.19   0.000    -.0183831   -.0119231
       2017  |  -.0129569   .0017373    -7.46   0.000    -.0163619   -.0095519
       2018  |  -.0046288   .0013774    -3.36   0.001    -.0073284   -.0019292
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0007563   .0006854    -1.10   0.270    -.0020998    .0005871
       2016  |   .0004025   .0007272     0.55   0.580    -.0010228    .0018277
       2017  |  -.0003155   .0007312    -0.43   0.666    -.0017486    .0011176
       2018  |  -.0071143   .0009074    -7.84   0.000    -.0088928   -.0053358
             |
eth_asian_~t |   .0005045   .0000486    10.39   0.000     .0004094    .0005997
eth_hispan~t |  -.0004508   .0000481    -9.36   0.000    -.0005451   -.0003564
eth_black_~t |  -.0010184   .0000893   -11.40   0.000    -.0011935   -.0008434
educ_hs_dr~p |  -.4235749   .1290329    -3.28   0.001    -.6764754   -.1706743
educ~us_prop |   .5127778   .1180923     4.34   0.000     .2813205    .7442351
pov_fam_ch~t |  -.0005233   .0000736    -7.11   0.000    -.0006675   -.0003792
inc_medi~_hh |   3.86e-07   3.37e-08    11.45   0.000     3.20e-07    4.52e-07
       _cons |   1.694864   .0283934    59.69   0.000     1.639214    1.750514
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_acs_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41602349 .07274195 .40961464 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0041828301    .577724386          3403  |
  2 |  .0035327676   .5023805556          2215  |
  3 |  .0029864963   .4355093478          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0041828301  |
  2 |  .0035327676  |
  3 |  .0035327676  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =    2723.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0177
                                                Root MSE          =      .4123

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_acs_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   1.060577   .0203232    52.19   0.000     1.020705    1.100449
       _cons |  -.0012498    .000411    -3.04   0.002    -.0020562   -.0004434
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_acs_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =     102.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0279
                                                Root MSE          =     .02926

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d_og~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .0885218   .0087447    10.12   0.000     .0713657    .1056779
       _cons |  -.0001379   .0006188    -0.22   0.824    -.0013519    .0010761
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_acs_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(40, 431860)   =   1512.75
       Model |  10512.8006        40  262.820015   Prob > F        =    0.0000
    Residual |  75030.0787   431,860  .173737041   R-squared       =    0.1229
-------------+----------------------------------   Adj R-squared   =    0.1228
       Total |  85542.8793   431,900  .198061772   Root MSE        =    .41682

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0400337    .007516     5.33   0.000     .0253025    .0547648
  va_math_og |   .1782492   .0070315    25.35   0.000     .1644678    .1920307
             |
        year |
       2016  |   .0081806   .0025256     3.24   0.001     .0032306    .0131307
       2017  |  -.0174097   .0025354    -6.87   0.000     -.022379   -.0124403
       2018  |  -.0304202   .0025603   -11.88   0.000    -.0354384    -.025402
             |
         age |  -.0001426   4.60e-06   -31.01   0.000    -.0001517   -.0001336
             |
        male |
       Male  |  -.0681915   .0012978   -52.54   0.000    -.0707351   -.0656479
 1.eth_asian |   .0509692   .0020315    25.09   0.000     .0469876    .0549508
1.eth_hisp~c |  -.0291704    .001784   -16.35   0.000    -.0326669   -.0256739
 1.eth_black |   .0063437   .0035919     1.77   0.077    -.0006963    .0133837
 1.eth_other |  -.0113934   .0038601    -2.95   0.003    -.0189592   -.0038277
             |
econ_disad~e |
Economic ..  |   -.064952   .0015146   -42.88   0.000    -.0679205   -.0619835
             |
limited_en~f |
Limited E..  |  -.0484397   .0034687   -13.96   0.000    -.0552382   -.0416413
             |
    disabled |
   Disabled  |  -.0207338   .0033931    -6.11   0.000    -.0273841   -.0140835
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0797343   .0025513    31.25   0.000     .0747339    .0847347
       2016  |   .0689524   .0024871    27.72   0.000     .0640778    .0738269
       2017  |   .0738761    .002639    27.99   0.000     .0687038    .0790484
       2018  |    .070647   .0032915    21.46   0.000     .0641958    .0770982
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0182209   .0013519   -13.48   0.000    -.0208706   -.0155713
       2016  |  -.0226421   .0013526   -16.74   0.000    -.0252932    -.019991
       2017  |  -.0120617   .0014126    -8.54   0.000    -.0148302   -.0092931
       2018  |  -.0127465   .0014092    -9.04   0.000    -.0155086   -.0099844
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0005008   .0006103    -0.82   0.412     -.001697    .0006954
       2016  |   .0012961   .0005601     2.31   0.021     .0001983     .002394
       2017  |  -.0018223   .0005577    -3.27   0.001    -.0029153   -.0007292
       2018  |   -.004818   .0009248    -5.21   0.000    -.0066307   -.0030054
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0562413   .0025377    22.16   0.000     .0512675    .0612151
       2016  |   .0618021   .0025771    23.98   0.000      .056751    .0668531
       2017  |   .0579881   .0027119    21.38   0.000     .0526727    .0633034
       2018  |    .085098   .0033109    25.70   0.000     .0786087    .0915872
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0117082   .0016944    -6.91   0.000    -.0150291   -.0083873
       2016  |  -.0156067   .0016508    -9.45   0.000    -.0188423   -.0123712
       2017  |  -.0129047   .0017405    -7.41   0.000     -.016316   -.0094935
       2018  |  -.0036997   .0013797    -2.68   0.007    -.0064039   -.0009956
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004871   .0006867    -0.71   0.478     -.001833    .0008588
       2016  |    .000695   .0007285     0.95   0.340     -.000733    .0021229
       2017  |  -.0001182   .0007326    -0.16   0.872     -.001554    .0013176
       2018  |  -.0067695    .000909    -7.45   0.000    -.0085511   -.0049879
             |
1.has_~2year |   .0204183   .0025037     8.16   0.000     .0155112    .0253255
1.has_~4year |   .0574055    .002704    21.23   0.000     .0521057    .0627052
       _cons |   1.676352    .028182    59.48   0.000     1.621116    1.731587
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_sib_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41681776 .07548627 .40992544 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0045807499   .5960855918          3403  |
  2 |  .0039655563   .5335822367          2215  |
  3 |  .0032540486   .4536896751          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0045807499  |
  2 |  .0039655563  |
  3 |  .0039655563  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =    3440.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0197
                                                Root MSE          =     .41267

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_sib_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |     1.0461   .0178338    58.66   0.000     1.011112    1.081087
       _cons |  -.0015675   .0004122    -3.80   0.000    -.0023763   -.0007588
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_sib_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =      10.87
                                                Prob > F          =     0.0010
                                                R-squared         =     0.0001
                                                Root MSE          =     .01475

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d~b_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |    .002504   .0007596     3.30   0.001     .0010137    .0039942
       _cons |  -3.82e-06    .000047    -0.08   0.935     -.000096    .0000884
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_sib_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(47, 431853)   =   1340.88
       Model |  10893.7493        47  231.781901   Prob > F        =    0.0000
    Residual |    74649.13   431,853  .172857732   R-squared       =    0.1273
-------------+----------------------------------   Adj R-squared   =    0.1273
       Total |  85542.8793   431,900  .198061772   Root MSE        =    .41576

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0750126   .0075856     9.89   0.000     .0601451    .0898801
  va_math_og |   .1196851   .0072231    16.57   0.000     .1055281    .1338422
             |
        year |
       2016  |   .0082863   .0025207     3.29   0.001     .0033457    .0132269
       2017  |  -.0173992   .0025357    -6.86   0.000    -.0223692   -.0124293
       2018  |   -.029163   .0025673   -11.36   0.000    -.0341948   -.0241312
             |
         age |  -.0001477   4.60e-06   -32.14   0.000    -.0001568   -.0001387
             |
        male |
       Male  |  -.0691388   .0012948   -53.40   0.000    -.0716765   -.0666011
 1.eth_asian |   .0458417   .0022867    20.05   0.000     .0413599    .0503235
1.eth_hisp~c |  -.0022588   .0019759    -1.14   0.253    -.0061315    .0016138
 1.eth_black |     .02931   .0037586     7.80   0.000     .0219433    .0366767
 1.eth_other |  -.0086846    .003865    -2.25   0.025    -.0162599   -.0011093
             |
econ_disad~e |
Economic ..  |  -.0402976   .0016134   -24.98   0.000    -.0434598   -.0371354
             |
limited_en~f |
Limited E..  |  -.0486574   .0034612   -14.06   0.000    -.0554412   -.0418735
             |
    disabled |
   Disabled  |   -.028696   .0033889    -8.47   0.000    -.0353382   -.0220539
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0748675   .0025473    29.39   0.000     .0698749    .0798602
       2016  |   .0643778   .0024832    25.93   0.000     .0595107    .0692448
       2017  |   .0677824   .0026357    25.72   0.000     .0626164    .0729484
       2018  |    .067028   .0032844    20.41   0.000     .0605906    .0734653
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0181381   .0013487   -13.45   0.000    -.0207815   -.0154948
       2016  |  -.0225028   .0013494   -16.68   0.000    -.0251476   -.0198579
       2017  |  -.0120766   .0014093    -8.57   0.000    -.0148388   -.0093145
       2018  |  -.0124022   .0014058    -8.82   0.000    -.0151575   -.0096469
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.000434   .0006088    -0.71   0.476    -.0016272    .0007592
       2016  |   .0012971   .0005587     2.32   0.020      .000202    .0023922
       2017  |  -.0016326   .0005563    -2.93   0.003     -.002723   -.0005423
       2018  |  -.0048188   .0009225    -5.22   0.000    -.0066269   -.0030107
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0550243   .0025317    21.73   0.000     .0500623    .0599863
       2016  |   .0606651   .0025709    23.60   0.000     .0556263    .0657039
       2017  |   .0574029   .0027055    21.22   0.000     .0521002    .0627056
       2018  |   .0820878   .0033034    24.85   0.000     .0756131    .0885624
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0112287   .0016905    -6.64   0.000     -.014542   -.0079153
       2016  |  -.0150945    .001647    -9.17   0.000    -.0183225   -.0118665
       2017  |  -.0129333   .0017362    -7.45   0.000    -.0163362   -.0095304
       2018  |  -.0044626   .0013766    -3.24   0.001    -.0071607   -.0017645
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0007331    .000685    -1.07   0.285    -.0020758    .0006095
       2016  |   .0004944   .0007267     0.68   0.496      -.00093    .0019188
       2017  |  -.0002417   .0007307    -0.33   0.741    -.0016739    .0011905
       2018  |  -.0069688   .0009068    -7.68   0.000    -.0087462   -.0051914
             |
1.has_~2year |     .02072    .002498     8.29   0.000     .0158241    .0256159
1.has_~4year |    .057446   .0026983    21.29   0.000     .0521573    .0627346
eth_asian_~t |   .0005128   .0000485    10.57   0.000     .0004177    .0006079
eth_hispan~t |   -.000453   .0000481    -9.42   0.000    -.0005473   -.0003587
eth_black_~t |  -.0010274   .0000893   -11.51   0.000    -.0012023   -.0008524
educ_hs_dr~p |  -.4473292   .1289561    -3.47   0.001    -.7000792   -.1945792
educ~us_prop |    .549081   .1180389     4.65   0.000     .3177284    .7804336
pov_fam_ch~t |  -.0005241   .0000735    -7.13   0.000    -.0006682     -.00038
inc_medi~_hh |   3.68e-07   3.37e-08    10.94   0.000     3.02e-07    4.34e-07
       _cons |    1.67878    .028386    59.14   0.000     1.623144    1.734416
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/outcome_va/vam_enr_both_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_both_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41576163 .0724872 .40939387 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0041527651   .5767862662          3403  |
  2 |  .0035041921   .5011288853          2215  |
  3 |  .0029550815   .4334437284          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0041527651  |
  2 |  .0035041921  |
  3 |  .0035041921  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =    2707.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0175
                                                Root MSE          =     .41207

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_both~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |    1.06021   .0203773    52.03   0.000     1.020232    1.100188
       _cons |  -.0012189    .000411    -2.97   0.003    -.0020252   -.0004125
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_both_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =      27.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .01478

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d_ac~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .0040294   .0007738     5.21   0.000     .0025112    .0055476
       _cons |  -4.78e-06   .0000452    -0.11   0.916    -.0000935    .0000839
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_sib_acs_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =     105.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0287
                                                Root MSE          =     .02927

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d_si~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .0900329   .0087768    10.26   0.000     .0728138    .1072521
       _cons |  -.0001377   .0006175    -0.22   0.824    -.0013491    .0010737
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_acs_sib_dk.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/o
    > utcome_va/va_enr_sib_acs_dk.dta saved
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(38, 431862)   =    651.66
       Model |  5401.04498        38  142.132763   Prob > F        =    0.0000
    Residual |   94193.194   431,862  .218109475   R-squared       =    0.0542
-------------+----------------------------------   Adj R-squared   =    0.0541
       Total |  99594.2389   431,900  .230595598   Root MSE        =    .46702

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .1040594   .0084206    12.36   0.000     .0875553    .1205635
  va_math_og |  -.1583235   .0078769   -20.10   0.000     -.173762    -.142885
             |
        year |
       2016  |  -.0090904   .0028296    -3.21   0.001    -.0146364   -.0035445
       2017  |  -.0362478   .0028401   -12.76   0.000    -.0418143   -.0306814
       2018  |  -.0106615   .0028668    -3.72   0.000    -.0162803   -.0050426
             |
         age |  -.0000734   5.15e-06   -14.25   0.000    -.0000835   -.0000633
             |
        male |
       Male  |   .0221967   .0014541    15.26   0.000     .0193467    .0250466
 1.eth_asian |  -.0093665   .0022752    -4.12   0.000    -.0138258   -.0049073
1.eth_hisp~c |  -.0089742   .0019984    -4.49   0.000     -.012891   -.0050574
 1.eth_black |  -.0419374   .0040245   -10.42   0.000    -.0498253   -.0340495
 1.eth_other |   .0021434    .004325     0.50   0.620    -.0063334    .0106202
             |
econ_disad~e |
Economic ..  |  -.0283535   .0016968   -16.71   0.000     -.031679   -.0250279
             |
limited_en~f |
Limited E..  |  -.0261807   .0038864    -6.74   0.000     -.033798   -.0185634
             |
    disabled |
   Disabled  |   .0314061   .0038016     8.26   0.000     .0239551     .038857
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   -.059339   .0028584   -20.76   0.000    -.0649413   -.0537366
       2016  |  -.0543819   .0027864   -19.52   0.000    -.0598431   -.0489206
       2017  |  -.0510696   .0029564   -17.27   0.000    -.0568641   -.0452752
       2018  |  -.0264276   .0036877    -7.17   0.000    -.0336555   -.0191998
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0418146   .0015147   -27.61   0.000    -.0447833   -.0388459
       2016  |  -.0405794   .0015155   -26.78   0.000    -.0435497   -.0376091
       2017  |  -.0309702   .0015826   -19.57   0.000    -.0340722   -.0278683
       2018  |  -.0325266    .001579   -20.60   0.000    -.0356213   -.0294319
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108893   .0006838    15.92   0.000     .0095491    .0122295
       2016  |   .0107272   .0006276    17.09   0.000     .0094971    .0119572
       2017  |   .0082988   .0006248    13.28   0.000     .0070741    .0095235
       2018  |   .0042373   .0010362     4.09   0.000     .0022064    .0062682
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0662537   .0028431   -23.30   0.000    -.0718261   -.0606813
       2016  |  -.0664775    .002887   -23.03   0.000     -.072136    -.060819
       2017  |  -.0673089   .0030383   -22.15   0.000    -.0732638    -.061354
       2018  |  -.0549456   .0037092   -14.81   0.000    -.0622155   -.0476757
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0294764   .0018984   -15.53   0.000    -.0331973   -.0257556
       2016  |  -.0335641   .0018496   -18.15   0.000    -.0371894   -.0299389
       2017  |  -.0262403   .0019501   -13.46   0.000    -.0300624   -.0224182
       2018  |  -.0354866   .0015457   -22.96   0.000    -.0385163    -.032457
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0097998   .0007694    12.74   0.000     .0082918    .0113077
       2016  |   .0115412   .0008163    14.14   0.000     .0099413    .0131411
       2017  |   .0091687   .0008208    11.17   0.000       .00756    .0107774
       2018  |   .0024198   .0010185     2.38   0.018     .0004237     .004416
             |
       _cons |   .9113114   .0315642    28.87   0.000     .8494466    .9731762
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_og_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.46702192 .09702212 .45683277 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0087542008   .7332547463          3403  |
  2 |  .0079577355   .6737673937          2215  |
  3 |  .0070370702   .6147260851          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0087542008  |
  2 |  .0079577355  |
  3 |  .0079577355  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =   12424.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0336
                                                Root MSE          =      .4591

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2year_~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye~k |   .9911534   .0088921   111.46   0.000     .9737081    1.008599
       _cons |  -.0013106   .0003987    -3.29   0.001    -.0020928   -.0005284
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/outcome_va/spec_test_enr_2year_og_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(45, 431855)   =    627.62
       Model |  6113.51727        45  135.855939   Prob > F        =    0.0000
    Residual |  93480.7217   431,855  .216463215   R-squared       =    0.0614
-------------+----------------------------------   Adj R-squared   =    0.0613
       Total |  99594.2389   431,900  .230595598   Root MSE        =    .46526

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0885591    .008488    10.43   0.000     .0719228    .1051953
  va_math_og |  -.1369724    .008082   -16.95   0.000    -.1528129   -.1211319
             |
        year |
       2016  |  -.0070582   .0028207    -2.50   0.012    -.0125866   -.0015298
       2017  |   -.033827   .0028368   -11.92   0.000     -.039387   -.0282669
       2018  |  -.0077344    .002871    -2.69   0.007    -.0133615   -.0021074
             |
         age |  -.0000734   5.14e-06   -14.27   0.000    -.0000835   -.0000633
             |
        male |
       Male  |    .021313   .0014489    14.71   0.000     .0184732    .0241528
 1.eth_asian |  -.0226499   .0025579    -8.85   0.000    -.0276633   -.0176365
1.eth_hisp~c |   .0113398   .0022107     5.13   0.000     .0070069    .0156726
 1.eth_black |  -.0161444    .004206    -3.84   0.000    -.0243881   -.0079008
 1.eth_other |    .000624    .004325     0.14   0.885    -.0078529     .009101
             |
econ_disad~e |
Economic ..  |  -.0188598   .0018053   -10.45   0.000    -.0223981   -.0153216
             |
limited_en~f |
Limited E..  |  -.0276297   .0038732    -7.13   0.000    -.0352211   -.0200383
             |
    disabled |
   Disabled  |   .0267617   .0037922     7.06   0.000     .0193291    .0341942
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   -.063052   .0028504   -22.12   0.000    -.0686386   -.0574653
       2016  |  -.0580275   .0027786   -20.88   0.000    -.0634735   -.0525814
       2017  |  -.0539823   .0029491   -18.30   0.000    -.0597624   -.0482021
       2018  |  -.0282421   .0036752    -7.68   0.000    -.0354454   -.0210388
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0405651   .0015092   -26.88   0.000    -.0435231   -.0376071
       2016  |  -.0392905     .00151   -26.02   0.000    -.0422501   -.0363309
       2017  |  -.0294992    .001577   -18.71   0.000      -.03259   -.0264083
       2018  |  -.0313874   .0015731   -19.95   0.000    -.0344706   -.0283041
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108924   .0006812    15.99   0.000     .0095572    .0122276
       2016  |   .0107136   .0006252    17.14   0.000     .0094882    .0119391
       2017  |   .0082155   .0006225    13.20   0.000     .0069954    .0094356
       2018  |    .004365   .0010323     4.23   0.000     .0023417    .0063882
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0653664   .0028328   -23.07   0.000    -.0709187   -.0598142
       2016  |  -.0656782   .0028765   -22.83   0.000    -.0713159   -.0600404
       2017  |  -.0660619   .0030273   -21.82   0.000    -.0719953   -.0601286
       2018  |  -.0570511   .0036962   -15.43   0.000    -.0642956   -.0498066
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0273032   .0018917   -14.43   0.000    -.0310109   -.0235954
       2016  |  -.0318658    .001843   -17.29   0.000     -.035478   -.0282535
       2017  |  -.0252572   .0019429   -13.00   0.000    -.0290652   -.0214492
       2018  |  -.0344964   .0015404   -22.39   0.000    -.0375155   -.0314773
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0091839   .0007666    11.98   0.000     .0076814    .0106863
       2016  |   .0110906   .0008132    13.64   0.000     .0094967    .0126845
       2017  |   .0089002   .0008177    10.88   0.000     .0072975    .0105029
       2018  |   .0027561   .0010148     2.72   0.007     .0007672     .004745
             |
eth_asian_~t |   .0007642   .0000543    14.08   0.000     .0006578    .0008707
eth_hispan~t |  -.0010283   .0000538   -19.10   0.000    -.0011338   -.0009228
eth_black_~t |  -.0025808   .0000999   -25.84   0.000    -.0027765    -.002385
educ_hs_dr~p |   -2.01108   .1443028   -13.94   0.000    -2.293909   -1.728251
educ~us_prop |  -1.625352   .1320674   -12.31   0.000      -1.8842   -1.366504
pov_fam_ch~t |  -.0012294   .0000823   -14.94   0.000    -.0013907   -.0010682
inc_medi~_hh |  -1.13e-06   3.77e-08   -30.07   0.000    -1.21e-06   -1.06e-06
       _cons |   1.068297   .0317535    33.64   0.000     1.006061    1.130533
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_acs_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.46525607 .08724491 .45700278 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0068987415   .6834099487          3403  |
  2 |  .0061149079   .6100301279          2215  |
  3 |  .0053371792   .5458582755          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0068987415  |
  2 |  .0061149079  |
  3 |  .0061149079  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =    8205.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0257
                                                Root MSE          =     .45922

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2ye~s_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~s_dk |   .9951189   .0109853    90.59   0.000     .9735671    1.016671
       _cons |  -.0012665   .0004245    -2.98   0.003    -.0020993   -.0004337
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_acs_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =     250.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0934
                                                Root MSE          =     .03867

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr~g_acs_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~g_dk |   .1437862   .0090817    15.83   0.000      .125969    .1616034
       _cons |  -.0001933   .0007912    -0.24   0.807    -.0017455    .0013589
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_acs_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(40, 431860)   =    670.60
       Model |   5824.3025        40  145.607563   Prob > F        =    0.0000
    Residual |  93769.9364   431,860  .217130404   R-squared       =    0.0585
-------------+----------------------------------   Adj R-squared   =    0.0584
       Total |  99594.2389   431,900  .230595598   Root MSE        =    .46597

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .1024395   .0084024    12.19   0.000     .0859711    .1189078
  va_math_og |  -.1525722   .0078607   -19.41   0.000    -.1679788   -.1371655
             |
        year |
       2016  |   -.009401   .0028234    -3.33   0.001    -.0149348   -.0038672
       2017  |  -.0366758   .0028344   -12.94   0.000    -.0422312   -.0311204
       2018  |  -.0123457   .0028623    -4.31   0.000    -.0179557   -.0067357
             |
         age |   -.000073   5.14e-06   -14.19   0.000     -.000083   -.0000629
             |
        male |
       Male  |    .022355   .0014508    15.41   0.000     .0195114    .0251985
 1.eth_asian |  -.0097381    .002271    -4.29   0.000    -.0141893    -.005287
1.eth_hisp~c |  -.0108262   .0019943    -5.43   0.000    -.0147351   -.0069173
 1.eth_black |  -.0419836   .0040155   -10.46   0.000    -.0498538   -.0341134
 1.eth_other |   .0014637   .0043154     0.34   0.734    -.0069943    .0099216
             |
econ_disad~e |
Economic ..  |  -.0289565   .0016932   -17.10   0.000    -.0322751    -.025638
             |
limited_en~f |
Limited E..  |  -.0267808   .0038777    -6.91   0.000     -.034381   -.0191805
             |
    disabled |
   Disabled  |   .0315316   .0037932     8.31   0.000      .024097    .0389661
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0579826   .0028521   -20.33   0.000    -.0635727   -.0523925
       2016  |   -.052979   .0027803   -19.05   0.000    -.0584284   -.0475296
       2017  |  -.0490973   .0029502   -16.64   0.000    -.0548796    -.043315
       2018  |  -.0247984   .0036796    -6.74   0.000    -.0320104   -.0175865
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0415331   .0015113   -27.48   0.000    -.0444951    -.038571
       2016  |  -.0402349   .0015121   -26.61   0.000    -.0431986   -.0372712
       2017  |  -.0307173   .0015791   -19.45   0.000    -.0338123   -.0276222
       2018  |  -.0322716   .0015754   -20.48   0.000    -.0353594   -.0291838
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0107249   .0006823    15.72   0.000     .0093877    .0120621
       2016  |   .0105714   .0006262    16.88   0.000     .0093441    .0117987
       2017  |   .0081195   .0006235    13.02   0.000     .0068975    .0093415
       2018  |   .0040151   .0010339     3.88   0.000     .0019887    .0060415
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0650669    .002837   -22.94   0.000    -.0706272   -.0595065
       2016  |  -.0649618    .002881   -22.55   0.000    -.0706085   -.0593151
       2017  |  -.0658753   .0030318   -21.73   0.000    -.0718175   -.0599332
       2018  |  -.0526279   .0037013   -14.22   0.000    -.0598824   -.0453734
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0292256   .0018942   -15.43   0.000    -.0329382   -.0255131
       2016  |  -.0332624   .0018455   -18.02   0.000    -.0368795   -.0296452
       2017  |  -.0260955   .0019457   -13.41   0.000     -.029909    -.022282
       2018  |   -.034838   .0015424   -22.59   0.000     -.037861   -.0318149
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0096816   .0007677    12.61   0.000      .008177    .0111862
       2016  |    .011363   .0008145    13.95   0.000     .0097666    .0129593
       2017  |   .0090623   .0008189    11.07   0.000     .0074572    .0106674
       2018  |   .0021958   .0010162     2.16   0.031     .0002041    .0041875
             |
1.has_~2year |   .0995394   .0027989    35.56   0.000     .0940536    .1050252
1.has_~4year |  -.0856121   .0030229   -28.32   0.000    -.0915368   -.0796873
       _cons |    .907256   .0315055    28.80   0.000     .8455062    .9690058
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_sib_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.46597254 .09531512 .45611998 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0084382148   .7268154478          3403  |
  2 |  .0076463292   .6658934782          2215  |
  3 |  .0067472702   .6070569781          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0084382148  |
  2 |  .0076463292  |
  3 |  .0076463292  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =   11941.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0324
                                                Root MSE          =     .45835

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2ye~b_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~b_dk |   .9918451   .0090766   109.28   0.000     .9740379    1.009652
       _cons |  -.0013406   .0003989    -3.36   0.001    -.0021231    -.000558
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_sib_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =     497.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0027
                                                Root MSE          =     .03126

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr~g_sib_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~g_dk |   .0188035   .0008432    22.30   0.000     .0171493    .0204578
       _cons |  -.0000245   .0000713    -0.34   0.731    -.0001644    .0001154
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_sib_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(47, 431853)   =    642.61
       Model |  6510.06518        47  138.512025   Prob > F        =    0.0000
    Residual |  93084.1738   431,853   .21554597   R-squared       =    0.0654
-------------+----------------------------------   Adj R-squared   =    0.0653
       Total |  99594.2389   431,900  .230595598   Root MSE        =    .46427

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0878482   .0084706    10.37   0.000     .0712461    .1044503
  va_math_og |  -.1327196   .0080658   -16.45   0.000    -.1485284   -.1169109
             |
        year |
       2016  |  -.0074212   .0028148    -2.64   0.008    -.0129382   -.0019042
       2017  |  -.0343365   .0028316   -12.13   0.000    -.0398862   -.0287867
       2018  |  -.0094729   .0028668    -3.30   0.001    -.0150918   -.0038541
             |
         age |   -.000073   5.13e-06   -14.22   0.000    -.0000831   -.0000629
             |
        male |
       Male  |   .0214689   .0014458    14.85   0.000     .0186351    .0243026
 1.eth_asian |  -.0225981   .0025535    -8.85   0.000    -.0276028   -.0175934
1.eth_hisp~c |   .0095487   .0022064     4.33   0.000     .0052242    .0138731
 1.eth_black |  -.0162933   .0041971    -3.88   0.000    -.0245195   -.0080671
 1.eth_other |   .0001201   .0043159     0.03   0.978     -.008339    .0085792
             |
econ_disad~e |
Economic ..  |  -.0192591   .0018016   -10.69   0.000    -.0227903    -.015728
             |
limited_en~f |
Limited E..  |  -.0281657    .003865    -7.29   0.000    -.0357411   -.0205904
             |
    disabled |
   Disabled  |   .0268779   .0037843     7.10   0.000     .0194608     .034295
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   -.061734   .0028445   -21.70   0.000    -.0673092   -.0561589
       2016  |  -.0566605    .002773   -20.43   0.000    -.0620954   -.0512256
       2017  |  -.0520943   .0029433   -17.70   0.000     -.057863   -.0463256
       2018  |   -.026688   .0036676    -7.28   0.000    -.0338764   -.0194996
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0403171    .001506   -26.77   0.000    -.0432689   -.0373653
       2016  |    -.03898   .0015069   -25.87   0.000    -.0419334   -.0360266
       2017  |  -.0292834   .0015737   -18.61   0.000    -.0323678    -.026199
       2018  |  -.0311604   .0015698   -19.85   0.000    -.0342372   -.0280836
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0107347   .0006798    15.79   0.000     .0094023    .0120671
       2016  |   .0105632   .0006239    16.93   0.000     .0093404    .0117861
       2017  |   .0080459   .0006212    12.95   0.000     .0068283    .0092634
       2018  |   .0041487   .0010301     4.03   0.000     .0021297    .0061677
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0642732    .002827   -22.74   0.000    -.0698141   -.0587323
       2016  |  -.0642675   .0028708   -22.39   0.000    -.0698942   -.0586408
       2017  |  -.0647281   .0030212   -21.42   0.000    -.0706494   -.0588067
       2018  |  -.0548193   .0036889   -14.86   0.000    -.0620493   -.0475892
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0270972   .0018877   -14.35   0.000    -.0307971   -.0233973
       2016  |  -.0316009   .0018391   -17.18   0.000    -.0352055   -.0279963
       2017  |  -.0251383   .0019388   -12.97   0.000    -.0289382   -.0213384
       2018  |  -.0338949   .0015372   -22.05   0.000    -.0369078    -.030882
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090801   .0007649    11.87   0.000     .0075808    .0105793
       2016  |   .0109268   .0008115    13.46   0.000     .0093363    .0125174
       2017  |   .0088032    .000816    10.79   0.000     .0072039    .0104025
       2018  |   .0025325   .0010126     2.50   0.012     .0005477    .0045172
             |
1.has_~2year |   .0971946   .0027894    34.84   0.000     .0917275    .1026618
1.has_~4year |  -.0817599   .0030132   -27.13   0.000    -.0876657   -.0758542
eth_asian_~t |   .0007457   .0000542    13.76   0.000     .0006395    .0008519
eth_hispan~t |  -.0010096   .0000537   -18.79   0.000    -.0011149   -.0009043
eth_black_~t |  -.0025433   .0000997   -25.52   0.000    -.0027387    -.002348
educ_hs_dr~p |  -1.984097   .1440016   -13.78   0.000    -2.266336   -1.701858
educ~us_prop |  -1.570926   .1318107   -11.92   0.000    -1.829271   -1.312581
pov_fam_ch~t |  -.0012079   .0000821   -14.71   0.000    -.0013688    -.001047
inc_medi~_hh |  -1.10e-06   3.76e-08   -29.28   0.000    -1.17e-06   -1.03e-06
       _cons |   1.060561   .0316979    33.46   0.000     .9984342    1.122688
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/outcome_va/vam_enr_2year_both_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_both_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.46426929 .08577266 .45627735 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0066563043    .676466892          3403  |
  2 |   .005878809     .60180365          2215  |
  3 |  .0051214535   .5382423752          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0066563043  |
  2 |   .005878809  |
  3 |   .005878809  |
    +---------------+
-------------------------------------------------------------------------------
note: label truncated to 80 characters

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =    7889.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0248
                                                Root MSE          =     .45846

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2ye~h_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~h_dk |   .9959642   .0112132    88.82   0.000     .9739653    1.017963
       _cons |  -.0012883   .0004245    -3.03   0.002    -.0021212   -.0004554
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_both_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =     382.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0021
                                                Root MSE          =     .03027

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
en~s_both_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~s_dk |   .0185558   .0009486    19.56   0.000     .0166947    .0204169
       _cons |  -.0000233   .0000684    -0.34   0.734    -.0001576     .000111
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_sib_acs_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =     249.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0925
                                                Root MSE          =     .03796

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
en~b_both_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~b_dk |   .1433928   .0090703    15.81   0.000     .1255978    .1611877
       _cons |  -.0001969   .0007739    -0.25   0.799    -.0017152    .0013215
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_acs_sib_dk.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/o
    > utcome_va/va_enr_2year_sib_acs_dk.dta saved
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(38, 431862)   =   3692.59
       Model |  24611.3934        38  647.668247   Prob > F        =    0.0000
    Residual |  75747.1727   431,862  .175396707   R-squared       =    0.2452
-------------+----------------------------------   Adj R-squared   =    0.2452
       Total |  100358.566   431,900  .232365284   Root MSE        =     .4188

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |  -.0621833   .0075512    -8.23   0.000    -.0769834   -.0473831
  va_math_og |   .3357806   .0070637    47.54   0.000     .3219361    .3496252
             |
        year |
       2016  |   .0178135   .0025375     7.02   0.000     .0128402    .0227869
       2017  |   .0200776   .0025468     7.88   0.000     .0150858    .0250693
       2018  |  -.0180316   .0025708    -7.01   0.000    -.0230704   -.0129929
             |
         age |  -.0000714   4.62e-06   -15.44   0.000    -.0000804   -.0000623
             |
        male |
       Male  |  -.0903498    .001304   -69.29   0.000    -.0929055    -.087794
 1.eth_asian |   .0616124   .0020403    30.20   0.000     .0576135    .0656112
1.eth_hisp~c |  -.0203874   .0017921   -11.38   0.000    -.0238998    -.016875
 1.eth_black |   .0483547    .003609    13.40   0.000     .0412812    .0554283
 1.eth_other |  -.0141593   .0038784    -3.65   0.000    -.0217609   -.0065576
             |
econ_disad~e |
Economic ..  |  -.0361774   .0015216   -23.78   0.000    -.0391596   -.0331952
             |
limited_en~f |
Limited E..  |  -.0223447   .0034852    -6.41   0.000    -.0291755   -.0155138
             |
    disabled |
   Disabled  |  -.0528086   .0034091   -15.49   0.000    -.0594903   -.0461269
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1391458   .0025633    54.28   0.000     .1341218    .1441697
       2016  |   .1232584   .0024987    49.33   0.000      .118361    .1281558
       2017  |   .1247551   .0026512    47.06   0.000     .1195589    .1299513
       2018  |   .0974401    .003307    29.46   0.000     .0909585    .1039217
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    .023511   .0013583    17.31   0.000     .0208488    .0261732
       2016  |   .0178111    .001359    13.11   0.000     .0151475    .0204748
       2017  |    .018703   .0014192    13.18   0.000     .0159214    .0214847
       2018  |   .0197206   .0014159    13.93   0.000     .0169454    .0224958
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.011426   .0006132   -18.63   0.000    -.0126278   -.0102241
       2016  |  -.0094291   .0005628   -16.75   0.000    -.0105321    -.008326
       2017  |  -.0101006   .0005603   -18.03   0.000    -.0111988   -.0090024
       2018  |  -.0091819   .0009292    -9.88   0.000    -.0110031   -.0073607
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1231466   .0025496    48.30   0.000     .1181496    .1281437
       2016  |   .1292561    .002589    49.93   0.000     .1241818    .1343304
       2017  |   .1260953   .0027246    46.28   0.000     .1207552    .1314354
       2018  |   .1408485   .0033262    42.34   0.000     .1343292    .1473678
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0176493   .0017024    10.37   0.000     .0143127     .020986
       2016  |   .0179047   .0016587    10.79   0.000     .0146537    .0211556
       2017  |   .0133167   .0017488     7.61   0.000     .0098892    .0167442
       2018  |   .0316277   .0013862    22.82   0.000     .0289109    .0343446
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0103129   .0006899   -14.95   0.000    -.0116652   -.0089606
       2016  |  -.0109391    .000732   -14.94   0.000    -.0123738   -.0095044
       2017  |  -.0093616    .000736   -12.72   0.000    -.0108042   -.0079189
       2018  |  -.0093332   .0009133   -10.22   0.000    -.0111232   -.0075431
             |
       _cons |   .7819978   .0283053    27.63   0.000     .7265203    .8374753
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_og_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.4188039 .08350331 .41039482 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0060683221   .6795498356          3403  |
  2 |  .0063428022   .7074702142          2215  |
  3 |  .0057152862   .6377830218          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0060683221  |
  2 |  .0063428022  |
  3 |  .0063428022  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =   15810.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0305
                                                Root MSE          =     .41237

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4year_~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye~k |   1.022018   .0081279   125.74   0.000     1.006072    1.037964
       _cons |  -7.99e-06   .0002935    -0.03   0.978    -.0005839    .0005679
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/outcome_va/spec_test_enr_4year_og_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(45, 431855)   =   3228.26
       Model |  25261.8068        45  561.373484   Prob > F        =    0.0000
    Residual |  75096.7593   431,855  .173893458   R-squared       =    0.2517
-------------+----------------------------------   Adj R-squared   =    0.2516
       Total |  100358.566   431,900  .232365284   Root MSE        =    .41701

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |  -.0116439   .0076077    -1.53   0.126    -.0265548    .0032671
  va_math_og |   .2556899   .0072438    35.30   0.000     .2414922    .2698876
             |
        year |
       2016  |   .0158763   .0025281     6.28   0.000     .0109213    .0208314
       2017  |   .0176652   .0025426     6.95   0.000     .0126817    .0226486
       2018  |  -.0196882   .0025732    -7.65   0.000    -.0247316   -.0146447
             |
         age |  -.0000765   4.61e-06   -16.60   0.000    -.0000856   -.0000675
             |
        male |
       Male  |  -.0904115   .0012986   -69.62   0.000    -.0929568   -.0878662
 1.eth_asian |   .0699373   .0022926    30.51   0.000     .0654439    .0744308
1.eth_hisp~c |  -.0138298   .0019814    -6.98   0.000    -.0177133   -.0099462
 1.eth_black |   .0455174   .0037698    12.07   0.000     .0381286    .0529061
 1.eth_other |  -.0098813   .0038765    -2.55   0.011    -.0174791   -.0022835
             |
econ_disad~e |
Economic ..  |  -.0209644    .001618   -12.96   0.000    -.0241357   -.0177931
             |
limited_en~f |
Limited E..  |  -.0211013   .0034715    -6.08   0.000    -.0279054   -.0142972
             |
    disabled |
   Disabled  |  -.0561127   .0033989   -16.51   0.000    -.0627744   -.0494509
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1380062   .0025548    54.02   0.000     .1329989    .1430135
       2016  |   .1223395   .0024905    49.12   0.000     .1174582    .1272207
       2017  |   .1215679   .0026433    45.99   0.000     .1163872    .1267486
       2018  |   .0956281   .0032941    29.03   0.000     .0891718    .1020844
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0223387   .0013527    16.51   0.000     .0196875      .02499
       2016  |   .0166557   .0013534    12.31   0.000      .014003    .0193084
       2017  |   .0172081   .0014134    12.17   0.000     .0144377    .0199784
       2018  |   .0189191     .00141    13.42   0.000     .0161556    .0216826
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0113627   .0006106   -18.61   0.000    -.0125594    -.010166
       2016  |  -.0094148   .0005604   -16.80   0.000    -.0105131   -.0083164
       2017  |  -.0098257    .000558   -17.61   0.000    -.0109193   -.0087321
       2018  |  -.0093111   .0009252   -10.06   0.000    -.0111245   -.0074976
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1210342    .002539    47.67   0.000     .1160578    .1260107
       2016  |   .1273141   .0025781    49.38   0.000      .122261    .1323672
       2017  |   .1242527   .0027133    45.79   0.000     .1189347    .1295707
       2018  |   .1399458   .0033129    42.24   0.000     .1334526     .146439
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0159455   .0016955     9.40   0.000     .0126223    .0192687
       2016  |   .0167127   .0016519    10.12   0.000     .0134751    .0199503
       2017  |   .0123003   .0017414     7.06   0.000     .0088872    .0157134
       2018  |   .0298676   .0013806    21.63   0.000     .0271616    .0325736
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0099402   .0006871   -14.47   0.000    -.0112868   -.0085936
       2016  |  -.0106881   .0007289   -14.66   0.000    -.0121167   -.0092595
       2017  |  -.0092157   .0007329   -12.57   0.000    -.0106522   -.0077792
       2018  |  -.0098704   .0009095   -10.85   0.000     -.011653   -.0080877
             |
eth_asian_~t |  -.0002597   .0000487    -5.34   0.000    -.0003551   -.0001643
eth_hispan~t |   .0005775   .0000483    11.97   0.000      .000483    .0006721
eth_black_~t |   .0015623   .0000895    17.45   0.000     .0013869    .0017378
educ_hs_dr~p |   1.587505   .1293375    12.27   0.000     1.334008    1.841003
educ~us_prop |    2.13813    .118371    18.06   0.000     1.906126    2.370134
pov_fam_ch~t |   .0007061   .0000737     9.58   0.000     .0005616    .0008506
inc_medi~_hh |   1.52e-06   3.38e-08    44.98   0.000     1.45e-06    1.58e-06
       _cons |   .6265669   .0284604    22.02   0.000     .5707854    .6823485
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_acs_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41700535 .07517087 .41017411 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0048714551   .6408928952          3403  |
  2 |  .0050496651   .6588992798          2215  |
  3 |  .0044938608   .5857597934          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0048714551  |
  2 |  .0050496651  |
  3 |  .0050496651  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =   10602.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0237
                                                Root MSE          =     .41202

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4ye~s_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~s_dk |   1.025814   .0099625   102.97   0.000     1.006269    1.045359
       _cons |   .0001493   .0003053     0.49   0.625    -.0004497    .0007484
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_acs_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =     148.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0783
                                                Root MSE          =     .03726

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr~g_acs_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~g_dk |   .1518186   .0124506    12.19   0.000     .1273919    .1762453
       _cons |  -2.01e-06   .0008322    -0.00   0.998    -.0016347    .0016307
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_acs_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(40, 431860)   =   3627.13
       Model |  25237.2865        40  630.932162   Prob > F        =    0.0000
    Residual |  75121.2796   431,860  .173948223   R-squared       =    0.2515
-------------+----------------------------------   Adj R-squared   =    0.2514
       Total |  100358.566   431,900  .232365284   Root MSE        =    .41707

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |  -.0624058   .0075206    -8.30   0.000    -.0771459   -.0476657
  va_math_og |   .3308214   .0070357    47.02   0.000     .3170316    .3446112
             |
        year |
       2016  |   .0175816   .0025271     6.96   0.000     .0126286    .0225347
       2017  |   .0192662    .002537     7.59   0.000     .0142938    .0242386
       2018  |  -.0180745   .0025619    -7.06   0.000    -.0230957   -.0130532
             |
         age |  -.0000697   4.60e-06   -15.14   0.000    -.0000787   -.0000607
             |
        male |
       Male  |  -.0905465   .0012986   -69.73   0.000    -.0930916   -.0880013
 1.eth_asian |   .0607073   .0020327    29.87   0.000     .0567233    .0646913
1.eth_hisp~c |  -.0183442    .001785   -10.28   0.000    -.0218428   -.0148455
 1.eth_black |   .0483273   .0035941    13.45   0.000      .041283    .0553715
 1.eth_other |  -.0128571   .0038625    -3.33   0.001    -.0204275   -.0052867
             |
econ_disad~e |
Economic ..  |  -.0359955   .0015155   -23.75   0.000    -.0389658   -.0330252
             |
limited_en~f |
Limited E..  |   -.021659   .0034708    -6.24   0.000    -.0284616   -.0148564
             |
    disabled |
   Disabled  |  -.0522654   .0033951   -15.39   0.000    -.0589197    -.045611
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1377169   .0025528    53.95   0.000     .1327135    .1427203
       2016  |   .1219313   .0024886    49.00   0.000     .1170538    .1268089
       2017  |   .1229734   .0026406    46.57   0.000      .117798    .1281489
       2018  |   .0954455   .0032935    28.98   0.000     .0889904    .1019006
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0233121   .0013527    17.23   0.000     .0206609    .0259633
       2016  |   .0175928   .0013534    13.00   0.000     .0149401    .0202454
       2017  |   .0186556   .0014134    13.20   0.000     .0158853    .0214259
       2018  |   .0195251   .0014101    13.85   0.000     .0167613    .0222888
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112257   .0006107   -18.38   0.000    -.0124226   -.0100288
       2016  |  -.0092753   .0005605   -16.55   0.000    -.0103738   -.0081768
       2017  |  -.0099418    .000558   -17.82   0.000    -.0110355    -.008848
       2018  |  -.0088332   .0009254    -9.55   0.000    -.0106469   -.0070194
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1213082   .0025392    47.77   0.000     .1163314     .126285
       2016  |   .1267638   .0025787    49.16   0.000     .1217097    .1318179
       2017  |   .1238634   .0027136    45.65   0.000     .1185448    .1291819
       2018  |   .1377259   .0033129    41.57   0.000     .1312327     .144219
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0175174   .0016954    10.33   0.000     .0141945    .0208403
       2016  |   .0176556   .0016518    10.69   0.000     .0144181    .0208932
       2017  |   .0131908   .0017415     7.57   0.000     .0097774    .0166041
       2018  |   .0311382   .0013805    22.56   0.000     .0284324     .033844
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0101687   .0006871   -14.80   0.000    -.0115153    -.008822
       2016  |   -.010668    .000729   -14.63   0.000    -.0120968   -.0092392
       2017  |  -.0091806    .000733   -12.52   0.000    -.0106172   -.0077439
       2018  |  -.0089652   .0009095    -9.86   0.000    -.0107479   -.0071825
             |
1.has_~2year |  -.0791211   .0025052   -31.58   0.000    -.0840312   -.0742109
1.has_~4year |   .1430176   .0027056    52.86   0.000     .1377146    .1483205
       _cons |   .7690955   .0281991    27.27   0.000     .7138261     .824365
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_sib_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.417071 .08148333 .40903385 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0057696338   .6713525712          3403  |
  2 |  .0060111523   .6973515539          2215  |
  3 |  .0053871899   .6262896663          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0057696338  |
  2 |  .0060111523  |
  3 |  .0060111523  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =   14780.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0289
                                                Root MSE          =     .41098

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4ye~b_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~b_dk |   1.023105   .0084153   121.58   0.000     1.006595    1.039615
       _cons |   .0000171   .0002943     0.06   0.954    -.0005604    .0005945
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_sib_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =     494.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0027
                                                Root MSE          =     .03802

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr~g_sib_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~g_dk |   .0275327    .001238    22.24   0.000     .0251038    .0299616
       _cons |  -9.33e-07   .0000851    -0.01   0.991     -.000168    .0001661
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_sib_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,901
-------------+----------------------------------   F(47, 431853)   =   3188.17
       Model |  25852.1517        47  550.045781   Prob > F        =    0.0000
    Residual |  74506.4144   431,853  .172527259   R-squared       =    0.2576
-------------+----------------------------------   Adj R-squared   =    0.2575
       Total |  100358.566   431,900  .232365284   Root MSE        =    .41536

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |  -.0128356   .0075783    -1.69   0.090    -.0276889    .0020177
  va_math_og |   .2524048   .0072162    34.98   0.000     .2382613    .2665483
             |
        year |
       2016  |   .0157075   .0025183     6.24   0.000     .0107717    .0206433
       2017  |   .0169372   .0025333     6.69   0.000      .011972    .0219024
       2018  |  -.0196901   .0025648    -7.68   0.000     -.024717   -.0146631
             |
         age |  -.0000747   4.59e-06   -16.27   0.000    -.0000837   -.0000657
             |
        male |
       Male  |  -.0906077   .0012935   -70.05   0.000     -.093143   -.0880725
 1.eth_asian |   .0684398   .0022845    29.96   0.000     .0639623    .0729173
1.eth_hisp~c |  -.0118075    .001974    -5.98   0.000    -.0156764   -.0079385
 1.eth_black |   .0456033    .003755    12.14   0.000     .0382436     .052963
 1.eth_other |  -.0088047   .0038613    -2.28   0.023    -.0163728   -.0012367
             |
econ_disad~e |
Economic ..  |  -.0210385   .0016119   -13.05   0.000    -.0241977   -.0178793
             |
limited_en~f |
Limited E..  |  -.0204917   .0034579    -5.93   0.000     -.027269   -.0137143
             |
    disabled |
   Disabled  |  -.0555739   .0033857   -16.41   0.000    -.0622097   -.0489382
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1366016   .0025449    53.68   0.000     .1316137    .1415894
       2016  |   .1210383   .0024809    48.79   0.000     .1161759    .1259007
       2017  |   .1198767   .0026332    45.52   0.000     .1147157    .1250377
       2018  |   .0937159   .0032813    28.56   0.000     .0872848    .1001471
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0221789   .0013474    16.46   0.000     .0195381    .0248198
       2016  |   .0164773   .0013481    12.22   0.000      .013835    .0191196
       2017  |   .0172067   .0014079    12.22   0.000     .0144472    .0199662
       2018  |   .0187582   .0014044    13.36   0.000     .0160055    .0215108
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0111687   .0006082   -18.36   0.000    -.0123607   -.0099767
       2016  |  -.0092661   .0005582   -16.60   0.000    -.0103602   -.0081721
       2017  |  -.0096785   .0005558   -17.41   0.000    -.0107678   -.0085892
       2018  |  -.0089675   .0009216    -9.73   0.000    -.0107738   -.0071611
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1192975   .0025293    47.17   0.000     .1143402    .1242547
       2016  |   .1249326   .0025684    48.64   0.000     .1198986    .1299666
       2017  |    .122131   .0027029    45.19   0.000     .1168333    .1274286
       2018  |   .1369071   .0033003    41.48   0.000     .1304386    .1433755
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0158685   .0016889     9.40   0.000     .0125584    .0191787
       2016  |   .0165064   .0016454    10.03   0.000     .0132815    .0197313
       2017  |   .0122049   .0017345     7.04   0.000     .0088053    .0156046
       2018  |   .0294322   .0013753    21.40   0.000     .0267367    .0321278
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0098132   .0006844   -14.34   0.000    -.0111545   -.0084719
       2016  |  -.0104324    .000726   -14.37   0.000    -.0118555   -.0090094
       2017  |  -.0090449     .00073   -12.39   0.000    -.0104757   -.0076141
       2018  |  -.0095012    .000906   -10.49   0.000    -.0112769   -.0077255
             |
1.has_~2year |  -.0764746   .0024956   -30.64   0.000    -.0813658   -.0715834
1.has_~4year |   .1392059   .0026958    51.64   0.000     .1339223    .1444895
eth_asian_~t |  -.0002329   .0000485    -4.80   0.000    -.0003279   -.0001379
eth_hispan~t |   .0005566   .0000481    11.58   0.000     .0004624    .0006508
eth_black_~t |    .001516   .0000892    17.00   0.000     .0013412    .0016907
educ_hs_dr~p |   1.536768   .1288328    11.93   0.000     1.284259    1.789276
educ~us_prop |   2.120007    .117926    17.98   0.000     1.888876    2.351138
pov_fam_ch~t |   .0006838   .0000734     9.31   0.000     .0005399    .0008277
inc_medi~_hh |   1.47e-06   3.36e-08    43.68   0.000     1.40e-06    1.53e-06
       _cons |   .6182188   .0283589    21.80   0.000     .5626363    .6738014
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_
> restr_smp/outcome_va/vam_enr_4year_both_dk.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_both_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41536401 .07340772 .40882584 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0046371745   .6321992568          3403  |
  2 |  .0047885572   .6480899692          2215  |
  3 |  .0042392714   .5739338398          1062  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0046371745  |
  2 |  .0047885572  |
  3 |  .0047885572  |
    +---------------+
-------------------------------------------------------------------------------
note: label truncated to 80 characters

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =    9808.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0225
                                                Root MSE          =     .41065

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4ye~h_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~h_dk |   1.026938   .0103691    99.04   0.000     1.006595    1.047281
       _cons |   .0001808    .000307     0.59   0.556    -.0004216    .0007831
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_both_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =     387.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0021
                                                Root MSE          =     .03693

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
en~s_both_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~s_dk |   .0273487   .0013902    19.67   0.000     .0246212    .0300761
       _cons |   3.26e-06    .000081     0.04   0.968    -.0001556    .0001622
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_sib_acs_dk.ster saved

Linear regression                               Number of obs     =    431,867
                                                F(1, 1237)        =     147.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0776
                                                Root MSE          =     .03624

                          (Std. err. adjusted for 1,238 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
en~b_both_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~b_dk |   .1515545   .0124656    12.16   0.000     .1270983    .1760106
       _cons |   1.63e-06    .000808     0.00   0.998    -.0015836    .0015869
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_acs_sib_dk.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/o
    > utcome_va/va_enr_4year_sib_acs_dk.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:     79.61 /        1 =      79.6130

. 
. set trace off

. 
. //change directory back to my own personal directory
. cd $projdir 
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_out_dk.smcl
  log type:  smcl
 closed on:   3 May 2022, 22:32:35
-------------------------------------------------------------------------------
