-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling_out.smcl
  log type:  smcl
 opened on:  12 Apr 2022, 13:14:16

. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh

. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. #delimit ;
delimiter now ;
. #delimit cr
delimiter now cr
. macro list
eststo_counter: 4
eststo:         est1 est2 est3 est4
T_gm_fix_span:  0
S_4:            .003900032715465
S_2:            300
S_3:            .020595561559967
S_1:            epanechnikov
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_6:            .7097029923018954
S_5:            4
ReS_jv2:        __000006 __000007 __000008 __000009 __00000A __00000B __00000C
                __00000D __00000E __00000F __00000G __00000H __00000I __00000J
                __00000K
dropv:          _cdscode_x
n_offset:       0
sort:           0
dots:           nois _dots 5 0
dotss:          nois _dots 0, title(Survey results being calculated)
ReS_Call:       version 16.1:
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_ca_ed_lab:     /home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files
_setlimit:      0
_1:             0
_0:             0

. 
. 
. timer on 1

. 
. 
. //load the VA grade 11 college outcomes sample
. use `va_g11_out_dataset', clear
(CST/SBAC Student Test Score Samples)

. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk', nogen keep(1 3)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       884,570
        from master                   884,570  
        from using                          0  

    Matched                           900,294  
    -----------------------------------------

. 
. drop if mi(has_older_sibling_enr_2year)
(884,570 observations deleted)

. drop if mi(has_older_sibling_enr_4year)
(0 observations deleted)

. 
. compress
  variable age was float now int
  variable major was long now int
  (3,601,176 bytes saved)

. tempfile va_g11_out_sibling_dataset

. save `va_g11_out_sibling_dataset'
file /home/tmp/St192370.000001 saved as .dta format

. 
. 
. 
. 
. *****************************************************************************
> ***
. *********** VA estimates for VA samples matched to siblings sample
. *****************************************************************************
> ***
. if `setlimit' == 0 {
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 
> 1)
. }

. else {
.   local drift_limit = `setlimit'
. }

. 
. foreach outcome in enr enr_2year enr_4year {
  2.   use `va_g11_out_sibling_dataset' if touse_g11_`outcome'==1 & sibling_out
> _sample == 1, clear
  3. 
.   ***********************Overall value added
.   **** No Peer Controls
.   ** No TFX
.     ***without sibling college going controls
.     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_cfr_g11_`outco
> me'_nosibctrl.ster, replace)
  4. 
.     //rename the first time to make sure indep var names for spec test are al
> l the same
.     rename tv va_cfr_g11_`outcome'
  5.     rename score_r g11_`outcome'_r
  6. 
.     **************** Specification Test
.     *************** No Peer Controls
.     ****** sibling sample without sibling controls
.     reg g11_`outcome'_r va_cfr_g11_`outcome', cluster(school_id)
  7.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11
> _`outcome'_sibling_nocontrol.ster, replace
  8.     //save to va project folder
.     estimates save $vaprojdir/estimates/sibling_va/outcome_va/spec_test_va_cf
> r_g11_`outcome'_sibling_nocontrol.ster, replace
  9. 
.     //rename again to distinguish between nocontrol and with control va estim
> ates
.     rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl
 10.     rename g11_`outcome'_r g11_`outcome'_r_nosibctrl
 11. 
. 
.     *** with sibling controls
.     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_cfr_g11_`outco
> me'.ster, replace)
 12.     rename tv va_cfr_g11_`outcome'
 13.     rename score_r g11_`outcome'_r
 14. 
.     **************** Specification Test
.     *************** No Peer Controls
.     ****** sibling sample with sibling controls
.     reg g11_`outcome'_r va_cfr_g11_`outcome', cluster(school_id)
 15.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11
> _`outcome'_sibling.ster, replace
 16.     //save to va project folder
.     estimates save $vaprojdir/estimates/sibling_va/outcome_va/spec_test_va_cf
> r_g11_`outcome'_sibling.ster, replace
 17. 
. 
. 
. 
. 
. 
. /*
> 
>   ** TFX
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 tfx_resid(school_id) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_tfx_g11_`outcome'
>         drop score_r
> 
>   corr va_cfr_g11_`outcome' va_tfx_g11_`outcome'
> 
>  */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
.   **** Peer Controls
.         ** No TFX
. 
.     /* ***without sibling college going controls
>     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv
>     rename score_r
> 
>     //with sibling controls
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                         `peer_demographic_controls' ///
>                         `peer_ela_score_controls' ///
>                         `peer_math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_cfr_g11_`outcome'_peer
>         rename score_r g11_`outcome'_r_peer
> 
>         ** TFX
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                         `peer_demographic_controls' ///
>                         `peer_ela_score_controls' ///
>                         `peer_math_score_controls' ///
>                 ) ///
>                 tfx_resid(school_id) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_tfx_g11_`outcome'_peer
>         drop score_r
> 
>         corr va_cfr_g11_`outcome'_peer va_tfx_g11_`outcome'_peer
>  */
. 
. 
. 
. *****************************************************************************
> ***
.   **************** Specification Test
. 
.   /* **** Peer Controls
>   reg g11_`outcome'_r_peer va_cfr_g11_`outcome'_peer, cluster(school_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`
> outcome'_peer_sibling.ster, replace
> 
>  */
. 
. 
.   *** no peer controls
. 
.   /* *** with peer controls
>   reg g11_`outcome'_r_nosibctrl_peer va_cfr_g11_`outcome'_nosibctrl_peer, clu
> ster(school_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`
> outcome'_peer_sibling_nocontrol.ster, replace */
. 
.   **************Do we need deep knowledge VA with sibling controls?? No.
. 
. 
. 
. 
.   ***************************************************************************
> ***
.   /* CFR Forecast Bias Test */
.   ***** leave out variable is sibling controls
. 
. 
.   **no peer controls
.   gen g11_`outcome'_r_d = g11_`outcome'_r_nosibctrl - g11_`outcome'_r
 18. 
.   //var rename gymnastics to make sure the indep var names are all the same w
> hen making tables later
.   rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_temp
 19.   rename va_cfr_g11_`outcome'_nosibctrl va_cfr_g11_`outcome'
 20. 
.   reg g11_`outcome'_r_d va_cfr_g11_`outcome', cluster(school_id)
 21.   //save to my personal folder
.   estimates save $projdir/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_`ou
> tcome'_sibling.ster, replace
 22.   //save to va project folder
.   estimates save $vaprojdir/estimates/sibling_va/outcome_va/fb_test_va_cfr_g1
> 1_`outcome'_sibling.ster, replace
 23. 
.   //roll back the rename gymnastics to restore original var names
.   rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl
 24.   rename va_cfr_g11_`outcome'_temp va_cfr_g11_`outcome'
 25. 
. 
.   /* ** with peer controls
>   gen g11_`outcome'_r_d_peer = g11_`outcome'_r_nosibctrl_peer - g11_`outcome'
> _r_peer
>   reg g11_`outcome'_r_d_peer va_cfr_g11_`outcome'_nosibctrl_peer, cluster(sch
> ool_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_`ou
> tcome'_sibling_peer.ster, replace
>  */
. 
. 
. 
.   **************** Save Value Added Estimates
.   collapse (firstnm) va_* ///
>     (mean) g11_`outcome'* ///
>     (sum) n_g11_`outcome' = touse_g11_`outcome' ///
>     , by(school_id cdscode grade year)
 26.   //save to my personal folder
.   save $projdir/dta/common_core_va/outcome_va/va_g11_`outcome'_sibling.dta, r
> eplace
 27.   //save to VA project folder
.   save $vaprojdir/data/sibling_va/outcome_va/va_g11_`outcome'_sibling.dta, re
> place
 28. 
. 
. }
(CST/SBAC Student Test Score Samples)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,442
-------------+----------------------------------   F(36, 700405)   =   2553.20
       Model |  16450.0479        36  456.945776   Prob > F        =    0.0000
    Residual |  125351.434   700,405  .178969931   R-squared       =    0.1160
-------------+----------------------------------   Adj R-squared   =    0.1160
       Total |  141801.482   700,441  .202446005   Root MSE        =    .42305

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |    .012467   .0019937     6.25   0.000     .0085593    .0163747
       2017  |  -.0116016   .0020029    -5.79   0.000    -.0155271   -.0076761
       2018  |  -.0280129   .0020041   -13.98   0.000    -.0319408   -.0240851
             |
         age |  -.0001742   3.51e-06   -49.67   0.000    -.0001811   -.0001673
             |
        male |
       Male  |  -.0695852   .0010335   -67.33   0.000    -.0716108   -.0675595
 1.eth_asian |   .0634695     .00166    38.23   0.000      .060216     .066723
1.eth_hisp~c |  -.0159565   .0014112   -11.31   0.000    -.0187224   -.0131906
 1.eth_black |   .0090534   .0027646     3.27   0.001     .0036348    .0144719
 1.eth_other |  -.0106233   .0030642    -3.47   0.001    -.0166289   -.0046176
             |
econ_disad~e |
Economic ..  |  -.0674867   .0012008   -56.20   0.000    -.0698403   -.0651332
             |
limited_en~f |
Limited E..  |  -.0442539   .0026864   -16.47   0.000    -.0495192   -.0389886
             |
    disabled |
   Disabled  |  -.0175178   .0026815    -6.53   0.000    -.0227734   -.0122622
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0830871   .0020208    41.12   0.000     .0791265    .0870478
       2016  |   .0729283   .0019904    36.64   0.000     .0690271    .0768295
       2017  |   .0708123   .0021244    33.33   0.000     .0666485     .074976
       2018  |    .071648   .0025843    27.72   0.000     .0665828    .0767132
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.016037   .0010459   -15.33   0.000    -.0180869   -.0139871
       2016  |  -.0204089   .0010679   -19.11   0.000     -.022502   -.0183158
       2017  |  -.0120672   .0011154   -10.82   0.000    -.0142533   -.0098812
       2018  |  -.0119936   .0011129   -10.78   0.000    -.0141749   -.0098123
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0013423    .000487    -2.76   0.006    -.0022968   -.0003879
       2016  |   .0007646   .0004504     1.70   0.090    -.0001181    .0016473
       2017  |  -.0016797   .0004506    -3.73   0.000    -.0025628   -.0007966
       2018  |  -.0049769   .0007306    -6.81   0.000    -.0064088   -.0035449
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0586995   .0020118    29.18   0.000     .0547564    .0626426
       2016  |   .0621623   .0020684    30.05   0.000     .0581083    .0662163
       2017  |   .0614896   .0021861    28.13   0.000     .0572049    .0657742
       2018  |   .0896876   .0026129    34.32   0.000     .0845663    .0948089
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0147932   .0013199   -11.21   0.000    -.0173801   -.0122063
       2016  |  -.0165704   .0013018   -12.73   0.000    -.0191219   -.0140189
       2017  |  -.0116852   .0013684    -8.54   0.000    -.0143672   -.0090031
       2018  |  -.0009304   .0010813    -0.86   0.390    -.0030496    .0011889
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0006068   .0005459     1.11   0.266    -.0004631    .0016768
       2016  |   .0011851   .0005851     2.03   0.043     .0000383    .0023319
       2017  |  -.0004774   .0005891    -0.81   0.418     -.001632    .0006771
       2018  |  -.0075972   .0007223   -10.52   0.000    -.0090129   -.0061815
             |
       _cons |   1.858858   .0214888    86.50   0.000     1.816741    1.900976
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/vam_cfr_g11_enr_nosibctrl.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr_nosibctrl.ster saved
Standard deviations: total, classes, students, teachers same year
.42304838 .08273089 .41488014 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0058747058   .7563312282          3572  |
  2 |  .0050065539    .682301683          2320  |
  3 |  .0042677877   .6200350016          1118  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0058747058  |
  2 |  .0050065539  |
  3 |  .0050065539  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,620
                                                F(1, 1277)        =    8447.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0283
                                                Root MSE          =     .41681

                          (Std. err. adjusted for 1,278 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   g11_enr_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |    1.05573   .0114863    91.91   0.000     1.033196    1.078265
       _cons |  -.0016024   .0002828    -5.67   0.000    -.0021571   -.0010477
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.ster saved
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,442
-------------+----------------------------------   F(38, 700403)   =   2448.10
       Model |  16625.8859        38  437.523313   Prob > F        =    0.0000
    Residual |  125175.596   700,403  .178719389   R-squared       =    0.1172
-------------+----------------------------------   Adj R-squared   =    0.1172
       Total |  141801.482   700,441  .202446005   Root MSE        =    .42275

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0118041   .0019925     5.92   0.000     .0078989    .0157093
       2017  |  -.0130101   .0020021    -6.50   0.000    -.0169341   -.0090861
       2018  |  -.0299744   .0020041   -14.96   0.000    -.0339024   -.0260464
             |
1.has_~2year |   .0219229   .0019872    11.03   0.000     .0180281    .0258177
1.has_~4year |   .0624166   .0021809    28.62   0.000     .0581421    .0666912
         age |  -.0001715   3.51e-06   -48.92   0.000    -.0001784   -.0001646
             |
        male |
       Male  |  -.0696185   .0010328   -67.41   0.000    -.0716427   -.0675943
 1.eth_asian |   .0618399   .0016597    37.26   0.000     .0585869    .0650929
1.eth_hisp~c |  -.0157446   .0014106   -11.16   0.000    -.0185094   -.0129799
 1.eth_black |   .0091485   .0027627     3.31   0.001     .0037337    .0145632
 1.eth_other |  -.0099914   .0030621    -3.26   0.001    -.0159931   -.0039898
             |
econ_disad~e |
Economic ..  |  -.0680558   .0012002   -56.70   0.000    -.0704081   -.0657034
             |
limited_en~f |
Limited E..  |  -.0443229   .0026845   -16.51   0.000    -.0495846   -.0390613
             |
    disabled |
   Disabled  |  -.0169079   .0026797    -6.31   0.000    -.0221599   -.0116558
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0830383   .0020195    41.12   0.000     .0790801    .0869964
       2016  |   .0730321   .0019892    36.71   0.000     .0691333    .0769309
       2017  |    .071069   .0021232    33.47   0.000     .0669076    .0752304
       2018  |   .0713433   .0025826    27.62   0.000     .0662814    .0764052
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0159045   .0010452   -15.22   0.000     -.017953   -.0138559
       2016  |  -.0202272   .0010672   -18.95   0.000    -.0223189   -.0181356
       2017  |  -.0118744   .0011146   -10.65   0.000     -.014059   -.0096898
       2018  |  -.0118375   .0011121   -10.64   0.000    -.0140173   -.0096577
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0013198   .0004866    -2.71   0.007    -.0022736    -.000366
       2016  |   .0007592   .0004501     1.69   0.092    -.0001229    .0016413
       2017  |  -.0016976   .0004503    -3.77   0.000    -.0025802   -.0008151
       2018  |  -.0048609   .0007301    -6.66   0.000    -.0062919   -.0034299
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0579581   .0020106    28.83   0.000     .0540174    .0618988
       2016  |   .0611877   .0020672    29.60   0.000      .057136    .0652394
       2017  |   .0605698   .0021848    27.72   0.000     .0562876     .064852
       2018  |   .0887844   .0026114    34.00   0.000     .0836662    .0939027
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0146941    .001319   -11.14   0.000    -.0172792    -.012109
       2016  |  -.0165188   .0013009   -12.70   0.000    -.0190685    -.013969
       2017  |   -.011595   .0013675    -8.48   0.000    -.0142752   -.0089148
       2018  |  -.0007821   .0010806    -0.72   0.469    -.0029001    .0013358
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0006532   .0005455     1.20   0.231     -.000416    .0017224
       2016  |   .0012674   .0005847     2.17   0.030     .0001214    .0024135
       2017  |  -.0004159   .0005887    -0.71   0.480    -.0015697    .0007378
       2018  |  -.0074343   .0007218   -10.30   0.000    -.0088491   -.0060196
             |
       _cons |    1.83833   .0214853    85.56   0.000      1.79622     1.88044
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/vam_cfr_g11_enr.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr.ster saved
Standard deviations: total, classes, students, teachers same year
.42275216 .08247168 .41462973 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0058370252   .7555375498          3572  |
  2 |  .0049746836   .6813900485          2320  |
  3 |  .0042355451   .6185915207          1118  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0058370252  |
  2 |  .0049746836  |
  3 |  .0049746836  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,620
                                                F(1, 1277)        =    8427.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0282
                                                Root MSE          =     .41655

                          (Std. err. adjusted for 1,278 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   g11_enr_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.055314   .0114957    91.80   0.000     1.032762    1.077867
       _cons |   -.001577   .0002827    -5.58   0.000    -.0021316   -.0010224
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_sibling.ster saved
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/spec_test_va_cfr_g11_enr_sibling.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_sibling.ster saved

Linear regression                               Number of obs     =    698,620
                                                F(1, 1277)        =      26.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .01585

                          (Std. err. adjusted for 1,278 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
 g11_enr_r_d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   .0035064   .0006781     5.17   0.000     .0021761    .0048368
       _cons |  -5.25e-06   .0000479    -0.11   0.913    -.0000993    .0000888
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/fb_test_va_cfr_g11_enr_sibling.ster saved
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/fb_test_va_cfr_g11_enr_sibling.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/fb_test_va_cfr_g11_enr_sibling.ster saved
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outc
    > ome_va/va_g11_enr_sibling.dta saved
(file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_
    > va/va_g11_enr_sibling.dta not found)
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_
    > va/va_g11_enr_sibling.dta saved
(CST/SBAC Student Test Score Samples)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,442
-------------+----------------------------------   F(36, 700405)   =   1032.40
       Model |  8182.30491        36  227.286247   Prob > F        =    0.0000
    Residual |  154196.278   700,405  .220153023   R-squared       =    0.0504
-------------+----------------------------------   Adj R-squared   =    0.0503
       Total |  162378.583   700,441  .231823356   Root MSE        =     .4692

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |  -.0057079   .0022113    -2.58   0.010    -.0100419   -.0013739
       2017  |  -.0317189   .0022214   -14.28   0.000    -.0360727   -.0273651
       2018  |   -.008716   .0022227    -3.92   0.000    -.0130725   -.0043596
             |
         age |  -.0000934   3.89e-06   -24.01   0.000     -.000101   -.0000858
             |
        male |
       Male  |    .019175   .0011463    16.73   0.000     .0169284    .0214217
 1.eth_asian |  -.0140303   .0018411    -7.62   0.000    -.0176388   -.0104218
1.eth_hisp~c |   .0017775   .0015652     1.14   0.256    -.0012902    .0048452
 1.eth_black |  -.0359235   .0030662   -11.72   0.000    -.0419332   -.0299137
 1.eth_other |   .0021036   .0033985     0.62   0.536    -.0045574    .0087645
             |
econ_disad~e |
Economic ..  |  -.0241404   .0013318   -18.13   0.000    -.0267507   -.0215301
             |
limited_en~f |
Limited E..  |  -.0234545   .0029795    -7.87   0.000    -.0292942   -.0176147
             |
    disabled |
   Disabled  |   .0270389    .002974     9.09   0.000     .0212099    .0328679
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   -.057379   .0022413   -25.60   0.000    -.0617718   -.0529862
       2016  |  -.0534823   .0022076   -24.23   0.000    -.0578092   -.0491554
       2017  |  -.0545911   .0023562   -23.17   0.000    -.0592091    -.049973
       2018  |  -.0280084   .0028663    -9.77   0.000    -.0336262   -.0223906
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0399667     .00116   -34.45   0.000    -.0422403   -.0376932
       2016  |  -.0378828   .0011844   -31.98   0.000    -.0402042   -.0355613
       2017  |  -.0310743   .0012371   -25.12   0.000    -.0334989   -.0286497
       2018  |  -.0309319   .0012343   -25.06   0.000    -.0333511   -.0285126
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0100843   .0005401    18.67   0.000     .0090257    .0111428
       2016  |    .009796   .0004995    19.61   0.000      .008817     .010775
       2017  |   .0083851   .0004997    16.78   0.000     .0074056    .0093646
       2018  |   .0037104   .0008103     4.58   0.000     .0021222    .0052986
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0640513   .0022313   -28.71   0.000    -.0684246    -.059678
       2016  |  -.0664907    .002294   -28.98   0.000    -.0709869   -.0619944
       2017  |  -.0617382   .0024246   -25.46   0.000    -.0664904   -.0569861
       2018  |  -.0512916    .002898   -17.70   0.000    -.0569716   -.0456116
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |    -.03361   .0014639   -22.96   0.000    -.0364791   -.0307408
       2016  |  -.0354713   .0014438   -24.57   0.000    -.0383012   -.0326415
       2017  |  -.0255018   .0015177   -16.80   0.000    -.0284765   -.0225271
       2018  |  -.0343984   .0011993   -28.68   0.000    -.0367489   -.0320479
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0110251   .0006055    18.21   0.000     .0098384    .0122118
       2016  |   .0120268    .000649    18.53   0.000     .0107548    .0132987
       2017  |   .0084558   .0006533    12.94   0.000     .0071753    .0097364
       2018  |   .0010349   .0008011     1.29   0.196    -.0005352    .0026051
             |
       _cons |   1.025411   .0238333    43.02   0.000     .9786989    1.072124
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/vam_cfr_g11_enr_2year_nosibctrl.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr_2year_nosibctrl.ster saved
Standard deviations: total, classes, students, teachers same year
.46920467 .0983212 .45878749 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0090347898   .8130653737          3572  |
  2 |  .0083694284   .7646196403          2320  |
  3 |  .0076544728   .7183210464          1118  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0090347898  |
  2 |  .0083694284  |
  3 |  .0083694284  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,620
                                                F(1, 1277)        =   33966.59
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0366
                                                Root MSE          =     .46054

                          (Std. err. adjusted for 1,278 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_2y~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.003413   .0054444   184.30   0.000     .9927322    1.014094
       _cons |  -.0011327   .0002698    -4.20   0.000    -.0016619   -.0006034
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster saved
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster not found
> )
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,442
-------------+----------------------------------   F(38, 700403)   =   1061.80
       Model |  8844.67412        38  232.754582   Prob > F        =    0.0000
    Residual |  153533.909   700,403  .219207955   R-squared       =    0.0545
-------------+----------------------------------   Adj R-squared   =    0.0544
       Total |  162378.583   700,441  .231823356   Root MSE        =     .4682

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |  -.0060639   .0022067    -2.75   0.006    -.0103889   -.0017389
       2017  |  -.0322395   .0022173   -14.54   0.000    -.0365853   -.0278937
       2018  |  -.0102691   .0022196    -4.63   0.000    -.0146194   -.0059189
             |
1.has_~2year |   .0976404   .0022008    44.37   0.000     .0933269    .1019539
1.has_~4year |  -.0849081   .0024154   -35.15   0.000    -.0896422   -.0801741
         age |  -.0000928   3.88e-06   -23.90   0.000    -.0001004   -.0000852
             |
        male |
       Male  |   .0192479   .0011438    16.83   0.000     .0170061    .0214897
 1.eth_asian |  -.0141756   .0018381    -7.71   0.000    -.0177783   -.0105729
1.eth_hisp~c |  -.0002227   .0015622    -0.14   0.887    -.0032846    .0028392
 1.eth_black |  -.0360147   .0030597   -11.77   0.000    -.0420115   -.0300178
 1.eth_other |   .0014552   .0033913     0.43   0.668    -.0051916     .008102
             |
econ_disad~e |
Economic ..  |  -.0248149   .0013292   -18.67   0.000    -.0274201   -.0222097
             |
limited_en~f |
Limited E..  |  -.0240119   .0029731    -8.08   0.000    -.0298391   -.0181847
             |
    disabled |
   Disabled  |   .0273359   .0029677     9.21   0.000     .0215192    .0331526
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0560593   .0022366   -25.06   0.000    -.0604429   -.0516757
       2016  |  -.0520335   .0022031   -23.62   0.000    -.0563514   -.0477156
       2017  |  -.0527665   .0023514   -22.44   0.000    -.0573753   -.0481578
       2018  |  -.0264235   .0028603    -9.24   0.000    -.0320296   -.0208175
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0396864   .0011576   -34.28   0.000    -.0419551   -.0374176
       2016  |  -.0375817   .0011819   -31.80   0.000    -.0398982   -.0352652
       2017  |  -.0308544   .0012344   -24.99   0.000    -.0332738    -.028435
       2018  |  -.0308216   .0012317   -25.02   0.000    -.0332357   -.0284075
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0099212    .000539    18.41   0.000     .0088649    .0109776
       2016  |    .009633   .0004985    19.33   0.000     .0086561      .01061
       2017  |   .0082271   .0004987    16.50   0.000     .0072497    .0092045
       2018  |   .0035325   .0008086     4.37   0.000     .0019477    .0051173
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0628278   .0022267   -28.22   0.000    -.0671921   -.0584635
       2016  |  -.0650255   .0022894   -28.40   0.000    -.0695127   -.0605383
       2017  |  -.0601761   .0024197   -24.87   0.000    -.0649186   -.0554336
       2018  |  -.0492162   .0028921   -17.02   0.000    -.0548846   -.0435477
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0333199   .0014607   -22.81   0.000    -.0361829   -.0304569
       2016  |   -.035134   .0014407   -24.39   0.000    -.0379577   -.0323102
       2017  |  -.0253146   .0015145   -16.72   0.000    -.0282829   -.0223463
       2018  |  -.0337616   .0011968   -28.21   0.000    -.0361072    -.031416
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0108811   .0006042    18.01   0.000     .0096969    .0120652
       2016  |   .0118663   .0006476    18.32   0.000     .0105971    .0131355
       2017  |   .0083386   .0006519    12.79   0.000     .0070608    .0096163
       2018  |    .000872   .0007994     1.09   0.275    -.0006948    .0024389
             |
       _cons |   1.020809   .0237949    42.90   0.000     .9741716    1.067446
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/vam_cfr_g11_enr_2year.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr_2year.ster saved
Standard deviations: total, classes, students, teachers same year
.46819649 .09666344 .4581093 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0087133422   .8080585607          3572  |
  2 |   .008051389   .7582383502          2320  |
  3 |   .007355188   .7121376364          1118  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0087133422  |
  2 |   .008051389  |
  3 |   .008051389  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,620
                                                F(1, 1277)        =   32366.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0353
                                                Root MSE          =     .45985

                          (Std. err. adjusted for 1,278 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_2y~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.004256   .0055821   179.91   0.000      .993305    1.015207
       _cons |  -.0011533   .0002709    -4.26   0.000    -.0016847   -.0006219
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_2year_sibling.ster saved
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_2year_sibling.ster saved

Linear regression                               Number of obs     =    698,620
                                                F(1, 1277)        =     668.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0029
                                                Root MSE          =     .03071

                          (Std. err. adjusted for 1,278 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_2y~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   .0183776   .0007109    25.85   0.000      .016983    .0197722
       _cons |  -.0000215   .0000593    -0.36   0.717    -.0001378    .0000948
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/fb_test_va_cfr_g11_enr_2year_sibling.ster saved
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/fb_test_va_cfr_g11_enr_2year_sibling.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/fb_test_va_cfr_g11_enr_2year_sibling.ster saved
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outc
    > ome_va/va_g11_enr_2year_sibling.dta saved
(file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_
    > va/va_g11_enr_2year_sibling.dta not found)
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_
    > va/va_g11_enr_2year_sibling.dta saved
(CST/SBAC Student Test Score Samples)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,442
-------------+----------------------------------   F(36, 700405)   =   6092.81
       Model |  38145.4281        36  1059.59523   Prob > F        =    0.0000
    Residual |  121806.861   700,405  .173909182   R-squared       =    0.2385
-------------+----------------------------------   Adj R-squared   =    0.2384
       Total |  159952.289   700,441  .228359403   Root MSE        =    .41702

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0181749   .0019654     9.25   0.000     .0143229    .0220269
       2017  |   .0201173   .0019743    10.19   0.000     .0162477    .0239869
       2018  |  -.0192969   .0019755    -9.77   0.000    -.0231689    -.015425
             |
         age |  -.0000808   3.46e-06   -23.38   0.000    -.0000876   -.0000741
             |
        male |
       Male  |  -.0887602   .0010188   -87.12   0.000     -.090757   -.0867634
 1.eth_asian |   .0774998   .0016363    47.36   0.000     .0742926    .0807069
1.eth_hisp~c |   -.017734   .0013911   -12.75   0.000    -.0204605   -.0150075
 1.eth_black |   .0449768   .0027252    16.50   0.000     .0396355    .0503182
 1.eth_other |  -.0127268   .0030205    -4.21   0.000     -.018647   -.0068067
             |
econ_disad~e |
Economic ..  |  -.0433464   .0011837   -36.62   0.000    -.0456664   -.0410264
             |
limited_en~f |
Limited E..  |  -.0207994   .0026481    -7.85   0.000    -.0259897   -.0156092
             |
    disabled |
   Disabled  |  -.0445567   .0026433   -16.86   0.000    -.0497375    -.039376
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1404662    .001992    70.51   0.000     .1365619    .1443704
       2016  |   .1264106   .0019621    64.43   0.000     .1225649    .1302563
       2017  |   .1254033   .0020941    59.88   0.000     .1212989    .1295078
       2018  |   .0996564   .0025475    39.12   0.000     .0946633    .1046495
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0239297    .001031    23.21   0.000      .021909    .0259505
       2016  |   .0174739   .0010527    16.60   0.000     .0154106    .0195371
       2017  |    .019007   .0010995    17.29   0.000     .0168521     .021162
       2018  |   .0189383   .0010971    17.26   0.000     .0167881    .0210885
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0114266     .00048   -23.80   0.000    -.0123674   -.0104857
       2016  |  -.0090314    .000444   -20.34   0.000    -.0099016   -.0081612
       2017  |  -.0100648   .0004442   -22.66   0.000    -.0109353   -.0091942
       2018  |  -.0086873   .0007202   -12.06   0.000    -.0100989   -.0072757
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1227508   .0019832    61.90   0.000     .1188639    .1266378
       2016  |    .128653   .0020389    63.10   0.000     .1246567    .1326492
       2017  |   .1232278    .002155    57.18   0.000     .1190042    .1274515
       2018  |   .1409792   .0025757    54.73   0.000     .1359308    .1460275
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0188168   .0013011    14.46   0.000     .0162667    .0213669
       2016  |   .0189009   .0012833    14.73   0.000     .0163858    .0214161
       2017  |   .0138166   .0013489    10.24   0.000     .0111728    .0164605
       2018  |    .033468   .0010659    31.40   0.000     .0313789    .0355571
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0104183   .0005381   -19.36   0.000     -.011473   -.0093636
       2016  |  -.0108417   .0005768   -18.80   0.000    -.0119721   -.0097112
       2017  |  -.0089333   .0005807   -15.38   0.000    -.0100714   -.0077952
       2018  |  -.0086321    .000712   -12.12   0.000    -.0100276   -.0072366
             |
       _cons |   .8334471   .0211828    39.35   0.000     .7919296    .8749646
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/vam_cfr_g11_enr_4year_nosibctrl.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr_4year_nosibctrl.ster saved
Standard deviations: total, classes, students, teachers same year
.4170242 .08808345 .40761561 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0073186514   .8200522755          3572  |
  2 |  .0070501571    .805034112          2320  |
  3 |  .0065426283     .77346797          1118  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0073186514  |
  2 |  .0070501571  |
  3 |  .0070501571  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,620
                                                F(1, 1277)        =   36588.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0378
                                                Root MSE          =     .40914

                          (Std. err. adjusted for 1,278 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_4y~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.016409   .0053137   191.28   0.000     1.005985    1.026834
       _cons |  -.0001996   .0001857    -1.07   0.283     -.000564    .0001648
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster saved
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster not found
> )
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,442
-------------+----------------------------------   F(38, 700403)   =   5976.85
       Model |  39167.1238        38  1030.71378   Prob > F        =    0.0000
    Residual |  120785.165   700,403  .172450953   R-squared       =    0.2449
-------------+----------------------------------   Adj R-squared   =    0.2448
       Total |  159952.289   700,441  .228359403   Root MSE        =    .41527

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |    .017868   .0019572     9.13   0.000     .0140319    .0217041
       2017  |   .0192294   .0019666     9.78   0.000     .0153748    .0230839
       2018  |  -.0197053   .0019687   -10.01   0.000    -.0235638   -.0158468
             |
1.has_~2year |  -.0757175    .001952   -38.79   0.000    -.0795434   -.0718916
1.has_~4year |   .1473247   .0021423    68.77   0.000     .1431258    .1515237
         age |  -.0000787   3.44e-06   -22.86   0.000    -.0000855    -.000072
             |
        male |
       Male  |  -.0888664   .0010145   -87.59   0.000    -.0908548    -.086878
 1.eth_asian |   .0760155   .0016304    46.63   0.000       .07282    .0792109
1.eth_hisp~c |  -.0155219   .0013856   -11.20   0.000    -.0182377   -.0128061
 1.eth_black |   .0451631   .0027138    16.64   0.000     .0398442    .0504821
 1.eth_other |  -.0114467   .0030079    -3.81   0.000    -.0173421   -.0055512
             |
econ_disad~e |
Economic ..  |  -.0432409    .001179   -36.68   0.000    -.0455516   -.0409302
             |
limited_en~f |
Limited E..  |  -.0203111    .002637    -7.70   0.000    -.0254796   -.0151425
             |
    disabled |
   Disabled  |  -.0442438   .0026323   -16.81   0.000    -.0494029   -.0390846
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1390976   .0019838    70.12   0.000     .1352095    .1429857
       2016  |   .1250656    .001954    64.00   0.000     .1212358    .1288955
       2017  |   .1238356   .0020856    59.38   0.000     .1197478    .1279233
       2018  |   .0977669   .0025369    38.54   0.000     .0927945    .1027392
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0237819   .0010267    23.16   0.000     .0217696    .0257942
       2016  |   .0173544   .0010483    16.55   0.000     .0152998    .0194091
       2017  |     .01898   .0010949    17.34   0.000      .016834    .0211259
       2018  |   .0189841   .0010925    17.38   0.000     .0168429    .0211253
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.011241    .000478   -23.52   0.000     -.012178   -.0103041
       2016  |  -.0088738   .0004421   -20.07   0.000    -.0097403   -.0080073
       2017  |  -.0099247   .0004423   -22.44   0.000    -.0107916   -.0090578
       2018  |  -.0083934   .0007172   -11.70   0.000    -.0097991   -.0069877
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1207859    .001975    61.16   0.000     .1169149    .1246569
       2016  |   .1262132   .0020307    62.15   0.000     .1222332    .1301932
       2017  |   .1207459   .0021462    56.26   0.000     .1165395    .1249524
       2018  |   .1380006   .0025652    53.80   0.000     .1329729    .1430283
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0186258   .0012956    14.38   0.000     .0160864    .0211652
       2016  |   .0186152   .0012779    14.57   0.000     .0161106    .0211198
       2017  |   .0137195   .0013433    10.21   0.000     .0110868    .0163523
       2018  |   .0329795   .0010615    31.07   0.000      .030899      .03506
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0102278   .0005359   -19.09   0.000    -.0112781   -.0091776
       2016  |  -.0105989   .0005744   -18.45   0.000    -.0117246   -.0094731
       2017  |  -.0087545   .0005782   -15.14   0.000    -.0098878   -.0076212
       2018  |  -.0083064   .0007091   -11.71   0.000    -.0096961   -.0069166
             |
       _cons |   .8175212   .0211051    38.74   0.000     .7761558    .8588865
------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/vam_cfr_g11_enr_4year.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr_4year.ster saved
Standard deviations: total, classes, students, teachers same year
.41527214 .08609014 .40625047 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0069825016   .8145867474          3572  |
  2 |  .0067065046   .7981198795          2320  |
  3 |  .0061989979   .7653936154          1118  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0069825016  |
  2 |  .0067065046  |
  3 |  .0067065046  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,620
                                                F(1, 1277)        =   33999.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0362
                                                Root MSE          =     .40776

                          (Std. err. adjusted for 1,278 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_4y~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.017027   .0055156   184.39   0.000     1.006207    1.027848
       _cons |  -.0001824   .0001878    -0.97   0.332    -.0005508    .0001861
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_4year_sibling.ster saved
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_4year_sibling.ster saved

Linear regression                               Number of obs     =    698,620
                                                F(1, 1277)        =     649.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0026
                                                Root MSE          =     .03815

                          (Std. err. adjusted for 1,278 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_4y~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |    .024641   .0009672    25.48   0.000     .0227436    .0265384
       _cons |  -.0000104   .0000773    -0.14   0.892     -.000162    .0001411
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/fb_test_va_cfr_g11_enr_4year_sibling.ster saved
(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_
> va/outcome_va/fb_test_va_cfr_g11_enr_4year_sibling.ster not found)
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/fb_test_va_cfr_g11_enr_4year_sibling.ster saved
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outc
    > ome_va/va_g11_enr_4year_sibling.dta saved
(file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_
    > va/va_g11_enr_4year_sibling.dta not found)
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_
    > va/va_g11_enr_4year_sibling.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:     67.66 /        1 =      67.6550

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling_out.smcl
  log type:  smcl
 closed on:  12 Apr 2022, 13:15:24
-------------------------------------------------------------------------------
