-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling_spec_test_tab.smcl
  log type:  smcl
 opened on:  13 Jan 2022, 19:07:22

. 
.  //run the do helper file to set the local macros
.  include `mattdofiles'/macros_va.doh

. #delimit ;
delimiter now ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2019
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. #delimit cr
delimiter now cr
. 
. 
.  #delimit ;
delimiter now ;
.  #delimit cr
delimiter now cr
.  macro list
eststo_counter: 4
eststo:         est1 est2 est3 est4
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2019
_test_score_min_year:
                2015
_enr_4year_fb_va_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/fb_test_va_cfr_g11_enr_4year_sibling.ster
_enr_4year_spec_va_sibling_peer:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/spec_test_va_cfr_g11_enr_4year_peer_sibling.s
                > ter
_enr_4year_spec_va_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling.ster
_enr_4year_spec_va_sibling_og:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling_nocont
                > rol.ster
_enr_4year_va_dta_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/outcome_va/va_g11_enr_4year_sibling.dta
_enr_4year_fb_va_census:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_test_va_cfr_g11_enr_4year_census.ster
_enr_4year_spec_va_census_peer:
                vaprojdir/estimates/sbac/bias_spec_test_va_cfr_g11_enr_4year_ce
                > nsus_peer.ster
_enr_4year_spec_va_census:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_enr_4year_census.ster
_enr_4year_va_dta_census:
                /home/research/ca_ed_lab/projects/common_core_va/data/sbac/bias
                > _va_g11_enr_4year_census.dta
_enr_4year_fb_va_l4:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_test_va_cfr_g11_enr_4year_L4_cst_ela_z_score.ster
_enr_4year_spec_va_l4_peer:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_enr_4year_L4_cst_ela_z_score_peer.
                > ster
_enr_4year_spec_va_l4:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_enr_4year_L4_cst_ela_z_score.ster
_enr_4year_va_dta_l4:
                /home/research/ca_ed_lab/projects/common_core_va/data/sbac/bias
                > _va_g11_enr_4year_L4_cst_ela_z_score.dta
_enr_4year_spec_va_peer:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /spec_test_va_cfr_g11_enr_4year_peer.ster
_enr_4year_spec_va:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /spec_test_va_cfr_g11_enr_4year.ster
_enr_4year_va_dta:
                /home/research/ca_ed_lab/projects/common_core_va/data/sbac/va_g
                > 11_enr_4year.dta, replace
_enr_2year_fb_va_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/fb_test_va_cfr_g11_enr_2year_sibling.ster
_enr_2year_spec_va_sibling_peer:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/spec_test_va_cfr_g11_enr_2year_peer_sibling.s
                > ter
_enr_2year_spec_va_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling.ster
_enr_2year_spec_va_sibling_og:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling_nocont
                > rol.ster
_enr_2year_va_dta_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/outcome_va/va_g11_enr_2year_sibling.dta
_enr_2year_fb_va_census:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_test_va_cfr_g11_enr_2year_census.ster
_enr_2year_spec_va_census_peer:
                vaprojdir/estimates/sbac/bias_spec_test_va_cfr_g11_enr_2year_ce
                > nsus_peer.ster
_enr_2year_spec_va_census:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_enr_2year_census.ster
_enr_2year_va_dta_census:
                /home/research/ca_ed_lab/projects/common_core_va/data/sbac/bias
                > _va_g11_enr_2year_census.dta
_enr_2year_fb_va_l4:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_test_va_cfr_g11_enr_2year_L4_cst_ela_z_score.ster
_enr_2year_spec_va_l4_peer:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_enr_2year_L4_cst_ela_z_score_peer.
                > ster
_enr_2year_spec_va_l4:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_enr_2year_L4_cst_ela_z_score.ster
_enr_2year_va_dta_l4:
                /home/research/ca_ed_lab/projects/common_core_va/data/sbac/bias
                > _va_g11_enr_2year_L4_cst_ela_z_score.dta
_enr_2year_spec_va_peer:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /spec_test_va_cfr_g11_enr_2year_peer.ster
_enr_2year_spec_va:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /spec_test_va_cfr_g11_enr_2year.ster
_enr_2year_va_dta:
                /home/research/ca_ed_lab/projects/common_core_va/data/sbac/va_g
                > 11_enr_2year.dta, replace
_enr_fb_va_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/fb_test_va_cfr_g11_enr_sibling.ster
_enr_spec_va_sibling_peer:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/spec_test_va_cfr_g11_enr_peer_sibling.ster
_enr_spec_va_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/spec_test_va_cfr_g11_enr_sibling.ster
_enr_spec_va_sibling_og:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/outcome_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.st
                > er
_enr_va_dta_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/outcome_va/va_g11_enr_sibling.dta
_enr_fb_va_census:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_test_va_cfr_g11_enr_census.ster
_enr_spec_va_census_peer:
                vaprojdir/estimates/sbac/bias_spec_test_va_cfr_g11_enr_census_p
                > eer.ster
_enr_spec_va_census:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_enr_census.ster
_enr_va_dta_census:
                /home/research/ca_ed_lab/projects/common_core_va/data/sbac/bias
                > _va_g11_enr_census.dta
_enr_fb_va_l4:  /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_test_va_cfr_g11_enr_L4_cst_ela_z_score.ster
_enr_spec_va_l4_peer:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_enr_L4_cst_ela_z_score_peer.ster
_enr_spec_va_l4:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_enr_L4_cst_ela_z_score.ster
_enr_va_dta_l4: /home/research/ca_ed_lab/projects/common_core_va/data/sbac/bias
                > _va_g11_enr_L4_cst_ela_z_score.dta
_enr_spec_va_peer:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /spec_test_va_cfr_g11_enr_peer.ster
_enr_spec_va:   /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /spec_test_va_cfr_g11_enr.ster
_enr_va_dta:    /home/research/ca_ed_lab/projects/common_core_va/data/sbac/va_g
                > 11_enr.dta, replace
_math_fb_va_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/test_score_va/fb_test_va_cfr_g11_math_sibling.ster
_math_spec_va_sibling_peer:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/test_score_va/spec_test_va_cfr_g11_math_peer_sibling.ste
                > r
_math_spec_va_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/test_score_va/spec_test_va_cfr_g11_math_sibling.ster
_math_spec_va_sibling_og:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontro
                > l.ster
_math_va_dta_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/test_score_va/va_g11_math_sibling.dta
_math_fb_va_census:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_test_va_cfr_g11_math_census.ster
_math_spec_va_census_peer:
                vaprojdir/estimates/sbac/bias_spec_test_va_cfr_g11_math_census_
                > peer.ster
_math_spec_va_census:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_math_census.ster
_math_va_dta_census:
                /home/research/ca_ed_lab/projects/common_core_va/data/sbac/bias
                > _va_g11_math_census.dta
_math_fb_va_l4: /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_test_va_cfr_g11_math_L4_cst_ela_z_score.ster
_math_spec_va_l4_peer:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_math_L4_cst_ela_z_score_peer.ster
_math_spec_va_l4:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_math_L4_cst_ela_z_score.ster
_math_va_dta_l4:
                /home/research/ca_ed_lab/projects/common_core_va/data/sbac/bias
                > _va_g11_math_L4_cst_ela_z_score.dta
_math_spec_va_peer:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /spec_test_va_cfr_g11_math_peer.ster
_math_spec_va:  /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /spec_test_va_cfr_g11_math.ster
_math_va_dta:   /home/research/ca_ed_lab/projects/common_core_va/data/sbac/va_g
                > 11_math.dta, replace
_ela_fb_va_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster
_ela_spec_va_sibling_peer:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/test_score_va/spec_test_va_cfr_g11_ela_peer_sibling.ster
_ela_spec_va_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster
_ela_spec_va_sibling_og:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingva
                > regs/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol
                > .ster
_ela_va_dta_sibling:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/test_score_va/va_g11_ela_sibling.dta
_ela_fb_va_census:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_test_va_cfr_g11_ela_census.ster
_ela_spec_va_census_peer:
                vaprojdir/estimates/sbac/bias_spec_test_va_cfr_g11_ela_census_p
                > eer.ster
_ela_spec_va_census:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_ela_census.ster
_ela_va_dta_census:
                /home/research/ca_ed_lab/projects/common_core_va/data/sbac/bias
                > _va_g11_ela_census.dta
_ela_fb_va_l4:  /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_test_va_cfr_g11_ela_L4_cst_ela_z_score.ster
_ela_spec_va_l4_peer:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_ela_L4_cst_ela_z_score_peer.ster
_ela_spec_va_l4:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /bias_spec_test_va_cfr_g11_ela_L4_cst_ela_z_score.ster
_ela_va_dta_l4: /home/research/ca_ed_lab/projects/common_core_va/data/sbac/bias
                > _va_g11_ela_L4_cst_ela_z_score.dta
_ela_spec_va_peer:
                /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /spec_test_va_cfr_g11_ela_peer.ster
_ela_spec_va:   /home/research/ca_ed_lab/projects/common_core_va/estimates/sbac
                > /spec_test_va_cfr_g11_ela.ster
_ela_va_dta:    /home/research/ca_ed_lab/projects/common_core_va/data/sbac/va_g
                > 11_ela.dta, replace
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/data/public_access
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_ca_ed_lab:     /home/research/ca_ed_lab
_mattdofiles:   /home/research/ca_ed_lab/users/chesun/gsr/caschls/do/matt/adapt
                > ed_commoncore_va_matt

. 
. 
.  timer on 1

. 
. 
. 
. *****************************************************************************
> ***
. ********* test score VA Spec test table without peer controls
. 
. 
. 
. foreach subject in ela math {
  2.   //original VA, original sample
.   estimates use ``subject'_spec_va'
  3.   eststo
  4.   test _b[va_cfr_g11_`subject'] = 1
  5.   matrix test_p = r(p)
  6.   matrix rownames test_p = pvalue
  7.   matrix colnames test_p = va_cfr_g11_`subject'
  8.   estadd matrix test_p = test_p
  9. 
. 
.   //original VA, leave out var L4 test score sample
.   estimates use ``subject'_spec_va_l4'
 10.   eststo
 11.   test _b[va_cfr_g11_`subject'] = 1
 12.   matrix test_p = r(p)
 13.   matrix rownames test_p = pvalue
 14.   matrix colnames test_p = va_cfr_g11_`subject'
 15.   estadd matrix test_p = test_p
 16. 
. 
.   //original VA, leave out census tract sample
.   estimates use ``subject'_spec_va_census'
 17.   eststo
 18.   test _b[va_cfr_g11_`subject'] = 1
 19.   matrix test_p = r(p)
 20.   matrix rownames test_p = pvalue
 21.   matrix colnames test_p = va_cfr_g11_`subject'
 22.   estadd matrix test_p = test_p
 23. 
. 
.   //original VA, sibling sample
.   estimates use ``subject'_spec_va_sibling_og'
 24.   eststo
 25.   test _b[va_cfr_g11_`subject'_nosibctrl] = 1
 26.   matrix test_p = r(p)
 27.   matrix rownames test_p = pvalue
 28.   matrix colnames test_p = va_cfr_g11_`subject'_nosibctrl
 29.   estadd matrix test_p = test_p
 30. 
. 
.   //sibling VA, sibling sample
.   estimates use ``subject'_spec_va_sibling'
 31.   eststo
 32.   test _b[va_cfr_g11_`subject'] = 1
 33.   matrix test_p = r(p)
 34.   matrix rownames test_p = pvalue
 35.   matrix colnames test_p = va_cfr_g11_`subject'
 36.   estadd matrix test_p = test_p
 37. 
. 
.   esttab using $projdir/out/csv/siblingvaregs/spec_test/spec_test_`subject'.c
> sv ///
>   , replace nonumbers  ///
>   cells(b(fmt(%5.3f) pvalue(test_p) star) se(fmt(%4.3f) par)) ///
>   mtitles("Original" "L4 Score Sample" "Census Sample" "Sibling Sample" "Sibl
> ing Controls") ///
>   title("Spec Tests for ``subject'_str' VA")
 38. 
.   eststo clear
 39. 
. }
(est1 stored)

 ( 1)  va_cfr_g11_ela = 1

       F(  1,  1312) =    4.18
            Prob > F =    0.0411

added matrix:
             e(test_p) :  1 x 1
(est2 stored)

 ( 1)  va_cfr_g11_ela = 1

       F(  1,  1236) =    7.43
            Prob > F =    0.0065

added matrix:
             e(test_p) :  1 x 1
(est3 stored)

 ( 1)  va_cfr_g11_ela = 1

       F(  1,  1253) =    2.67
            Prob > F =    0.1025

added matrix:
             e(test_p) :  1 x 1
(est4 stored)

 ( 1)  va_cfr_g11_ela_nosibctrl = 1

       F(  1,  1288) =    0.77
            Prob > F =    0.3802

added matrix:
             e(test_p) :  1 x 1
(est5 stored)

 ( 1)  va_cfr_g11_ela = 1

       F(  1,  1288) =    0.76
            Prob > F =    0.3835

added matrix:
             e(test_p) :  1 x 1
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/spec_test/spec_test_ela.csv)
(est1 stored)

 ( 1)  va_cfr_g11_math = 1

       F(  1,  1311) =    0.12
            Prob > F =    0.7330

added matrix:
             e(test_p) :  1 x 1
(est2 stored)

 ( 1)  va_cfr_g11_math = 1

       F(  1,  1235) =   12.67
            Prob > F =    0.0004

added matrix:
             e(test_p) :  1 x 1
(est3 stored)

 ( 1)  va_cfr_g11_math = 1

       F(  1,  1252) =   16.67
            Prob > F =    0.0000

added matrix:
             e(test_p) :  1 x 1
(est4 stored)

 ( 1)  va_cfr_g11_math_nosibctrl = 1

       F(  1,  1287) =    0.13
            Prob > F =    0.7202

added matrix:
             e(test_p) :  1 x 1
(est5 stored)

 ( 1)  va_cfr_g11_math = 1

       F(  1,  1287) =    0.14
            Prob > F =    0.7113

added matrix:
             e(test_p) :  1 x 1
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/spec_test/spec_test_math.csv)

. 
. 
. 
. 
. 
. *****************************************************************************
> ***
. ********* enrollment VA Spec test table without peer controls
. foreach outcome in enr enr_2year enr_4year  {
  2.   //original VA, original sample
.   estimates use ``outcome'_spec_va'
  3.   eststo
  4.   test _b[va_cfr_g11_`outcome'] = 1
  5.   matrix test_p = r(p)
  6.   matrix rownames test_p = pvalue
  7.   matrix colnames test_p = va_cfr_g11_`outcome'
  8.   estadd matrix test_p = test_p
  9. 
.   //original VA, leave out var L4 test score sample
.   estimates use ``outcome'_spec_va_l4'
 10.   eststo
 11.   test _b[va_cfr_g11_`outcome'] = 1
 12.   matrix test_p = r(p)
 13.   matrix rownames test_p = pvalue
 14.   matrix colnames test_p = va_cfr_g11_`outcome'
 15.   estadd matrix test_p = test_p
 16. 
.   //original VA, leave out census tract sample
.   estimates use ``outcome'_spec_va_census'
 17.   eststo
 18.   test _b[va_cfr_g11_`outcome'] = 1
 19.   matrix test_p = r(p)
 20.   matrix rownames test_p = pvalue
 21.   matrix colnames test_p = va_cfr_g11_`outcome'
 22.   estadd matrix test_p = test_p
 23. 
.   //original VA, sibling sample
.   estimates use ``outcome'_spec_va_sibling_og'
 24.   eststo
 25.   test _b[va_cfr_g11_`outcome'_nosibctrl] = 1
 26.   matrix test_p = r(p)
 27.   matrix rownames test_p = pvalue
 28.   matrix colnames test_p = va_cfr_g11_`outcome'_nosibctrl
 29.   estadd matrix test_p = test_p
 30. 
.   //sibling VA, sibling sample
.   estimates use ``outcome'_spec_va_sibling'
 31.   eststo
 32.   test _b[va_cfr_g11_`outcome'] = 1
 33.   matrix test_p = r(p)
 34.   matrix rownames test_p = pvalue
 35.   matrix colnames test_p = va_cfr_g11_`outcome'
 36.   estadd matrix test_p = test_p
 37. 
. 
.   esttab using $projdir/out/csv/siblingvaregs/spec_test/spec_test_`outcome'.c
> sv ///
>   , replace nonumbers  ///
>   cells(b(fmt(%5.3f) pvalue(test_p) star) se(fmt(%4.3f) par)) ///
>   mtitles("Original" "L4 Score Sample" "Census Sample" "Sibling Sample" "Sibl
> ing Controls") ///
>   title("Spec Tests for ``outcome'_str' VA")
 38. 
.   eststo clear
 39. 
. }
(est1 stored)

 ( 1)  va_cfr_g11_enr = 1

       F(  1,  1194) =    0.29
            Prob > F =    0.5872

added matrix:
             e(test_p) :  1 x 1
(est2 stored)

 ( 1)  va_cfr_g11_enr = 1

       F(  1,  1224) =    0.00
            Prob > F =    0.9567

added matrix:
             e(test_p) :  1 x 1
(est3 stored)

 ( 1)  va_cfr_g11_enr = 1

       F(  1,  1171) =    1.66
            Prob > F =    0.1984

added matrix:
             e(test_p) :  1 x 1
(est4 stored)

 ( 1)  va_cfr_g11_enr_nosibctrl = 1

       F(  1,  1183) =    0.67
            Prob > F =    0.4131

added matrix:
             e(test_p) :  1 x 1
(est5 stored)

 ( 1)  va_cfr_g11_enr = 1

       F(  1,  1183) =    0.65
            Prob > F =    0.4190

added matrix:
             e(test_p) :  1 x 1
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/spec_test/spec_test_enr.csv)
(est1 stored)

 ( 1)  va_cfr_g11_enr_2year = 1

       F(  1,  1194) =    2.45
            Prob > F =    0.1175

added matrix:
             e(test_p) :  1 x 1
(est2 stored)

 ( 1)  va_cfr_g11_enr_2year = 1

       F(  1,  1224) =   16.28
            Prob > F =    0.0001

added matrix:
             e(test_p) :  1 x 1
(est3 stored)

 ( 1)  va_cfr_g11_enr_2year = 1

       F(  1,  1171) =    7.13
            Prob > F =    0.0077

added matrix:
             e(test_p) :  1 x 1
(est4 stored)

 ( 1)  va_cfr_g11_enr_2year_nosibctrl = 1

       F(  1,  1183) =    1.19
            Prob > F =    0.2750

added matrix:
             e(test_p) :  1 x 1
(est5 stored)

 ( 1)  va_cfr_g11_enr_2year = 1

       F(  1,  1183) =    1.08
            Prob > F =    0.2997

added matrix:
             e(test_p) :  1 x 1
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/spec_test/spec_test_enr_2year.csv)
(est1 stored)

 ( 1)  va_cfr_g11_enr_4year = 1

       F(  1,  1194) =    0.75
            Prob > F =    0.3861

added matrix:
             e(test_p) :  1 x 1
(est2 stored)

 ( 1)  va_cfr_g11_enr_4year = 1

       F(  1,  1224) =    3.73
            Prob > F =    0.0537

added matrix:
             e(test_p) :  1 x 1
(est3 stored)

 ( 1)  va_cfr_g11_enr_4year = 1

       F(  1,  1171) =    0.35
            Prob > F =    0.5536

added matrix:
             e(test_p) :  1 x 1
(est4 stored)

 ( 1)  va_cfr_g11_enr_4year_nosibctrl = 1

       F(  1,  1183) =    0.01
            Prob > F =    0.9426

added matrix:
             e(test_p) :  1 x 1
(est5 stored)

 ( 1)  va_cfr_g11_enr_4year = 1

       F(  1,  1183) =    0.01
            Prob > F =    0.9337

added matrix:
             e(test_p) :  1 x 1
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/spec_test/spec_test_enr_4year.csv)

. 
. 
. 
. 
.  timer off 1

.  log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling_spec_test_tab.smcl
  log type:  smcl
 closed on:  13 Jan 2022, 19:07:23
-------------------------------------------------------------------------------
