{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Apr 2022, 00:43:06
{txt}
{com}. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh
{txt}
{com}. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. #delimit ;
{txt}delimiter now ;
{com}. #delimit cr
{txt}delimiter now cr
{com}. macro list
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_6:{space 12}{res}{res}.7097029923018954
{p_end}
{txt}{p 0 16}
S_5:{space 12}{res}{res}4
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.379339567907114
{p_end}
{txt}{p 0 16}
ReS_jv2:{space 8}{res}{res}__000006 __000007 __000008 __000009 __00000A __00000B __00000C __00000D __00000E __00000F __00000G __00000H __00000I __00000J __00000K
{p_end}
{txt}{p 0 16}
dropv:{space 10}{res}{res}_cdscode_x
{p_end}
{txt}{p 0 16}
n_offset:{space 7}{res}{res}0
{p_end}
{txt}{p 0 16}
sort:{space 11}{res}{res}0
{p_end}
{txt}{p 0 16}
dots:{space 11}{res}{res}nois _dots 5 0
{p_end}
{txt}{p 0 16}
dotss:{space 10}{res}{res}nois _dots 0, title(Survey results being calculated)
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.0104764158075594
{p_end}
{txt}{p 0 16}
ReS_Call:{space 7}{res}{res}version 16.1:
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_ca_ed_lab:{space 5}{res}{res}/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files
{p_end}
{txt}{p 0 16}
_setlimit:{space 6}{res}{res}0
{p_end}
{txt}{p 0 16}
_1:{space 13}{res}{res}0
{p_end}
{txt}{p 0 16}
_0:{space 13}{res}{res}0
{p_end}
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. 
. ********************************************************************************
. 
. 
. //load the VA grade 11 sample
. use `va_g11_dataset', clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk', nogen keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         884,570
{txt}{col 9}from master{col 30}{res}         884,570{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}         900,294{txt}  
{col 5}{hline 41}

{com}. 
. drop if mi(has_older_sibling_enr_2year)
{txt}(884,570 observations deleted)

{com}. drop if mi(has_older_sibling_enr_4year)
{txt}(0 observations deleted)

{com}. 
. compress
  {txt}variable {bf}{res}age{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (1,800,588 bytes saved)

{com}. tempfile va_g11_sibling_dataset
{txt}
{com}. save `va_g11_sibling_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St192370.000001{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. ********************************************************************************
. *********** VA estimates for VA samples matched to siblings sample
. ********************************************************************************
. 
. 
. if `setlimit' == 0 {c -(}
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
. {c )-}
{txt}
{com}. else {c -(}
.   local drift_limit = `setlimit'
. {c )-}
{txt}
{com}. 
. foreach subject in ela math {c -(}
{txt}  2{com}. 
. 
.     /* load the VA g11 subject sample with siblings outcome sample
>      (those who have at least one older sibling matched to the postsecondary
>    outcomes) */
.     use `va_g11_sibling_dataset' if touse_g11_`subject'==1 & sibling_out_sample == 1, clear
{txt}  3{com}. 
.     ******************************************************************************
.     ************ Value added estimation with no peer controls ********************
.     ****** No TFX, without sibling college going controls
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`subject'_nosibctrl.ster, replace)
{txt}  4{com}. 
.     //rename the first time to make sure indep var names for spec test are all the same
.     rename tv va_cfr_g11_`subject'
{txt}  5{com}.         rename score_r sbac_g11_`subject'_r
{txt}  6{com}. 
. 
.     ************ specification test: regressing score residuals on VA estimates
.     ******* No peer controls
.     ******** sibling sample without sibling controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
{txt}  7{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_nocontrol.ster, replace
{txt}  8{com}.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_nocontrol.ster, replace
{txt}  9{com}. 
.     //rename again to distinguish between nocontrol and with control va estimates
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
{txt} 10{com}.     rename sbac_g11_`subject'_r sbac_g11_`subject'_r_nosibctrl
{txt} 11{com}.     label var va_cfr_g11_`subject'_nosibctrl "`subject' VA with family FE without TFX without sibling control"
{txt} 12{com}.     label var sbac_g11_`subject'_r_nosibctrl "`subject' score residual with family FE without TFX without sibling control"
{txt} 13{com}. 
.     ****** No TFX (teacher fixed effects), include sibling controls
.     vam sbac_`subject'_z_score ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`subject'.ster, replace)
{txt} 14{com}. 
. 
.     rename tv va_cfr_g11_`subject'
{txt} 15{com}.         rename score_r sbac_g11_`subject'_r
{txt} 16{com}. 
.     ************ specification test: regressing score residuals on VA estimates
.     ******* No peer controls
.     ******** sibling sample with sibling controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
{txt} 17{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 18{com}.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 19{com}. 
. 
. 
.     label var va_cfr_g11_`subject' "`subject' VA with family FE without TFX"
{txt} 20{com}.     label var sbac_g11_`subject'_r "`subject' score residual with family FE without TFX"
{txt} 21{com}. 
. /*
>     ****** With TFX, and TFX is added back in the the VA estimates
>     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_tfx_g11_`subject'
>     drop score_r
>     label var va_tfx_g11_`subject' "`subject' VA with family FE with TFX"
> 
> 
>  */
. 
. 
. 
. 
. 
. 
. 
.     ******************************************************************************
.     ************ Value added estimation with peer controls ********************
.     ****** No TFX (teacher fixed effects)
.     /* vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_cfr_g11_`subject'_peer
>     rename score_r sbac_g11_`subject'_r_peer
>     label var va_cfr_g11_`subject'_peer "`subject' VA with family FE with TFX"
>     label var sbac_g11_`subject'_r_peer "`subject' score residual with family FE with TFX"
> 
> 
>     ****** With TFX
>     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_tfx_g11_`subject'_peer
>     drop score_r */
. 
. 
.     ******************************************************************************
.     ************ specification test: regressing score residuals on VA estimates
. 
.     /* ******* With peer controls
>     reg sbac_g11_`subject'_r_peer va_cfr_g11_`subject'_peer, cluster(school_id)
>     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_peer_sibling.ster, replace */
. 
. 
. 
. 
.     ******************************************************************************
.     /* CFR Forecast Bias Test */
.     ***** leave out variable is sibling controls
.     **no peer controls
.     gen sbac_g11_`subject'_r_d = sbac_g11_`subject'_r_nosibctrl - sbac_g11_`subject'_r
{txt} 22{com}.     //var rename gymnastics to make sure the indep var names are all the same when making tables later
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_temp
{txt} 23{com}.     rename va_cfr_g11_`subject'_nosibctrl va_cfr_g11_`subject'
{txt} 24{com}. 
.     reg sbac_g11_`subject'_r_d va_cfr_g11_`subject'_nosibctrl,  cluster(school_id)
{txt} 25{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 26{com}.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 27{com}. 
.     //roll back the rename gymnastics to restore original var names
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
{txt} 28{com}.     rename va_cfr_g11_`subject'_temp va_cfr_g11_`subject'
{txt} 29{com}. 
. 
.     **************** Save Value Added Estimates
.     collapse (firstnm) va_* ///
>                 (mean) sbac_*_r* ///
>                 (sum) n_g11_`subject' = touse_g11_`subject' ///
>       if sibling_full_sample == 1 & sibling_out_sample == 1 ///
>                 , by(school_id cdscode grade year)
{txt} 30{com}.     //save to my personal folder
.         save $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibling.dta, replace
{txt} 31{com}.     //save to VA project folder
.     save $vaprojdir/data/sibling_va/test_score_va/va_g11_`subject'_sibling.dta, replace
{txt} 32{com}. 
. 
. {c )-}
{txt}(CST/SBAC Student Test Score Samples)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   677,254
{txt}{hline 13}{c +}{hline 34}   F(36, 677217)   = {res} 28471.16
{txt}       Model {c |} {res} 329901.804        36  9163.93899   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 217974.086   677,217  .321867416   {txt}R-squared       ={res}    0.6021
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6021
{txt}       Total {c |} {res} 547875.889   677,253  .808967829   {txt}Root MSE        =   {res} .56733

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0499644{col 26}{space 2} .0027484{col 37}{space 1}   18.18{col 46}{space 3}0.000{col 54}{space 4} .0445776{col 67}{space 3} .0553512
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0676601{col 26}{space 2} .0027356{col 37}{space 1}   24.73{col 46}{space 3}0.000{col 54}{space 4} .0622985{col 67}{space 3} .0730217
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0710576{col 26}{space 2} .0027417{col 37}{space 1}  -25.92{col 46}{space 3}0.000{col 54}{space 4}-.0764313{col 67}{space 3} -.065684
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003426{col 26}{space 2} 4.88e-06{col 37}{space 1}  -70.14{col 46}{space 3}0.000{col 54}{space 4}-.0003522{col 67}{space 3} -.000333
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0902902{col 26}{space 2} .0014094{col 37}{space 1}  -64.06{col 46}{space 3}0.000{col 54}{space 4}-.0930527{col 67}{space 3}-.0875278
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1036863{col 26}{space 2}  .002264{col 37}{space 1}   45.80{col 46}{space 3}0.000{col 54}{space 4} .0992489{col 67}{space 3} .1081236
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0050762{col 26}{space 2} .0019297{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.0088584{col 67}{space 3} -.001294
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1444525{col 26}{space 2} .0037981{col 37}{space 1}  -38.03{col 46}{space 3}0.000{col 54}{space 4}-.1518967{col 67}{space 3}-.1370083
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0043308{col 26}{space 2} .0042032{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4}-.0039074{col 67}{space 3} .0125689
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0366117{col 26}{space 2} .0016359{col 37}{space 1}  -22.38{col 46}{space 3}0.000{col 54}{space 4} -.039818{col 67}{space 3}-.0334053
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2115924{col 26}{space 2} .0036819{col 37}{space 1}  -57.47{col 46}{space 3}0.000{col 54}{space 4}-.2188087{col 67}{space 3} -.204376
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1861937{col 26}{space 2} .0037187{col 37}{space 1}  -50.07{col 46}{space 3}0.000{col 54}{space 4}-.1934822{col 67}{space 3}-.1789052
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6117768{col 26}{space 2} .0027977{col 37}{space 1}  218.67{col 46}{space 3}0.000{col 54}{space 4} .6062934{col 67}{space 3} .6172602
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .593261{col 26}{space 2} .0027254{col 37}{space 1}  217.68{col 46}{space 3}0.000{col 54}{space 4} .5879193{col 67}{space 3} .5986027
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5819387{col 26}{space 2} .0028658{col 37}{space 1}  203.07{col 46}{space 3}0.000{col 54}{space 4} .5763219{col 67}{space 3} .5875555
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5727827{col 26}{space 2} .0034906{col 37}{space 1}  164.09{col 46}{space 3}0.000{col 54}{space 4} .5659413{col 67}{space 3} .5796241
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0002419{col 26}{space 2} .0014746{col 37}{space 1}    0.16{col 46}{space 3}0.870{col 54}{space 4}-.0026483{col 67}{space 3} .0031321
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0138144{col 26}{space 2} .0014878{col 37}{space 1}   -9.29{col 46}{space 3}0.000{col 54}{space 4}-.0167304{col 67}{space 3}-.0108984
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0132171{col 26}{space 2} .0014998{col 37}{space 1}   -8.81{col 46}{space 3}0.000{col 54}{space 4}-.0161566{col 67}{space 3}-.0102775
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0110561{col 26}{space 2} .0015063{col 37}{space 1}    7.34{col 46}{space 3}0.000{col 54}{space 4} .0081038{col 67}{space 3} .0140084
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275553{col 26}{space 2} .0006825{col 37}{space 1}  -40.37{col 46}{space 3}0.000{col 54}{space 4}-.0288931{col 67}{space 3}-.0262176
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0226716{col 26}{space 2} .0006239{col 37}{space 1}  -36.34{col 46}{space 3}0.000{col 54}{space 4}-.0238944{col 67}{space 3}-.0214489
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0236694{col 26}{space 2} .0006071{col 37}{space 1}  -38.99{col 46}{space 3}0.000{col 54}{space 4}-.0248592{col 67}{space 3}-.0224796
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0294713{col 26}{space 2} .0009879{col 37}{space 1}  -29.83{col 46}{space 3}0.000{col 54}{space 4}-.0314076{col 67}{space 3} -.027535
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1695626{col 26}{space 2}  .002779{col 37}{space 1}   61.01{col 46}{space 3}0.000{col 54}{space 4} .1641157{col 67}{space 3} .1750094
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1896512{col 26}{space 2} .0028265{col 37}{space 1}   67.10{col 46}{space 3}0.000{col 54}{space 4} .1841112{col 67}{space 3} .1951911
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1889889{col 26}{space 2} .0029484{col 37}{space 1}   64.10{col 46}{space 3}0.000{col 54}{space 4} .1832101{col 67}{space 3} .1947678
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2478465{col 26}{space 2} .0035318{col 37}{space 1}   70.18{col 46}{space 3}0.000{col 54}{space 4} .2409242{col 67}{space 3} .2547687
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0045974{col 26}{space 2} .0018502{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.0082238{col 67}{space 3}-.0009711
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0127122{col 26}{space 2} .0018014{col 37}{space 1}   -7.06{col 46}{space 3}0.000{col 54}{space 4}-.0162428{col 67}{space 3}-.0091815
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0071678{col 26}{space 2} .0018429{col 37}{space 1}   -3.89{col 46}{space 3}0.000{col 54}{space 4}-.0107798{col 67}{space 3}-.0035559
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0042888{col 26}{space 2} .0014656{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .0014163{col 67}{space 3} .0071613
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0031236{col 26}{space 2} .0007616{col 37}{space 1}   -4.10{col 46}{space 3}0.000{col 54}{space 4}-.0046164{col 67}{space 3}-.0016309
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0035752{col 26}{space 2} .0008052{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-.0051535{col 67}{space 3} -.001997
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0066743{col 26}{space 2} .0007956{col 37}{space 1}   -8.39{col 46}{space 3}0.000{col 54}{space 4}-.0082336{col 67}{space 3}-.0051149
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.005854{col 26}{space 2} .0009793{col 37}{space 1}   -5.98{col 46}{space 3}0.000{col 54}{space 4}-.0077734{col 67}{space 3}-.0039346
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.270121{col 26}{space 2} .0299192{col 37}{space 1}   75.88{col 46}{space 3}0.000{col 54}{space 4}  2.21148{col 67}{space 3} 2.328761
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela_nosibctrl.ster not found)
{err}file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela_nosibctrl.ster could not be opened
{txt}{search r(603), local:r(603);}

end of do-file
{search r(603), local:r(603);}
{com}.     pause
. 
.     /* do file to create sum stats for the test score VA sibling samples */
.     do $projdir/do/share/siblingvaregs/va_sibling_sample_sumstats
.     pause
. 
.     /* sum stats for the test score VA estimates with additional demographic control
>     for has at least one older sibling who enrolled in college (2 year, 4 year) */
.     do $projdir/do/share/siblingvaregs/va_sibling_est_sumstats
.     pause
. 
.     /* do file to create a regression output table for spec test for test score VA
>     with original sample, sibling sample without control, sibling sample with control */
.     do $projdir/do/share/siblingvaregs/va_sibling_spec_test_tab
.     pause
. 
.     /* do file to run enrollment outcome VA regressions with sibling effects.
>     Include as controls the dummies for
>     1) has an older sibling enrolled in 2 year
>     2) has an older sibling enrolled in 4 year
> 
>     Comment on family fixed effects: Too many fixed effects, not enough observations. */
. 
.     /* To run this do file:
>     for origianl drift limit
>     do $projdir/do/share/siblingvaregs/va_sibling_out 0
> 
>     otherwise set a number if encounting an error
> 
>     do $projdir/do/share/siblingvaregs/va_sibling_out 2
>      */
.      do $projdir/do/share/siblingvaregs/va_sibling_out 0
.      pause
. 
.      /* sum stats for the enrollment VA estimates with additional demographic control
>      for has at least one older sibling who enrolled in college (2 year, 4 year) */
.      do $projdir/do/share/siblingvaregs/va_sibling_out_est_sumstats
.      pause
. 
.      /* do file to create a regression output table for spec test for college outcome
>      VA with original sample, sibling sample without control, sibling sample with control */
.      do $projdir/do/share/siblingvaregs/va_sibling_out_spec_test_tab
.      pause
. 
.      /* do file to run forecast bias tests and spec tests for test score VA
>      regressions with sibling effects. Two versions of VA: one with leave out
>      7th grade score, one with leave out census tract
>      Include as controls the dummies for
>      1) has an older sibling enrolled in 2 year
>      2) has an older sibling enrolled in 4 year
> 
>      Comment on family fixed effects: Too many fixed effects, not enough observations.
>      Stata returns an error "attempted to fit a model with too many variables"
>      Only 749488 obs but 600210 families, too many variables from family fixed effects */
.      do $projdir/do/share/siblingvaregs/va_sibling_forecast_bias
.      pause
. 
.      /* do file to create a regression output table for forecast bias tests for test score VA
>      and enrollment VA on different samples */
.      do $projdir/do/share/siblingvaregs/va_sibling_fb_test_tab
.      pause
. 
. {c )-}
{txt}{search r(603), local:r(603);}

end of do-file

{search r(603), local:r(603);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Apr 2022, 00:44:18
{txt}{.-}
{smcl}
{txt}{sf}{ul off}