{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs_out.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Jul 2022, 22:15:05
{txt}
{com}. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative file paths  */
. cd $vaprojdir
{res}/home/research/ca_ed_lab/projects/common_core_va
{txt}
{com}. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh
{txt}
{com}. ********************************************************************************
. /* Macros for common core VA project folder file paths, and relevant datasets to make it possible
> to use Matt's doh files  */
. ********************************************************************************
. ********************************************************************************
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"
{txt}
{com}. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"
{txt}
{com}. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"
{txt}
{com}. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"
{txt}
{com}. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"
{txt}
{com}. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"
{txt}
{com}. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecondary_out_merge"
{txt}
{com}. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"
{txt}
{com}. {txt}
{com}. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. macro list
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.0039002308063216
{p_end}
{txt}{p 0 16}
S_2:{space 12}{res}{res}300
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.0206002574343117
{p_end}
{txt}{p 0 16}
S_1:{space 12}{res}{res}epanechnikov
{p_end}
{txt}{p 0 16}
S_6:{space 12}{res}{res}.7098361624622439
{p_end}
{txt}{p 0 16}
S_5:{space 12}{res}{res}4
{p_end}
{txt}{p 0 16}
ReS_jv2:{space 8}{res}{res}__000006 __000007 __000008 __000009 __00000A __00000B __00000C __00000D __00000E __00000F __00000G __00000H __00000I __00000J __00000K
{p_end}
{txt}{p 0 16}
dropv:{space 10}{res}{res}_cdscode_x
{p_end}
{txt}{p 0 16}
n_offset:{space 7}{res}{res}0
{p_end}
{txt}{p 0 16}
sort:{space 11}{res}{res}0
{p_end}
{txt}{p 0 16}
dots:{space 11}{res}{res}nois _dots 5 0
{p_end}
{txt}{p 0 16}
dotss:{space 10}{res}{res}nois _dots 0, title(Survey results being calculated)
{p_end}
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_both_str:{space 6}{res}{res}Original + Census + Sibling
{p_end}
{txt}{p 0 16}
_sib_str:{space 7}{res}{res}Original + Sibling
{p_end}
{txt}{p 0 16}
_acs_str:{space 7}{res}{res}Original + Census
{p_end}
{txt}{p 0 16}
_og_str:{space 8}{res}{res}Original Specification
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}
{com}. 
. //startomg timer
. timer on 1
{txt}
{com}. 
. 
. 
. 
. ********************************************************************************
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
{txt}
{com}. 
. 
. ********************************************************************************
. ********************************************************************************
. /* Outcome VA, 4 specifications  */
. 
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   // load the resctricted sample with sibling and acs controls
.   use $vaprojdir/data/va_samples/va_sib_acs_out_restr_smp.dta if touse_g11_`outcome'==1, clear
{txt}  3{com}. 
.   ********************************************************************************
.   /* Primary outcome va specification, no tfx, no peer fx, no sibling ctrl, no acs ctrl */
.   ********************************************************************************
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_og.ster, replace)
{txt}  4{com}. 
.   // rename the va estimates and the residuals
.   rename tv va_`outcome'_og
{txt}  5{com}.   rename score_r `outcome'_r_og
{txt}  6{com}.   label var va_`outcome'_og "``outcome'_str' VA OG Specification"
{txt}  7{com}.   label var `outcome'_r_og "Outcome Residual from ``outcome'_str' VA OG Specification"
{txt}  8{com}. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_og va_`outcome'_og, cluster(school_id)
{txt}  9{com}. 
.   // save spec test estimates
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_og.ster, replace
{txt} 10{com}. 
. 
. 
.   ********************************************************************************
.   /* Outcome VA, no tfx, no peer fx, no sibling ctrl, with acs ctrl */
.   ********************************************************************************
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `census_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_acs.ster, replace)
{txt} 11{com}. 
.   // rename va estimates and score residuals
.   rename tv va_`outcome'_acs
{txt} 12{com}.   rename score_r `outcome'_r_acs
{txt} 13{com}.   label var va_`outcome'_acs "``outcome'_str' VA with Census Controls"
{txt} 14{com}.   label var `outcome'_r_acs "Outcome Residual from ``outcome'_str' VA with Census Controls"
{txt} 15{com}. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_acs va_`outcome'_acs, cluster(school_id)
{txt} 16{com}. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_acs.ster, replace
{txt} 17{com}. 
. 
.   *******************
.   // forecast bias test for ACS leave out vars
. 
.   // difference in outcome residuals
.   gen `outcome'_r_d_og_acs = `outcome'_r_og - `outcome'_r_acs
{txt} 18{com}.   // fb test
.   reg `outcome'_r_d_og_acs va_`outcome'_og, cluster(school_id)
{txt} 19{com}.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`outcome'_acs_og.ster, replace
{txt} 20{com}. 
. 
. 
. 
.   ********************************************************************************
.   /* Outcome VA, no tfx, no peer fx, with sibling ctrl, no acs ctrl */
.   ********************************************************************************
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `sibling_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_sib.ster, replace)
{txt} 21{com}. 
.   //rename va estimates sand score residuals
.   rename tv va_`outcome'_sib
{txt} 22{com}.   rename score_r `outcome'_r_sib
{txt} 23{com}.   label var va_`outcome'_sib "``outcome'_str' VA with Sibling Controls"
{txt} 24{com}.   label var `outcome'_r_sib "Outcome Residual from ``outcome'_str' VA with Sibling Controls"
{txt} 25{com}. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_sib va_`outcome'_sib, cluster(school_id)
{txt} 26{com}. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_sib.ster, replace
{txt} 27{com}. 
. 
.   *******************
.   // forecast bias test for sibling controls as leave out vars
.   // difference in outcome residuals
.   gen `outcome'_r_d_og_sib = `outcome'_r_og - `outcome'_r_sib
{txt} 28{com}.   // fb test
.   reg `outcome'_r_d_og_sib va_`outcome'_og, cluster(school_id)
{txt} 29{com}.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`outcome'_sib_og.ster, replace
{txt} 30{com}. 
. 
. 
. 
.   ********************************************************************************
.   /* Outcome VA, no tfx, no peer fx, with sibling ctrl, with acs ctrl */
.   ********************************************************************************
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `sibling_controls' ///
>       `census_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_both.ster, replace)
{txt} 31{com}. 
.   //rename va estimates sand outcome residuals
.   rename tv va_`outcome'_both
{txt} 32{com}.   rename score_r `outcome'_r_both
{txt} 33{com}.   label var va_`outcome'_both "``outcome'_str' VA with Sibling and Census Controls"
{txt} 34{com}.   label var `outcome'_r_both "Outcome Residual from ``outcome'_str' VA with Sibling and Census Controls"
{txt} 35{com}. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_both va_`outcome'_both, cluster(school_id)
{txt} 36{com}. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_both.ster, replace
{txt} 37{com}. 
. 
.   *******************
.   // forecast bias test for sibling controls as leave out vars against specification with only census controls
.   // difference in outcome residuals with census controls and residuals with both census and sibling controls
.   gen `outcome'_r_d_acs_both = `outcome'_r_acs - `outcome'_r_both
{txt} 38{com}.   // fb test
.   reg `outcome'_r_d_acs_both va_`outcome'_acs, cluster(school_id)
{txt} 39{com}.   //naming convention: forecast bias test for leave out variables being sibling controls, against VA with only acs controls
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`outcome'_sib_acs.ster, replace
{txt} 40{com}. 
. 
.   *******************
.   // forecast bias test for census controls as leave out vars against specification with only sibling controls
.   // difference in outcome residuals with census controls and residuals with both census and sibling controls
.   gen `outcome'_r_d_sib_both = `outcome'_r_sib - `outcome'_r_both
{txt} 41{com}.   // fb test
.   reg `outcome'_r_d_sib_both va_`outcome'_sib, cluster(school_id)
{txt} 42{com}.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`outcome'_acs_sib.ster, replace
{txt} 43{com}. 
. 
. 
. 
. 
.   ********* Save VA estimates
.   collapse (firstnm) va_* ///
>     (mean) `outcome'* ///
>     (sum) n_g11_`outcome' = touse_g11_`outcome' ///
>     , by(school_id cdscode grade year)
{txt} 44{com}.   // save to VA project data folder
.   save $vaprojdir/data/sib_acs_restr_smp/outcome_va/va_`outcome'_sib_acs.dta, replace
{txt} 45{com}. 
. {c )-}
{txt}(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(36, 433276)   = {res}  1626.54
{txt}       Model {c |} {res} 10230.7049        36  284.186247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75701.0035   433,276   .17471774   {txt}R-squared       ={res}    0.1191
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1190
{txt}       Total {c |} {res} 85931.7083   433,312  .198313705   {txt}Root MSE        =   {res} .41799

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0081875{col 26}{space 2}  .002529{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} .0032306{col 67}{space 3} .0131443
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0154851{col 26}{space 2} .0025372{col 37}{space 1}   -6.10{col 46}{space 3}0.000{col 54}{space 4}-.0204579{col 67}{space 3}-.0105122
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0283736{col 26}{space 2}  .002559{col 37}{space 1}  -11.09{col 46}{space 3}0.000{col 54}{space 4}-.0333891{col 67}{space 3}-.0233581
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001493{col 26}{space 2} 4.60e-06{col 37}{space 1}  -32.45{col 46}{space 3}0.000{col 54}{space 4}-.0001583{col 67}{space 3}-.0001402
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0676695{col 26}{space 2} .0012993{col 37}{space 1}  -52.08{col 46}{space 3}0.000{col 54}{space 4}-.0702161{col 67}{space 3}-.0651229
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0559875{col 26}{space 2} .0020319{col 37}{space 1}   27.55{col 46}{space 3}0.000{col 54}{space 4}  .052005{col 67}{space 3} .0599701
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0297107{col 26}{space 2}  .001782{col 37}{space 1}  -16.67{col 46}{space 3}0.000{col 54}{space 4}-.0332035{col 67}{space 3} -.026218
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0001945{col 26}{space 2} .0035885{col 37}{space 1}   -0.05{col 46}{space 3}0.957{col 54}{space 4}-.0072279{col 67}{space 3}  .006839
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0123071{col 26}{space 2}  .003861{col 37}{space 1}   -3.19{col 46}{space 3}0.001{col 54}{space 4}-.0198746{col 67}{space 3}-.0047397
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0686687{col 26}{space 2} .0015103{col 37}{space 1}  -45.47{col 46}{space 3}0.000{col 54}{space 4}-.0716288{col 67}{space 3}-.0657086
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0497767{col 26}{space 2} .0034706{col 37}{space 1}  -14.34{col 46}{space 3}0.000{col 54}{space 4} -.056579{col 67}{space 3}-.0429744
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0175381{col 26}{space 2} .0033917{col 37}{space 1}   -5.17{col 46}{space 3}0.000{col 54}{space 4}-.0241856{col 67}{space 3}-.0108905
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0811937{col 26}{space 2} .0025528{col 37}{space 1}   31.81{col 46}{space 3}0.000{col 54}{space 4} .0761902{col 67}{space 3} .0861971
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0719307{col 26}{space 2}  .002491{col 37}{space 1}   28.88{col 46}{space 3}0.000{col 54}{space 4} .0670484{col 67}{space 3} .0768129
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .074364{col 26}{space 2} .0026417{col 37}{space 1}   28.15{col 46}{space 3}0.000{col 54}{space 4} .0691864{col 67}{space 3} .0795416
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0713949{col 26}{space 2} .0032906{col 37}{space 1}   21.70{col 46}{space 3}0.000{col 54}{space 4} .0649454{col 67}{space 3} .0778444
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0183052{col 26}{space 2} .0013517{col 37}{space 1}  -13.54{col 46}{space 3}0.000{col 54}{space 4}-.0209544{col 67}{space 3}-.0156559
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0226519{col 26}{space 2} .0013547{col 37}{space 1}  -16.72{col 46}{space 3}0.000{col 54}{space 4}-.0253071{col 67}{space 3}-.0199967
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.011981{col 26}{space 2}  .001412{col 37}{space 1}   -8.49{col 46}{space 3}0.000{col 54}{space 4}-.0147484{col 67}{space 3}-.0092136
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0133124{col 26}{space 2} .0014085{col 37}{space 1}   -9.45{col 46}{space 3}0.000{col 54}{space 4} -.016073{col 67}{space 3}-.0105518
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.000561{col 26}{space 2} .0006108{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-.0017582{col 67}{space 3} .0006362
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012112{col 26}{space 2} .0005613{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4}  .000111{col 67}{space 3} .0023114
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0018928{col 26}{space 2} .0005577{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4} -.002986{col 67}{space 3}-.0007997
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0047795{col 26}{space 2} .0009243{col 37}{space 1}   -5.17{col 46}{space 3}0.000{col 54}{space 4}-.0065912{col 67}{space 3}-.0029679
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0566758{col 26}{space 2} .0025398{col 37}{space 1}   22.32{col 46}{space 3}0.000{col 54}{space 4}  .051698{col 67}{space 3} .0616537
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0631053{col 26}{space 2} .0025829{col 37}{space 1}   24.43{col 46}{space 3}0.000{col 54}{space 4} .0580428{col 67}{space 3} .0681677
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0582672{col 26}{space 2} .0027161{col 37}{space 1}   21.45{col 46}{space 3}0.000{col 54}{space 4} .0529437{col 67}{space 3} .0635906
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0889956{col 26}{space 2} .0033083{col 37}{space 1}   26.90{col 46}{space 3}0.000{col 54}{space 4} .0825114{col 67}{space 3} .0954799
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0118834{col 26}{space 2} .0016955{col 37}{space 1}   -7.01{col 46}{space 3}0.000{col 54}{space 4}-.0152066{col 67}{space 3}-.0085602
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0155047{col 26}{space 2} .0016533{col 37}{space 1}   -9.38{col 46}{space 3}0.000{col 54}{space 4}-.0187451{col 67}{space 3}-.0122643
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0133682{col 26}{space 2} .0017406{col 37}{space 1}   -7.68{col 46}{space 3}0.000{col 54}{space 4}-.0167797{col 67}{space 3}-.0099568
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0028613{col 26}{space 2} .0013786{col 37}{space 1}   -2.08{col 46}{space 3}0.038{col 54}{space 4}-.0055633{col 67}{space 3}-.0001593
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0004253{col 26}{space 2} .0006877{col 37}{space 1}   -0.62{col 46}{space 3}0.536{col 54}{space 4}-.0017731{col 67}{space 3} .0009226
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0006362{col 26}{space 2}   .00073{col 37}{space 1}    0.87{col 46}{space 3}0.384{col 54}{space 4}-.0007946{col 67}{space 3}  .002067
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0000166{col 26}{space 2} .0007332{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-.0014205{col 67}{space 3} .0014536
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.007031{col 26}{space 2} .0009085{col 37}{space 1}   -7.74{col 46}{space 3}0.000{col 54}{space 4}-.0088116{col 67}{space 3}-.0052503
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.721146{col 26}{space 2} .0281718{col 37}{space 1}   61.09{col 46}{space 3}0.000{col 54}{space 4}  1.66593{col 67}{space 3} 1.776362
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_og.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41799251 .07930353 .41040065 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0052947343   .6470484039          3445{txt}  {c |}
  2 {c |}  {res}.0044305046   .5609940705          2240{txt}  {c |}
  3 {c |}  {res}.0037898405   .4978511877          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0052947343{txt}  {c |}
  2 {c |}  {res}.0044305046{txt}  {c |}
  3 {c |}  {res}.0044305046{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}  3831.53
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0234
                                                {txt}Root MSE          =    {res} .41287

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    enr_r_og{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_enr_og {c |}{col 14}{res}{space 2} 1.060904{col 26}{space 2} .0171392{col 37}{space 1}   61.90{col 46}{space 3}0.000{col 54}{space 4} 1.027279{col 67}{space 3} 1.094529
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0018621{col 26}{space 2} .0003807{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4} -.002609{col 67}{space 3}-.0011152
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(43, 433269)   = {res}  1431.56
{txt}       Model {c |} {res} 10690.0214        43  248.605148   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  75241.687   433,269  .173660444   {txt}R-squared       ={res}    0.1244
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1243
{txt}       Total {c |} {res} 85931.7083   433,312  .198313705   {txt}Root MSE        =   {res} .41673

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0082433{col 26}{space 2} .0025229{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4} .0032984{col 67}{space 3} .0131882
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0158179{col 26}{space 2} .0025363{col 37}{space 1}   -6.24{col 46}{space 3}0.000{col 54}{space 4}-.0207889{col 67}{space 3}-.0108469
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0271906{col 26}{space 2} .0025646{col 37}{space 1}  -10.60{col 46}{space 3}0.000{col 54}{space 4}-.0322172{col 67}{space 3}-.0221639
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001539{col 26}{space 2} 4.59e-06{col 37}{space 1}  -33.51{col 46}{space 3}0.000{col 54}{space 4}-.0001629{col 67}{space 3}-.0001449
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0687376{col 26}{space 2} .0012956{col 37}{space 1}  -53.05{col 46}{space 3}0.000{col 54}{space 4} -.071277{col 67}{space 3}-.0661981
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0477829{col 26}{space 2} .0022882{col 37}{space 1}   20.88{col 46}{space 3}0.000{col 54}{space 4}  .043298{col 67}{space 3} .0522677
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0023709{col 26}{space 2} .0019763{col 37}{space 1}   -1.20{col 46}{space 3}0.230{col 54}{space 4}-.0062444{col 67}{space 3} .0015026
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0263682{col 26}{space 2} .0037573{col 37}{space 1}    7.02{col 46}{space 3}0.000{col 54}{space 4} .0190041{col 67}{space 3} .0337324
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0097244{col 26}{space 2} .0038639{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-.0172976{col 67}{space 3}-.0021512
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0414402{col 26}{space 2}  .001613{col 37}{space 1}  -25.69{col 46}{space 3}0.000{col 54}{space 4}-.0446017{col 67}{space 3}-.0382788
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0499151{col 26}{space 2} .0034613{col 37}{space 1}  -14.42{col 46}{space 3}0.000{col 54}{space 4}-.0566992{col 67}{space 3} -.043131
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0268962{col 26}{space 2} .0033865{col 37}{space 1}   -7.94{col 46}{space 3}0.000{col 54}{space 4}-.0335336{col 67}{space 3}-.0202587
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0756169{col 26}{space 2} .0025478{col 37}{space 1}   29.68{col 46}{space 3}0.000{col 54}{space 4} .0706232{col 67}{space 3} .0806106
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0664225{col 26}{space 2} .0024863{col 37}{space 1}   26.72{col 46}{space 3}0.000{col 54}{space 4} .0615495{col 67}{space 3} .0712955
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0675111{col 26}{space 2} .0026374{col 37}{space 1}   25.60{col 46}{space 3}0.000{col 54}{space 4} .0623419{col 67}{space 3} .0726804
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0675218{col 26}{space 2} .0032819{col 37}{space 1}   20.57{col 46}{space 3}0.000{col 54}{space 4} .0610894{col 67}{space 3} .0739543
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0183999{col 26}{space 2} .0013479{col 37}{space 1}  -13.65{col 46}{space 3}0.000{col 54}{space 4}-.0210417{col 67}{space 3}-.0157582
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.022699{col 26}{space 2} .0013509{col 37}{space 1}  -16.80{col 46}{space 3}0.000{col 54}{space 4}-.0253468{col 67}{space 3}-.0200513
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0122056{col 26}{space 2}  .001408{col 37}{space 1}   -8.67{col 46}{space 3}0.000{col 54}{space 4}-.0149653{col 67}{space 3}-.0094459
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0128909{col 26}{space 2} .0014043{col 37}{space 1}   -9.18{col 46}{space 3}0.000{col 54}{space 4}-.0156434{col 67}{space 3}-.0101384
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0004542{col 26}{space 2}  .000609{col 37}{space 1}   -0.75{col 46}{space 3}0.456{col 54}{space 4}-.0016479{col 67}{space 3} .0007394
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .001224{col 26}{space 2} .0005597{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4} .0001271{col 67}{space 3} .0023209
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0016579{col 26}{space 2} .0005561{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4}-.0027479{col 67}{space 3} -.000568
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0048119{col 26}{space 2} .0009215{col 37}{space 1}   -5.22{col 46}{space 3}0.000{col 54}{space 4}-.0066181{col 67}{space 3}-.0030058
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0553293{col 26}{space 2} .0025324{col 37}{space 1}   21.85{col 46}{space 3}0.000{col 54}{space 4} .0503657{col 67}{space 3} .0602928
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0618222{col 26}{space 2} .0025754{col 37}{space 1}   24.01{col 46}{space 3}0.000{col 54}{space 4} .0567745{col 67}{space 3} .0668698
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0576098{col 26}{space 2} .0027082{col 37}{space 1}   21.27{col 46}{space 3}0.000{col 54}{space 4} .0523018{col 67}{space 3} .0629178
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0851022{col 26}{space 2} .0032995{col 37}{space 1}   25.79{col 46}{space 3}0.000{col 54}{space 4} .0786353{col 67}{space 3} .0915691
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0115685{col 26}{space 2} .0016908{col 37}{space 1}   -6.84{col 46}{space 3}0.000{col 54}{space 4}-.0148825{col 67}{space 3}-.0082545
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.015175{col 26}{space 2} .0016486{col 37}{space 1}   -9.20{col 46}{space 3}0.000{col 54}{space 4}-.0184062{col 67}{space 3}-.0119438
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0135136{col 26}{space 2} .0017354{col 37}{space 1}   -7.79{col 46}{space 3}0.000{col 54}{space 4} -.016915{col 67}{space 3}-.0101122
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  -.00414{col 26}{space 2}  .001375{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4} -.006835{col 67}{space 3} -.001445
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0006807{col 26}{space 2} .0006857{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-.0020246{col 67}{space 3} .0006632
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0004304{col 26}{space 2} .0007278{col 37}{space 1}    0.59{col 46}{space 3}0.554{col 54}{space 4}-.0009961{col 67}{space 3}  .001857
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0001139{col 26}{space 2}  .000731{col 37}{space 1}   -0.16{col 46}{space 3}0.876{col 54}{space 4}-.0015466{col 67}{space 3} .0013188
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.007337{col 26}{space 2} .0009059{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4}-.0091125{col 67}{space 3}-.0055614
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2} .0006532{col 26}{space 2} .0000483{col 37}{space 1}   13.52{col 46}{space 3}0.000{col 54}{space 4} .0005585{col 67}{space 3} .0007479
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0003596{col 26}{space 2}  .000048{col 37}{space 1}   -7.49{col 46}{space 3}0.000{col 54}{space 4}-.0004537{col 67}{space 3}-.0002654
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0011749{col 26}{space 2} .0000891{col 37}{space 1}  -13.19{col 46}{space 3}0.000{col 54}{space 4}-.0013495{col 67}{space 3}-.0010002
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-.3131407{col 26}{space 2} .1289904{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-.5659579{col 67}{space 3}-.0603234
{txt}educ~us_prop {c |}{col 14}{res}{space 2} .7060729{col 26}{space 2} .1176986{col 37}{space 1}    6.00{col 46}{space 3}0.000{col 54}{space 4} .4753872{col 67}{space 3} .9367587
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0005161{col 26}{space 2} .0000735{col 37}{space 1}   -7.02{col 46}{space 3}0.000{col 54}{space 4}-.0006602{col 67}{space 3}-.0003721
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 4.75e-07{col 26}{space 2} 3.34e-08{col 37}{space 1}   14.21{col 46}{space 3}0.000{col 54}{space 4} 4.10e-07{col 67}{space 3} 5.41e-07
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.705141{col 26}{space 2} .0283653{col 37}{space 1}   60.11{col 46}{space 3}0.000{col 54}{space 4} 1.649546{col 67}{space 3} 1.760736
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_acs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41672586 .07576588 .4097804 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0047230319   .6211796298          3445{txt}  {c |}
  2 {c |}  {res} .003876107   .5263430594          2240{txt}  {c |}
  3 {c |}  {res}.0033710667    .469764882          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0047230319{txt}  {c |}
  2 {c |}  {res} .003876107{txt}  {c |}
  3 {c |}  {res} .003876107{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}  2977.08
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0204
                                                {txt}Root MSE          =    {res} .41225

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   enr_r_acs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_enr_acs {c |}{col 14}{res}{space 2} 1.076636{col 26}{space 2} .0197321{col 37}{space 1}   54.56{col 46}{space 3}0.000{col 54}{space 4} 1.037925{col 67}{space 3} 1.115348
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.001414{col 26}{space 2} .0003823{col 37}{space 1}   -3.70{col 46}{space 3}0.000{col 54}{space 4}-.0021641{col 67}{space 3} -.000664
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_acs.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   151.69
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0364
                                                {txt}Root MSE          =    {res} .03196

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_d_og~s{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_enr_og {c |}{col 14}{res}{space 2} .1030607{col 26}{space 2} .0083679{col 37}{space 1}   12.32{col 46}{space 3}0.000{col 54}{space 4} .0866441{col 67}{space 3} .1194774
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001929{col 26}{space 2} .0006978{col 37}{space 1}   -0.28{col 46}{space 3}0.782{col 54}{space 4}-.0015619{col 67}{space 3} .0011762
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_acs_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(38, 433274)   = {res}  1557.46
{txt}       Model {c |} {res} 10327.2617        38  271.770046   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75604.4466   433,274  .174495692   {txt}R-squared       ={res}    0.1202
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1201
{txt}       Total {c |} {res} 85931.7083   433,312  .198313705   {txt}Root MSE        =   {res} .41773

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0076296{col 26}{space 2} .0025276{col 37}{space 1}    3.02{col 46}{space 3}0.003{col 54}{space 4} .0026756{col 67}{space 3} .0125836
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0167221{col 26}{space 2} .0025363{col 37}{space 1}   -6.59{col 46}{space 3}0.000{col 54}{space 4}-.0216931{col 67}{space 3} -.011751
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0300865{col 26}{space 2}  .002559{col 37}{space 1}  -11.76{col 46}{space 3}0.000{col 54}{space 4} -.035102{col 67}{space 3}-.0250709
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001471{col 26}{space 2} 4.60e-06{col 37}{space 1}  -31.99{col 46}{space 3}0.000{col 54}{space 4}-.0001561{col 67}{space 3}-.0001381
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} -.067719{col 26}{space 2} .0012985{col 37}{space 1}  -52.15{col 46}{space 3}0.000{col 54}{space 4} -.070264{col 67}{space 3} -.065174
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0546945{col 26}{space 2} .0020315{col 37}{space 1}   26.92{col 46}{space 3}0.000{col 54}{space 4} .0507127{col 67}{space 3} .0586762
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0295205{col 26}{space 2} .0017813{col 37}{space 1}  -16.57{col 46}{space 3}0.000{col 54}{space 4}-.0330119{col 67}{space 3}-.0260291
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0002575{col 26}{space 2} .0035863{col 37}{space 1}   -0.07{col 46}{space 3}0.943{col 54}{space 4}-.0072865{col 67}{space 3} .0067714
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0116744{col 26}{space 2} .0038587{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-.0192373{col 67}{space 3}-.0041116
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0690944{col 26}{space 2} .0015096{col 37}{space 1}  -45.77{col 46}{space 3}0.000{col 54}{space 4} -.072053{col 67}{space 3}-.0661357
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2} -.049694{col 26}{space 2} .0034684{col 37}{space 1}  -14.33{col 46}{space 3}0.000{col 54}{space 4} -.056492{col 67}{space 3} -.042896
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0168538{col 26}{space 2} .0033896{col 37}{space 1}   -4.97{col 46}{space 3}0.000{col 54}{space 4}-.0234974{col 67}{space 3}-.0102102
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0811033{col 26}{space 2} .0025514{col 37}{space 1}   31.79{col 46}{space 3}0.000{col 54}{space 4} .0761027{col 67}{space 3} .0861038
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0719927{col 26}{space 2} .0024896{col 37}{space 1}   28.92{col 46}{space 3}0.000{col 54}{space 4} .0671132{col 67}{space 3} .0768722
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0745858{col 26}{space 2} .0026404{col 37}{space 1}   28.25{col 46}{space 3}0.000{col 54}{space 4} .0694107{col 67}{space 3} .0797609
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0710509{col 26}{space 2} .0032887{col 37}{space 1}   21.60{col 46}{space 3}0.000{col 54}{space 4} .0646051{col 67}{space 3} .0774966
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0182362{col 26}{space 2} .0013508{col 37}{space 1}  -13.50{col 46}{space 3}0.000{col 54}{space 4}-.0208838{col 67}{space 3}-.0155886
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0225335{col 26}{space 2} .0013539{col 37}{space 1}  -16.64{col 46}{space 3}0.000{col 54}{space 4}-.0251871{col 67}{space 3}-.0198799
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0117588{col 26}{space 2} .0014111{col 37}{space 1}   -8.33{col 46}{space 3}0.000{col 54}{space 4}-.0145246{col 67}{space 3} -.008993
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.013267{col 26}{space 2} .0014076{col 37}{space 1}   -9.43{col 46}{space 3}0.000{col 54}{space 4}-.0160259{col 67}{space 3}-.0105082
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0005253{col 26}{space 2} .0006105{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4}-.0017218{col 67}{space 3} .0006712
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012083{col 26}{space 2}  .000561{col 37}{space 1}    2.15{col 46}{space 3}0.031{col 54}{space 4} .0001088{col 67}{space 3} .0023078
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0019164{col 26}{space 2} .0005574{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.0030089{col 67}{space 3}-.0008239
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0046567{col 26}{space 2} .0009237{col 37}{space 1}   -5.04{col 46}{space 3}0.000{col 54}{space 4}-.0064672{col 67}{space 3}-.0028462
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0560248{col 26}{space 2} .0025384{col 37}{space 1}   22.07{col 46}{space 3}0.000{col 54}{space 4} .0510497{col 67}{space 3} .0609999
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0620934{col 26}{space 2} .0025817{col 37}{space 1}   24.05{col 46}{space 3}0.000{col 54}{space 4} .0570334{col 67}{space 3} .0671535
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0574034{col 26}{space 2} .0027147{col 37}{space 1}   21.15{col 46}{space 3}0.000{col 54}{space 4} .0520827{col 67}{space 3} .0627241
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0881019{col 26}{space 2} .0033067{col 37}{space 1}   26.64{col 46}{space 3}0.000{col 54}{space 4} .0816209{col 67}{space 3} .0945829
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0117653{col 26}{space 2} .0016945{col 37}{space 1}   -6.94{col 46}{space 3}0.000{col 54}{space 4}-.0150864{col 67}{space 3}-.0084442
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0154419{col 26}{space 2} .0016523{col 37}{space 1}   -9.35{col 46}{space 3}0.000{col 54}{space 4}-.0186803{col 67}{space 3}-.0122035
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.013368{col 26}{space 2} .0017395{col 37}{space 1}   -7.69{col 46}{space 3}0.000{col 54}{space 4}-.0167773{col 67}{space 3}-.0099588
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0027008{col 26}{space 2} .0013778{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-.0054014{col 67}{space 3}-3.27e-07
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0003968{col 26}{space 2} .0006873{col 37}{space 1}   -0.58{col 46}{space 3}0.564{col 54}{space 4}-.0017438{col 67}{space 3} .0009502
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0007332{col 26}{space 2} .0007296{col 37}{space 1}    1.01{col 46}{space 3}0.315{col 54}{space 4}-.0006967{col 67}{space 3} .0021631
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0000968{col 26}{space 2} .0007327{col 37}{space 1}    0.13{col 46}{space 3}0.895{col 54}{space 4}-.0013393{col 67}{space 3} .0015329
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0068705{col 26}{space 2} .0009079{col 37}{space 1}   -7.57{col 46}{space 3}0.000{col 54}{space 4}  -.00865{col 67}{space 3}-.0050909
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0193456{col 26}{space 2} .0025059{col 37}{space 1}    7.72{col 46}{space 3}0.000{col 54}{space 4} .0144342{col 67}{space 3} .0242571
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0587273{col 26}{space 2} .0027061{col 37}{space 1}   21.70{col 46}{space 3}0.000{col 54}{space 4} .0534235{col 67}{space 3} .0640311
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.704137{col 26}{space 2} .0281648{col 37}{space 1}   60.51{col 46}{space 3}0.000{col 54}{space 4} 1.648935{col 67}{space 3}  1.75934
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_sib.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41772682 .07909487 .41017032 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0052672265   .6465161824          3445{txt}  {c |}
  2 {c |}  {res}.0044060826   .5603988327          2240{txt}  {c |}
  3 {c |}  {res}.0037610667   .4965062514          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0052672265{txt}  {c |}
  2 {c |}  {res}.0044060826{txt}  {c |}
  3 {c |}  {res}.0044060826{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}  3825.59
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0233
                                                {txt}Root MSE          =    {res} .41263

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   enr_r_sib{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_enr_sib {c |}{col 14}{res}{space 2} 1.060337{col 26}{space 2} .0171433{col 37}{space 1}   61.85{col 46}{space 3}0.000{col 54}{space 4} 1.026704{col 67}{space 3}  1.09397
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0018323{col 26}{space 2} .0003805{col 37}{space 1}   -4.82{col 46}{space 3}0.000{col 54}{space 4}-.0025788{col 67}{space 3}-.0010858
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_sib.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}    16.70
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res} .01493

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_d_og~b{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_enr_og {c |}{col 14}{res}{space 2} .0026713{col 26}{space 2} .0006537{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} .0013888{col 67}{space 3} .0039538
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.31e-06{col 26}{space 2} .0000478{col 37}{space 1}   -0.09{col 46}{space 3}0.928{col 54}{space 4}-.0000981{col 67}{space 3} .0000895
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_sib_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(45, 433267)   = {res}  1382.15
{txt}       Model {c |} {res} 10787.2162        45  239.715915   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75144.4922   433,267  .173436916   {txt}R-squared       ={res}    0.1255
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1254
{txt}       Total {c |} {res} 85931.7083   433,312  .198313705   {txt}Root MSE        =   {res} .41646

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0076925{col 26}{space 2} .0025215{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4} .0027505{col 67}{space 3} .0126345
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  -.01706{col 26}{space 2} .0025353{col 37}{space 1}   -6.73{col 46}{space 3}0.000{col 54}{space 4}-.0220292{col 67}{space 3}-.0120908
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0289301{col 26}{space 2} .0025647{col 37}{space 1}  -11.28{col 46}{space 3}0.000{col 54}{space 4}-.0339568{col 67}{space 3}-.0239033
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001517{col 26}{space 2} 4.59e-06{col 37}{space 1}  -33.04{col 46}{space 3}0.000{col 54}{space 4}-.0001607{col 67}{space 3}-.0001427
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0687889{col 26}{space 2} .0012948{col 37}{space 1}  -53.13{col 46}{space 3}0.000{col 54}{space 4}-.0713267{col 67}{space 3}-.0662511
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0463269{col 26}{space 2} .0022876{col 37}{space 1}   20.25{col 46}{space 3}0.000{col 54}{space 4} .0418432{col 67}{space 3} .0508106
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0021178{col 26}{space 2} .0019754{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-.0059895{col 67}{space 3} .0017539
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0263201{col 26}{space 2} .0037548{col 37}{space 1}    7.01{col 46}{space 3}0.000{col 54}{space 4} .0189607{col 67}{space 3} .0336795
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0091372{col 26}{space 2} .0038615{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-.0167056{col 67}{space 3}-.0015687
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0419063{col 26}{space 2} .0016121{col 37}{space 1}  -25.99{col 46}{space 3}0.000{col 54}{space 4} -.045066{col 67}{space 3}-.0387465
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0498473{col 26}{space 2} .0034591{col 37}{space 1}  -14.41{col 46}{space 3}0.000{col 54}{space 4} -.056627{col 67}{space 3}-.0430675
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0262263{col 26}{space 2} .0033845{col 37}{space 1}   -7.75{col 46}{space 3}0.000{col 54}{space 4}-.0328597{col 67}{space 3}-.0195928
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0755157{col 26}{space 2} .0025464{col 37}{space 1}   29.66{col 46}{space 3}0.000{col 54}{space 4} .0705249{col 67}{space 3} .0805065
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0664799{col 26}{space 2} .0024849{col 37}{space 1}   26.75{col 46}{space 3}0.000{col 54}{space 4} .0616096{col 67}{space 3} .0713501
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0677461{col 26}{space 2} .0026361{col 37}{space 1}   25.70{col 46}{space 3}0.000{col 54}{space 4} .0625793{col 67}{space 3} .0729128
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0671886{col 26}{space 2}   .00328{col 37}{space 1}   20.48{col 46}{space 3}0.000{col 54}{space 4}   .06076{col 67}{space 3} .0736172
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0183235{col 26}{space 2}  .001347{col 37}{space 1}  -13.60{col 46}{space 3}0.000{col 54}{space 4}-.0209636{col 67}{space 3}-.0156834
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0225727{col 26}{space 2} .0013501{col 37}{space 1}  -16.72{col 46}{space 3}0.000{col 54}{space 4}-.0252188{col 67}{space 3}-.0199266
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0119725{col 26}{space 2} .0014072{col 37}{space 1}   -8.51{col 46}{space 3}0.000{col 54}{space 4}-.0147305{col 67}{space 3}-.0092144
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0128381{col 26}{space 2} .0014034{col 37}{space 1}   -9.15{col 46}{space 3}0.000{col 54}{space 4}-.0155888{col 67}{space 3}-.0100874
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0004187{col 26}{space 2} .0006086{col 37}{space 1}   -0.69{col 46}{space 3}0.491{col 54}{space 4}-.0016116{col 67}{space 3} .0007741
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012207{col 26}{space 2} .0005593{col 37}{space 1}    2.18{col 46}{space 3}0.029{col 54}{space 4} .0001244{col 67}{space 3} .0023169
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0016844{col 26}{space 2} .0005558{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-.0027737{col 67}{space 3}-.0005952
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0046885{col 26}{space 2}  .000921{col 37}{space 1}   -5.09{col 46}{space 3}0.000{col 54}{space 4}-.0064936{col 67}{space 3}-.0028835
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0546887{col 26}{space 2}  .002531{col 37}{space 1}   21.61{col 46}{space 3}0.000{col 54}{space 4}  .049728{col 67}{space 3} .0596494
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0608188{col 26}{space 2} .0025741{col 37}{space 1}   23.63{col 46}{space 3}0.000{col 54}{space 4} .0557735{col 67}{space 3}  .065864
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0567599{col 26}{space 2} .0027068{col 37}{space 1}   20.97{col 46}{space 3}0.000{col 54}{space 4} .0514547{col 67}{space 3} .0620651
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0842139{col 26}{space 2} .0032978{col 37}{space 1}   25.54{col 46}{space 3}0.000{col 54}{space 4} .0777502{col 67}{space 3} .0906775
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0114385{col 26}{space 2} .0016898{col 37}{space 1}   -6.77{col 46}{space 3}0.000{col 54}{space 4}-.0147504{col 67}{space 3}-.0081265
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0151039{col 26}{space 2} .0016476{col 37}{space 1}   -9.17{col 46}{space 3}0.000{col 54}{space 4}-.0183331{col 67}{space 3}-.0118748
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0135074{col 26}{space 2} .0017343{col 37}{space 1}   -7.79{col 46}{space 3}0.000{col 54}{space 4}-.0169066{col 67}{space 3}-.0101082
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0039687{col 26}{space 2} .0013742{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.0066622{col 67}{space 3}-.0012753
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0006555{col 26}{space 2} .0006852{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-.0019986{col 67}{space 3} .0006875
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0005261{col 26}{space 2} .0007274{col 37}{space 1}    0.72{col 46}{space 3}0.470{col 54}{space 4}-.0008996{col 67}{space 3} .0019517
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0000349{col 26}{space 2} .0007305{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-.0014667{col 67}{space 3} .0013969
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0071751{col 26}{space 2} .0009053{col 37}{space 1}   -7.93{col 46}{space 3}0.000{col 54}{space 4}-.0089496{col 67}{space 3}-.0054007
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0202015{col 26}{space 2} .0024991{col 37}{space 1}    8.08{col 46}{space 3}0.000{col 54}{space 4} .0153034{col 67}{space 3} .0250996
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0585877{col 26}{space 2} .0026991{col 37}{space 1}   21.71{col 46}{space 3}0.000{col 54}{space 4} .0532976{col 67}{space 3} .0638778
{txt}eth_asian_~t {c |}{col 14}{res}{space 2} .0006611{col 26}{space 2} .0000483{col 37}{space 1}   13.69{col 46}{space 3}0.000{col 54}{space 4} .0005665{col 67}{space 3} .0007557
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0003627{col 26}{space 2}  .000048{col 37}{space 1}   -7.56{col 46}{space 3}0.000{col 54}{space 4}-.0004568{col 67}{space 3}-.0002687
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0011835{col 26}{space 2} .0000891{col 37}{space 1}  -13.29{col 46}{space 3}0.000{col 54}{space 4} -.001358{col 67}{space 3}-.0010089
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-.3375843{col 26}{space 2}  .128912{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-.5902479{col 67}{space 3}-.0849207
{txt}educ~us_prop {c |}{col 14}{res}{space 2} .7440957{col 26}{space 2}  .117647{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} .5135112{col 67}{space 3} .9746801
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0005168{col 26}{space 2} .0000735{col 37}{space 1}   -7.04{col 46}{space 3}0.000{col 54}{space 4}-.0006608{col 67}{space 3}-.0003729
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 4.58e-07{col 26}{space 2} 3.34e-08{col 37}{space 1}   13.70{col 46}{space 3}0.000{col 54}{space 4} 3.92e-07{col 67}{space 3} 5.23e-07
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.68899{col 26}{space 2} .0283576{col 37}{space 1}   59.56{col 46}{space 3}0.000{col 54}{space 4}  1.63341{col 67}{space 3}  1.74457
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_both.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41645758 .07549254 .40955805 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0046866199   .6200224248          3445{txt}  {c |}
  2 {c |}  {res}.0038429403   .5249523496          2240{txt}  {c |}
  3 {c |}  {res}.0033350788   .4676491674          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0046866199{txt}  {c |}
  2 {c |}  {res}.0038429403{txt}  {c |}
  3 {c |}  {res}.0038429403{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}  2951.16
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0203
                                                {txt}Root MSE          =    {res} .41201

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  enr_r_both{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_enr_both {c |}{col 14}{res}{space 2} 1.076392{col 26}{space 2} .0198141{col 37}{space 1}   54.32{col 46}{space 3}0.000{col 54}{space 4} 1.037519{col 67}{space 3} 1.115264
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0013836{col 26}{space 2} .0003824{col 37}{space 1}   -3.62{col 46}{space 3}0.000{col 54}{space 4}-.0021338{col 67}{space 3}-.0006335
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_both.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}    38.56
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0002
                                                {txt}Root MSE          =    {res} .01498

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_d_ac~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_enr_acs {c |}{col 14}{res}{space 2} .0042659{col 26}{space 2}  .000687{col 37}{space 1}    6.21{col 46}{space 3}0.000{col 54}{space 4} .0029182{col 67}{space 3} .0056136
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.73e-06{col 26}{space 2}  .000046{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4}-.0000959{col 67}{space 3} .0000844
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_sib_acs.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   154.62
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0372
                                                {txt}Root MSE          =    {res} .03197

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_d_si~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_enr_sib {c |}{col 14}{res}{space 2} .1046008{col 26}{space 2} .0084121{col 37}{space 1}   12.43{col 46}{space 3}0.000{col 54}{space 4} .0880975{col 67}{space 3} .1211041
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001932{col 26}{space 2} .0006959{col 37}{space 1}   -0.28{col 46}{space 3}0.781{col 54}{space 4}-.0015585{col 67}{space 3} .0011721
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_acs_sib.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/outcome_va/va_enr_sib_acs.dta{rm}
saved
{p_end}
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(36, 433276)   = {res}   675.04
{txt}       Model {c |} {res} 5306.03575        36  147.389882   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  94602.849   433,276  .218343155   {txt}R-squared       ={res}    0.0531
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0530
{txt}       Total {c |} {res} 99908.8848   433,312  .230570316   {txt}Root MSE        =   {res} .46727

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0088359{col 26}{space 2} .0028272{col 37}{space 1}   -3.13{col 46}{space 3}0.002{col 54}{space 4}-.0143771{col 67}{space 3}-.0032947
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0363714{col 26}{space 2} .0028363{col 37}{space 1}  -12.82{col 46}{space 3}0.000{col 54}{space 4}-.0419305{col 67}{space 3}-.0308123
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0109105{col 26}{space 2} .0028607{col 37}{space 1}   -3.81{col 46}{space 3}0.000{col 54}{space 4}-.0165173{col 67}{space 3}-.0053037
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000738{col 26}{space 2} 5.14e-06{col 37}{space 1}  -14.35{col 46}{space 3}0.000{col 54}{space 4}-.0000839{col 67}{space 3}-.0000637
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0220021{col 26}{space 2} .0014525{col 37}{space 1}   15.15{col 46}{space 3}0.000{col 54}{space 4} .0191552{col 67}{space 3} .0248489
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0106871{col 26}{space 2} .0022715{col 37}{space 1}   -4.70{col 46}{space 3}0.000{col 54}{space 4}-.0151391{col 67}{space 3} -.006235
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0068894{col 26}{space 2} .0019921{col 37}{space 1}   -3.46{col 46}{space 3}0.001{col 54}{space 4}-.0107939{col 67}{space 3}-.0029848
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0380581{col 26}{space 2} .0040116{col 37}{space 1}   -9.49{col 46}{space 3}0.000{col 54}{space 4}-.0459208{col 67}{space 3}-.0301955
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0019439{col 26}{space 2} .0043162{col 37}{space 1}    0.45{col 46}{space 3}0.652{col 54}{space 4}-.0065158{col 67}{space 3} .0104035
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0255885{col 26}{space 2} .0016883{col 37}{space 1}  -15.16{col 46}{space 3}0.000{col 54}{space 4}-.0288976{col 67}{space 3}-.0222794
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2} -.024987{col 26}{space 2} .0038798{col 37}{space 1}   -6.44{col 46}{space 3}0.000{col 54}{space 4}-.0325913{col 67}{space 3}-.0173827
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0300342{col 26}{space 2} .0037915{col 37}{space 1}    7.92{col 46}{space 3}0.000{col 54}{space 4} .0226029{col 67}{space 3} .0374654
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0601664{col 26}{space 2} .0028538{col 37}{space 1}  -21.08{col 46}{space 3}0.000{col 54}{space 4}-.0657597{col 67}{space 3}-.0545731
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0561431{col 26}{space 2} .0027846{col 37}{space 1}  -20.16{col 46}{space 3}0.000{col 54}{space 4}-.0616009{col 67}{space 3}-.0506853
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0519468{col 26}{space 2} .0029531{col 37}{space 1}  -17.59{col 46}{space 3}0.000{col 54}{space 4}-.0577348{col 67}{space 3}-.0461588
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0265222{col 26}{space 2} .0036786{col 37}{space 1}   -7.21{col 46}{space 3}0.000{col 54}{space 4}-.0337321{col 67}{space 3}-.0193123
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0421198{col 26}{space 2}  .001511{col 37}{space 1}  -27.87{col 46}{space 3}0.000{col 54}{space 4}-.0450814{col 67}{space 3}-.0391582
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0408507{col 26}{space 2} .0015144{col 37}{space 1}  -26.97{col 46}{space 3}0.000{col 54}{space 4}-.0438189{col 67}{space 3}-.0378825
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0312781{col 26}{space 2} .0015784{col 37}{space 1}  -19.82{col 46}{space 3}0.000{col 54}{space 4}-.0343718{col 67}{space 3}-.0281844
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.032296{col 26}{space 2} .0015745{col 37}{space 1}  -20.51{col 46}{space 3}0.000{col 54}{space 4} -.035382{col 67}{space 3}-.0292099
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .010949{col 26}{space 2} .0006828{col 37}{space 1}   16.03{col 46}{space 3}0.000{col 54}{space 4} .0096107{col 67}{space 3} .0122874
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0107743{col 26}{space 2} .0006275{col 37}{space 1}   17.17{col 46}{space 3}0.000{col 54}{space 4} .0095444{col 67}{space 3} .0120042
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0083567{col 26}{space 2} .0006235{col 37}{space 1}   13.40{col 46}{space 3}0.000{col 54}{space 4} .0071346{col 67}{space 3} .0095787
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0042262{col 26}{space 2} .0010333{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4}  .002201{col 67}{space 3} .0062514
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0656131{col 26}{space 2} .0028392{col 37}{space 1}  -23.11{col 46}{space 3}0.000{col 54}{space 4}-.0711779{col 67}{space 3}-.0600484
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0661042{col 26}{space 2} .0028874{col 37}{space 1}  -22.89{col 46}{space 3}0.000{col 54}{space 4}-.0717635{col 67}{space 3}-.0604449
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0668462{col 26}{space 2} .0030363{col 37}{space 1}  -22.02{col 46}{space 3}0.000{col 54}{space 4}-.0727973{col 67}{space 3}-.0608952
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0559496{col 26}{space 2} .0036984{col 37}{space 1}  -15.13{col 46}{space 3}0.000{col 54}{space 4}-.0631983{col 67}{space 3}-.0487009
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0297278{col 26}{space 2} .0018954{col 37}{space 1}  -15.68{col 46}{space 3}0.000{col 54}{space 4}-.0334428{col 67}{space 3}-.0260128
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0338607{col 26}{space 2} .0018482{col 37}{space 1}  -18.32{col 46}{space 3}0.000{col 54}{space 4}-.0374832{col 67}{space 3}-.0302383
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0267713{col 26}{space 2} .0019458{col 37}{space 1}  -13.76{col 46}{space 3}0.000{col 54}{space 4} -.030585{col 67}{space 3}-.0229577
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0360725{col 26}{space 2} .0015411{col 37}{space 1}  -23.41{col 46}{space 3}0.000{col 54}{space 4}-.0390931{col 67}{space 3} -.033052
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0097408{col 26}{space 2} .0007688{col 37}{space 1}   12.67{col 46}{space 3}0.000{col 54}{space 4}  .008234{col 67}{space 3} .0112476
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0115107{col 26}{space 2} .0008161{col 37}{space 1}   14.11{col 46}{space 3}0.000{col 54}{space 4} .0099112{col 67}{space 3} .0131101
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0093169{col 26}{space 2} .0008196{col 37}{space 1}   11.37{col 46}{space 3}0.000{col 54}{space 4} .0077105{col 67}{space 3} .0109234
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0021713{col 26}{space 2} .0010156{col 37}{space 1}    2.14{col 46}{space 3}0.033{col 54}{space 4} .0001807{col 67}{space 3} .0041618
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .911522{col 26}{space 2} .0314931{col 37}{space 1}   28.94{col 46}{space 3}0.000{col 54}{space 4} .8497964{col 67}{space 3} .9732475
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_2year_og.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46727204 .09867961 .4567335 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .009177939   .7460293792          3445{txt}  {c |}
  2 {c |}  {res}.0083226199   .6822244309          2240{txt}  {c |}
  3 {c |}  {res}.0074436809   .6297817764          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .009177939{txt}  {c |}
  2 {c |}  {res}.0083226199{txt}  {c |}
  3 {c |}  {res}.0083226199{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res} 14462.38
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0354
                                                {txt}Root MSE          =    {res} .45889

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2year_~g{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_2ye~g {c |}{col 14}{res}{space 2} .9879006{col 26}{space 2} .0082147{col 37}{space 1}  120.26{col 46}{space 3}0.000{col 54}{space 4} .9717843{col 67}{space 3} 1.004017
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0011909{col 26}{space 2} .0003926{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-.0019611{col 67}{space 3}-.0004207
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_2year_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(43, 433269)   = {res}   649.04
{txt}       Model {c |} {res} 6046.06394        43  140.606138   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 93862.8208   433,269  .216638672   {txt}R-squared       ={res}    0.0605
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0604
{txt}       Total {c |} {res} 99908.8848   433,312  .230570316   {txt}Root MSE        =   {res} .46544

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0066825{col 26}{space 2} .0028179{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-.0122054{col 67}{space 3}-.0011595
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0336715{col 26}{space 2} .0028328{col 37}{space 1}  -11.89{col 46}{space 3}0.000{col 54}{space 4}-.0392237{col 67}{space 3}-.0281194
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0077949{col 26}{space 2} .0028645{col 37}{space 1}   -2.72{col 46}{space 3}0.007{col 54}{space 4}-.0134092{col 67}{space 3}-.0021806
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000736{col 26}{space 2} 5.13e-06{col 37}{space 1}  -14.35{col 46}{space 3}0.000{col 54}{space 4}-.0000837{col 67}{space 3}-.0000636
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0211803{col 26}{space 2} .0014471{col 37}{space 1}   14.64{col 46}{space 3}0.000{col 54}{space 4}  .018344{col 67}{space 3} .0240166
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0223999{col 26}{space 2} .0025557{col 37}{space 1}   -8.76{col 46}{space 3}0.000{col 54}{space 4} -.027409{col 67}{space 3}-.0173907
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} .0118743{col 26}{space 2} .0022073{col 37}{space 1}    5.38{col 46}{space 3}0.000{col 54}{space 4}  .007548{col 67}{space 3} .0162006
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0141867{col 26}{space 2} .0041965{col 37}{space 1}   -3.38{col 46}{space 3}0.001{col 54}{space 4}-.0224118{col 67}{space 3}-.0059617
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0004198{col 26}{space 2} .0043157{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4}-.0080388{col 67}{space 3} .0088783
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2} -.018186{col 26}{space 2} .0018016{col 37}{space 1}  -10.09{col 46}{space 3}0.000{col 54}{space 4} -.021717{col 67}{space 3}-.0146549
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0264173{col 26}{space 2}  .003866{col 37}{space 1}   -6.83{col 46}{space 3}0.000{col 54}{space 4}-.0339945{col 67}{space 3}-.0188401
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0262886{col 26}{space 2} .0037824{col 37}{space 1}    6.95{col 46}{space 3}0.000{col 54}{space 4} .0188752{col 67}{space 3}  .033702
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0634038{col 26}{space 2} .0028457{col 37}{space 1}  -22.28{col 46}{space 3}0.000{col 54}{space 4}-.0689813{col 67}{space 3}-.0578263
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0592668{col 26}{space 2} .0027769{col 37}{space 1}  -21.34{col 46}{space 3}0.000{col 54}{space 4}-.0647096{col 67}{space 3}-.0538241
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0542546{col 26}{space 2} .0029458{col 37}{space 1}  -18.42{col 46}{space 3}0.000{col 54}{space 4}-.0600282{col 67}{space 3}-.0484809
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0281332{col 26}{space 2} .0036656{col 37}{space 1}   -7.67{col 46}{space 3}0.000{col 54}{space 4}-.0353177{col 67}{space 3}-.0209487
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0407432{col 26}{space 2} .0015054{col 37}{space 1}  -27.06{col 46}{space 3}0.000{col 54}{space 4}-.0436938{col 67}{space 3}-.0377926
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0394397{col 26}{space 2} .0015088{col 37}{space 1}  -26.14{col 46}{space 3}0.000{col 54}{space 4}-.0423969{col 67}{space 3}-.0364824
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0296691{col 26}{space 2} .0015726{col 37}{space 1}  -18.87{col 46}{space 3}0.000{col 54}{space 4}-.0327514{col 67}{space 3}-.0265868
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0311738{col 26}{space 2} .0015685{col 37}{space 1}  -19.87{col 46}{space 3}0.000{col 54}{space 4}-.0342481{col 67}{space 3}-.0280996
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0109277{col 26}{space 2} .0006802{col 37}{space 1}   16.07{col 46}{space 3}0.000{col 54}{space 4} .0095946{col 67}{space 3} .0122609
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .010754{col 26}{space 2} .0006251{col 37}{space 1}   17.20{col 46}{space 3}0.000{col 54}{space 4} .0095288{col 67}{space 3} .0119791
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0082386{col 26}{space 2} .0006211{col 37}{space 1}   13.26{col 46}{space 3}0.000{col 54}{space 4} .0070212{col 67}{space 3} .0094559
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0043686{col 26}{space 2} .0010293{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 54}{space 4} .0023513{col 67}{space 3}  .006386
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0645901{col 26}{space 2} .0028285{col 37}{space 1}  -22.84{col 46}{space 3}0.000{col 54}{space 4}-.0701339{col 67}{space 3}-.0590463
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0651449{col 26}{space 2} .0028765{col 37}{space 1}  -22.65{col 46}{space 3}0.000{col 54}{space 4}-.0707827{col 67}{space 3}-.0595072
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0655069{col 26}{space 2} .0030248{col 37}{space 1}  -21.66{col 46}{space 3}0.000{col 54}{space 4}-.0714354{col 67}{space 3}-.0595783
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0575899{col 26}{space 2} .0036852{col 37}{space 1}  -15.63{col 46}{space 3}0.000{col 54}{space 4}-.0648129{col 67}{space 3} -.050367
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0274338{col 26}{space 2} .0018885{col 37}{space 1}  -14.53{col 46}{space 3}0.000{col 54}{space 4}-.0311352{col 67}{space 3}-.0237324
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.032047{col 26}{space 2} .0018414{col 37}{space 1}  -17.40{col 46}{space 3}0.000{col 54}{space 4} -.035656{col 67}{space 3} -.028438
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0257249{col 26}{space 2} .0019383{col 37}{space 1}  -13.27{col 46}{space 3}0.000{col 54}{space 4}-.0295239{col 67}{space 3}-.0219258
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0348421{col 26}{space 2} .0015358{col 37}{space 1}  -22.69{col 46}{space 3}0.000{col 54}{space 4}-.0378521{col 67}{space 3} -.031832
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0091231{col 26}{space 2} .0007658{col 37}{space 1}   11.91{col 46}{space 3}0.000{col 54}{space 4}  .007622{col 67}{space 3} .0106241
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0110526{col 26}{space 2} .0008129{col 37}{space 1}   13.60{col 46}{space 3}0.000{col 54}{space 4} .0094593{col 67}{space 3} .0126459
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0090554{col 26}{space 2} .0008164{col 37}{space 1}   11.09{col 46}{space 3}0.000{col 54}{space 4} .0074552{col 67}{space 3} .0106556
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0025951{col 26}{space 2} .0010118{col 37}{space 1}    2.56{col 46}{space 3}0.010{col 54}{space 4}  .000612{col 67}{space 3} .0045783
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2} .0006855{col 26}{space 2}  .000054{col 37}{space 1}   12.71{col 46}{space 3}0.000{col 54}{space 4} .0005797{col 67}{space 3} .0007912
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0010317{col 26}{space 2} .0000536{col 37}{space 1}  -19.23{col 46}{space 3}0.000{col 54}{space 4}-.0011368{col 67}{space 3}-.0009266
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0025273{col 26}{space 2} .0000995{col 37}{space 1}  -25.39{col 46}{space 3}0.000{col 54}{space 4}-.0027223{col 67}{space 3}-.0023322
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-2.116527{col 26}{space 2} .1440705{col 37}{space 1}  -14.69{col 46}{space 3}0.000{col 54}{space 4}-2.398901{col 67}{space 3}-1.834153
{txt}educ~us_prop {c |}{col 14}{res}{space 2}-1.820992{col 26}{space 2} .1314586{col 37}{space 1}  -13.85{col 46}{space 3}0.000{col 54}{space 4}-2.078647{col 67}{space 3}-1.563337
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0012909{col 26}{space 2} .0000821{col 37}{space 1}  -15.72{col 46}{space 3}0.000{col 54}{space 4}-.0014517{col 67}{space 3}  -.00113
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2}-1.21e-06{col 26}{space 2} 3.73e-08{col 37}{space 1}  -32.40{col 46}{space 3}0.000{col 54}{space 4}-1.28e-06{col 67}{space 3}-1.14e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.078872{col 26}{space 2} .0316814{col 37}{space 1}   34.05{col 46}{space 3}0.000{col 54}{space 4} 1.016778{col 67}{space 3} 1.140967
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_2year_acs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.4654446 .08840514 .45697177 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0071757742   .6946978631          3445{txt}  {c |}
  2 {c |}  {res}.0063409202   .6170295848          2240{txt}  {c |}
  3 {c |}  {res}.0056062251   .5595532151          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0071757742{txt}  {c |}
  2 {c |}  {res}.0063409202{txt}  {c |}
  3 {c |}  {res}.0063409202{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}  9576.34
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0269
                                                {txt}Root MSE          =    {res}  .4591

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2year_~s{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_2ye~s {c |}{col 14}{res}{space 2} .9927638{col 26}{space 2} .0101449{col 37}{space 1}   97.86{col 46}{space 3}0.000{col 54}{space 4} .9728609{col 67}{space 3} 1.012667
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0011852{col 26}{space 2} .0004174{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-.0020041{col 67}{space 3}-.0003664
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_2year_acs.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   257.39
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0992
                                                {txt}Root MSE          =    {res} .03922

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2y~g_acs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_2ye~g {c |}{col 14}{res}{space 2} .1461538{col 26}{space 2} .0091099{col 37}{space 1}   16.04{col 46}{space 3}0.000{col 54}{space 4} .1282814{col 67}{space 3} .1640263
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0002107{col 26}{space 2} .0008049{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-.0017898{col 67}{space 3} .0013684
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_2year_acs_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(38, 433274)   = {res}   694.96
{txt}       Model {c |} {res} 5739.70404        38  151.044843   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 94169.1807   433,274  .217343253   {txt}R-squared       ={res}    0.0574
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0574
{txt}       Total {c |} {res} 99908.8848   433,312  .230570316   {txt}Root MSE        =   {res}  .4662

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0091682{col 26}{space 2} .0028209{col 37}{space 1}   -3.25{col 46}{space 3}0.001{col 54}{space 4} -.014697{col 67}{space 3}-.0036393
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0369478{col 26}{space 2} .0028306{col 37}{space 1}  -13.05{col 46}{space 3}0.000{col 54}{space 4}-.0424957{col 67}{space 3}-.0313999
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.012608{col 26}{space 2}  .002856{col 37}{space 1}   -4.41{col 46}{space 3}0.000{col 54}{space 4}-.0182056{col 67}{space 3}-.0070104
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000733{col 26}{space 2} 5.13e-06{col 37}{space 1}  -14.28{col 46}{space 3}0.000{col 54}{space 4}-.0000833{col 67}{space 3}-.0000632
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0221835{col 26}{space 2} .0014492{col 37}{space 1}   15.31{col 46}{space 3}0.000{col 54}{space 4} .0193431{col 67}{space 3} .0250238
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0110293{col 26}{space 2} .0022673{col 37}{space 1}   -4.86{col 46}{space 3}0.000{col 54}{space 4}-.0154731{col 67}{space 3}-.0065855
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0088319{col 26}{space 2} .0019881{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-.0127285{col 67}{space 3}-.0049354
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0382803{col 26}{space 2} .0040024{col 37}{space 1}   -9.56{col 46}{space 3}0.000{col 54}{space 4}-.0461249{col 67}{space 3}-.0304357
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0012966{col 26}{space 2} .0043064{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4}-.0071438{col 67}{space 3} .0097371
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0262682{col 26}{space 2} .0016847{col 37}{space 1}  -15.59{col 46}{space 3}0.000{col 54}{space 4}-.0295702{col 67}{space 3}-.0229662
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0256491{col 26}{space 2} .0038709{col 37}{space 1}   -6.63{col 46}{space 3}0.000{col 54}{space 4} -.033236{col 67}{space 3}-.0180622
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0302117{col 26}{space 2}  .003783{col 37}{space 1}    7.99{col 46}{space 3}0.000{col 54}{space 4} .0227971{col 67}{space 3} .0376262
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0587672{col 26}{space 2} .0028474{col 37}{space 1}  -20.64{col 46}{space 3}0.000{col 54}{space 4}-.0643481{col 67}{space 3}-.0531864
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0546605{col 26}{space 2} .0027785{col 37}{space 1}  -19.67{col 46}{space 3}0.000{col 54}{space 4}-.0601062{col 67}{space 3}-.0492147
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0498938{col 26}{space 2} .0029468{col 37}{space 1}  -16.93{col 46}{space 3}0.000{col 54}{space 4}-.0556694{col 67}{space 3}-.0441182
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0249624{col 26}{space 2} .0036703{col 37}{space 1}   -6.80{col 46}{space 3}0.000{col 54}{space 4}-.0321561{col 67}{space 3}-.0177687
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0417928{col 26}{space 2} .0015076{col 37}{space 1}  -27.72{col 46}{space 3}0.000{col 54}{space 4}-.0447476{col 67}{space 3}-.0388379
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0405008{col 26}{space 2}  .001511{col 37}{space 1}  -26.80{col 46}{space 3}0.000{col 54}{space 4}-.0434623{col 67}{space 3}-.0375393
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0310181{col 26}{space 2} .0015749{col 37}{space 1}  -19.70{col 46}{space 3}0.000{col 54}{space 4}-.0341048{col 67}{space 3}-.0279314
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0320836{col 26}{space 2} .0015709{col 37}{space 1}  -20.42{col 46}{space 3}0.000{col 54}{space 4}-.0351626{col 67}{space 3}-.0290046
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0107811{col 26}{space 2} .0006813{col 37}{space 1}   15.82{col 46}{space 3}0.000{col 54}{space 4} .0094457{col 67}{space 3} .0121164
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0106225{col 26}{space 2} .0006261{col 37}{space 1}   16.97{col 46}{space 3}0.000{col 54}{space 4} .0093954{col 67}{space 3} .0118496
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0081665{col 26}{space 2} .0006221{col 37}{space 1}   13.13{col 46}{space 3}0.000{col 54}{space 4} .0069472{col 67}{space 3} .0093858
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0040396{col 26}{space 2} .0010309{col 37}{space 1}    3.92{col 46}{space 3}0.000{col 54}{space 4}  .002019{col 67}{space 3} .0060602
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0644419{col 26}{space 2} .0028329{col 37}{space 1}  -22.75{col 46}{space 3}0.000{col 54}{space 4}-.0699943{col 67}{space 3}-.0588894
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0645777{col 26}{space 2} .0028813{col 37}{space 1}  -22.41{col 46}{space 3}0.000{col 54}{space 4} -.070225{col 67}{space 3}-.0589305
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0653849{col 26}{space 2} .0030297{col 37}{space 1}  -21.58{col 46}{space 3}0.000{col 54}{space 4} -.071323{col 67}{space 3}-.0594468
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0535092{col 26}{space 2} .0036904{col 37}{space 1}  -14.50{col 46}{space 3}0.000{col 54}{space 4}-.0607422{col 67}{space 3}-.0462761
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0295248{col 26}{space 2} .0018911{col 37}{space 1}  -15.61{col 46}{space 3}0.000{col 54}{space 4}-.0332313{col 67}{space 3}-.0258183
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0335673{col 26}{space 2}  .001844{col 37}{space 1}  -18.20{col 46}{space 3}0.000{col 54}{space 4}-.0371815{col 67}{space 3}-.0299531
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0265601{col 26}{space 2} .0019413{col 37}{space 1}  -13.68{col 46}{space 3}0.000{col 54}{space 4} -.030365{col 67}{space 3}-.0227552
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0353967{col 26}{space 2} .0015377{col 37}{space 1}  -23.02{col 46}{space 3}0.000{col 54}{space 4}-.0384106{col 67}{space 3}-.0323829
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0096388{col 26}{space 2}  .000767{col 37}{space 1}   12.57{col 46}{space 3}0.000{col 54}{space 4} .0081355{col 67}{space 3} .0111421
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0113375{col 26}{space 2} .0008142{col 37}{space 1}   13.92{col 46}{space 3}0.000{col 54}{space 4} .0097417{col 67}{space 3} .0129334
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0091954{col 26}{space 2} .0008178{col 37}{space 1}   11.24{col 46}{space 3}0.000{col 54}{space 4} .0075926{col 67}{space 3} .0107982
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0019474{col 26}{space 2} .0010133{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}-.0000387{col 67}{space 3} .0039334
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .1014943{col 26}{space 2} .0027967{col 37}{space 1}   36.29{col 46}{space 3}0.000{col 54}{space 4}  .096013{col 67}{space 3} .1069757
{txt}1.has_~4year {c |}{col 14}{res}{space 2}-.0852628{col 26}{space 2} .0030201{col 37}{space 1}  -28.23{col 46}{space 3}0.000{col 54}{space 4}-.0911821{col 67}{space 3}-.0793435
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9071638{col 26}{space 2} .0314331{col 37}{space 1}   28.86{col 46}{space 3}0.000{col 54}{space 4} .8455559{col 67}{space 3} .9687718
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_2year_sib.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46620087 .0968756 .45602453 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .008833778    .739436961          3445{txt}  {c |}
  2 {c |}  {res}.0079856748   .6742992091          2240{txt}  {c |}
  3 {c |}  {res}.0071244185   .6215851946          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .008833778{txt}  {c |}
  2 {c |}  {res}.0079856748{txt}  {c |}
  3 {c |}  {res}.0079856748{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res} 13781.55
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0341
                                                {txt}Root MSE          =    {res} .45815

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2year_~b{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_2ye~b {c |}{col 14}{res}{space 2} .9884735{col 26}{space 2} .0084201{col 37}{space 1}  117.39{col 46}{space 3}0.000{col 54}{space 4} .9719544{col 67}{space 3} 1.004993
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0012233{col 26}{space 2}  .000393{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-.0019943{col 67}{space 3}-.0004523
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_2year_sib.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   517.32
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0030
                                                {txt}Root MSE          =    {res} .03159

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2y~g_sib{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_2ye~g {c |}{col 14}{res}{space 2} .0194547{col 26}{space 2} .0008554{col 37}{space 1}   22.74{col 46}{space 3}0.000{col 54}{space 4} .0177767{col 67}{space 3} .0211328
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.000022{col 26}{space 2}  .000073{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4}-.0001651{col 67}{space 3} .0001212
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_2year_sib_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(45, 433267)   = {res}   664.47
{txt}       Model {c |} {res} 6449.94981        45  143.332218   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  93458.935   433,267  .215707485   {txt}R-squared       ={res}    0.0646
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0645
{txt}       Total {c |} {res} 99908.8848   433,312  .230570316   {txt}Root MSE        =   {res} .46444

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0070702{col 26}{space 2}  .002812{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.0125816{col 67}{space 3}-.0015587
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0343355{col 26}{space 2} .0028275{col 37}{space 1}  -12.14{col 46}{space 3}0.000{col 54}{space 4}-.0398772{col 67}{space 3}-.0287937
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0095491{col 26}{space 2} .0028602{col 37}{space 1}   -3.34{col 46}{space 3}0.001{col 54}{space 4} -.015155{col 67}{space 3}-.0039432
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000732{col 26}{space 2} 5.12e-06{col 37}{space 1}  -14.29{col 46}{space 3}0.000{col 54}{space 4}-.0000832{col 67}{space 3}-.0000631
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0213554{col 26}{space 2}  .001444{col 37}{space 1}   14.79{col 46}{space 3}0.000{col 54}{space 4} .0185251{col 67}{space 3} .0241856
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0223847{col 26}{space 2} .0025512{col 37}{space 1}   -8.77{col 46}{space 3}0.000{col 54}{space 4} -.027385{col 67}{space 3}-.0173844
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} .0100271{col 26}{space 2}  .002203{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 54}{space 4} .0057092{col 67}{space 3} .0143449
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0144426{col 26}{space 2} .0041875{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4}-.0226499{col 67}{space 3}-.0062352
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0000547{col 26}{space 2} .0043065{col 37}{space 1}   -0.01{col 46}{space 3}0.990{col 54}{space 4}-.0084952{col 67}{space 3} .0083859
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0185921{col 26}{space 2} .0017979{col 37}{space 1}  -10.34{col 46}{space 3}0.000{col 54}{space 4}-.0221159{col 67}{space 3}-.0150683
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0270107{col 26}{space 2} .0038577{col 37}{space 1}   -7.00{col 46}{space 3}0.000{col 54}{space 4}-.0345716{col 67}{space 3}-.0194497
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0264214{col 26}{space 2} .0037744{col 37}{space 1}    7.00{col 46}{space 3}0.000{col 54}{space 4} .0190237{col 67}{space 3} .0338192
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0620657{col 26}{space 2} .0028398{col 37}{space 1}  -21.86{col 46}{space 3}0.000{col 54}{space 4}-.0676315{col 67}{space 3}-.0564998
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0578482{col 26}{space 2} .0027712{col 37}{space 1}  -20.87{col 46}{space 3}0.000{col 54}{space 4}-.0632797{col 67}{space 3}-.0524168
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0523134{col 26}{space 2} .0029399{col 37}{space 1}  -17.79{col 46}{space 3}0.000{col 54}{space 4}-.0580754{col 67}{space 3}-.0465513
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0266553{col 26}{space 2} .0036579{col 37}{space 1}   -7.29{col 46}{space 3}0.000{col 54}{space 4}-.0338247{col 67}{space 3} -.019486
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0404578{col 26}{space 2} .0015022{col 37}{space 1}  -26.93{col 46}{space 3}0.000{col 54}{space 4}-.0434021{col 67}{space 3}-.0375135
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0391309{col 26}{space 2} .0015056{col 37}{space 1}  -25.99{col 46}{space 3}0.000{col 54}{space 4}-.0420819{col 67}{space 3}-.0361799
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.029453{col 26}{space 2} .0015693{col 37}{space 1}  -18.77{col 46}{space 3}0.000{col 54}{space 4}-.0325288{col 67}{space 3}-.0263772
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0309882{col 26}{space 2} .0015652{col 37}{space 1}  -19.80{col 46}{space 3}0.000{col 54}{space 4}-.0340559{col 67}{space 3}-.0279206
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0107681{col 26}{space 2} .0006787{col 37}{space 1}   15.86{col 46}{space 3}0.000{col 54}{space 4} .0094377{col 67}{space 3} .0120984
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0106082{col 26}{space 2} .0006238{col 37}{space 1}   17.01{col 46}{space 3}0.000{col 54}{space 4} .0093857{col 67}{space 3} .0118307
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0080601{col 26}{space 2} .0006198{col 37}{space 1}   13.00{col 46}{space 3}0.000{col 54}{space 4} .0068453{col 67}{space 3} .0092749
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0041865{col 26}{space 2} .0010271{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} .0021735{col 67}{space 3} .0061995
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.063519{col 26}{space 2} .0028226{col 37}{space 1}  -22.50{col 46}{space 3}0.000{col 54}{space 4}-.0690513{col 67}{space 3}-.0579867
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0637329{col 26}{space 2} .0028707{col 37}{space 1}  -22.20{col 46}{space 3}0.000{col 54}{space 4}-.0693595{col 67}{space 3}-.0581064
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0641532{col 26}{space 2} .0030187{col 37}{space 1}  -21.25{col 46}{space 3}0.000{col 54}{space 4}-.0700696{col 67}{space 3}-.0582367
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0552669{col 26}{space 2} .0036778{col 37}{space 1}  -15.03{col 46}{space 3}0.000{col 54}{space 4}-.0624753{col 67}{space 3}-.0480585
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0272803{col 26}{space 2} .0018845{col 37}{space 1}  -14.48{col 46}{space 3}0.000{col 54}{space 4}-.0309738{col 67}{space 3}-.0235868
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0317962{col 26}{space 2} .0018374{col 37}{space 1}  -17.30{col 46}{space 3}0.000{col 54}{space 4}-.0353975{col 67}{space 3}-.0281949
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0255454{col 26}{space 2} .0019341{col 37}{space 1}  -13.21{col 46}{space 3}0.000{col 54}{space 4}-.0293363{col 67}{space 3}-.0217545
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.034228{col 26}{space 2} .0015326{col 37}{space 1}  -22.33{col 46}{space 3}0.000{col 54}{space 4}-.0372318{col 67}{space 3}-.0312242
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0090354{col 26}{space 2} .0007642{col 37}{space 1}   11.82{col 46}{space 3}0.000{col 54}{space 4} .0075376{col 67}{space 3} .0105333
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0108946{col 26}{space 2} .0008112{col 37}{space 1}   13.43{col 46}{space 3}0.000{col 54}{space 4} .0093047{col 67}{space 3} .0124845
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0089439{col 26}{space 2} .0008147{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .0073471{col 67}{space 3} .0105407
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0023692{col 26}{space 2} .0010097{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0003903{col 67}{space 3} .0043481
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0987736{col 26}{space 2}  .002787{col 37}{space 1}   35.44{col 46}{space 3}0.000{col 54}{space 4} .0933112{col 67}{space 3}  .104236
{txt}1.has_~4year {c |}{col 14}{res}{space 2}-.0811922{col 26}{space 2} .0030101{col 37}{space 1}  -26.97{col 46}{space 3}0.000{col 54}{space 4}-.0870919{col 67}{space 3}-.0752925
{txt}eth_asian_~t {c |}{col 14}{res}{space 2} .0006699{col 26}{space 2} .0000538{col 37}{space 1}   12.44{col 46}{space 3}0.000{col 54}{space 4} .0005644{col 67}{space 3} .0007754
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0010112{col 26}{space 2} .0000535{col 37}{space 1}  -18.89{col 46}{space 3}0.000{col 54}{space 4}-.0011162{col 67}{space 3}-.0009063
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0024909{col 26}{space 2} .0000993{col 37}{space 1}  -25.08{col 46}{space 3}0.000{col 54}{space 4}-.0026856{col 67}{space 3}-.0022963
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-2.086824{col 26}{space 2} .1437657{col 37}{space 1}  -14.52{col 46}{space 3}0.000{col 54}{space 4}  -2.3686{col 67}{space 3}-1.805047
{txt}educ~us_prop {c |}{col 14}{res}{space 2} -1.75916{col 26}{space 2} .1312026{col 37}{space 1}  -13.41{col 46}{space 3}0.000{col 54}{space 4}-2.016313{col 67}{space 3}-1.502007
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0012668{col 26}{space 2} .0000819{col 37}{space 1}  -15.47{col 46}{space 3}0.000{col 54}{space 4}-.0014274{col 67}{space 3}-.0011063
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2}-1.18e-06{col 26}{space 2} 3.73e-08{col 37}{space 1}  -31.53{col 46}{space 3}0.000{col 54}{space 4}-1.25e-06{col 67}{space 3}-1.10e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.070388{col 26}{space 2}  .031625{col 37}{space 1}   33.85{col 46}{space 3}0.000{col 54}{space 4} 1.008404{col 67}{space 3} 1.132373
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_2year_both.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.4644432 .08687414 .45624595 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0069181974   .6877463941          3445{txt}  {c |}
  2 {c |}  {res}.0060912743    .608843009          2240{txt}  {c |}
  3 {c |}  {res}.0053734278   .5515214675          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0069181974{txt}  {c |}
  2 {c |}  {res}.0060912743{txt}  {c |}
  3 {c |}  {res}.0060912743{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}note: label truncated to 80 characters

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}  9126.92
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0260
                                                {txt}Root MSE          =    {res} .45834

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2year_~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_2ye~h {c |}{col 14}{res}{space 2} .9934111{col 26}{space 2} .0103984{col 37}{space 1}   95.53{col 46}{space 3}0.000{col 54}{space 4} .9730108{col 67}{space 3} 1.013811
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0012083{col 26}{space 2} .0004177{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.0020278{col 67}{space 3}-.0003888
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_2year_both.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   385.29
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0023
                                                {txt}Root MSE          =    {res}  .0305

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2~s_both{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_2ye~s {c |}{col 14}{res}{space 2} .0189013{col 26}{space 2} .0009629{col 37}{space 1}   19.63{col 46}{space 3}0.000{col 54}{space 4} .0170122{col 67}{space 3} .0207905
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000208{col 26}{space 2} .0000696{col 37}{space 1}   -0.30{col 46}{space 3}0.766{col 54}{space 4}-.0001574{col 67}{space 3} .0001159
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_2year_sib_acs.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   256.72
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0980
                                                {txt}Root MSE          =    {res} .03845

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2~b_both{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_2ye~b {c |}{col 14}{res}{space 2}  .145408{col 26}{space 2} .0090752{col 37}{space 1}   16.02{col 46}{space 3}0.000{col 54}{space 4} .1276037{col 67}{space 3} .1632123
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0002132{col 26}{space 2} .0007862{col 37}{space 1}   -0.27{col 46}{space 3}0.786{col 54}{space 4}-.0017556{col 67}{space 3} .0013292
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_2year_acs_sib.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/outcome_va/va_enr_2year_sib_acs.dta{rm}
saved
{p_end}
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(36, 433276)   = {res}  3794.91
{txt}       Model {c |} {res} 24124.1901        36  670.116391   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 76509.1332   433,276  .176582901   {txt}R-squared       ={res}    0.2397
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2397
{txt}       Total {c |} {res} 100633.323   433,312  .232242179   {txt}Root MSE        =   {res} .42022

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0170234{col 26}{space 2} .0025425{col 37}{space 1}    6.70{col 46}{space 3}0.000{col 54}{space 4} .0120402{col 67}{space 3} .0220066
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0208863{col 26}{space 2} .0025507{col 37}{space 1}    8.19{col 46}{space 3}0.000{col 54}{space 4}  .015887{col 67}{space 3} .0258856
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0174632{col 26}{space 2} .0025726{col 37}{space 1}   -6.79{col 46}{space 3}0.000{col 54}{space 4}-.0225054{col 67}{space 3} -.012421
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000755{col 26}{space 2} 4.62e-06{col 37}{space 1}  -16.32{col 46}{space 3}0.000{col 54}{space 4}-.0000845{col 67}{space 3}-.0000664
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0896716{col 26}{space 2} .0013062{col 37}{space 1}  -68.65{col 46}{space 3}0.000{col 54}{space 4}-.0922318{col 67}{space 3}-.0871114
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0666746{col 26}{space 2} .0020428{col 37}{space 1}   32.64{col 46}{space 3}0.000{col 54}{space 4} .0626708{col 67}{space 3} .0706783
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0228213{col 26}{space 2} .0017915{col 37}{space 1}  -12.74{col 46}{space 3}0.000{col 54}{space 4}-.0263327{col 67}{space 3}  -.01931
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0378637{col 26}{space 2} .0036076{col 37}{space 1}   10.50{col 46}{space 3}0.000{col 54}{space 4} .0307928{col 67}{space 3} .0449345
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} -.014251{col 26}{space 2} .0038816{col 37}{space 1}   -3.67{col 46}{space 3}0.000{col 54}{space 4}-.0218588{col 67}{space 3}-.0066432
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0430801{col 26}{space 2} .0015183{col 37}{space 1}  -28.37{col 46}{space 3}0.000{col 54}{space 4} -.046056{col 67}{space 3}-.0401043
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0247897{col 26}{space 2} .0034891{col 37}{space 1}   -7.10{col 46}{space 3}0.000{col 54}{space 4}-.0316282{col 67}{space 3}-.0179512
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0475722{col 26}{space 2} .0034097{col 37}{space 1}  -13.95{col 46}{space 3}0.000{col 54}{space 4}-.0542552{col 67}{space 3}-.0408893
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1413601{col 26}{space 2} .0025664{col 37}{space 1}   55.08{col 46}{space 3}0.000{col 54}{space 4}   .13633{col 67}{space 3} .1463901
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1280738{col 26}{space 2} .0025042{col 37}{space 1}   51.14{col 46}{space 3}0.000{col 54}{space 4} .1231656{col 67}{space 3}  .132982
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1263107{col 26}{space 2} .0026557{col 37}{space 1}   47.56{col 46}{space 3}0.000{col 54}{space 4} .1211056{col 67}{space 3} .1315159
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0979171{col 26}{space 2} .0033081{col 37}{space 1}   29.60{col 46}{space 3}0.000{col 54}{space 4} .0914332{col 67}{space 3}  .104401
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0238147{col 26}{space 2} .0013589{col 37}{space 1}   17.53{col 46}{space 3}0.000{col 54}{space 4} .0211513{col 67}{space 3}  .026478
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0181988{col 26}{space 2} .0013619{col 37}{space 1}   13.36{col 46}{space 3}0.000{col 54}{space 4} .0155295{col 67}{space 3} .0208682
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0192971{col 26}{space 2} .0014195{col 37}{space 1}   13.59{col 46}{space 3}0.000{col 54}{space 4}  .016515{col 67}{space 3} .0220793
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0189836{col 26}{space 2}  .001416{col 37}{space 1}   13.41{col 46}{space 3}0.000{col 54}{space 4} .0162083{col 67}{space 3} .0217589
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  -.01151{col 26}{space 2} .0006141{col 37}{space 1}  -18.74{col 46}{space 3}0.000{col 54}{space 4}-.0127136{col 67}{space 3}-.0103064
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0095631{col 26}{space 2} .0005643{col 37}{space 1}  -16.95{col 46}{space 3}0.000{col 54}{space 4}-.0106692{col 67}{space 3}-.0084571
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0102495{col 26}{space 2} .0005607{col 37}{space 1}  -18.28{col 46}{space 3}0.000{col 54}{space 4}-.0113485{col 67}{space 3}-.0091505
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0090058{col 26}{space 2} .0009292{col 37}{space 1}   -9.69{col 46}{space 3}0.000{col 54}{space 4} -.010827{col 67}{space 3}-.0071845
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .122289{col 26}{space 2} .0025533{col 37}{space 1}   47.89{col 46}{space 3}0.000{col 54}{space 4} .1172846{col 67}{space 3} .1272933
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1292095{col 26}{space 2} .0025967{col 37}{space 1}   49.76{col 46}{space 3}0.000{col 54}{space 4} .1241201{col 67}{space 3} .1342989
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1251134{col 26}{space 2} .0027305{col 37}{space 1}   45.82{col 46}{space 3}0.000{col 54}{space 4} .1197616{col 67}{space 3} .1304652
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1449453{col 26}{space 2} .0033259{col 37}{space 1}   43.58{col 46}{space 3}0.000{col 54}{space 4} .1384265{col 67}{space 3}  .151464
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0178444{col 26}{space 2} .0017046{col 37}{space 1}   10.47{col 46}{space 3}0.000{col 54}{space 4} .0145036{col 67}{space 3} .0211853
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .018356{col 26}{space 2} .0016621{col 37}{space 1}   11.04{col 46}{space 3}0.000{col 54}{space 4} .0150983{col 67}{space 3} .0216137
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0134031{col 26}{space 2} .0017498{col 37}{space 1}    7.66{col 46}{space 3}0.000{col 54}{space 4} .0099735{col 67}{space 3} .0168327
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0332113{col 26}{space 2} .0013859{col 37}{space 1}   23.96{col 46}{space 3}0.000{col 54}{space 4} .0304949{col 67}{space 3} .0359277
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0101661{col 26}{space 2} .0006913{col 37}{space 1}  -14.70{col 46}{space 3}0.000{col 54}{space 4}-.0115211{col 67}{space 3}-.0088111
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0108745{col 26}{space 2} .0007339{col 37}{space 1}  -14.82{col 46}{space 3}0.000{col 54}{space 4}-.0123129{col 67}{space 3}-.0094361
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0093004{col 26}{space 2} .0007371{col 37}{space 1}  -12.62{col 46}{space 3}0.000{col 54}{space 4} -.010745{col 67}{space 3}-.0078557
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0092022{col 26}{space 2} .0009133{col 37}{space 1}  -10.08{col 46}{space 3}0.000{col 54}{space 4}-.0109923{col 67}{space 3}-.0074121
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .8096241{col 26}{space 2} .0283218{col 37}{space 1}   28.59{col 46}{space 3}0.000{col 54}{space 4} .7541143{col 67}{space 3} .8651339
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_4year_og.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.42021768 .09076259 .41029874 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0078669166    .768767781          3445{txt}  {c |}
  2 {c |}  {res}.0076120441   .7454761302          2240{txt}  {c |}
  3 {c |}  {res} .007143041   .7126992407          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0078669166{txt}  {c |}
  2 {c |}  {res}.0076120441{txt}  {c |}
  3 {c |}  {res}.0076120441{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res} 24862.23
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0392
                                                {txt}Root MSE          =    {res} .41195

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4year_~g{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_4ye~g {c |}{col 14}{res}{space 2} 1.021422{col 26}{space 2} .0064779{col 37}{space 1}  157.68{col 46}{space 3}0.000{col 54}{space 4} 1.008713{col 67}{space 3} 1.034131
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.000353{col 26}{space 2} .0002432{col 37}{space 1}   -1.45{col 46}{space 3}0.147{col 54}{space 4}-.0008301{col 67}{space 3} .0001242
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_4year_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(43, 433269)   = {res}  3325.80
{txt}       Model {c |} {res} 24973.1998        43  580.772089   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75660.1234   433,269   .17462621   {txt}R-squared       ={res}    0.2482
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2481
{txt}       Total {c |} {res} 100633.323   433,312  .232242179   {txt}Root MSE        =   {res} .41788

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0149258{col 26}{space 2} .0025299{col 37}{space 1}    5.90{col 46}{space 3}0.000{col 54}{space 4} .0099672{col 67}{space 3} .0198844
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0178536{col 26}{space 2} .0025433{col 37}{space 1}    7.02{col 46}{space 3}0.000{col 54}{space 4} .0128688{col 67}{space 3} .0228384
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0193957{col 26}{space 2} .0025718{col 37}{space 1}   -7.54{col 46}{space 3}0.000{col 54}{space 4}-.0244362{col 67}{space 3}-.0143551
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000803{col 26}{space 2} 4.61e-06{col 37}{space 1}  -17.43{col 46}{space 3}0.000{col 54}{space 4}-.0000893{col 67}{space 3}-.0000713
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0899179{col 26}{space 2} .0012992{col 37}{space 1}  -69.21{col 46}{space 3}0.000{col 54}{space 4}-.0924643{col 67}{space 3}-.0873714
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0701828{col 26}{space 2} .0022946{col 37}{space 1}   30.59{col 46}{space 3}0.000{col 54}{space 4} .0656855{col 67}{space 3} .0746801
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0142452{col 26}{space 2} .0019818{col 37}{space 1}   -7.19{col 46}{space 3}0.000{col 54}{space 4}-.0181294{col 67}{space 3}-.0103609
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}  .040555{col 26}{space 2} .0037677{col 37}{space 1}   10.76{col 46}{space 3}0.000{col 54}{space 4} .0331704{col 67}{space 3} .0479395
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0101442{col 26}{space 2} .0038747{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-.0177384{col 67}{space 3}-.0025499
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0232543{col 26}{space 2} .0016175{col 37}{space 1}  -14.38{col 46}{space 3}0.000{col 54}{space 4}-.0264245{col 67}{space 3} -.020084
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0234978{col 26}{space 2} .0034709{col 37}{space 1}   -6.77{col 46}{space 3}0.000{col 54}{space 4}-.0303007{col 67}{space 3}-.0166948
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0531847{col 26}{space 2} .0033959{col 37}{space 1}  -15.66{col 46}{space 3}0.000{col 54}{space 4}-.0598406{col 67}{space 3}-.0465288
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1390207{col 26}{space 2} .0025549{col 37}{space 1}   54.41{col 46}{space 3}0.000{col 54}{space 4} .1340131{col 67}{space 3} .1440283
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1256893{col 26}{space 2} .0024932{col 37}{space 1}   50.41{col 46}{space 3}0.000{col 54}{space 4} .1208028{col 67}{space 3} .1305759
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1217657{col 26}{space 2} .0026448{col 37}{space 1}   46.04{col 46}{space 3}0.000{col 54}{space 4} .1165821{col 67}{space 3} .1269493
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .095655{col 26}{space 2}  .003291{col 37}{space 1}   29.07{col 46}{space 3}0.000{col 54}{space 4} .0892047{col 67}{space 3} .1021054
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0223432{col 26}{space 2} .0013516{col 37}{space 1}   16.53{col 46}{space 3}0.000{col 54}{space 4} .0196941{col 67}{space 3} .0249923
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0167406{col 26}{space 2} .0013547{col 37}{space 1}   12.36{col 46}{space 3}0.000{col 54}{space 4} .0140856{col 67}{space 3} .0193957
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0174635{col 26}{space 2} .0014119{col 37}{space 1}   12.37{col 46}{space 3}0.000{col 54}{space 4} .0146961{col 67}{space 3} .0202308
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0182829{col 26}{space 2} .0014082{col 37}{space 1}   12.98{col 46}{space 3}0.000{col 54}{space 4} .0155228{col 67}{space 3}  .021043
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.011382{col 26}{space 2} .0006107{col 37}{space 1}  -18.64{col 46}{space 3}0.000{col 54}{space 4}-.0125789{col 67}{space 3} -.010185
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  -.00953{col 26}{space 2} .0005612{col 37}{space 1}  -16.98{col 46}{space 3}0.000{col 54}{space 4}-.0106299{col 67}{space 3}  -.00843
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0098965{col 26}{space 2} .0005576{col 37}{space 1}  -17.75{col 46}{space 3}0.000{col 54}{space 4}-.0109895{col 67}{space 3}-.0088036
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0091805{col 26}{space 2} .0009241{col 37}{space 1}   -9.93{col 46}{space 3}0.000{col 54}{space 4}-.0109917{col 67}{space 3}-.0073694
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1199194{col 26}{space 2} .0025395{col 37}{space 1}   47.22{col 46}{space 3}0.000{col 54}{space 4} .1149421{col 67}{space 3} .1248967
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1269671{col 26}{space 2} .0025825{col 37}{space 1}   49.16{col 46}{space 3}0.000{col 54}{space 4} .1219054{col 67}{space 3} .1320288
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1231167{col 26}{space 2} .0027157{col 37}{space 1}   45.33{col 46}{space 3}0.000{col 54}{space 4} .1177939{col 67}{space 3} .1284394
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1426921{col 26}{space 2} .0033087{col 37}{space 1}   43.13{col 46}{space 3}0.000{col 54}{space 4} .1362072{col 67}{space 3} .1491769
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0158653{col 26}{space 2} .0016955{col 37}{space 1}    9.36{col 46}{space 3}0.000{col 54}{space 4} .0125421{col 67}{space 3} .0191885
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .016872{col 26}{space 2} .0016532{col 37}{space 1}   10.21{col 46}{space 3}0.000{col 54}{space 4} .0136317{col 67}{space 3} .0201122
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0122113{col 26}{space 2} .0017402{col 37}{space 1}    7.02{col 46}{space 3}0.000{col 54}{space 4} .0088004{col 67}{space 3} .0156221
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0307021{col 26}{space 2} .0013788{col 37}{space 1}   22.27{col 46}{space 3}0.000{col 54}{space 4} .0279996{col 67}{space 3} .0334046
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0098038{col 26}{space 2} .0006876{col 37}{space 1}  -14.26{col 46}{space 3}0.000{col 54}{space 4}-.0111514{col 67}{space 3}-.0084561
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106222{col 26}{space 2} .0007299{col 37}{space 1}  -14.55{col 46}{space 3}0.000{col 54}{space 4}-.0120527{col 67}{space 3}-.0091917
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0091693{col 26}{space 2}  .000733{col 37}{space 1}  -12.51{col 46}{space 3}0.000{col 54}{space 4} -.010606{col 67}{space 3}-.0077326
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0099321{col 26}{space 2} .0009084{col 37}{space 1}  -10.93{col 46}{space 3}0.000{col 54}{space 4}-.0117126{col 67}{space 3}-.0081516
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2}-.0000323{col 26}{space 2} .0000484{col 37}{space 1}   -0.67{col 46}{space 3}0.505{col 54}{space 4}-.0001272{col 67}{space 3} .0000627
{txt}eth_hispan~t {c |}{col 14}{res}{space 2} .0006721{col 26}{space 2} .0000482{col 37}{space 1}   13.95{col 46}{space 3}0.000{col 54}{space 4} .0005777{col 67}{space 3} .0007665
{txt}eth_black_~t {c |}{col 14}{res}{space 2} .0013524{col 26}{space 2} .0000894{col 37}{space 1}   15.13{col 46}{space 3}0.000{col 54}{space 4} .0011772{col 67}{space 3} .0015275
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2} 1.803387{col 26}{space 2} .1293486{col 37}{space 1}   13.94{col 46}{space 3}0.000{col 54}{space 4} 1.549867{col 67}{space 3} 2.056906
{txt}educ~us_prop {c |}{col 14}{res}{space 2} 2.527065{col 26}{space 2} .1180255{col 37}{space 1}   21.41{col 46}{space 3}0.000{col 54}{space 4} 2.295739{col 67}{space 3} 2.758391
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2} .0007747{col 26}{space 2} .0000737{col 37}{space 1}   10.51{col 46}{space 3}0.000{col 54}{space 4} .0006303{col 67}{space 3} .0009192
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 1.69e-06{col 26}{space 2} 3.35e-08{col 37}{space 1}   50.26{col 46}{space 3}0.000{col 54}{space 4} 1.62e-06{col 67}{space 3} 1.75e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6262685{col 26}{space 2}  .028444{col 37}{space 1}   22.02{col 46}{space 3}0.000{col 54}{space 4}  .570519{col 67}{space 3} .6820179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_4year_acs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41788301 .08020118 .4101146 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0060588579   .7198245906          3445{txt}  {c |}
  2 {c |}  {res}.0058274578   .6911891236          2240{txt}  {c |}
  3 {c |}  {res}.0053738965   .6491003845          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0060588579{txt}  {c |}
  2 {c |}  {res}.0058274578{txt}  {c |}
  3 {c |}  {res}.0058274578{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res} 14123.97
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0294
                                                {txt}Root MSE          =    {res} .41174

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4year_~s{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_4ye~s {c |}{col 14}{res}{space 2} 1.029157{col 26}{space 2} .0086597{col 37}{space 1}  118.84{col 46}{space 3}0.000{col 54}{space 4} 1.012167{col 67}{space 3} 1.046146
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000806{col 26}{space 2} .0002626{col 37}{space 1}   -0.31{col 46}{space 3}0.759{col 54}{space 4}-.0005958{col 67}{space 3} .0004347
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_4year_acs.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   160.79
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1013
                                                {txt}Root MSE          =    {res} .04198

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4y~g_acs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_4ye~g {c |}{col 14}{res}{space 2} .1730435{col 26}{space 2} .0136467{col 37}{space 1}   12.68{col 46}{space 3}0.000{col 54}{space 4} .1462705{col 67}{space 3} .1998166
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.000055{col 26}{space 2} .0009498{col 37}{space 1}   -0.06{col 46}{space 3}0.954{col 54}{space 4}-.0019183{col 67}{space 3} .0018083
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_4year_acs_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(38, 433274)   = {res}  3722.97
{txt}       Model {c |} {res} 24770.6875        38  651.860198   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75862.6357   433,274  .175091595   {txt}R-squared       ={res}    0.2461
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2461
{txt}       Total {c |} {res} 100633.323   433,312  .232242179   {txt}Root MSE        =   {res} .41844

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0167978{col 26}{space 2} .0025319{col 37}{space 1}    6.63{col 46}{space 3}0.000{col 54}{space 4} .0118353{col 67}{space 3} .0217602
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0202257{col 26}{space 2} .0025406{col 37}{space 1}    7.96{col 46}{space 3}0.000{col 54}{space 4} .0152462{col 67}{space 3} .0252052
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0174785{col 26}{space 2} .0025634{col 37}{space 1}   -6.82{col 46}{space 3}0.000{col 54}{space 4}-.0225026{col 67}{space 3}-.0124543
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000738{col 26}{space 2} 4.61e-06{col 37}{space 1}  -16.03{col 46}{space 3}0.000{col 54}{space 4}-.0000828{col 67}{space 3}-.0000648
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0899025{col 26}{space 2} .0013007{col 37}{space 1}  -69.12{col 46}{space 3}0.000{col 54}{space 4}-.0924518{col 67}{space 3}-.0873532
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0657238{col 26}{space 2}  .002035{col 37}{space 1}   32.30{col 46}{space 3}0.000{col 54}{space 4} .0617352{col 67}{space 3} .0697123
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0206885{col 26}{space 2} .0017844{col 37}{space 1}  -11.59{col 46}{space 3}0.000{col 54}{space 4}-.0241859{col 67}{space 3}-.0171912
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0380228{col 26}{space 2} .0035924{col 37}{space 1}   10.58{col 46}{space 3}0.000{col 54}{space 4} .0309818{col 67}{space 3} .0450637
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} -.012971{col 26}{space 2} .0038652{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-.0205468{col 67}{space 3}-.0053953
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0428262{col 26}{space 2} .0015121{col 37}{space 1}  -28.32{col 46}{space 3}0.000{col 54}{space 4}-.0457899{col 67}{space 3}-.0398624
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0240449{col 26}{space 2} .0034744{col 37}{space 1}   -6.92{col 46}{space 3}0.000{col 54}{space 4}-.0308545{col 67}{space 3}-.0172353
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0470655{col 26}{space 2} .0033954{col 37}{space 1}  -13.86{col 46}{space 3}0.000{col 54}{space 4}-.0537204{col 67}{space 3}-.0404105
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1398705{col 26}{space 2} .0025557{col 37}{space 1}   54.73{col 46}{space 3}0.000{col 54}{space 4} .1348614{col 67}{space 3} .1448796
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1266532{col 26}{space 2} .0024938{col 37}{space 1}   50.79{col 46}{space 3}0.000{col 54}{space 4} .1217653{col 67}{space 3}  .131541
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1244796{col 26}{space 2} .0026449{col 37}{space 1}   47.06{col 46}{space 3}0.000{col 54}{space 4} .1192957{col 67}{space 3} .1296636
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0960133{col 26}{space 2} .0032943{col 37}{space 1}   29.15{col 46}{space 3}0.000{col 54}{space 4} .0895566{col 67}{space 3}   .10247
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0235566{col 26}{space 2} .0013531{col 37}{space 1}   17.41{col 46}{space 3}0.000{col 54}{space 4} .0209045{col 67}{space 3} .0262088
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0179673{col 26}{space 2} .0013562{col 37}{space 1}   13.25{col 46}{space 3}0.000{col 54}{space 4} .0153092{col 67}{space 3} .0206254
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0192593{col 26}{space 2} .0014135{col 37}{space 1}   13.62{col 46}{space 3}0.000{col 54}{space 4} .0164888{col 67}{space 3} .0220298
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0188166{col 26}{space 2}   .00141{col 37}{space 1}   13.35{col 46}{space 3}0.000{col 54}{space 4} .0160531{col 67}{space 3} .0215802
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0113064{col 26}{space 2} .0006115{col 37}{space 1}  -18.49{col 46}{space 3}0.000{col 54}{space 4}-.0125049{col 67}{space 3}-.0101079
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0094142{col 26}{space 2} .0005619{col 37}{space 1}  -16.75{col 46}{space 3}0.000{col 54}{space 4}-.0105156{col 67}{space 3}-.0083128
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0100829{col 26}{space 2} .0005584{col 37}{space 1}  -18.06{col 46}{space 3}0.000{col 54}{space 4}-.0111773{col 67}{space 3}-.0089886
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0086964{col 26}{space 2} .0009253{col 37}{space 1}   -9.40{col 46}{space 3}0.000{col 54}{space 4}-.0105099{col 67}{space 3}-.0068828
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1204667{col 26}{space 2} .0025427{col 37}{space 1}   47.38{col 46}{space 3}0.000{col 54}{space 4} .1154831{col 67}{space 3} .1254502
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1266712{col 26}{space 2} .0025861{col 37}{space 1}   48.98{col 46}{space 3}0.000{col 54}{space 4} .1216024{col 67}{space 3} .1317399
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1227883{col 26}{space 2} .0027193{col 37}{space 1}   45.15{col 46}{space 3}0.000{col 54}{space 4} .1174585{col 67}{space 3} .1281181
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .141611{col 26}{space 2} .0033123{col 37}{space 1}   42.75{col 46}{space 3}0.000{col 54}{space 4}  .135119{col 67}{space 3} .1481031
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0177595{col 26}{space 2} .0016974{col 37}{space 1}   10.46{col 46}{space 3}0.000{col 54}{space 4} .0144328{col 67}{space 3} .0210863
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0181254{col 26}{space 2} .0016551{col 37}{space 1}   10.95{col 46}{space 3}0.000{col 54}{space 4} .0148814{col 67}{space 3} .0213693
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0131921{col 26}{space 2} .0017424{col 37}{space 1}    7.57{col 46}{space 3}0.000{col 54}{space 4}  .009777{col 67}{space 3} .0166072
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0326959{col 26}{space 2} .0013802{col 37}{space 1}   23.69{col 46}{space 3}0.000{col 54}{space 4} .0299908{col 67}{space 3}  .035401
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0100357{col 26}{space 2} .0006884{col 37}{space 1}  -14.58{col 46}{space 3}0.000{col 54}{space 4} -.011385{col 67}{space 3}-.0086864
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106043{col 26}{space 2} .0007308{col 37}{space 1}  -14.51{col 46}{space 3}0.000{col 54}{space 4}-.0120367{col 67}{space 3} -.009172
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0090986{col 26}{space 2}  .000734{col 37}{space 1}  -12.40{col 46}{space 3}0.000{col 54}{space 4}-.0105372{col 67}{space 3}  -.00766
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0088178{col 26}{space 2} .0009095{col 37}{space 1}   -9.70{col 46}{space 3}0.000{col 54}{space 4}-.0106004{col 67}{space 3}-.0070353
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0821487{col 26}{space 2} .0025102{col 37}{space 1}  -32.73{col 46}{space 3}0.000{col 54}{space 4}-.0870685{col 67}{space 3}-.0772289
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .1439901{col 26}{space 2} .0027107{col 37}{space 1}   53.12{col 46}{space 3}0.000{col 54}{space 4} .1386772{col 67}{space 3}  .149303
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7969736{col 26}{space 2} .0282129{col 37}{space 1}   28.25{col 46}{space 3}0.000{col 54}{space 4} .7416772{col 67}{space 3}   .85227
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_4year_sib.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41843948 .08861685 .40894822 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .007497821   .7617146919          3445{txt}  {c |}
  2 {c |}  {res}.0072295401   .7368737765          2240{txt}  {c |}
  3 {c |}  {res} .006754941   .7027696277          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .007497821{txt}  {c |}
  2 {c |}  {res}.0072295401{txt}  {c |}
  3 {c |}  {res}.0072295401{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res} 22786.69
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0374
                                                {txt}Root MSE          =    {res} .41059

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4year_~b{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_4ye~b {c |}{col 14}{res}{space 2} 1.021645{col 26}{space 2}  .006768{col 37}{space 1}  150.95{col 46}{space 3}0.000{col 54}{space 4} 1.008367{col 67}{space 3} 1.034923
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0003298{col 26}{space 2} .0002464{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-.0008131{col 67}{space 3} .0001536
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_4year_sib.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   528.34
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0029
                                                {txt}Root MSE          =    {res} .03857

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4y~g_sib{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_4ye~g {c |}{col 14}{res}{space 2} .0256778{col 26}{space 2} .0011171{col 37}{space 1}   22.99{col 46}{space 3}0.000{col 54}{space 4} .0234862{col 67}{space 3} .0278695
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000157{col 26}{space 2} .0000879{col 37}{space 1}   -0.18{col 46}{space 3}0.858{col 54}{space 4}-.0001882{col 67}{space 3} .0001567
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_4year_sib_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(45, 433267)   = {res}  3281.02
{txt}       Model {c |} {res} 25577.1358        45  568.380795   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75056.1875   433,267  .173233105   {txt}R-squared       ={res}    0.2542
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2541
{txt}       Total {c |} {res} 100633.323   433,312  .232242179   {txt}Root MSE        =   {res} .41621

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0147627{col 26}{space 2}   .00252{col 37}{space 1}    5.86{col 46}{space 3}0.000{col 54}{space 4} .0098236{col 67}{space 3} .0197018
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0172755{col 26}{space 2} .0025339{col 37}{space 1}    6.82{col 46}{space 3}0.000{col 54}{space 4} .0123092{col 67}{space 3} .0222418
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.019381{col 26}{space 2} .0025632{col 37}{space 1}   -7.56{col 46}{space 3}0.000{col 54}{space 4}-.0244047{col 67}{space 3}-.0143572
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000785{col 26}{space 2} 4.59e-06{col 37}{space 1}  -17.11{col 46}{space 3}0.000{col 54}{space 4}-.0000875{col 67}{space 3}-.0000695
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0901442{col 26}{space 2} .0012941{col 37}{space 1}  -69.66{col 46}{space 3}0.000{col 54}{space 4}-.0926805{col 67}{space 3}-.0876079
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0687116{col 26}{space 2} .0022863{col 37}{space 1}   30.05{col 46}{space 3}0.000{col 54}{space 4} .0642305{col 67}{space 3} .0731927
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0121448{col 26}{space 2} .0019742{col 37}{space 1}   -6.15{col 46}{space 3}0.000{col 54}{space 4}-.0160142{col 67}{space 3}-.0082754
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0407627{col 26}{space 2} .0037526{col 37}{space 1}   10.86{col 46}{space 3}0.000{col 54}{space 4} .0334076{col 67}{space 3} .0481177
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0090825{col 26}{space 2} .0038593{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0166465{col 67}{space 3}-.0015184
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0233142{col 26}{space 2} .0016112{col 37}{space 1}  -14.47{col 46}{space 3}0.000{col 54}{space 4}-.0264721{col 67}{space 3}-.0201563
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0228366{col 26}{space 2} .0034571{col 37}{space 1}   -6.61{col 46}{space 3}0.000{col 54}{space 4}-.0296124{col 67}{space 3}-.0160608
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0526477{col 26}{space 2} .0033825{col 37}{space 1}  -15.56{col 46}{space 3}0.000{col 54}{space 4}-.0592772{col 67}{space 3}-.0460182
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1375814{col 26}{space 2} .0025449{col 37}{space 1}   54.06{col 46}{space 3}0.000{col 54}{space 4} .1325935{col 67}{space 3} .1425692
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1243281{col 26}{space 2} .0024834{col 37}{space 1}   50.06{col 46}{space 3}0.000{col 54}{space 4} .1194607{col 67}{space 3} .1291955
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1200595{col 26}{space 2} .0026346{col 37}{space 1}   45.57{col 46}{space 3}0.000{col 54}{space 4} .1148958{col 67}{space 3} .1252232
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .093844{col 26}{space 2}  .003278{col 37}{space 1}   28.63{col 46}{space 3}0.000{col 54}{space 4} .0874191{col 67}{space 3} .1002688
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0221342{col 26}{space 2} .0013462{col 37}{space 1}   16.44{col 46}{space 3}0.000{col 54}{space 4} .0194957{col 67}{space 3} .0247728
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0165582{col 26}{space 2} .0013493{col 37}{space 1}   12.27{col 46}{space 3}0.000{col 54}{space 4} .0139136{col 67}{space 3} .0192027
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0174806{col 26}{space 2} .0014063{col 37}{space 1}   12.43{col 46}{space 3}0.000{col 54}{space 4} .0147242{col 67}{space 3}  .020237
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0181502{col 26}{space 2} .0014026{col 37}{space 1}   12.94{col 46}{space 3}0.000{col 54}{space 4} .0154011{col 67}{space 3} .0208992
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0111868{col 26}{space 2} .0006083{col 37}{space 1}  -18.39{col 46}{space 3}0.000{col 54}{space 4} -.012379{col 67}{space 3}-.0099946
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0093875{col 26}{space 2}  .000559{col 37}{space 1}  -16.79{col 46}{space 3}0.000{col 54}{space 4}-.0104831{col 67}{space 3}-.0082919
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0097445{col 26}{space 2} .0005554{col 37}{space 1}  -17.54{col 46}{space 3}0.000{col 54}{space 4}-.0108332{col 67}{space 3}-.0086559
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.008875{col 26}{space 2} .0009204{col 37}{space 1}   -9.64{col 46}{space 3}0.000{col 54}{space 4} -.010679{col 67}{space 3}-.0070711
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1182077{col 26}{space 2} .0025295{col 37}{space 1}   46.73{col 46}{space 3}0.000{col 54}{space 4}   .11325{col 67}{space 3} .1231655
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1245517{col 26}{space 2} .0025726{col 37}{space 1}   48.41{col 46}{space 3}0.000{col 54}{space 4} .1195094{col 67}{space 3} .1295939
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1209131{col 26}{space 2} .0027052{col 37}{space 1}   44.70{col 46}{space 3}0.000{col 54}{space 4}  .115611{col 67}{space 3} .1262152
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1394807{col 26}{space 2} .0032959{col 37}{space 1}   42.32{col 46}{space 3}0.000{col 54}{space 4} .1330209{col 67}{space 3} .1459406
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0158418{col 26}{space 2} .0016888{col 37}{space 1}    9.38{col 46}{space 3}0.000{col 54}{space 4} .0125319{col 67}{space 3} .0191518
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0166923{col 26}{space 2} .0016466{col 37}{space 1}   10.14{col 46}{space 3}0.000{col 54}{space 4}  .013465{col 67}{space 3} .0199196
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .012038{col 26}{space 2} .0017333{col 37}{space 1}    6.95{col 46}{space 3}0.000{col 54}{space 4} .0086408{col 67}{space 3} .0154352
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0302593{col 26}{space 2} .0013734{col 37}{space 1}   22.03{col 46}{space 3}0.000{col 54}{space 4} .0275674{col 67}{space 3} .0329512
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.009691{col 26}{space 2} .0006848{col 37}{space 1}  -14.15{col 46}{space 3}0.000{col 54}{space 4}-.0110333{col 67}{space 3}-.0083487
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0103686{col 26}{space 2}  .000727{col 37}{space 1}  -14.26{col 46}{space 3}0.000{col 54}{space 4}-.0117934{col 67}{space 3}-.0089437
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0089788{col 26}{space 2} .0007301{col 37}{space 1}  -12.30{col 46}{space 3}0.000{col 54}{space 4}-.0104097{col 67}{space 3}-.0075478
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0095443{col 26}{space 2} .0009048{col 37}{space 1}  -10.55{col 46}{space 3}0.000{col 54}{space 4}-.0113178{col 67}{space 3}-.0077709
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0785721{col 26}{space 2} .0024976{col 37}{space 1}  -31.46{col 46}{space 3}0.000{col 54}{space 4}-.0834673{col 67}{space 3}-.0736769
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .1397799{col 26}{space 2} .0026975{col 37}{space 1}   51.82{col 46}{space 3}0.000{col 54}{space 4} .1344929{col 67}{space 3} .1450669
{txt}eth_asian_~t {c |}{col 14}{res}{space 2}-8.79e-06{col 26}{space 2} .0000482{col 37}{space 1}   -0.18{col 46}{space 3}0.855{col 54}{space 4}-.0001033{col 67}{space 3} .0000858
{txt}eth_hispan~t {c |}{col 14}{res}{space 2} .0006485{col 26}{space 2}  .000048{col 37}{space 1}   13.52{col 46}{space 3}0.000{col 54}{space 4} .0005545{col 67}{space 3} .0007425
{txt}eth_black_~t {c |}{col 14}{res}{space 2} .0013075{col 26}{space 2}  .000089{col 37}{space 1}   14.69{col 46}{space 3}0.000{col 54}{space 4}  .001133{col 67}{space 3} .0014819
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}  1.74924{col 26}{space 2} .1288362{col 37}{space 1}   13.58{col 46}{space 3}0.000{col 54}{space 4} 1.496724{col 67}{space 3} 2.001755
{txt}educ~us_prop {c |}{col 14}{res}{space 2} 2.503256{col 26}{space 2} .1175778{col 37}{space 1}   21.29{col 46}{space 3}0.000{col 54}{space 4} 2.272807{col 67}{space 3} 2.733705
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}   .00075{col 26}{space 2} .0000734{col 37}{space 1}   10.22{col 46}{space 3}0.000{col 54}{space 4} .0006061{col 67}{space 3} .0008939
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 1.63e-06{col 26}{space 2} 3.34e-08{col 37}{space 1}   48.89{col 46}{space 3}0.000{col 54}{space 4} 1.57e-06{col 67}{space 3} 1.70e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6186015{col 26}{space 2} .0283409{col 37}{space 1}   21.83{col 46}{space 3}0.000{col 54}{space 4} .5630542{col 67}{space 3} .6741488
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_4year_both.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41621281 .07835309 .40877121 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0057800583   .7119900722          3445{txt}  {c |}
  2 {c |}  {res}.0055366738   .6816020879          2240{txt}  {c |}
  3 {c |}  {res}.0050837808   .6383457158          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0057800583{txt}  {c |}
  2 {c |}  {res}.0055366738{txt}  {c |}
  3 {c |}  {res}.0055366738{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}note: label truncated to 80 characters

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res} 12999.24
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0281
                                                {txt}Root MSE          =    {res} .41039

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4year_~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_4ye~h {c |}{col 14}{res}{space 2} 1.029821{col 26}{space 2} .0090324{col 37}{space 1}  114.01{col 46}{space 3}0.000{col 54}{space 4} 1.012101{col 67}{space 3} 1.047542
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000499{col 26}{space 2} .0002655{col 37}{space 1}   -0.19{col 46}{space 3}0.851{col 54}{space 4}-.0005708{col 67}{space 3} .0004709
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_4year_both.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   410.69
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0023
                                                {txt}Root MSE          =    {res} .03729

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4~s_both{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_4ye~s {c |}{col 14}{res}{space 2} .0257448{col 26}{space 2} .0012704{col 37}{space 1}   20.27{col 46}{space 3}0.000{col 54}{space 4} .0232525{col 67}{space 3} .0282371
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-8.75e-06{col 26}{space 2} .0000827{col 37}{space 1}   -0.11{col 46}{space 3}0.916{col 54}{space 4} -.000171{col 67}{space 3} .0001535
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_4year_sib_acs.ster} saved

Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   159.75
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1007
                                                {txt}Root MSE          =    {res} .04092

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4~b_both{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_4ye~b {c |}{col 14}{res}{space 2} .1728357{col 26}{space 2} .0136747{col 37}{space 1}   12.64{col 46}{space 3}0.000{col 54}{space 4} .1460078{col 67}{space 3} .1996636
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000522{col 26}{space 2} .0009243{col 37}{space 1}   -0.06{col 46}{space 3}0.955{col 54}{space 4}-.0018655{col 67}{space 3} .0017612
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_4year_acs_sib.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/outcome_va/va_enr_4year_sib_acs.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:     91.97 /        1 =      91.9680
{txt}
{com}. 
. //change directory back to my own personal directory
. cd $projdir 
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs_out.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Jul 2022, 22:16:37
{txt}{.-}
{smcl}
{txt}{sf}{ul off}