-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvareg
> s/va_sibling_out.smcl
  log type:  smcl
 opened on:  10 Nov 2021, 15:52:23

. 
. //include macros
. include do_files/sbac/macros_va.doh

. #delimit ;
delimiter now ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2019
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. #delimit cr
delimiter now cr
. 
. 
. #delimit ;
delimiter now ;
. #delimit cr
delimiter now cr
. macro list
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cst
vadtadir:       /home/research/ca_ed_lab/msnaven/common_core_va/data/sbac
projdir:        /home/research/ca_ed_lab/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2019
_test_score_min_year:
                2015
_sibling_out_xwalk:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/si
                > bling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/uf
                > amilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/si
                > blingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > va_dataset
_k12_test_scores_public:
                /home/research/ca_ed_lab/msnaven/data/public_access/clean/k12_t
                > est_scores
_k12_public_schools:
                /home/research/ca_ed_lab/msnaven/data/public_access/clean/k12_p
                > ublic_schools
_public_access: /home/research/ca_ed_lab/data/public_access
_k12_test_scores:
                /home/research/ca_ed_lab/msnaven/data/restricted_access/clean/k
                > 12_test_scores
_ca_ed_lab:     /home/research/ca_ed_lab
_common_core_va:
                /home/research/ca_ed_lab/msnaven/common_core_va
_mattdofiles:   /home/research/ca_ed_lab/msnaven/common_core_va/do_files/sbac
_matthomedir:   /home/research/ca_ed_lab/msnaven/common_core_va
_setlimit:      2
_1:             2
_0:             2

. 
. 
. timer on 1

. 
. 
. //load the VA grade 11 college outcomes sample
. use `va_g11_out_dataset', clear
(CST/SBAC Student Test Score Samples)

. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk'

    Result                      Number of obs
    -----------------------------------------
    Not matched                     4,172,662
        from master                   801,425  (_merge==1)
        from using                  3,371,237  (_merge==2)

    Matched                           801,938  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. compress
  (0 bytes saved)

. tempfile va_g11_out_sibling_dataset

. save `va_g11_out_sibling_dataset'
file /home/tmp/St241407.000001 saved as .dta format

. 
. 
. *****************************************************************************
> ***
. *********** VA estimates for VA samples matched to siblings sample
. *****************************************************************************
> ***
. if `setlimit' == 0 {
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 
> 1)
. }

. else {
.   local drift_limit = `setlimit'
. }

. 
. foreach outcome in enr enr_2year enr_4year {
  2.   use `va_g11_out_sibling_dataset' if touse_g11_`outcome'==1 & sibling_out
> _sample == 1, clear
  3. 
.   ***********************Overall value added
.   **** No Peer Controls
.   ** No TFX
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit')
  4.   rename tv va_cfr_g11_`outcome'
  5.   rename score_r g11_`outcome'_r
  6. 
. 
.   ** TFX
.         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 tfx_resid(school_id) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
  7.         rename tv va_tfx_g11_`outcome'
  8.         drop score_r
  9. 
.   corr va_cfr_g11_`outcome' va_tfx_g11_`outcome'
 10. 
. 
.   *** No TFX, without sibling college going controls
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit')
 11.   rename tv va_cfr_g11_`outcome'_nosibctrl
 12.   rename score_r g11_`outcome'_r_nosibctrl
 13. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
.   **** Peer Controls
.         ** No TFX
.         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                         `peer_demographic_controls' ///
>                         `peer_ela_score_controls' ///
>                         `peer_math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
 14.         rename tv va_cfr_g11_`outcome'_peer
 15.         rename score_r g11_`outcome'_r_peer
 16. 
.         ** TFX
.         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                         `peer_demographic_controls' ///
>                         `peer_ela_score_controls' ///
>                         `peer_math_score_controls' ///
>                 ) ///
>                 tfx_resid(school_id) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
 17.         rename tv va_tfx_g11_`outcome'_peer
 18.         drop score_r
 19. 
.         corr va_cfr_g11_`outcome'_peer va_tfx_g11_`outcome'_peer
 20. 
. 
. 
. 
. 
.   **************** Specification Test
.   **** No Peer Controls
.   reg g11_`outcome'_r va_cfr_g11_`outcome', cluster(school_id)
 21.   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g1
> 1_`outcome'_sibling.ster, replace
 22. 
.   **** Peer Controls
.   reg g11_`outcome'_r_peer va_cfr_g11_`outcome'_peer, cluster(school_id)
 23.   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g1
> 1_`outcome'_peer_sibling.ster, replace
 24. 
. 
. 
.   ****** sibling sample without sibling controls
.   reg g11_`outcome'_r_nosibctrl va_cfr_g11_`outcome'_nosibctrl, cluster(schoo
> l_id)
 25.   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g1
> 1_`outcome'_sibling_nocontrol.ster, replace
 26. 
. 
. 
. 
.   **************Do we need deep knowledge VA with sibling controls??
. 
. 
. 
. 
. 
. 
. 
. 
.   **************** Save Value Added Estimates
.   collapse (firstnm) va_* ///
>     (mean) g11_`outcome'* ///
>     (sum) n_g11_`outcome' = touse_g11_`outcome' ///
>     , by(school_id cdscode grade year)
 27. 
.   save $projdir/dta/common_core_va/outcome_va/va_g11_`outcome'_sibling.dta, r
> eplace
 28. 
. 
. }
(CST/SBAC Student Test Score Samples)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   276,999
-------------+----------------------------------   F(31, 276967)   =   1558.56
       Model |  9430.34958        31  304.204825   Prob > F        =    0.0000
    Residual |  54059.2241   276,967  .195182907   R-squared       =    0.1485
-------------+----------------------------------   Adj R-squared   =    0.1484
       Total |  63489.5737   276,998  .229205892   Root MSE        =     .4418

-------------------------------------------------------------------------------
          enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.1762352   .0024883   -70.83   0.000    -.1811121   -.1713583
        2017  |   -.607357   .0177258   -34.26   0.000     -.642099   -.5726149
              |
1.has_o~2year |   .0247435   .0035532     6.96   0.000     .0177793    .0317077
1.has_o~4year |   .0726363   .0040416    17.97   0.000      .064715    .0805577
          age |  -.0002051   5.48e-06   -37.41   0.000    -.0002159   -.0001944
              |
         male |
        Male  |   -.065806   .0017146   -38.38   0.000    -.0691666   -.0624455
  1.eth_asian |   .0865173   .0028782    30.06   0.000     .0808762    .0921585
1.eth_hispa~c |   -.001816    .002345    -0.77   0.439    -.0064122    .0027802
  1.eth_black |   .0186584   .0044227     4.22   0.000       .00999    .0273268
  1.eth_other |  -.0020038   .0052539    -0.38   0.703    -.0123014    .0082937
              |
econ_disadv~e |
Economic D..  |  -.0680975    .001991   -34.20   0.000    -.0719997   -.0641952
              |
limited_eng~f |
Limited En..  |   -.046673   .0041259   -11.31   0.000    -.0547596   -.0385864
              |
     disabled |
    Disabled  |   .0093883   .0046975     2.00   0.046     .0001813    .0185953
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .0836229   .0021425    39.03   0.000     .0794237     .087822
        2016  |   .0691556   .0030495    22.68   0.000     .0631787    .0751326
        2017  |  -.0209736   .0306112    -0.69   0.493    -.0809708    .0390235
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0157796   .0011086   -14.23   0.000    -.0179523   -.0136068
        2016  |  -.0079283   .0014534    -5.45   0.000    -.0107769   -.0050796
        2017  |   .0113295   .0126733     0.89   0.371    -.0135097    .0361688
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0013549   .0005113    -2.65   0.008     -.002357   -.0003528
        2016  |  -.0011664   .0007079    -1.65   0.099    -.0025538     .000221
        2017  |  -.0002814   .0069722    -0.04   0.968    -.0139467    .0133839
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .0579079   .0021211    27.30   0.000     .0537506    .0620651
        2016  |    .048886   .0032012    15.27   0.000     .0426117    .0551603
        2017  |   -.022132   .0311719    -0.71   0.478     -.083228     .038964
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0153965   .0013864   -11.11   0.000    -.0181138   -.0126792
        2016  |  -.0105199   .0017433    -6.03   0.000    -.0139368   -.0071031
        2017  |   -.010858   .0158828    -0.68   0.494    -.0419879    .0202719
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0006836   .0005718     1.20   0.232    -.0004372    .0018043
        2016  |    .000051   .0009043     0.06   0.955    -.0017215    .0018235
        2017  |   .0033712   .0087769     0.38   0.701    -.0138312    .0205736
              |
        _cons |    2.02621   .0335551    60.38   0.000     1.960443    2.091978
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.4417951 .10718175 .42859652 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                  1              2              3
    +----------------------------------------------+
  1 |   .0050469197    .3632650974           1244  |
  2 |  -.0047111818   -.2843127945             62  |
    +----------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                  1
    +----------------+
  1 |   .0050469197  |
  2 |  -.0047111818  |
    +----------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

Linear regression, absorbing indicators            Number of obs     = 276,999
Absorbed variable: school_id                       No. of categories =   1,295
                                                   F(31, 275673)     = 1034.09
                                                   Prob > F          =  0.0000
                                                   R-squared         =  0.1920
                                                   Adj R-squared     =  0.1881
                                                   Root MSE          =  0.4314

-------------------------------------------------------------------------------
          enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.1821017   .0024663   -73.84   0.000    -.1869355   -.1772678
        2017  |  -.5397904   .0189102   -28.54   0.000     -.576854   -.5027269
              |
1.has_o~2year |   .0182027   .0034877     5.22   0.000     .0113669    .0250386
1.has_o~4year |   .0685067   .0039633    17.29   0.000     .0607386    .0762747
          age |  -.0001774   5.49e-06   -32.32   0.000    -.0001882   -.0001667
              |
         male |
        Male  |  -.0680184   .0016809   -40.46   0.000     -.071313   -.0647238
  1.eth_asian |    .061984     .00314    19.74   0.000     .0558296    .0681384
1.eth_hispa~c |    .013577   .0025283     5.37   0.000     .0086215    .0185325
  1.eth_black |   .0418421   .0045379     9.22   0.000     .0329479    .0507362
  1.eth_other |  -.0037188   .0052002    -0.72   0.475     -.013911    .0064733
              |
econ_disadv~e |
Economic D..  |  -.0354487   .0021135   -16.77   0.000    -.0395911   -.0313064
              |
limited_eng~f |
Limited En..  |  -.0485834   .0041054   -11.83   0.000    -.0566299   -.0405368
              |
     disabled |
    Disabled  |  -.0109227   .0046401    -2.35   0.019    -.0200173   -.0018282
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .0720756   .0021199    34.00   0.000     .0679207    .0762306
        2016  |   .0503709   .0030069    16.75   0.000     .0444775    .0562643
        2017  |  -.0456134   .0301089    -1.51   0.130     -.104626    .0133993
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0150898   .0010902   -13.84   0.000    -.0172266    -.012953
        2016  |  -.0081968   .0014292    -5.74   0.000     -.010998   -.0053955
        2017  |   .0203961   .0124664     1.64   0.102    -.0040376    .0448299
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0011569    .000501    -2.31   0.021    -.0021388    -.000175
        2016  |  -.0009022   .0006935    -1.30   0.193    -.0022614    .0004569
        2017  |    .000086   .0068265     0.01   0.990    -.0132936    .0134657
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .0556325   .0020959    26.54   0.000     .0515245    .0597404
        2016  |   .0394969   .0031477    12.55   0.000     .0333274    .0456663
        2017  |  -.0421042   .0306327    -1.37   0.169    -.1021434     .017935
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0128865    .001362    -9.46   0.000     -.015556    -.010217
        2016  |  -.0102911   .0017109    -6.01   0.000    -.0136444   -.0069377
        2017  |  -.0106531   .0155732    -0.68   0.494    -.0411761    .0198699
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0003227   .0005606     0.58   0.565     -.000776    .0014215
        2016  |    .000386   .0008859     0.44   0.663    -.0013503    .0021224
        2017  |    .003822   .0086091     0.44   0.657    -.0130516    .0206957
              |
        _cons |   1.835904   .0335891    54.66   0.000      1.77007    1.901737
-------------------------------------------------------------------------------
F test of absorbed indicators: F(1294, 275673) = 11.458       Prob > F = 0.000
Standard deviations: total, classes, students, teachers same year
.44321475 .11690977 .42751775 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                  1              2              3
    +----------------------------------------------+
  1 |   .0068623666    .4321694439           1244  |
  2 |  -.0007339555   -.0422789169             62  |
    +----------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                  1
    +----------------+
  1 |   .0068623666  |
  2 |  -.0007339555  |
    +----------------+
-------------------------------------------------------------------------------
(obs=275,290)

             | va_cfr~r va_tfx~r
-------------+------------------
va_cfr_g11~r |   1.0000
va_tfx_g11~r |   0.9793   1.0000

-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   276,999
-------------+----------------------------------   F(29, 276969)   =   1650.40
       Model |  9354.78406        29  322.578761   Prob > F        =    0.0000
    Residual |  54134.7896   276,969  .195454327   R-squared       =    0.1473
-------------+----------------------------------   Adj R-squared   =    0.1473
       Total |  63489.5737   276,998  .229205892   Root MSE        =     .4421

-------------------------------------------------------------------------------
          enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.1761625   .0024899   -70.75   0.000    -.1810426   -.1712823
        2017  |   -.606998   .0177381   -34.22   0.000    -.6417642   -.5722318
              |
          age |  -.0002081   5.48e-06   -37.95   0.000    -.0002189   -.0001974
              |
         male |
        Male  |  -.0657504   .0017158   -38.32   0.000    -.0691133   -.0623875
  1.eth_asian |   .0885292   .0028781    30.76   0.000     .0828882    .0941702
1.eth_hispa~c |  -.0023366   .0023461    -1.00   0.319    -.0069349    .0022616
  1.eth_black |   .0183466   .0044258     4.15   0.000     .0096723     .027021
  1.eth_other |  -.0028786   .0052574    -0.55   0.584    -.0131829    .0074258
              |
econ_disadv~e |
Economic D..  |  -.0675442    .001992   -33.91   0.000    -.0714485   -.0636399
              |
limited_eng~f |
Limited En..  |  -.0465404   .0041287   -11.27   0.000    -.0546326   -.0384482
              |
     disabled |
    Disabled  |   .0089085   .0047007     1.90   0.058    -.0003048    .0181218
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .0836372   .0021435    39.02   0.000      .079436    .0878384
        2016  |   .0690125   .0030513    22.62   0.000     .0630321     .074993
        2017  |  -.0218587   .0306324    -0.71   0.475    -.0818974      .03818
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0159354   .0011092   -14.37   0.000    -.0181095   -.0137613
        2016  |  -.0079989   .0014544    -5.50   0.000    -.0108494   -.0051484
        2017  |   .0112577   .0126821     0.89   0.375    -.0135987    .0361142
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0013704   .0005116    -2.68   0.007    -.0023732   -.0003677
        2016  |  -.0011485   .0007083    -1.62   0.105    -.0025368    .0002399
        2017  |  -.0002898   .0069771    -0.04   0.967    -.0139646     .013385
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .0587212    .002122    27.67   0.000     .0545622    .0628802
        2016  |   .0498695    .003203    15.57   0.000     .0435917    .0561473
        2017  |  -.0198605   .0311933    -0.64   0.524    -.0809985    .0412775
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   -.015532   .0013873   -11.20   0.000     -.018251   -.0128129
        2016  |  -.0105772   .0017445    -6.06   0.000    -.0139964    -.007158
        2017  |  -.0107097   .0158938    -0.67   0.500    -.0418611    .0204418
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0006353   .0005722     1.11   0.267    -.0004862    .0017568
        2016  |  -.0000142    .000905    -0.02   0.987    -.0017879    .0017595
        2017  |   .0030323   .0087829     0.35   0.730     -.014182    .0202466
              |
        _cons |    2.04904   .0335548    61.07   0.000     1.983274    2.114807
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.44210217 .10750853 .42883125 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                  1              2              3
    +----------------------------------------------+
  1 |    .005095066    .3645667618           1244  |
  2 |  -.0045945096   -.2768012914             62  |
    +----------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                  1
    +----------------+
  1 |    .005095066  |
  2 |  -.0045945096  |
    +----------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   276,999
-------------+----------------------------------   F(58, 276940)   =    910.03
       Model |  10163.4152        58  175.231296   Prob > F        =    0.0000
    Residual |  53326.1585   276,940  .192554916   R-squared       =    0.1601
-------------+----------------------------------   Adj R-squared   =    0.1599
       Total |  63489.5737   276,998  .229205892   Root MSE        =    .43881

-------------------------------------------------------------------------------
          enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.1799261   .0027656   -65.06   0.000    -.1853466   -.1745055
        2017  |  -.6299318   .0206591   -30.49   0.000     -.670423   -.5894406
              |
1.has_o~2year |     .02421   .0035308     6.86   0.000     .0172897    .0311304
1.has_o~4year |   .0723277   .0040156    18.01   0.000     .0644572    .0801982
          age |  -.0001881   5.56e-06   -33.82   0.000     -.000199   -.0001772
              |
         male |
        Male  |  -.0681768   .0017046   -40.00   0.000    -.0715176   -.0648359
  1.eth_asian |    .064234   .0031801    20.20   0.000      .058001     .070467
1.eth_hispa~c |    .012025   .0025607     4.70   0.000     .0070061    .0170439
  1.eth_black |   .0419526   .0045955     9.13   0.000     .0329455    .0509597
  1.eth_other |  -.0039018   .0052627    -0.74   0.458    -.0142166     .006413
              |
econ_disadv~e |
Economic D..  |   -.038791   .0021565   -17.99   0.000    -.0430176   -.0345644
              |
limited_eng~f |
Limited En..  |  -.0532006   .0041474   -12.83   0.000    -.0613293   -.0450719
              |
     disabled |
    Disabled  |  -.0071477   .0046869    -1.53   0.127    -.0163338    .0020385
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .0732744   .0021645    33.85   0.000      .069032    .0775168
        2016  |   .0530106   .0030942    17.13   0.000     .0469461    .0590751
        2017  |  -.0079548   .0309569    -0.26   0.797    -.0686294    .0527199
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0139501   .0011065   -12.61   0.000    -.0161188   -.0117814
        2016  |  -.0068857   .0014531    -4.74   0.000    -.0097338   -.0040376
        2017  |   .0028064   .0128696     0.22   0.827    -.0224177    .0280305
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0016139   .0005085    -3.17   0.002    -.0026104   -.0006173
        2016  |  -.0012297   .0007041    -1.75   0.081    -.0026096    .0001503
        2017  |   .0017843   .0069682     0.26   0.798    -.0118732    .0154419
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .0548647   .0021329    25.72   0.000     .0506843    .0590451
        2016  |   .0462865   .0032118    14.41   0.000     .0399914    .0525815
        2017  |  -.0106411   .0312147    -0.34   0.733    -.0718211    .0505388
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0129781   .0013817    -9.39   0.000    -.0156861   -.0102701
        2016  |  -.0087871   .0017368    -5.06   0.000    -.0121912   -.0053829
        2017  |  -.0092065   .0158467    -0.58   0.561    -.0402655    .0218526
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0001313   .0005687     0.23   0.817    -.0009834     .001246
        2016  |  -.0003313    .000899    -0.37   0.712    -.0020933    .0014306
        2017  |   .0027534   .0087375     0.32   0.753    -.0143718    .0198787
              |
     peer_age |  -.0000677   .0000178    -3.81   0.000    -.0001026   -.0000329
    peer_male |   .2619877   .0242101    10.82   0.000     .2145366    .3094388
peer_eth_as~n |    .144081   .0084374    17.08   0.000     .1275439    .1606181
peer_eth_hi~c |   .0750967    .007841     9.58   0.000     .0597286    .0904648
peer_eth_bl~k |  -.0297012   .0146211    -2.03   0.042    -.0583581   -.0010443
peer_eth_ot~r |   .0446258   .0340253     1.31   0.190    -.0220629    .1113144
peer_econ_d~e |  -.0360488   .0076229    -4.73   0.000    -.0509895   -.0211081
peer_limite~f |   .0859101   .0179531     4.79   0.000     .0507226    .1210976
peer_disabled |  -.0331927   .0286715    -1.16   0.247    -.0893881    .0230028
              |
         year#|
           c. |
peer_prior_e~ |
        2015  |    .113817   .0104032    10.94   0.000      .093427     .134207
        2016  |   .1692856   .0139726    12.12   0.000     .1418996    .1966716
        2017  |   -.150829   .2861323    -0.53   0.598    -.7116403    .4099824
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |   .0021267   .0116866     0.18   0.856    -.0207788    .0250322
        2016  |   .1337601   .0155959     8.58   0.000     .1031925    .1643277
        2017  |   .1529782   .2354017     0.65   0.516    -.3084027    .6143592
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |    .033778   .0126398     2.67   0.008     .0090043    .0585517
        2016  |    .068144   .0193873     3.51   0.000     .0301455    .1061425
        2017  |   .1048108   .3113222     0.34   0.736    -.5053721    .7149936
              |
         year#|
           c. |
peer_prior_m~ |
        2015  |   .0235826   .0092801     2.54   0.011     .0053938    .0417714
        2016  |  -.0056792   .0135642    -0.42   0.675    -.0322646    .0209062
        2017  |   .1249019   .2824085     0.44   0.658     -.428611    .6784148
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   -.094466   .0135008    -7.00   0.000    -.1209273   -.0680048
        2016  |  -.1827445   .0175467   -10.41   0.000    -.2171355   -.1483536
        2017  |   .1207522   .2578623     0.47   0.640    -.3846509    .6261553
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |  -.0071034    .009444    -0.75   0.452    -.0256133    .0114065
        2016  |  -.0656549   .0183084    -3.59   0.000    -.1015389    -.029771
        2017  |  -.3372523   .2964617    -1.14   0.255     -.918309    .2438044
              |
        _cons |   2.138866   .1104123    19.37   0.000     1.922461    2.355271
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.4388108 .09854271 .42760291 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                  1              2              3
    +----------------------------------------------+
  1 |   .0035576195    .2947533939           1244  |
  2 |   -.001167432   -.1005504189             62  |
    +----------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0035576195  |
  2 |  -.001167432  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

Linear regression, absorbing indicators            Number of obs     = 276,999
Absorbed variable: school_id                       No. of categories =   1,295
                                                   F(58, 275646)     =  565.05
                                                   Prob > F          =  0.0000
                                                   R-squared         =  0.1939
                                                   Adj R-squared     =  0.1899
                                                   Root MSE          =  0.4309

-------------------------------------------------------------------------------
          enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.1927842   .0029555   -65.23   0.000     -.198577   -.1869915
        2017  |  -.6521991    .022775   -28.64   0.000    -.6968375   -.6075608
              |
1.has_o~2year |   .0182821    .003484     5.25   0.000     .0114535    .0251106
1.has_o~4year |   .0682738   .0039591    17.24   0.000     .0605142    .0760334
          age |  -.0001821   5.50e-06   -33.09   0.000    -.0001929   -.0001713
              |
         male |
        Male  |   -.067632   .0016809   -40.24   0.000    -.0709265   -.0643375
  1.eth_asian |   .0616151   .0031399    19.62   0.000     .0554609    .0677692
1.eth_hispa~c |   .0141487   .0025282     5.60   0.000     .0091935     .019104
  1.eth_black |   .0423848   .0045358     9.34   0.000     .0334949    .0512748
  1.eth_other |  -.0027618   .0051953    -0.53   0.595    -.0129443    .0074208
              |
econ_disadv~e |
Economic D..  |  -.0376217   .0021236   -17.72   0.000    -.0417839   -.0334594
              |
limited_eng~f |
Limited En..  |   -.048663   .0041014   -11.87   0.000    -.0567016   -.0406244
              |
     disabled |
    Disabled  |  -.0100737   .0046366    -2.17   0.030    -.0191613   -.0009861
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .0725586   .0021316    34.04   0.000     .0683806    .0767366
        2016  |   .0478808    .003049    15.70   0.000     .0419048    .0538568
        2017  |  -.0080322   .0304986    -0.26   0.792    -.0678086    .0517441
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0146001   .0010907   -13.39   0.000    -.0167378   -.0124624
        2016  |   -.008991   .0014328    -6.27   0.000    -.0117993   -.0061827
        2017  |   .0010347     .01266     0.08   0.935    -.0237785    .0258479
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0013014   .0005007    -2.60   0.009    -.0022827   -.0003201
        2016  |  -.0007437   .0006933    -1.07   0.283    -.0021026    .0006153
        2017  |   .0036819   .0068587     0.54   0.591     -.009761    .0171247
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .0545064   .0021007    25.95   0.000     .0503891    .0586237
        2016  |   .0402121   .0031643    12.71   0.000       .03401    .0464141
        2017  |  -.0112055   .0307825    -0.36   0.716    -.0715384    .0491274
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0126394   .0013617    -9.28   0.000    -.0153083   -.0099705
        2016  |  -.0105779   .0017121    -6.18   0.000    -.0139335   -.0072222
        2017  |  -.0041414   .0156306    -0.26   0.791     -.034777    .0264941
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0003014   .0005602     0.54   0.591    -.0007965    .0013994
        2016  |   .0005899   .0008854     0.67   0.505    -.0011454    .0023253
        2017  |    .000839    .008624     0.10   0.922    -.0160637    .0177417
              |
     peer_age |   .0005281   .0000817     6.46   0.000      .000368    .0006882
    peer_male |   .0328019   .0466489     0.70   0.482    -.0586286    .1242324
peer_eth_as~n |   .0115882   .0932206     0.12   0.901    -.1711217    .1942981
peer_eth_hi~c |   -.029366   .0634223    -0.46   0.643    -.1536719    .0949399
peer_eth_bl~k |   .0364272    .108498     0.34   0.737    -.1762258    .2490802
peer_eth_ot~r |   .4548766   .0889316     5.11   0.000     .2805732      .62918
peer_econ_d~e |   .1696996   .0165084    10.28   0.000     .1373436    .2020557
peer_limite~f |   .2760359   .0630859     4.38   0.000     .1523892    .3996826
peer_disabled |   .1997552   .0692633     2.88   0.004      .064001    .3355093
              |
         year#|
           c. |
peer_prior_e~ |
        2015  |   .1491651   .0289759     5.15   0.000     .0923731    .2059571
        2016  |   .2085757   .0288485     7.23   0.000     .1520334     .265118
        2017  |   .0048317   .3240618     0.01   0.988    -.6303205    .6399838
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.1845532   .0294874    -6.26   0.000    -.2423476   -.1267587
        2016  |  -.0475615   .0295504    -1.61   0.108    -.1054794    .0103564
        2017  |  -.1374205   .2660544    -0.52   0.605    -.6588798    .3840388
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.1176258   .0348787    -3.37   0.001    -.1859872   -.0492645
        2016  |  -.0982831   .0382079    -2.57   0.010    -.1731696   -.0233966
        2017  |   .1347276   .3525375     0.38   0.702    -.5562364    .8256915
              |
         year#|
           c. |
peer_prior_m~ |
        2015  |   -.102491   .0257389    -3.98   0.000    -.1529385   -.0520436
        2016  |  -.1805081   .0266058    -6.78   0.000    -.2326547   -.1283616
        2017  |   -.164151   .3162475    -0.52   0.604    -.7839874    .4556854
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   .1810309   .0321752     5.63   0.000     .1179685    .2440933
        2016  |   .0911811   .0310175     2.94   0.003     .0303877    .1519744
        2017  |   .5180406   .2921499     1.77   0.076    -.0545652    1.090646
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   .2813329   .0326634     8.61   0.000     .2173135    .3453523
        2016  |    .273147   .0388215     7.04   0.000     .1970579     .349236
        2017  |  -.1209436   .3199068    -0.38   0.705    -.7479521    .5060649
              |
        _cons |  -1.539808   .5031482    -3.06   0.002    -2.525964   -.5536509
-------------------------------------------------------------------------------
F test of absorbed indicators: F(1294, 275646) = 8.930        Prob > F = 0.000
Standard deviations: total, classes, students, teachers same year
.45398631 .15278635 .42750427 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0171578528   .6721185385          1244  |
  2 |  .0263971828   .7441215958            62  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0171578528  |
  2 |  .0263971828  |
    +---------------+
-------------------------------------------------------------------------------
(obs=275,290)

             | va_cf~er va_tf~er
-------------+------------------
va_cfr_g1~er |   1.0000
va_tfx_g1~er |   0.6815   1.0000


Linear regression                               Number of obs     =    275,290
                                                F(1, 1183)        =     181.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0106
                                                Root MSE          =      .4392

                           (Std. err. adjusted for 1,184 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
    g11_enr_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11~nr |   .9433521   .0700758    13.46   0.000     .8058653    1.080839
        _cons |    .008898   .0018493     4.81   0.000     .0052698    .0125262
-------------------------------------------------------------------------------
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outcome_va/s
> pec_test_va_cfr_g11_enr_sibling.ster saved

Linear regression                               Number of obs     =    275,290
                                                F(1, 1183)        =     101.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0049
                                                Root MSE          =     .43752

                           (Std. err. adjusted for 1,184 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
g11_enr_r_p~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11~er |   .8352693   .0828098    10.09   0.000     .6727988    .9977398
        _cons |   .0071123    .001992     3.57   0.000      .003204    .0110206
-------------------------------------------------------------------------------
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outcome_va/s
> pec_test_va_cfr_g11_enr_peer_sibling.ster saved

Linear regression                               Number of obs     =    275,290
                                                F(1, 1183)        =     180.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0107
                                                Root MSE          =     .43949

                           (Std. err. adjusted for 1,184 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
g11_enr_r_n~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11_~l |   .9425976    .070117    13.44   0.000     .8050302    1.080165
        _cons |   .0089286   .0018513     4.82   0.000     .0052964    .0125607
-------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outco
> me_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.ster not found)
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outcome_va/s
> pec_test_va_cfr_g11_enr_sibling_nocontrol.ster saved
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/outcome_va
    > /va_g11_enr_sibling.dta saved
(CST/SBAC Student Test Score Samples)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   276,999
-------------+----------------------------------   F(31, 276967)   =    463.16
       Model |  3109.27822        31  100.299297   Prob > F        =    0.0000
    Residual |   59978.101   276,967  .216553239   R-squared       =    0.0493
-------------+----------------------------------   Adj R-squared   =    0.0492
       Total |  63087.3792   276,998  .227753916   Root MSE        =    .46535

-------------------------------------------------------------------------------
    enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0897282   .0026209   -34.24   0.000    -.0948652   -.0845913
        2017  |  -.3533847    .018671   -18.93   0.000    -.3899793   -.3167901
              |
1.has_o~2year |    .089445   .0037427    23.90   0.000     .0821095    .0967805
1.has_o~4year |  -.0764233   .0042571   -17.95   0.000    -.0847671   -.0680795
          age |  -.0001245   5.78e-06   -21.55   0.000    -.0001358   -.0001131
              |
         male |
        Male  |   .0190289    .001806    10.54   0.000     .0154892    .0225687
  1.eth_asian |   .0004293   .0030317     0.14   0.887    -.0055126    .0063713
1.eth_hispa~c |   .0077931   .0024701     3.16   0.002     .0029519    .0126344
  1.eth_black |   -.026705   .0046585    -5.73   0.000    -.0358356   -.0175743
  1.eth_other |   .0140962   .0055341     2.55   0.011     .0032495    .0249429
              |
econ_disadv~e |
Economic D..  |  -.0306755   .0020971   -14.63   0.000    -.0347859   -.0265652
              |
limited_eng~f |
Limited En..  |  -.0308299   .0043459    -7.09   0.000    -.0393477   -.0223121
              |
     disabled |
    Disabled  |   .0389495    .004948     7.87   0.000     .0292515    .0486475
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |  -.0573695   .0022567   -25.42   0.000    -.0617925   -.0529464
        2016  |  -.0137728   .0032121    -4.29   0.000    -.0200685   -.0074771
        2017  |   .0008567   .0322435     0.03   0.979    -.0623396    .0640531
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0392381   .0011677   -33.60   0.000    -.0415267   -.0369495
        2016  |  -.0262684   .0015309   -17.16   0.000    -.0292689   -.0232678
        2017  |   .0017169    .013349     0.13   0.898    -.0244469    .0278806
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0098585   .0005385    18.31   0.000      .008803     .010914
        2016  |   .0036327   .0007456     4.87   0.000     .0021713     .005094
        2017  |    .000358    .007344     0.05   0.961     -.014036     .014752
              |
         year#|
           c. |
prior_math_~e |
        2015  |  -.0625644   .0022342   -28.00   0.000    -.0669434   -.0581855
        2016  |  -.0264575   .0033719    -7.85   0.000    -.0330664   -.0198487
        2017  |  -.0291298    .032834    -0.89   0.375    -.0934836     .035224
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0332698   .0014603   -22.78   0.000     -.036132   -.0304076
        2016  |  -.0250681   .0018363   -13.65   0.000    -.0286671    -.021469
        2017  |  -.0082772   .0167297    -0.49   0.621     -.041067    .0245127
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0107714   .0006023    17.88   0.000     .0095909    .0119519
        2016  |   .0053812   .0009526     5.65   0.000     .0035143    .0072482
        2017  |   .0066744   .0092449     0.72   0.470    -.0114453    .0247941
              |
        _cons |   1.208036   .0353444    34.18   0.000     1.138762     1.27731
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.46535281 .09368361 .45582521 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                  1              2              3
    +----------------------------------------------+
  1 |   .0065039604    .5926432719           1244  |
  2 |   -.000472279   -.0384788752             62  |
    +----------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0065039604  |
  2 |  -.000472279  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

Linear regression, absorbing indicators            Number of obs     = 276,999
Absorbed variable: school_id                       No. of categories =   1,295
                                                   F(31, 275673)     =  452.54
                                                   Prob > F          =  0.0000
                                                   R-squared         =  0.0905
                                                   Adj R-squared     =  0.0861
                                                   Root MSE          =  0.4562

-------------------------------------------------------------------------------
    enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0877682   .0026083   -33.65   0.000    -.0928804   -.0826559
        2017  |  -.3118855   .0199993   -15.59   0.000    -.3510837   -.2726874
              |
1.has_o~2year |   .0731374   .0036886    19.83   0.000     .0659079     .080367
1.has_o~4year |  -.0668687   .0041916   -15.95   0.000    -.0750841   -.0586533
          age |  -.0001049   5.80e-06   -18.07   0.000    -.0001163   -.0000935
              |
         male |
        Male  |   .0170915   .0017778     9.61   0.000     .0136071    .0205759
  1.eth_asian |  -.0166627   .0033209    -5.02   0.000    -.0231716   -.0101539
1.eth_hispa~c |   .0299338    .002674    11.19   0.000     .0246929    .0351747
  1.eth_black |   .0047012   .0047992     0.98   0.327    -.0047052    .0141076
  1.eth_other |   .0098656   .0054997     1.79   0.073    -.0009135    .0206448
              |
econ_disadv~e |
Economic D..  |  -.0058174   .0022352    -2.60   0.009    -.0101982   -.0014365
              |
limited_eng~f |
Limited En..  |  -.0353449   .0043419    -8.14   0.000    -.0438548   -.0268349
              |
     disabled |
    Disabled  |   .0298283   .0049074     6.08   0.000       .02021    .0394466
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |  -.0640294    .002242   -28.56   0.000    -.0684237   -.0596351
        2016  |  -.0215569     .00318    -6.78   0.000    -.0277897   -.0153241
        2017  |  -.0225353    .031843    -0.71   0.479    -.0849467     .039876
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0364946    .001153   -31.65   0.000    -.0387544   -.0342348
        2016  |  -.0222709   .0015116   -14.73   0.000    -.0252335   -.0193082
        2017  |     .01287   .0131843     0.98   0.329     -.012971    .0387109
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0096454   .0005298    18.21   0.000      .008607    .0106839
        2016  |   .0037337   .0007334     5.09   0.000     .0022963    .0051712
        2017  |  -.0004595   .0072196    -0.06   0.949    -.0146098    .0136907
              |
         year#|
           c. |
prior_math_~e |
        2015  |  -.0626908   .0022166   -28.28   0.000    -.0670353   -.0583463
        2016  |  -.0299639    .003329    -9.00   0.000    -.0364887   -.0234391
        2017  |  -.0567988   .0323969    -1.75   0.080    -.1202958    .0066982
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0295337   .0014404   -20.50   0.000    -.0323569   -.0267105
        2016  |  -.0230398   .0018095   -12.73   0.000    -.0265863   -.0194933
        2017  |  -.0091093   .0164701    -0.55   0.580    -.0413902    .0231716
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |    .009978   .0005929    16.83   0.000      .008816    .0111401
        2016  |   .0051764   .0009369     5.52   0.000     .0033401    .0070127
        2017  |   .0083491   .0091049     0.92   0.359    -.0094963    .0261945
              |
        _cons |   1.060303   .0355235    29.85   0.000     .9906779    1.129928
-------------------------------------------------------------------------------
F test of absorbed indicators: F(1294, 275673) = 9.648        Prob > F = 0.000
Standard deviations: total, classes, students, teachers same year
.46618356 .10012049 .4553054 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0079211296   .6419880714          1244  |
  2 |  .0032815459   .2347768789            62  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0079211296  |
  2 |  .0032815459  |
    +---------------+
-------------------------------------------------------------------------------
(obs=275,290)

             | va_cfr~r va_tfx~r
-------------+------------------
va_cfr_g11~r |   1.0000
va_tfx_g11~r |   0.9869   1.0000

-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   276,999
-------------+----------------------------------   F(29, 276969)   =    464.48
       Model |  2925.87132        29  100.892114   Prob > F        =    0.0000
    Residual |  60161.5079   276,969  .217213868   R-squared       =    0.0464
-------------+----------------------------------   Adj R-squared   =    0.0463
       Total |  63087.3792   276,998  .227753916   Root MSE        =    .46606

-------------------------------------------------------------------------------
    enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0891668   .0026249   -33.97   0.000    -.0943114   -.0840221
        2017  |  -.3539395   .0186994   -18.93   0.000    -.3905899   -.3172892
              |
          age |  -.0001252   5.78e-06   -21.66   0.000    -.0001366   -.0001139
              |
         male |
        Male  |   .0189908   .0018088    10.50   0.000     .0154457     .022536
  1.eth_asian |   .0007734   .0030341     0.25   0.799    -.0051734    .0067201
1.eth_hispa~c |   .0093242   .0024732     3.77   0.000     .0044768    .0141717
  1.eth_black |  -.0267213   .0046656    -5.73   0.000    -.0358658   -.0175768
  1.eth_other |   .0147712   .0055423     2.67   0.008     .0039084     .025634
              |
econ_disadv~e |
Economic D..  |  -.0302182      .0021   -14.39   0.000    -.0343342   -.0261023
              |
limited_eng~f |
Limited En..  |  -.0307194   .0043525    -7.06   0.000    -.0392501   -.0221887
              |
     disabled |
    Disabled  |   .0387217   .0049555     7.81   0.000     .0290091    .0484343
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |  -.0586626   .0022597   -25.96   0.000    -.0630915   -.0542337
        2016  |  -.0150699   .0032167    -4.68   0.000    -.0213744   -.0087653
        2017  |  -.0000921   .0322926    -0.00   0.998    -.0633846    .0632004
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0395136   .0011694   -33.79   0.000    -.0418055   -.0372217
        2016  |   -.026588   .0015332   -17.34   0.000     -.029593    -.023583
        2017  |   .0013685   .0133694     0.10   0.918    -.0248351    .0275721
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0100059   .0005393    18.55   0.000     .0089488    .0110629
        2016  |   .0037442   .0007467     5.01   0.000     .0022806    .0052077
        2017  |   .0003878   .0073552     0.05   0.958    -.0140282    .0148037
              |
         year#|
           c. |
prior_math_~e |
        2015  |   -.063732    .002237   -28.49   0.000    -.0681163   -.0593476
        2016  |  -.0272232   .0033766    -8.06   0.000    -.0338412   -.0206051
        2017  |  -.0286665   .0328838    -0.87   0.383    -.0931179    .0357849
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0335323   .0014625   -22.93   0.000    -.0363987   -.0306658
        2016  |  -.0253215   .0018391   -13.77   0.000    -.0289259    -.021717
        2017  |  -.0071466   .0167552    -0.43   0.670    -.0399863    .0256931
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0109094   .0006032    18.09   0.000     .0097272    .0120917
        2016  |   .0054569    .000954     5.72   0.000     .0035871    .0073267
        2017  |   .0063023   .0092589     0.68   0.496    -.0118449    .0244495
              |
        _cons |   1.213986   .0353733    34.32   0.000     1.144655    1.283316
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.46606209 .09480611 .45631751 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                  1              2              3
    +----------------------------------------------+
  1 |   .0067091089    .6000004736           1244  |
  2 |  -.0004259291   -.0340176553             62  |
    +----------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                  1
    +----------------+
  1 |   .0067091089  |
  2 |  -.0004259291  |
    +----------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   276,999
-------------+----------------------------------   F(58, 276940)   =    311.94
       Model |   3868.7543        58  66.7026603   Prob > F        =    0.0000
    Residual |  59218.6249   276,940  .213831967   R-squared       =    0.0613
-------------+----------------------------------   Adj R-squared   =    0.0611
       Total |  63087.3792   276,998  .227753916   Root MSE        =    .46242

-------------------------------------------------------------------------------
    enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0913477   .0029144   -31.34   0.000    -.0970599   -.0856355
        2017  |  -.3721204   .0217706   -17.09   0.000    -.4147901   -.3294507
              |
1.has_o~2year |   .0858273   .0037208    23.07   0.000     .0785347      .09312
1.has_o~4year |  -.0742629   .0042317   -17.55   0.000    -.0825569    -.065969
          age |  -.0001079   5.86e-06   -18.42   0.000    -.0001194   -.0000964
              |
         male |
        Male  |   .0172694   .0017963     9.61   0.000     .0137488      .02079
  1.eth_asian |   -.014796   .0033512    -4.42   0.000    -.0213644   -.0082277
1.eth_hispa~c |    .029607   .0026985    10.97   0.000     .0243181    .0348959
  1.eth_black |   .0053586   .0048428     1.11   0.269    -.0041331    .0148503
  1.eth_other |   .0126701   .0055459     2.28   0.022     .0018003    .0235399
              |
econ_disadv~e |
Economic D..  |  -.0066357   .0022725    -2.92   0.004    -.0110897   -.0021817
              |
limited_eng~f |
Limited En..  |  -.0384642   .0043705    -8.80   0.000    -.0470302   -.0298981
              |
     disabled |
    Disabled  |   .0309374    .004939     6.26   0.000      .021257    .0406178
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |  -.0623879    .002281   -27.35   0.000    -.0668585   -.0579173
        2016  |  -.0242947   .0032606    -7.45   0.000    -.0306855    -.017904
        2017  |   .0079828   .0326224     0.24   0.807    -.0559563    .0719219
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0355135    .001166   -30.46   0.000    -.0377989   -.0332281
        2016  |  -.0230293   .0015313   -15.04   0.000    -.0260306    -.020028
        2017  |   -.000435    .013562    -0.03   0.974    -.0270162    .0261461
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0094246   .0005358    17.59   0.000     .0083744    .0104747
        2016  |   .0036371   .0007419     4.90   0.000     .0021829    .0050913
        2017  |   .0008742   .0073431     0.12   0.905    -.0135181    .0152665
              |
         year#|
           c. |
prior_math_~e |
        2015  |   -.063262   .0022476   -28.15   0.000    -.0676673   -.0588567
        2016  |  -.0275504   .0033846    -8.14   0.000    -.0341841   -.0209166
        2017  |  -.0275051   .0328941    -0.84   0.403    -.0919766    .0369664
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0291891    .001456   -20.05   0.000    -.0320428   -.0263354
        2016  |  -.0225639   .0018303   -12.33   0.000    -.0261512   -.0189766
        2017  |  -.0072487   .0166993    -0.43   0.664    -.0399787    .0254814
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |    .009977   .0005993    16.65   0.000     .0088023    .0111516
        2016  |   .0048348   .0009473     5.10   0.000      .002978    .0066915
        2017  |   .0064473   .0092076     0.70   0.484    -.0115993     .024494
              |
     peer_age |  -.0000221   .0000187    -1.18   0.239    -.0000588    .0000147
    peer_male |   .0956628   .0255126     3.75   0.000     .0456587    .1456669
peer_eth_as~n |   .1341846   .0088914    15.09   0.000     .1167577    .1516114
peer_eth_hi~c |  -.0465318   .0082628    -5.63   0.000    -.0627268   -.0303369
peer_eth_bl~k |  -.2220922   .0154077   -14.41   0.000    -.2522909   -.1918935
peer_eth_ot~r |   .0122212   .0358559     0.34   0.733    -.0580554    .0824978
peer_econ_d~e |  -.0733753    .008033    -9.13   0.000    -.0891198   -.0576307
peer_limite~f |   .1715663    .018919     9.07   0.000     .1344857     .208647
peer_disabled |  -.1296121   .0302141    -4.29   0.000     -.188831   -.0703933
              |
         year#|
           c. |
peer_prior_e~ |
        2015  |   .0554784   .0109629     5.06   0.000     .0339914    .0769654
        2016  |   .1123296   .0147244     7.63   0.000     .0834703     .141189
        2017  |  -.3338621   .3015267    -1.11   0.268    -.9248463     .257122
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.1221971   .0123154    -9.92   0.000     -.146335   -.0980593
        2016  |  -.1085355    .016435    -6.60   0.000    -.1407476   -.0763233
        2017  |  -.0197964   .2480668    -0.08   0.936    -.5060005    .4664077
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.0594208   .0133199    -4.46   0.000    -.0855274   -.0333142
        2016  |  -.1294356   .0204303    -6.34   0.000    -.1694785   -.0893926
        2017  |   .1404288   .3280719     0.43   0.669    -.5025831    .7834407
              |
         year#|
           c. |
peer_prior_m~ |
        2015  |  -.0015867   .0097794    -0.16   0.871    -.0207541    .0175806
        2016  |  -.0297888    .014294    -2.08   0.037    -.0578046    -.001773
        2017  |   .2947199   .2976026     0.99   0.322    -.2885731    .8780128
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |  -.0962987   .0142272    -6.77   0.000    -.1241836   -.0684138
        2016  |  -.0654817   .0184907    -3.54   0.000     -.101723   -.0292404
        2017  |   .0874818   .2717358     0.32   0.748     -.445113    .6200765
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   .0647805   .0099521     6.51   0.000     .0452747    .0842862
        2016  |   .0874481   .0192934     4.53   0.000     .0496336    .1252627
        2017  |  -.2687424   .3124119    -0.86   0.390    -.8810611    .3435763
              |
        _cons |   1.248689   .1163527    10.73   0.000     1.020641    1.476737
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.46241969 .08062387 .45533697 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0043854709   .5031888108          1244  |
  2 |  .0001040378   .0124743132            62  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0043854709  |
  2 |  .0001040378  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

Linear regression, absorbing indicators            Number of obs     = 276,999
Absorbed variable: school_id                       No. of categories =   1,295
                                                   F(58, 275646)     =  245.09
                                                   Prob > F          =  0.0000
                                                   R-squared         =  0.0911
                                                   Adj R-squared     =  0.0866
                                                   Root MSE          =  0.4561

-------------------------------------------------------------------------------
    enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0966752   .0031284   -30.90   0.000    -.1028068   -.0905437
        2017  |  -.3922494    .024107   -16.27   0.000    -.4394984   -.3450004
              |
1.has_o~2year |   .0730719   .0036878    19.81   0.000      .065844    .0802999
1.has_o~4year |  -.0669066   .0041906   -15.97   0.000      -.07512   -.0586931
          age |  -.0001082   5.82e-06   -18.58   0.000    -.0001196   -.0000968
              |
         male |
        Male  |   .0172473   .0017792     9.69   0.000     .0137602    .0207345
  1.eth_asian |  -.0170825   .0033236    -5.14   0.000    -.0235966   -.0105684
1.eth_hispa~c |   .0297433   .0026761    11.11   0.000     .0244983    .0349884
  1.eth_black |   .0048629    .004801     1.01   0.311     -.004547    .0142728
  1.eth_other |   .0099054   .0054991     1.80   0.072    -.0008727    .0206835
              |
econ_disadv~e |
Economic D..  |  -.0063126   .0022478    -2.81   0.005    -.0107183   -.0019069
              |
limited_eng~f |
Limited En..  |  -.0353779   .0043412    -8.15   0.000    -.0438866   -.0268692
              |
     disabled |
    Disabled  |   .0295923   .0049078     6.03   0.000     .0199732    .0392114
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |  -.0627872   .0022563   -27.83   0.000    -.0672095   -.0583649
        2016  |  -.0249542   .0032273    -7.73   0.000    -.0312797   -.0186287
        2017  |   .0060154   .0322823     0.19   0.852     -.057257    .0692878
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0360295   .0011545   -31.21   0.000    -.0382922   -.0337668
        2016  |  -.0230451   .0015166   -15.19   0.000    -.0260176   -.0200725
        2017  |   .0001962   .0134004     0.01   0.988    -.0260682    .0264606
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0094992   .0005299    17.92   0.000     .0084605    .0105378
        2016  |   .0039347   .0007339     5.36   0.000     .0024963    .0053731
        2017  |   .0019937   .0072598     0.27   0.784    -.0122354    .0162228
              |
         year#|
           c. |
prior_math_~e |
        2015  |  -.0629218   .0022236   -28.30   0.000    -.0672799   -.0585637
        2016  |  -.0303786   .0033494    -9.07   0.000    -.0369434   -.0238138
        2017  |  -.0356594   .0325828    -1.09   0.274    -.0995209     .028202
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0291713   .0014414   -20.24   0.000    -.0319963   -.0263463
        2016  |  -.0236475   .0018122   -13.05   0.000    -.0271994   -.0200956
        2017  |  -.0051267   .0165448    -0.31   0.757     -.037554    .0273006
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0099064    .000593    16.71   0.000     .0087443    .0110686
        2016  |    .005293   .0009372     5.65   0.000     .0034561    .0071298
        2017  |   .0057513   .0091283     0.63   0.529      -.01214    .0236426
              |
     peer_age |   .0002711   .0000865     3.13   0.002     .0001016    .0004405
    peer_male |   .0340288   .0493771     0.69   0.491     -.062749    .1308067
peer_eth_as~n |  -.1364195   .0986727    -1.38   0.167    -.3298152    .0569762
peer_eth_hi~c |  -.1015888   .0671315    -1.51   0.130    -.2331648    .0299871
peer_eth_bl~k |   .0267447   .1148435     0.23   0.816    -.1983453    .2518348
peer_eth_ot~r |   .0999039   .0941327     1.06   0.289    -.0845937    .2844015
peer_econ_d~e |   .0413836   .0174739     2.37   0.018     .0071352     .075632
peer_limite~f |    .193861   .0667755     2.90   0.004     .0629828    .3247391
peer_disabled |   .0093245   .0733142     0.13   0.899    -.1343692    .1530183
              |
         year#|
           c. |
peer_prior_e~ |
        2015  |    .049897   .0306706     1.63   0.104    -.0102165    .1100104
        2016  |   .1209522   .0305357     3.96   0.000      .061103    .1808014
        2017  |  -.3716892   .3430145    -1.08   0.279    -1.043988    .3006099
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.1329204   .0312119    -4.26   0.000    -.1940949   -.0717458
        2016  |  -.0875921   .0312786    -2.80   0.005    -.1488973   -.0262868
        2017  |    .017977   .2816146     0.06   0.949    -.5339799    .5699338
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.0279976   .0369186    -0.76   0.448    -.1003571    .0443619
        2016  |  -.0455603   .0404425    -1.13   0.260    -.1248265    .0337059
        2017  |   .4954522   .3731557     1.33   0.184    -.2359228    1.226827
              |
         year#|
           c. |
peer_prior_m~ |
        2015  |  -.0032718   .0272442    -0.12   0.904    -.0566697     .050126
        2016  |  -.0634583   .0281618    -2.25   0.024    -.1186547    -.008262
        2017  |   .1630581   .3347433     0.49   0.626    -.4930296    .8191457
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   .0656376   .0340569     1.93   0.054     -.001113    .1323883
        2016  |   .0907307   .0328315     2.76   0.006     .0263819    .1550796
        2017  |   .2675357   .3092363     0.87   0.387     -.338559    .8736304
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |  -.0183551   .0345737    -0.53   0.595    -.0861187    .0494084
        2016  |  -.0181142    .041092    -0.44   0.659    -.0986534    .0624249
        2017  |  -.3987248   .3386165    -1.18   0.239    -1.062404    .2649543
              |
        _cons |  -.5591327   .5325749    -1.05   0.294    -1.602965    .4846994
-------------------------------------------------------------------------------
F test of absorbed indicators: F(1294, 275646) = 6.970        Prob > F = 0.000
Standard deviations: total, classes, students, teachers same year
.46709088 .104231 .45531285 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0091559514   .6906662646          1244  |
  2 |   .014908202   .6841909383            62  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0091559514  |
  2 |   .014908202  |
    +---------------+
-------------------------------------------------------------------------------
(obs=275,290)

             | va_cf~er va_tf~er
-------------+------------------
va_cfr_g1~er |   1.0000
va_tfx_g1~er |   0.8043   1.0000


Linear regression                               Number of obs     =    275,290
                                                F(1, 1183)        =    1060.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0193
                                                Root MSE          =     .46089

                           (Std. err. adjusted for 1,184 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
g11_enr_2y~_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11~ar |   1.032902   .0317124    32.57   0.000     .9706837    1.095121
        _cons |   .0010626   .0014429     0.74   0.462    -.0017683    .0038936
-------------------------------------------------------------------------------
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outcome_va/s
> pec_test_va_cfr_g11_enr_2year_sibling.ster saved

Linear regression                               Number of obs     =    275,290
                                                F(1, 1183)        =     468.71
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0110
                                                Root MSE          =     .45989

                           (Std. err. adjusted for 1,184 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
g11_enr_2y~er | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11~er |   1.022261    .047218    21.65   0.000     .9296209    1.114902
        _cons |    .002838   .0014459     1.96   0.050     1.20e-06    .0056749
-------------------------------------------------------------------------------
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outcome_va/s
> pec_test_va_cfr_g11_enr_2year_peer_sibling.ster saved

Linear regression                               Number of obs     =    275,290
                                                F(1, 1183)        =    1118.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0200
                                                Root MSE          =     .46141

                           (Std. err. adjusted for 1,184 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
g11_enr_2ye~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11_~l |   1.033754   .0309092    33.44   0.000     .9731112    1.094397
        _cons |   .0010254   .0014436     0.71   0.478    -.0018068    .0038577
-------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outco
> me_va/spec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster not found)
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outcome_va/s
> pec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster saved
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/outcome_va
    > /va_g11_enr_2year_sibling.dta saved
(CST/SBAC Student Test Score Samples)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   276,999
-------------+----------------------------------   F(31, 276967)   =   2962.31
       Model |  14298.1069        31  461.229255   Prob > F        =    0.0000
    Residual |  43123.5847   276,967   .15569936   R-squared       =    0.2490
-------------+----------------------------------   Adj R-squared   =    0.2489
       Total |  57421.6916   276,998  .207300022   Root MSE        =    .39459

-------------------------------------------------------------------------------
    enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0865069   .0022224   -38.93   0.000    -.0908628   -.0821511
        2017  |  -.2539723   .0158317   -16.04   0.000     -.285002   -.2229425
              |
1.has_o~2year |  -.0647015   .0031735   -20.39   0.000    -.0709215   -.0584815
1.has_o~4year |   .1490596   .0036097    41.29   0.000     .1419847    .1561346
          age |  -.0000807   4.90e-06   -16.48   0.000    -.0000903   -.0000711
              |
         male |
        Male  |   -.084835   .0015314   -55.40   0.000    -.0878364   -.0818335
  1.eth_asian |    .086088   .0025706    33.49   0.000     .0810496    .0911264
1.eth_hispa~c |  -.0096091   .0020945    -4.59   0.000    -.0137142   -.0055041
  1.eth_black |   .0453634   .0039501    11.48   0.000     .0376212    .0531055
  1.eth_other |     -.0161   .0046925    -3.43   0.001    -.0252973   -.0069028
              |
econ_disadv~e |
Economic D..  |  -.0374219   .0017782   -21.04   0.000    -.0409072   -.0339367
              |
limited_eng~f |
Limited En..  |  -.0158431    .003685    -4.30   0.000    -.0230656   -.0086206
              |
     disabled |
    Disabled  |  -.0295612   .0041956    -7.05   0.000    -.0377844    -.021338
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .1409923   .0019135    73.68   0.000     .1372419    .1447428
        2016  |   .0829285   .0027237    30.45   0.000     .0775902    .0882668
        2017  |  -.0218304   .0273403    -0.80   0.425    -.0754166    .0317558
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0234585   .0009901    23.69   0.000     .0215179    .0253991
        2016  |   .0183401   .0012981    14.13   0.000     .0157958    .0208844
        2017  |   .0096127   .0113191     0.85   0.396    -.0125724    .0317977
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0112134   .0004566   -24.56   0.000    -.0121084   -.0103184
        2016  |  -.0047991   .0006322    -7.59   0.000    -.0060382   -.0035599
        2017  |  -.0006394   .0062272    -0.10   0.918    -.0128445    .0115657
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .1204723   .0018944    63.59   0.000     .1167592    .1241853
        2016  |   .0753435   .0028591    26.35   0.000     .0697397    .0809474
        2017  |   .0069978    .027841     0.25   0.802    -.0475699    .0615654
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0178733   .0012383    14.43   0.000     .0154464    .0203003
        2016  |   .0145482    .001557     9.34   0.000     .0114964    .0175999
        2017  |  -.0025808   .0141857    -0.18   0.856    -.0303844    .0252227
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0100878   .0005107   -19.75   0.000    -.0110888   -.0090868
        2016  |  -.0053302   .0008077    -6.60   0.000    -.0069133   -.0037472
        2017  |  -.0033032    .007839    -0.42   0.673    -.0186675    .0120611
              |
        _cons |   .8181742   .0299696    27.30   0.000     .7594346    .8769139
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.39458758 .09199503 .38371379 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                  1              2              3
    +----------------------------------------------+
  1 |   .0041870155    .4254092282           1244  |
  2 |  -.0010140558   -.2796055827             62  |
    +----------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                  1
    +----------------+
  1 |   .0041870155  |
  2 |  -.0010140558  |
    +----------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

Linear regression, absorbing indicators            Number of obs     = 276,999
Absorbed variable: school_id                       No. of categories =   1,295
                                                   F(31, 275673)     = 2267.64
                                                   Prob > F          =  0.0000
                                                   R-squared         =  0.2862
                                                   Adj R-squared     =  0.2828
                                                   Root MSE          =  0.3856

-------------------------------------------------------------------------------
    enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0943335   .0022045   -42.79   0.000    -.0986543   -.0900127
        2017  |  -.2279049   .0169032   -13.48   0.000    -.2610347   -.1947752
              |
1.has_o~2year |  -.0549347   .0031176   -17.62   0.000     -.061045   -.0488244
1.has_o~4year |   .1353754   .0035427    38.21   0.000     .1284318    .1423189
          age |  -.0000725   4.91e-06   -14.78   0.000    -.0000822   -.0000629
              |
         male |
        Male  |  -.0851099   .0015025   -56.64   0.000    -.0880548   -.0821649
  1.eth_asian |   .0786467   .0028068    28.02   0.000     .0731455    .0841479
1.eth_hispa~c |  -.0163568     .00226    -7.24   0.000    -.0207863   -.0119273
  1.eth_black |   .0371408   .0040563     9.16   0.000     .0291907     .045091
  1.eth_other |  -.0135845   .0046482    -2.92   0.003    -.0226949   -.0044741
              |
econ_disadv~e |
Economic D..  |  -.0296314   .0018891   -15.69   0.000     -.033334   -.0259287
              |
limited_eng~f |
Limited En..  |  -.0132385   .0036697    -3.61   0.000     -.020431    -.006046
              |
     disabled |
    Disabled  |   -.040751   .0041476    -9.83   0.000    -.0488803   -.0326217
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |    .136105   .0018949    71.83   0.000      .132391     .139819
        2016  |   .0719278   .0026877    26.76   0.000     .0666599    .0771956
        2017  |   -.023078   .0269132    -0.86   0.391    -.0758272    .0296712
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0214048   .0009745    21.97   0.000     .0194949    .0233148
        2016  |   .0140741   .0012775    11.02   0.000     .0115701    .0165781
        2017  |   .0075262   .0111432     0.68   0.499    -.0143142    .0293666
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0108023   .0004478   -24.12   0.000      -.01168   -.0099247
        2016  |   -.004636   .0006199    -7.48   0.000    -.0058509   -.0034211
        2017  |   .0005456   .0061019     0.09   0.929     -.011414    .0125052
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .1183233   .0018735    63.16   0.000     .1146513    .1219952
        2016  |   .0694607   .0028136    24.69   0.000     .0639461    .0749754
        2017  |   .0146945   .0273814     0.54   0.592    -.0389723    .0683613
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0166472   .0012174    13.67   0.000     .0142611    .0190334
        2016  |   .0127487   .0015293     8.34   0.000     .0097513    .0157462
        2017  |  -.0015438   .0139203    -0.11   0.912    -.0288272    .0257396
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0096553   .0005011   -19.27   0.000    -.0106374   -.0086732
        2016  |  -.0047903   .0007919    -6.05   0.000    -.0063423   -.0032383
        2017  |  -.0045271   .0076954    -0.59   0.556    -.0196098    .0105556
              |
        _cons |   .7756006    .030024    25.83   0.000     .7167543    .8344468
-------------------------------------------------------------------------------
F test of absorbed indicators: F(1294, 275673) = 11.098       Prob > F = 0.000
Standard deviations: total, classes, students, teachers same year
.39480559 .09395012 .38346424 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                  1              2              3
    +----------------------------------------------+
  1 |    .004359682    .4339463488           1244  |
  2 |  -.0009880668     -.27532639             62  |
    +----------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                  1
    +----------------+
  1 |    .004359682  |
  2 |  -.0009880668  |
    +----------------+
-------------------------------------------------------------------------------
(obs=275,290)

             | va_cfr~r va_tfx~r
-------------+------------------
va_cfr_g11~r |   1.0000
va_tfx_g11~r |   0.9960   1.0000

-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   276,999
-------------+----------------------------------   F(29, 276969)   =   3074.06
       Model |  13981.9049        29  482.134652   Prob > F        =    0.0000
    Residual |  43439.7866   276,969  .156839887   R-squared       =    0.2435
-------------+----------------------------------   Adj R-squared   =    0.2434
       Total |  57421.6916   276,998  .207300022   Root MSE        =    .39603

-------------------------------------------------------------------------------
    enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0869957   .0022304   -39.00   0.000    -.0913673   -.0826241
        2017  |  -.2530585   .0158896   -15.93   0.000    -.2842017   -.2219154
              |
          age |  -.0000829   4.91e-06   -16.87   0.000    -.0000925   -.0000732
              |
         male |
        Male  |  -.0847412    .001537   -55.13   0.000    -.0877537   -.0817288
  1.eth_asian |   .0877558   .0025782    34.04   0.000     .0827026     .092809
1.eth_hispa~c |  -.0116608   .0021016    -5.55   0.000    -.0157799   -.0075418
  1.eth_black |   .0450679   .0039645    11.37   0.000     .0372975    .0528383
  1.eth_other |  -.0176498   .0047095    -3.75   0.000    -.0268803   -.0084192
              |
econ_disadv~e |
Economic D..  |   -.037326   .0017844   -20.92   0.000    -.0408234   -.0338285
              |
limited_eng~f |
Limited En..  |   -.015821   .0036985    -4.28   0.000    -.0230699   -.0085721
              |
     disabled |
    Disabled  |  -.0298132   .0042108    -7.08   0.000    -.0380664   -.0215601
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .1422998   .0019201    74.11   0.000     .1385364    .1460632
        2016  |   .0840824   .0027333    30.76   0.000     .0787252    .0894396
        2017  |  -.0217666   .0274402    -0.79   0.428    -.0755486    .0320154
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0235782   .0009937    23.73   0.000     .0216307    .0255257
        2016  |   .0185891   .0013028    14.27   0.000     .0160356    .0211425
        2017  |   .0098892   .0113604     0.87   0.384    -.0123769    .0321554
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0113763   .0004583   -24.82   0.000    -.0122745   -.0104781
        2016  |  -.0048927   .0006345    -7.71   0.000    -.0061363    -.003649
        2017  |  -.0006775     .00625    -0.11   0.914    -.0129273    .0115722
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .1224531   .0019008    64.42   0.000     .1187276    .1261787
        2016  |   .0770927   .0028692    26.87   0.000     .0714691    .0827163
        2017  |    .008806   .0279426     0.32   0.753    -.0459607    .0635727
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0180003   .0012427    14.48   0.000     .0155646     .020436
        2016  |   .0147443   .0015627     9.44   0.000     .0116814    .0178072
        2017  |  -.0035631   .0142375    -0.25   0.802    -.0314682     .024342
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0102741   .0005126   -20.04   0.000    -.0112787   -.0092695
        2016  |  -.0054711   .0008107    -6.75   0.000      -.00706   -.0038823
        2017  |    -.00327   .0078676    -0.42   0.678    -.0186904    .0121504
              |
        _cons |   .8350544    .030058    27.78   0.000     .7761416    .8939673
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.39603016 .09336681 .38486689 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                  1              2              3
    +----------------------------------------------+
  1 |   .0043980036    .4352055496           1244  |
  2 |   -.000665327   -.1983788092             62  |
    +----------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0043980036  |
  2 |  -.000665327  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   276,999
-------------+----------------------------------   F(58, 276940)   =   1642.25
       Model |  14695.2995        58  253.367232   Prob > F        =    0.0000
    Residual |  42726.3921   276,940  .154280321   R-squared       =    0.2559
-------------+----------------------------------   Adj R-squared   =    0.2558
       Total |  57421.6916   276,998  .207300022   Root MSE        =    .39279

-------------------------------------------------------------------------------
    enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0885784   .0024755   -35.78   0.000    -.0934304   -.0837264
        2017  |  -.2578113   .0184922   -13.94   0.000    -.2940555   -.2215671
              |
1.has_o~2year |  -.0616173   .0031605   -19.50   0.000    -.0678118   -.0554228
1.has_o~4year |   .1465906   .0035944    40.78   0.000     .1395456    .1536356
          age |  -.0000801   4.98e-06   -16.10   0.000    -.0000899   -.0000704
              |
         male |
        Male  |  -.0854462   .0015258   -56.00   0.000    -.0884366   -.0824557
  1.eth_asian |   .0790301   .0028466    27.76   0.000     .0734508    .0846093
1.eth_hispa~c |  -.0175821   .0022921    -7.67   0.000    -.0220745   -.0130896
  1.eth_black |    .036594   .0041135     8.90   0.000     .0285317    .0446564
  1.eth_other |  -.0165719   .0047108    -3.52   0.000    -.0258049    -.007339
              |
econ_disadv~e |
Economic D..  |  -.0321552   .0019303   -16.66   0.000    -.0359385    -.028372
              |
limited_eng~f |
Limited En..  |  -.0147364   .0037124    -3.97   0.000    -.0220126   -.0074603
              |
     disabled |
    Disabled  |   -.038085   .0041953    -9.08   0.000    -.0463077   -.0298624
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .1356623   .0019375    70.02   0.000     .1318649    .1394597
        2016  |   .0773053   .0027696    27.91   0.000     .0718769    .0827337
        2017  |  -.0159375   .0277099    -0.58   0.565    -.0702483    .0383732
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0215634   .0009904    21.77   0.000     .0196222    .0235047
        2016  |   .0161436   .0013007    12.41   0.000     .0135942    .0186929
        2017  |   .0032415   .0115198     0.28   0.778    -.0193369    .0258199
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0110384   .0004551   -24.25   0.000    -.0119305   -.0101464
        2016  |  -.0048668   .0006302    -7.72   0.000     -.006102   -.0036316
        2017  |   .0009102   .0062373     0.15   0.884    -.0113149    .0131352
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .1181268   .0019092    61.87   0.000     .1143849    .1218687
        2016  |   .0738368   .0028749    25.68   0.000      .068202    .0794716
        2017  |    .016864   .0279407     0.60   0.546     -.037899    .0716269
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |    .016211   .0012367    13.11   0.000      .013787    .0186349
        2016  |   .0137768   .0015547     8.86   0.000     .0107297    .0168239
        2017  |  -.0019578   .0141846    -0.14   0.890    -.0297592    .0258435
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0098456   .0005091   -19.34   0.000    -.0108434   -.0088479
        2016  |  -.0051661   .0008047    -6.42   0.000    -.0067433   -.0035889
        2017  |  -.0036939    .007821    -0.47   0.637     -.019023    .0116351
              |
     peer_age |  -.0000457   .0000159    -2.87   0.004    -.0000769   -.0000145
    peer_male |   .1663249   .0216708     7.68   0.000     .1238508     .208799
peer_eth_as~n |   .0098964   .0075524     1.31   0.190    -.0049062     .024699
peer_eth_hi~c |   .1216285   .0070186    17.33   0.000     .1078724    .1353847
peer_eth_bl~k |   .1923911   .0130875    14.70   0.000     .1667399    .2180422
peer_eth_ot~r |   .0324045   .0304565     1.06   0.287    -.0272894    .0920984
peer_econ_d~e |   .0373265   .0068234     5.47   0.000     .0239528    .0507001
peer_limite~f |  -.0856562     .01607    -5.33   0.000     -.117153   -.0541594
peer_disabled |   .0964195   .0256643     3.76   0.000     .0461182    .1467208
              |
         year#|
           c. |
peer_prior_e~ |
        2015  |   .0583386    .009312     6.26   0.000     .0400872    .0765899
        2016  |    .056956   .0125071     4.55   0.000     .0324424    .0814695
        2017  |   .1830332   .2561208     0.71   0.475    -.3189565    .6850228
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |   .1243238   .0104609    11.88   0.000     .1038208    .1448268
        2016  |   .2422956   .0139601    17.36   0.000     .2149341     .269657
        2017  |   .1727747   .2107112     0.82   0.412    -.2402135    .5857628
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |   .0931988   .0113141     8.24   0.000     .0710235    .1153741
        2016  |   .1975796   .0173538    11.39   0.000     .1635666    .2315926
        2017  |   -.035618   .2786686    -0.13   0.898    -.5818008    .5105647
              |
         year#|
           c. |
peer_prior_m~ |
        2015  |   .0251693   .0083068     3.03   0.002     .0088883    .0414503
        2016  |   .0241096   .0121415     1.99   0.047     .0003126    .0479066
        2017  |   -.169818   .2527876    -0.67   0.502    -.6652747    .3256387
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   .0018326   .0120848     0.15   0.879    -.0218532    .0255184
        2016  |  -.1172628   .0157062    -7.47   0.000    -.1480466    -.086479
        2017  |   .0332704    .230816     0.14   0.885    -.4191225    .4856634
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |  -.0718838   .0084534    -8.50   0.000    -.0884523   -.0553154
        2016  |  -.1531031   .0163881    -9.34   0.000    -.1852233   -.1209829
        2017  |  -.0685099   .2653667    -0.26   0.796    -.5886214    .4516017
              |
        _cons |   .8901776   .0988315     9.01   0.000     .6964705    1.083885
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.39278534 .08463637 .38355835 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                  1              2              3
    +----------------------------------------------+
  1 |   .0033319069    .3763255434           1244  |
  2 |  -.0007634971   -.2568692675             62  |
    +----------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                  1
    +----------------+
  1 |   .0033319069  |
  2 |  -.0007634971  |
    +----------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

Linear regression, absorbing indicators            Number of obs     = 276,999
Absorbed variable: school_id                       No. of categories =   1,295
                                                   F(58, 275646)     = 1222.16
                                                   Prob > F          =  0.0000
                                                   R-squared         =  0.2874
                                                   Adj R-squared     =  0.2839
                                                   Root MSE          =  0.3853

-------------------------------------------------------------------------------
    enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |   -.096109   .0026427   -36.37   0.000    -.1012886   -.0909295
        2017  |  -.2599498    .020364   -12.77   0.000    -.2998626   -.2200369
              |
1.has_o~2year |  -.0547899   .0031152   -17.59   0.000    -.0608955   -.0486842
1.has_o~4year |   .1351804   .0035399    38.19   0.000     .1282422    .1421186
          age |  -.0000738   4.92e-06   -15.01   0.000    -.0000835   -.0000642
              |
         male |
        Male  |  -.0848793   .0015029   -56.48   0.000     -.087825   -.0819336
  1.eth_asian |   .0786976   .0028075    28.03   0.000     .0731949    .0842003
1.eth_hispa~c |  -.0155946   .0022606    -6.90   0.000    -.0200253   -.0111639
  1.eth_black |   .0375219   .0040556     9.25   0.000     .0295731    .0454708
  1.eth_other |  -.0126672   .0046453    -2.73   0.006    -.0217718   -.0035626
              |
econ_disadv~e |
Economic D..  |  -.0313091   .0018988   -16.49   0.000    -.0350307   -.0275874
              |
limited_eng~f |
Limited En..  |  -.0132851   .0036672    -3.62   0.000    -.0204727   -.0060976
              |
     disabled |
    Disabled  |   -.039666   .0041458    -9.57   0.000    -.0477916   -.0315405
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .1353458    .001906    71.01   0.000     .1316101    .1390815
        2016  |    .072835   .0027262    26.72   0.000     .0674917    .0781784
        2017  |  -.0140477   .0272699    -0.52   0.606     -.067496    .0394006
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0214294   .0009752    21.97   0.000      .019518    .0233408
        2016  |   .0140541   .0012811    10.97   0.000     .0115431    .0165651
        2017  |   .0008385   .0113198     0.07   0.941    -.0213479    .0230249
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0108005   .0004477   -24.13   0.000    -.0116779   -.0099231
        2016  |  -.0046784   .0006199    -7.55   0.000    -.0058934   -.0034633
        2017  |   .0016882   .0061326     0.28   0.783    -.0103316     .013708
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .1174282   .0018783    62.52   0.000     .1137467    .1211096
        2016  |   .0705907   .0028294    24.95   0.000     .0650452    .0761361
        2017  |   .0244539   .0275238     0.89   0.374     -.029492    .0783999
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0165319   .0012176    13.58   0.000     .0141455    .0189183
        2016  |   .0130697   .0015309     8.54   0.000     .0100692    .0160701
        2017  |   .0009853   .0139759     0.07   0.944    -.0264071    .0283777
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   -.009605   .0005009   -19.18   0.000    -.0105868   -.0086233
        2016  |   -.004703   .0007917    -5.94   0.000    -.0062547   -.0031514
        2017  |  -.0049123    .007711    -0.64   0.524    -.0200256    .0102011
              |
     peer_age |    .000257    .000073     3.52   0.000     .0001139    .0004002
    peer_male |  -.0012269   .0417105    -0.03   0.977    -.0829784    .0805246
peer_eth_as~n |   .1480077   .0833521     1.78   0.076    -.0153601    .3113755
peer_eth_hi~c |   .0722229   .0567082     1.27   0.203    -.0389237    .1833694
peer_eth_bl~k |   .0096825   .0970121     0.10   0.920    -.1804586    .1998235
peer_eth_ot~r |   .3549727   .0795171     4.46   0.000     .1991214    .5108239
peer_econ_d~e |    .128316   .0147608     8.69   0.000     .0993852    .1572467
peer_limite~f |   .0821749   .0564075     1.46   0.145    -.0283823     .192732
peer_disabled |   .1904307   .0619309     3.07   0.002     .0690478    .3118136
              |
         year#|
           c. |
peer_prior_e~ |
        2015  |   .0992681   .0259084     3.83   0.000     .0484883     .150048
        2016  |   .0876235   .0257946     3.40   0.001     .0370669    .1381801
        2017  |   .3765208   .2897558     1.30   0.194    -.1913926    .9444342
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.0516328   .0263658    -1.96   0.050     -.103309    .0000434
        2016  |   .0400305   .0264221     1.52   0.130    -.0117561    .0918171
        2017  |  -.1553974   .2378892    -0.65   0.514    -.6216538    .3108589
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.0896282   .0311864    -2.87   0.004    -.1507527   -.0285037
        2016  |  -.0527228   .0341631    -1.54   0.123    -.1196816     .014236
        2017  |  -.3607246   .3152171    -1.14   0.252    -.9785415    .2570922
              |
         year#|
           c. |
peer_prior_m~ |
        2015  |  -.0992192   .0230141    -4.31   0.000    -.1443262   -.0541122
        2016  |  -.1170498   .0237892    -4.92   0.000     -.163676   -.0704236
        2017  |  -.3272091   .2827688    -1.16   0.247    -.8814281      .22701
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   .1153933    .028769     4.01   0.000     .0590068    .1717798
        2016  |   .0004503   .0277339     0.02   0.987    -.0539073     .054808
        2017  |   .2505049   .2612222     0.96   0.338    -.2614835    .7624933
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |    .299688   .0292056    10.26   0.000     .2424459    .3569301
        2016  |   .2912612   .0347118     8.39   0.000     .2232271    .3592953
        2017  |   .2777813   .2860407     0.97   0.331    -.2828506    .8384131
              |
        _cons |  -.9806749   .4498837    -2.18   0.029    -1.862435   -.0989151
-------------------------------------------------------------------------------
F test of absorbed indicators: F(1294, 275646) = 9.415        Prob > F = 0.000
Standard deviations: total, classes, students, teachers same year
.40625213 .13409189 .38348424 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0141143893   .7417742311          1244  |
  2 |  .0056483063   .6694996984            62  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0141143893  |
  2 |  .0056483063  |
    +---------------+
-------------------------------------------------------------------------------
(obs=275,290)

             | va_cf~er va_tf~er
-------------+------------------
va_cfr_g1~er |   1.0000
va_tfx_g1~er |   0.7396   1.0000


Linear regression                               Number of obs     =    275,290
                                                F(1, 1183)        =     210.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0111
                                                Root MSE          =     .39241

                           (Std. err. adjusted for 1,184 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
g11_enr_4y~_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11~ar |   1.005778   .0693976    14.49   0.000     .8696216    1.141934
        _cons |    .009267   .0018834     4.92   0.000     .0055718    .0129621
-------------------------------------------------------------------------------
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outcome_va/s
> pec_test_va_cfr_g11_enr_4year_sibling.ster saved

Linear regression                               Number of obs     =    275,290
                                                F(1, 1183)        =     151.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0070
                                                Root MSE          =     .39144

                           (Std. err. adjusted for 1,184 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
g11_enr_4y~er | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11~er |   .8967688   .0728667    12.31   0.000     .7538064    1.039731
        _cons |   .0074981   .0017808     4.21   0.000     .0040042     .010992
-------------------------------------------------------------------------------
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outcome_va/s
> pec_test_va_cfr_g11_enr_4year_peer_sibling.ster saved

Linear regression                               Number of obs     =    275,290
                                                F(1, 1183)        =     224.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0118
                                                Root MSE          =     .39371

                           (Std. err. adjusted for 1,184 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
g11_enr_4ye~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11_~l |   1.004826    .067009    15.00   0.000     .8733562    1.136296
        _cons |   .0095183    .001889     5.04   0.000     .0058121    .0132245
-------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outco
> me_va/spec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster not found)
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/outcome_va/s
> pec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster saved
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/outcome_va
    > /va_g11_enr_4year_sibling.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:    144.87 /        1 =     144.8680

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvareg
> s/va_sibling_out.smcl
  log type:  smcl
 closed on:  10 Nov 2021, 15:54:48
-------------------------------------------------------------------------------
