{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling_out_forecast_bias.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Jul 2022, 21:48:45
{txt}
{com}. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. #delimit ;
{txt}delimiter now ;
{com}. #delimit cr
{txt}delimiter now cr
{com}. macro list
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.0039002308063216
{p_end}
{txt}{p 0 16}
S_2:{space 12}{res}{res}300
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.0206002574343117
{p_end}
{txt}{p 0 16}
S_1:{space 12}{res}{res}epanechnikov
{p_end}
{txt}{p 0 16}
S_6:{space 12}{res}{res}.7098361624622439
{p_end}
{txt}{p 0 16}
S_5:{space 12}{res}{res}4
{p_end}
{txt}{p 0 16}
ReS_jv2:{space 8}{res}{res}__000006 __000007 __000008 __000009 __00000A __00000B __00000C __00000D __00000E __00000F __00000G __00000H __00000I __00000J __00000K
{p_end}
{txt}{p 0 16}
dropv:{space 10}{res}{res}_cdscode_x
{p_end}
{txt}{p 0 16}
n_offset:{space 7}{res}{res}0
{p_end}
{txt}{p 0 16}
sort:{space 11}{res}{res}0
{p_end}
{txt}{p 0 16}
dots:{space 11}{res}{res}nois _dots 5 0
{p_end}
{txt}{p 0 16}
dotss:{space 10}{res}{res}nois _dots 0, title(Survey results being calculated)
{p_end}
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_both_str:{space 6}{res}{res}Original + Census + Sibling
{p_end}
{txt}{p 0 16}
_sib_str:{space 7}{res}{res}Original + Sibling
{p_end}
{txt}{p 0 16}
_acs_str:{space 7}{res}{res}Original + Census
{p_end}
{txt}{p 0 16}
_og_str:{space 8}{res}{res}Original Specification
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. 
. 
. 
. ********************************************************************************
. 
. //load the VA grade 11 college outcomes sample
. use `va_g11_out_dataset', clear
{txt}(Enrollment Outcome Grade 11 VA Sample)

{com}. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk', nogen keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         884,312
{txt}{col 9}from master{col 30}{res}         884,312{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}         900,133{txt}  
{col 5}{hline 41}

{com}. 
. // keep the sibling controls sample for 2yr and 4yr sibling enrollment controls 
. keep if sibling_2y_4y_controls_sample==1
{txt}(902,143 observations deleted)

{com}. 
. compress
  {txt}variable {bf}{res}age{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}major{sf}{txt} was {bf}{res}long{sf}{txt} now {bf}{res}int{sf}
{txt}  (3,529,208 bytes saved)

{com}. tempfile va_g11_out_sibling_dataset
{txt}
{com}. save `va_g11_out_sibling_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000001{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. ********************************************************************************
. *********** VA estimates for sibling VA sample matched to census tract sample
. ********************************************************************************
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
{txt}
{com}. 
. 
. 
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}. 
.   *************** Census Tract Forecast Bias Test for Sibling Long Run Outcome VA
.   // call do helper file to merge onto ACS controls. Be sure to specify correct arguments
.    do $vaprojdir/do_files/sbac/merge_va_smp_acs.doh outcome `va_g11_out_sibling_dataset' va_g11_out_sibling_dataset create_va `outcome'
{txt}  3{com}. 
. 
. 
.   **************** College Outcome VA without sibling controls
.   ************** No peer controls
.   ************* No TFX
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_`outcome'_census_nosib_noacs.ster, replace)
{txt}  4{com}.   rename tv va_`outcome'_nosib_noacs
{txt}  5{com}.   rename score_r `outcome'_r_nosib_noacs
{txt}  6{com}. 
.   ***** Spec Test: no peer controls, no tfx, no sibling controls
.   reg `outcome'_r_nosib_noacs va_`outcome'_nosib_noacs, cluster(school_id)
{txt}  7{com}.   //save to my personal folder
.   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_`outcome'_census_nosib_noacs.ster, replace
{txt}  8{com}.   //save to va project folder
.   estimates save $vaprojdir/estimates/sibling_va/outcome_va/spec_test_`outcome'_census_nosib_noacs.ster, replace
{txt}  9{com}. 
. 
. 
. 
.   **************** College Outcome VA with sibling controls
.   ************** No peer controls
.   ************* No TFX
. 
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_`outcome'_census_noacs.ster, replace)
{txt} 10{com}. 
.     rename tv va_`outcome'_noacs
{txt} 11{com}.     rename score_r `outcome'_r_noacs
{txt} 12{com}. 
.     ***** Spec Test: no peer controls, no tfx, with sibling controls
.     reg `outcome'_r_noacs va_`outcome'_noacs, cluster(school_id)
{txt} 13{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_`outcome'_census_noacs.ster, replace
{txt} 14{com}.     //save to va project folder
.     estimates save $vaprojdir/estimates/sibling_va/outcome_va/spec_test_`outcome'_census_noacs.ster, replace
{txt} 15{com}. 
. 
. 
.     **************** College Outcome VA with sibling controls and census controls
.     ************** No peer controls
.     ************* No TFX
.     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `census_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_`outcome'_sib_census.ster, replace)
{txt} 16{com}. 
.       rename tv va_`outcome'_sib_census
{txt} 17{com}.       rename score_r `outcome'_r_sib_census
{txt} 18{com}. 
. 
.       ***** Forecast bias test for sibling census sample: census controls as leave out var
.       gen `outcome'_r_d = `outcome'_r_noacs - `outcome'_r_sib_census
{txt} 19{com}.       reg `outcome'_r_d va_`outcome'_noacs, cluster(school_id)
{txt} 20{com}.       estimates save $projdir/est/siblingvaregs/outcome_va/fb_test_`outcome'_census.ster, replace
{txt} 21{com}.       estimates save $vaprojdir/estimates/sibling_va/outcome_va/fb_test_`outcome'_census.ster, replace
{txt} 22{com}. 
. 
.       **************** Save Value Added Estimates
.       collapse (firstnm) va_* ///
>         (mean) `outcome'* ///
>         (sum) n_g11_`outcome' = touse_g11_`outcome' ///
>         , by(school_id cdscode grade year)
{txt} 23{com}.       //save to my personal folder
.       save $projdir/dta/common_core_va/outcome_va/va_g11_`outcome'_sibling_census.dta, replace
{txt} 24{com}.       //save to VA project folder
.       save $vaprojdir/data/sibling_va/outcome_va/va_g11_`outcome'_sibling_census.dta, replace
{txt} 25{com}. 
. {c )-}
{txt}
{com}. ********************************************************************************
. /* do helper file to merge census tract controls to VA sample. Arguments need
> to be set for
> -- what type of VA, test score or outcome
> -- which VA dataset file is being merged to using the tempfile macro in calling file
> -- the name for the tempfile being merged to, using a string
> -- what purpose does the calling do file have, create VA estimates or create VA sample
> -- what is the exact name for the VA being created, what subject or outcome
> 
> If purpose is create_va, this produces a dataset with obs that has non-missing
> census controls, and that are in the touse sample for the corresponding VA estimation 
> 
> See comments above the args command for details on how to set arguments */
. ********************************************************************************
. ********************************************************************************
. *************** written by Che Sun. Email: ucsun@ucdavis.edu *******************
. ********************** First written on April 27. 2022 *************************
. 
. 
. /* To call this do helper file:
> 
> do $vaprojdir/do_files/sbac/merge_va_smp_acs.doh
> 
> AND ADD NECESSARY ARGUMENTS
> 
>  */
. 
. /* CHANGE LOG
> 
>  */
. 
. /*
> -- set va_type to either test_score or outcome
> -- set va_dataset_file to `va_g11_dataset', `va_g11_out_dataset', `va_g11_sibling_dataset',
> or `va_g11_out_sibling_dataset'. MUST pass as macros to give file location
> -- set va_dataset_name to any of the options in va_dataset_file but without macro quotes
> -- set purpose to create_va or create_sample
> -- set va_name to `subject' or `outcome' or none
> */
. 
. 
. args va_type va_dataset_file va_dataset_name purpose va_name
{txt}
{com}. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. import delimited $vaprojdir/data/restricted_access/clean/crosswalks/address_list_census_batch_geocoded.csv ///
>   , delimiter(tab) varnames(1) case(lower) stringcols(_all) clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(13 vars, 11,090,000 obs)

{com}. rename id address_id
{res}{txt}
{com}. gen census_sct = statefp + countyfp + tract
{txt}(2,838,343 missing values generated)

{com}. keep address_id census_sct
{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile census_geocode
{txt}
{com}. save `census_geocode'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000002{rm}
saved
as .dta format
{p_end}

{com}. 
. use merge_id_k12_test_scores state_student_id student_id cdscode year grade ///
>   street_address_line_one street_address_line_two city state zip_code ///
>   using $vaprojdir/data/restricted_access/clean/k12_test_scores/k12_test_scores_clean.dta, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. //keep students in grade 6 in years 2010-2013 to match with census. the census_grade macro is set to 6
. keep if grade==`census_grade' & inrange(year, ``va_type'_min_year'-(11-`census_grade'), ``va_type'_max_year'-(11-`census_grade'))
{txt}(76,338,017 observations deleted)

{com}. drop if mi(state_student_id)
{txt}(2,272 observations deleted)

{com}. duplicates tag state_student_id, gen(dup_ssid)

{p 0 4}{txt}Duplicates in terms of {res} state_student_id{p_end}
{txt}
{com}. egen year_min = min(year) if dup_ssid!=0, by(state_student_id)
{txt}(1,846,043 missing values generated)

{com}. drop if year!=year_min & dup_ssid!=0
{txt}(2,526 observations deleted)

{com}. duplicates drop state_student_id, force

{p 0 4}{txt}Duplicates in terms of {res} state_student_id{p_end}

{txt}(9,913 observations deleted)

{com}. rename year year_grade`census_grade'
{res}{txt}
{com}. keep state_student_id student_id year_grade`census_grade' street_address_line_one street_address_line_two city state zip_code
{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile lagged_address
{txt}
{com}. save `lagged_address'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000003{rm}
saved
as .dta format
{p_end}

{com}. 
. use $vaprojdir/data/restricted_access/clean/crosswalks/address_list.dta, clear
{txt}
{com}. keep address_id street_address_line_one city state zip_code
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(14,185,218 observations deleted)

{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile address_id
{txt}
{com}. save `address_id'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000004{rm}
saved
as .dta format
{p_end}

{com}. 
. use $vaprojdir/data/public_access/clean/acs/acs_ca_census_tract_clean.dta, clear
{txt}
{com}. rename year year_grade`census_grade'
{res}{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile lagged_acs
{txt}
{com}. save `lagged_acs'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000005{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. use `va_dataset_file', clear
{txt}(Enrollment Outcome Grade 11 VA Sample)

{com}. merge m:1 state_student_id using `lagged_address' ///
>   , keep(3) keepusing(street_address_line_one city state zip_code year_grade`census_grade') gen(merge_lagged_address)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         849,331{txt}  (merge_lagged_address==3)
{col 5}{hline 41}

{com}. merge m:1 street_address_line_one city state zip_code using `address_id' ///
>   , keep(3) gen(merge_address_id)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         849,331{txt}  (merge_address_id==3)
{col 5}{hline 41}

{com}. merge m:1 address_id using `census_geocode' ///
>   , keep(3) gen(merge_census_geocode)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         848,975{txt}  (merge_census_geocode==3)
{col 5}{hline 41}

{com}. rename census_sct geoid2
{res}{txt}
{com}. 
. merge m:1 geoid2 year_grade`census_grade' using `lagged_acs' ///
>   , keep(3) gen(merge_acs)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         526,647{txt}  (merge_acs==3)
{col 5}{hline 41}

{com}. rename geoid2 census_sct
{res}{txt}
{com}. foreach v of varlist `census_controls' {c -(}
{txt}  2{com}.   drop if mi(`v')
{txt}  3{com}. {c )-}
{txt}(39 observations deleted)
(0 observations deleted)
(0 observations deleted)
(1 observation deleted)
(0 observations deleted)
(17 observations deleted)
(0 observations deleted)

{com}. 
. // create a sample indicator for obs with census controls
. gen byte census_controls_sample = 1
{txt}
{com}. 
. 
. if "`purpose'" == "create_va" {c -(}
.   // only keep obs needed for the current VA estimation
.   keep if touse_g11_`va_name'==1
{txt}(93,277 observations deleted)
{com}.   di "ACS controls merged successfully to `va_dataset_name'"
{res}ACS controls merged successfully to va_g11_out_sibling_dataset
{com}.   di "Ready to create VA estimates for `va_name'"
{res}Ready to create VA estimates for enr
{com}. {c )-}
{txt}
{com}. else if "`purpose'" == "create_sample" {c -(}
.   di "VA sample including ACS controls created"
. {c )-}
{txt}
{com}. 
{txt}end of do-file
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(36, 433276)   = {res}  1626.54
{txt}       Model {c |} {res} 10230.7049        36  284.186247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75701.0035   433,276   .17471774   {txt}R-squared       ={res}    0.1191
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1190
{txt}       Total {c |} {res} 85931.7083   433,312  .198313705   {txt}Root MSE        =   {res} .41799

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0081875{col 26}{space 2}  .002529{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} .0032306{col 67}{space 3} .0131443
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0154851{col 26}{space 2} .0025372{col 37}{space 1}   -6.10{col 46}{space 3}0.000{col 54}{space 4}-.0204579{col 67}{space 3}-.0105122
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0283736{col 26}{space 2}  .002559{col 37}{space 1}  -11.09{col 46}{space 3}0.000{col 54}{space 4}-.0333891{col 67}{space 3}-.0233581
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001493{col 26}{space 2} 4.60e-06{col 37}{space 1}  -32.45{col 46}{space 3}0.000{col 54}{space 4}-.0001583{col 67}{space 3}-.0001402
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0676695{col 26}{space 2} .0012993{col 37}{space 1}  -52.08{col 46}{space 3}0.000{col 54}{space 4}-.0702161{col 67}{space 3}-.0651229
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0559875{col 26}{space 2} .0020319{col 37}{space 1}   27.55{col 46}{space 3}0.000{col 54}{space 4}  .052005{col 67}{space 3} .0599701
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0297107{col 26}{space 2}  .001782{col 37}{space 1}  -16.67{col 46}{space 3}0.000{col 54}{space 4}-.0332035{col 67}{space 3} -.026218
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0001945{col 26}{space 2} .0035885{col 37}{space 1}   -0.05{col 46}{space 3}0.957{col 54}{space 4}-.0072279{col 67}{space 3}  .006839
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0123071{col 26}{space 2}  .003861{col 37}{space 1}   -3.19{col 46}{space 3}0.001{col 54}{space 4}-.0198746{col 67}{space 3}-.0047397
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0686687{col 26}{space 2} .0015103{col 37}{space 1}  -45.47{col 46}{space 3}0.000{col 54}{space 4}-.0716288{col 67}{space 3}-.0657086
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0497767{col 26}{space 2} .0034706{col 37}{space 1}  -14.34{col 46}{space 3}0.000{col 54}{space 4} -.056579{col 67}{space 3}-.0429744
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0175381{col 26}{space 2} .0033917{col 37}{space 1}   -5.17{col 46}{space 3}0.000{col 54}{space 4}-.0241856{col 67}{space 3}-.0108905
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0811937{col 26}{space 2} .0025528{col 37}{space 1}   31.81{col 46}{space 3}0.000{col 54}{space 4} .0761902{col 67}{space 3} .0861971
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0719307{col 26}{space 2}  .002491{col 37}{space 1}   28.88{col 46}{space 3}0.000{col 54}{space 4} .0670484{col 67}{space 3} .0768129
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .074364{col 26}{space 2} .0026417{col 37}{space 1}   28.15{col 46}{space 3}0.000{col 54}{space 4} .0691864{col 67}{space 3} .0795416
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0713949{col 26}{space 2} .0032906{col 37}{space 1}   21.70{col 46}{space 3}0.000{col 54}{space 4} .0649454{col 67}{space 3} .0778444
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0183052{col 26}{space 2} .0013517{col 37}{space 1}  -13.54{col 46}{space 3}0.000{col 54}{space 4}-.0209544{col 67}{space 3}-.0156559
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0226519{col 26}{space 2} .0013547{col 37}{space 1}  -16.72{col 46}{space 3}0.000{col 54}{space 4}-.0253071{col 67}{space 3}-.0199967
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.011981{col 26}{space 2}  .001412{col 37}{space 1}   -8.49{col 46}{space 3}0.000{col 54}{space 4}-.0147484{col 67}{space 3}-.0092136
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0133124{col 26}{space 2} .0014085{col 37}{space 1}   -9.45{col 46}{space 3}0.000{col 54}{space 4} -.016073{col 67}{space 3}-.0105518
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.000561{col 26}{space 2} .0006108{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-.0017582{col 67}{space 3} .0006362
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012112{col 26}{space 2} .0005613{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4}  .000111{col 67}{space 3} .0023114
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0018928{col 26}{space 2} .0005577{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4} -.002986{col 67}{space 3}-.0007997
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0047795{col 26}{space 2} .0009243{col 37}{space 1}   -5.17{col 46}{space 3}0.000{col 54}{space 4}-.0065912{col 67}{space 3}-.0029679
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0566758{col 26}{space 2} .0025398{col 37}{space 1}   22.32{col 46}{space 3}0.000{col 54}{space 4}  .051698{col 67}{space 3} .0616537
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0631053{col 26}{space 2} .0025829{col 37}{space 1}   24.43{col 46}{space 3}0.000{col 54}{space 4} .0580428{col 67}{space 3} .0681677
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0582672{col 26}{space 2} .0027161{col 37}{space 1}   21.45{col 46}{space 3}0.000{col 54}{space 4} .0529437{col 67}{space 3} .0635906
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0889956{col 26}{space 2} .0033083{col 37}{space 1}   26.90{col 46}{space 3}0.000{col 54}{space 4} .0825114{col 67}{space 3} .0954799
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0118834{col 26}{space 2} .0016955{col 37}{space 1}   -7.01{col 46}{space 3}0.000{col 54}{space 4}-.0152066{col 67}{space 3}-.0085602
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0155047{col 26}{space 2} .0016533{col 37}{space 1}   -9.38{col 46}{space 3}0.000{col 54}{space 4}-.0187451{col 67}{space 3}-.0122643
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0133682{col 26}{space 2} .0017406{col 37}{space 1}   -7.68{col 46}{space 3}0.000{col 54}{space 4}-.0167797{col 67}{space 3}-.0099568
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0028613{col 26}{space 2} .0013786{col 37}{space 1}   -2.08{col 46}{space 3}0.038{col 54}{space 4}-.0055633{col 67}{space 3}-.0001593
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0004253{col 26}{space 2} .0006877{col 37}{space 1}   -0.62{col 46}{space 3}0.536{col 54}{space 4}-.0017731{col 67}{space 3} .0009226
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0006362{col 26}{space 2}   .00073{col 37}{space 1}    0.87{col 46}{space 3}0.384{col 54}{space 4}-.0007946{col 67}{space 3}  .002067
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0000166{col 26}{space 2} .0007332{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-.0014205{col 67}{space 3} .0014536
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.007031{col 26}{space 2} .0009085{col 37}{space 1}   -7.74{col 46}{space 3}0.000{col 54}{space 4}-.0088116{col 67}{space 3}-.0052503
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.721146{col 26}{space 2} .0281718{col 37}{space 1}   61.09{col 46}{space 3}0.000{col 54}{space 4}  1.66593{col 67}{space 3} 1.776362
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_enr_census_nosib_noacs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41799251 .07930353 .41040065 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0052947343   .6470484039          3445{txt}  {c |}
  2 {c |}  {res}.0044305046   .5609940705          2240{txt}  {c |}
  3 {c |}  {res}.0037898405   .4978511877          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0052947343{txt}  {c |}
  2 {c |}  {res}.0044305046{txt}  {c |}
  3 {c |}  {res}.0044305046{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}  3831.53
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0234
                                                {txt}Root MSE          =    {res} .41287

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_nosi~s{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_nos~s {c |}{col 14}{res}{space 2} 1.060904{col 26}{space 2} .0171392{col 37}{space 1}   61.90{col 46}{space 3}0.000{col 54}{space 4} 1.027279{col 67}{space 3} 1.094529
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0018621{col 26}{space 2} .0003807{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4} -.002609{col 67}{space 3}-.0011152
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_enr_census_nosib_noacs.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_enr_census_nosib_noacs.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(38, 433274)   = {res}  1557.46
{txt}       Model {c |} {res} 10327.2617        38  271.770046   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75604.4466   433,274  .174495692   {txt}R-squared       ={res}    0.1202
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1201
{txt}       Total {c |} {res} 85931.7083   433,312  .198313705   {txt}Root MSE        =   {res} .41773

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0076296{col 26}{space 2} .0025276{col 37}{space 1}    3.02{col 46}{space 3}0.003{col 54}{space 4} .0026756{col 67}{space 3} .0125836
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0167221{col 26}{space 2} .0025363{col 37}{space 1}   -6.59{col 46}{space 3}0.000{col 54}{space 4}-.0216931{col 67}{space 3} -.011751
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0300865{col 26}{space 2}  .002559{col 37}{space 1}  -11.76{col 46}{space 3}0.000{col 54}{space 4} -.035102{col 67}{space 3}-.0250709
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0193456{col 26}{space 2} .0025059{col 37}{space 1}    7.72{col 46}{space 3}0.000{col 54}{space 4} .0144342{col 67}{space 3} .0242571
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0587273{col 26}{space 2} .0027061{col 37}{space 1}   21.70{col 46}{space 3}0.000{col 54}{space 4} .0534235{col 67}{space 3} .0640311
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0001471{col 26}{space 2} 4.60e-06{col 37}{space 1}  -31.99{col 46}{space 3}0.000{col 54}{space 4}-.0001561{col 67}{space 3}-.0001381
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} -.067719{col 26}{space 2} .0012985{col 37}{space 1}  -52.15{col 46}{space 3}0.000{col 54}{space 4} -.070264{col 67}{space 3} -.065174
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0546945{col 26}{space 2} .0020315{col 37}{space 1}   26.92{col 46}{space 3}0.000{col 54}{space 4} .0507127{col 67}{space 3} .0586762
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0295205{col 26}{space 2} .0017813{col 37}{space 1}  -16.57{col 46}{space 3}0.000{col 54}{space 4}-.0330119{col 67}{space 3}-.0260291
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0002575{col 26}{space 2} .0035863{col 37}{space 1}   -0.07{col 46}{space 3}0.943{col 54}{space 4}-.0072865{col 67}{space 3} .0067714
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0116744{col 26}{space 2} .0038587{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-.0192373{col 67}{space 3}-.0041116
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0690944{col 26}{space 2} .0015096{col 37}{space 1}  -45.77{col 46}{space 3}0.000{col 54}{space 4} -.072053{col 67}{space 3}-.0661357
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2} -.049694{col 26}{space 2} .0034684{col 37}{space 1}  -14.33{col 46}{space 3}0.000{col 54}{space 4} -.056492{col 67}{space 3} -.042896
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0168538{col 26}{space 2} .0033896{col 37}{space 1}   -4.97{col 46}{space 3}0.000{col 54}{space 4}-.0234974{col 67}{space 3}-.0102102
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0811033{col 26}{space 2} .0025514{col 37}{space 1}   31.79{col 46}{space 3}0.000{col 54}{space 4} .0761027{col 67}{space 3} .0861038
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0719927{col 26}{space 2} .0024896{col 37}{space 1}   28.92{col 46}{space 3}0.000{col 54}{space 4} .0671132{col 67}{space 3} .0768722
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0745858{col 26}{space 2} .0026404{col 37}{space 1}   28.25{col 46}{space 3}0.000{col 54}{space 4} .0694107{col 67}{space 3} .0797609
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0710509{col 26}{space 2} .0032887{col 37}{space 1}   21.60{col 46}{space 3}0.000{col 54}{space 4} .0646051{col 67}{space 3} .0774966
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0182362{col 26}{space 2} .0013508{col 37}{space 1}  -13.50{col 46}{space 3}0.000{col 54}{space 4}-.0208838{col 67}{space 3}-.0155886
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0225335{col 26}{space 2} .0013539{col 37}{space 1}  -16.64{col 46}{space 3}0.000{col 54}{space 4}-.0251871{col 67}{space 3}-.0198799
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0117588{col 26}{space 2} .0014111{col 37}{space 1}   -8.33{col 46}{space 3}0.000{col 54}{space 4}-.0145246{col 67}{space 3} -.008993
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.013267{col 26}{space 2} .0014076{col 37}{space 1}   -9.43{col 46}{space 3}0.000{col 54}{space 4}-.0160259{col 67}{space 3}-.0105082
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0005253{col 26}{space 2} .0006105{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4}-.0017218{col 67}{space 3} .0006712
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012083{col 26}{space 2}  .000561{col 37}{space 1}    2.15{col 46}{space 3}0.031{col 54}{space 4} .0001088{col 67}{space 3} .0023078
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0019164{col 26}{space 2} .0005574{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.0030089{col 67}{space 3}-.0008239
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0046567{col 26}{space 2} .0009237{col 37}{space 1}   -5.04{col 46}{space 3}0.000{col 54}{space 4}-.0064672{col 67}{space 3}-.0028462
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0560248{col 26}{space 2} .0025384{col 37}{space 1}   22.07{col 46}{space 3}0.000{col 54}{space 4} .0510497{col 67}{space 3} .0609999
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0620934{col 26}{space 2} .0025817{col 37}{space 1}   24.05{col 46}{space 3}0.000{col 54}{space 4} .0570334{col 67}{space 3} .0671535
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0574034{col 26}{space 2} .0027147{col 37}{space 1}   21.15{col 46}{space 3}0.000{col 54}{space 4} .0520827{col 67}{space 3} .0627241
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0881019{col 26}{space 2} .0033067{col 37}{space 1}   26.64{col 46}{space 3}0.000{col 54}{space 4} .0816209{col 67}{space 3} .0945829
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0117653{col 26}{space 2} .0016945{col 37}{space 1}   -6.94{col 46}{space 3}0.000{col 54}{space 4}-.0150864{col 67}{space 3}-.0084442
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0154419{col 26}{space 2} .0016523{col 37}{space 1}   -9.35{col 46}{space 3}0.000{col 54}{space 4}-.0186803{col 67}{space 3}-.0122035
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.013368{col 26}{space 2} .0017395{col 37}{space 1}   -7.69{col 46}{space 3}0.000{col 54}{space 4}-.0167773{col 67}{space 3}-.0099588
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0027008{col 26}{space 2} .0013778{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-.0054014{col 67}{space 3}-3.27e-07
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0003968{col 26}{space 2} .0006873{col 37}{space 1}   -0.58{col 46}{space 3}0.564{col 54}{space 4}-.0017438{col 67}{space 3} .0009502
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0007332{col 26}{space 2} .0007296{col 37}{space 1}    1.01{col 46}{space 3}0.315{col 54}{space 4}-.0006967{col 67}{space 3} .0021631
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0000968{col 26}{space 2} .0007327{col 37}{space 1}    0.13{col 46}{space 3}0.895{col 54}{space 4}-.0013393{col 67}{space 3} .0015329
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0068705{col 26}{space 2} .0009079{col 37}{space 1}   -7.57{col 46}{space 3}0.000{col 54}{space 4}  -.00865{col 67}{space 3}-.0050909
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.704137{col 26}{space 2} .0281648{col 37}{space 1}   60.51{col 46}{space 3}0.000{col 54}{space 4} 1.648935{col 67}{space 3}  1.75934
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_enr_census_noacs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41772682 .07909487 .41017032 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0052672265   .6465161824          3445{txt}  {c |}
  2 {c |}  {res}.0044060826   .5603988327          2240{txt}  {c |}
  3 {c |}  {res}.0037610667   .4965062514          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0052672265{txt}  {c |}
  2 {c |}  {res}.0044060826{txt}  {c |}
  3 {c |}  {res}.0044060826{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}  3825.59
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0233
                                                {txt}Root MSE          =    {res} .41263

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} enr_r_noacs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_noacs {c |}{col 14}{res}{space 2} 1.060337{col 26}{space 2} .0171433{col 37}{space 1}   61.85{col 46}{space 3}0.000{col 54}{space 4} 1.026704{col 67}{space 3}  1.09397
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0018323{col 26}{space 2} .0003805{col 37}{space 1}   -4.82{col 46}{space 3}0.000{col 54}{space 4}-.0025788{col 67}{space 3}-.0010858
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_enr_census_noacs.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_enr_census_noacs.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(45, 433267)   = {res}  1382.15
{txt}       Model {c |} {res} 10787.2162        45  239.715915   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75144.4922   433,267  .173436916   {txt}R-squared       ={res}    0.1255
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1254
{txt}       Total {c |} {res} 85931.7083   433,312  .198313705   {txt}Root MSE        =   {res} .41646

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0076925{col 26}{space 2} .0025215{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4} .0027505{col 67}{space 3} .0126345
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  -.01706{col 26}{space 2} .0025353{col 37}{space 1}   -6.73{col 46}{space 3}0.000{col 54}{space 4}-.0220292{col 67}{space 3}-.0120908
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0289301{col 26}{space 2} .0025647{col 37}{space 1}  -11.28{col 46}{space 3}0.000{col 54}{space 4}-.0339568{col 67}{space 3}-.0239033
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0202015{col 26}{space 2} .0024991{col 37}{space 1}    8.08{col 46}{space 3}0.000{col 54}{space 4} .0153034{col 67}{space 3} .0250996
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0585877{col 26}{space 2} .0026991{col 37}{space 1}   21.71{col 46}{space 3}0.000{col 54}{space 4} .0532976{col 67}{space 3} .0638778
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0001517{col 26}{space 2} 4.59e-06{col 37}{space 1}  -33.04{col 46}{space 3}0.000{col 54}{space 4}-.0001607{col 67}{space 3}-.0001427
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0687889{col 26}{space 2} .0012948{col 37}{space 1}  -53.13{col 46}{space 3}0.000{col 54}{space 4}-.0713267{col 67}{space 3}-.0662511
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0463269{col 26}{space 2} .0022876{col 37}{space 1}   20.25{col 46}{space 3}0.000{col 54}{space 4} .0418432{col 67}{space 3} .0508106
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0021178{col 26}{space 2} .0019754{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-.0059895{col 67}{space 3} .0017539
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0263201{col 26}{space 2} .0037548{col 37}{space 1}    7.01{col 46}{space 3}0.000{col 54}{space 4} .0189607{col 67}{space 3} .0336795
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0091372{col 26}{space 2} .0038615{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-.0167056{col 67}{space 3}-.0015687
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0419063{col 26}{space 2} .0016121{col 37}{space 1}  -25.99{col 46}{space 3}0.000{col 54}{space 4} -.045066{col 67}{space 3}-.0387465
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0498473{col 26}{space 2} .0034591{col 37}{space 1}  -14.41{col 46}{space 3}0.000{col 54}{space 4} -.056627{col 67}{space 3}-.0430675
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0262263{col 26}{space 2} .0033845{col 37}{space 1}   -7.75{col 46}{space 3}0.000{col 54}{space 4}-.0328597{col 67}{space 3}-.0195928
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0755157{col 26}{space 2} .0025464{col 37}{space 1}   29.66{col 46}{space 3}0.000{col 54}{space 4} .0705249{col 67}{space 3} .0805065
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0664799{col 26}{space 2} .0024849{col 37}{space 1}   26.75{col 46}{space 3}0.000{col 54}{space 4} .0616096{col 67}{space 3} .0713501
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0677461{col 26}{space 2} .0026361{col 37}{space 1}   25.70{col 46}{space 3}0.000{col 54}{space 4} .0625793{col 67}{space 3} .0729128
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0671886{col 26}{space 2}   .00328{col 37}{space 1}   20.48{col 46}{space 3}0.000{col 54}{space 4}   .06076{col 67}{space 3} .0736172
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0183235{col 26}{space 2}  .001347{col 37}{space 1}  -13.60{col 46}{space 3}0.000{col 54}{space 4}-.0209636{col 67}{space 3}-.0156834
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0225727{col 26}{space 2} .0013501{col 37}{space 1}  -16.72{col 46}{space 3}0.000{col 54}{space 4}-.0252188{col 67}{space 3}-.0199266
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0119725{col 26}{space 2} .0014072{col 37}{space 1}   -8.51{col 46}{space 3}0.000{col 54}{space 4}-.0147305{col 67}{space 3}-.0092144
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0128381{col 26}{space 2} .0014034{col 37}{space 1}   -9.15{col 46}{space 3}0.000{col 54}{space 4}-.0155888{col 67}{space 3}-.0100874
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0004187{col 26}{space 2} .0006086{col 37}{space 1}   -0.69{col 46}{space 3}0.491{col 54}{space 4}-.0016116{col 67}{space 3} .0007741
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012207{col 26}{space 2} .0005593{col 37}{space 1}    2.18{col 46}{space 3}0.029{col 54}{space 4} .0001244{col 67}{space 3} .0023169
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0016844{col 26}{space 2} .0005558{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-.0027737{col 67}{space 3}-.0005952
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0046885{col 26}{space 2}  .000921{col 37}{space 1}   -5.09{col 46}{space 3}0.000{col 54}{space 4}-.0064936{col 67}{space 3}-.0028835
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0546887{col 26}{space 2}  .002531{col 37}{space 1}   21.61{col 46}{space 3}0.000{col 54}{space 4}  .049728{col 67}{space 3} .0596494
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0608188{col 26}{space 2} .0025741{col 37}{space 1}   23.63{col 46}{space 3}0.000{col 54}{space 4} .0557735{col 67}{space 3}  .065864
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0567599{col 26}{space 2} .0027068{col 37}{space 1}   20.97{col 46}{space 3}0.000{col 54}{space 4} .0514547{col 67}{space 3} .0620651
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0842139{col 26}{space 2} .0032978{col 37}{space 1}   25.54{col 46}{space 3}0.000{col 54}{space 4} .0777502{col 67}{space 3} .0906775
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0114385{col 26}{space 2} .0016898{col 37}{space 1}   -6.77{col 46}{space 3}0.000{col 54}{space 4}-.0147504{col 67}{space 3}-.0081265
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0151039{col 26}{space 2} .0016476{col 37}{space 1}   -9.17{col 46}{space 3}0.000{col 54}{space 4}-.0183331{col 67}{space 3}-.0118748
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0135074{col 26}{space 2} .0017343{col 37}{space 1}   -7.79{col 46}{space 3}0.000{col 54}{space 4}-.0169066{col 67}{space 3}-.0101082
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0039687{col 26}{space 2} .0013742{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.0066622{col 67}{space 3}-.0012753
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0006555{col 26}{space 2} .0006852{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-.0019986{col 67}{space 3} .0006875
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0005261{col 26}{space 2} .0007274{col 37}{space 1}    0.72{col 46}{space 3}0.470{col 54}{space 4}-.0008996{col 67}{space 3} .0019517
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0000349{col 26}{space 2} .0007305{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-.0014667{col 67}{space 3} .0013969
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0071751{col 26}{space 2} .0009053{col 37}{space 1}   -7.93{col 46}{space 3}0.000{col 54}{space 4}-.0089496{col 67}{space 3}-.0054007
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2} .0006611{col 26}{space 2} .0000483{col 37}{space 1}   13.69{col 46}{space 3}0.000{col 54}{space 4} .0005665{col 67}{space 3} .0007557
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0003627{col 26}{space 2}  .000048{col 37}{space 1}   -7.56{col 46}{space 3}0.000{col 54}{space 4}-.0004568{col 67}{space 3}-.0002687
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0011835{col 26}{space 2} .0000891{col 37}{space 1}  -13.29{col 46}{space 3}0.000{col 54}{space 4} -.001358{col 67}{space 3}-.0010089
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-.3375843{col 26}{space 2}  .128912{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-.5902479{col 67}{space 3}-.0849207
{txt}educ~us_prop {c |}{col 14}{res}{space 2} .7440957{col 26}{space 2}  .117647{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} .5135112{col 67}{space 3} .9746801
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0005168{col 26}{space 2} .0000735{col 37}{space 1}   -7.04{col 46}{space 3}0.000{col 54}{space 4}-.0006608{col 67}{space 3}-.0003729
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 4.58e-07{col 26}{space 2} 3.34e-08{col 37}{space 1}   13.70{col 46}{space 3}0.000{col 54}{space 4} 3.92e-07{col 67}{space 3} 5.23e-07
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.68899{col 26}{space 2} .0283576{col 37}{space 1}   59.56{col 46}{space 3}0.000{col 54}{space 4}  1.63341{col 67}{space 3}  1.74457
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_enr_sib_census.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41645758 .07549254 .40955805 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0046866199   .6200224248          3445{txt}  {c |}
  2 {c |}  {res}.0038429403   .5249523496          2240{txt}  {c |}
  3 {c |}  {res}.0033350788   .4676491674          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0046866199{txt}  {c |}
  2 {c |}  {res}.0038429403{txt}  {c |}
  3 {c |}  {res}.0038429403{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   154.62
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0372
                                                {txt}Root MSE          =    {res} .03197

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     enr_r_d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_noacs {c |}{col 14}{res}{space 2} .1046008{col 26}{space 2} .0084121{col 37}{space 1}   12.43{col 46}{space 3}0.000{col 54}{space 4} .0880975{col 67}{space 3} .1211041
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001932{col 26}{space 2} .0006959{col 37}{space 1}   -0.28{col 46}{space 3}0.781{col 54}{space 4}-.0015585{col 67}{space 3} .0011721
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/fb_test_enr_census.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/fb_test_enr_census.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outcome_va/va_g11_enr_sibling_census.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_va/va_g11_enr_sibling_census.dta{rm}
saved
{p_end}

{com}. ********************************************************************************
. /* do helper file to merge census tract controls to VA sample. Arguments need
> to be set for
> -- what type of VA, test score or outcome
> -- which VA dataset file is being merged to using the tempfile macro in calling file
> -- the name for the tempfile being merged to, using a string
> -- what purpose does the calling do file have, create VA estimates or create VA sample
> -- what is the exact name for the VA being created, what subject or outcome
> 
> If purpose is create_va, this produces a dataset with obs that has non-missing
> census controls, and that are in the touse sample for the corresponding VA estimation 
> 
> See comments above the args command for details on how to set arguments */
. ********************************************************************************
. ********************************************************************************
. *************** written by Che Sun. Email: ucsun@ucdavis.edu *******************
. ********************** First written on April 27. 2022 *************************
. 
. 
. /* To call this do helper file:
> 
> do $vaprojdir/do_files/sbac/merge_va_smp_acs.doh
> 
> AND ADD NECESSARY ARGUMENTS
> 
>  */
. 
. /* CHANGE LOG
> 
>  */
. 
. /*
> -- set va_type to either test_score or outcome
> -- set va_dataset_file to `va_g11_dataset', `va_g11_out_dataset', `va_g11_sibling_dataset',
> or `va_g11_out_sibling_dataset'. MUST pass as macros to give file location
> -- set va_dataset_name to any of the options in va_dataset_file but without macro quotes
> -- set purpose to create_va or create_sample
> -- set va_name to `subject' or `outcome' or none
> */
. 
. 
. args va_type va_dataset_file va_dataset_name purpose va_name
{txt}
{com}. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. import delimited $vaprojdir/data/restricted_access/clean/crosswalks/address_list_census_batch_geocoded.csv ///
>   , delimiter(tab) varnames(1) case(lower) stringcols(_all) clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(13 vars, 11,090,000 obs)

{com}. rename id address_id
{res}{txt}
{com}. gen census_sct = statefp + countyfp + tract
{txt}(2,838,343 missing values generated)

{com}. keep address_id census_sct
{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile census_geocode
{txt}
{com}. save `census_geocode'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000002{rm}
saved
as .dta format
{p_end}

{com}. 
. use merge_id_k12_test_scores state_student_id student_id cdscode year grade ///
>   street_address_line_one street_address_line_two city state zip_code ///
>   using $vaprojdir/data/restricted_access/clean/k12_test_scores/k12_test_scores_clean.dta, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. //keep students in grade 6 in years 2010-2013 to match with census. the census_grade macro is set to 6
. keep if grade==`census_grade' & inrange(year, ``va_type'_min_year'-(11-`census_grade'), ``va_type'_max_year'-(11-`census_grade'))
{txt}(76,338,017 observations deleted)

{com}. drop if mi(state_student_id)
{txt}(2,272 observations deleted)

{com}. duplicates tag state_student_id, gen(dup_ssid)

{p 0 4}{txt}Duplicates in terms of {res} state_student_id{p_end}
{txt}
{com}. egen year_min = min(year) if dup_ssid!=0, by(state_student_id)
{txt}(1,846,043 missing values generated)

{com}. drop if year!=year_min & dup_ssid!=0
{txt}(2,526 observations deleted)

{com}. duplicates drop state_student_id, force

{p 0 4}{txt}Duplicates in terms of {res} state_student_id{p_end}

{txt}(9,913 observations deleted)

{com}. rename year year_grade`census_grade'
{res}{txt}
{com}. keep state_student_id student_id year_grade`census_grade' street_address_line_one street_address_line_two city state zip_code
{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile lagged_address
{txt}
{com}. save `lagged_address'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000003{rm}
saved
as .dta format
{p_end}

{com}. 
. use $vaprojdir/data/restricted_access/clean/crosswalks/address_list.dta, clear
{txt}
{com}. keep address_id street_address_line_one city state zip_code
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(14,185,218 observations deleted)

{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile address_id
{txt}
{com}. save `address_id'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000004{rm}
saved
as .dta format
{p_end}

{com}. 
. use $vaprojdir/data/public_access/clean/acs/acs_ca_census_tract_clean.dta, clear
{txt}
{com}. rename year year_grade`census_grade'
{res}{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile lagged_acs
{txt}
{com}. save `lagged_acs'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000005{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. use `va_dataset_file', clear
{txt}(Enrollment Outcome Grade 11 VA Sample)

{com}. merge m:1 state_student_id using `lagged_address' ///
>   , keep(3) keepusing(street_address_line_one city state zip_code year_grade`census_grade') gen(merge_lagged_address)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         849,331{txt}  (merge_lagged_address==3)
{col 5}{hline 41}

{com}. merge m:1 street_address_line_one city state zip_code using `address_id' ///
>   , keep(3) gen(merge_address_id)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         849,331{txt}  (merge_address_id==3)
{col 5}{hline 41}

{com}. merge m:1 address_id using `census_geocode' ///
>   , keep(3) gen(merge_census_geocode)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         848,975{txt}  (merge_census_geocode==3)
{col 5}{hline 41}

{com}. rename census_sct geoid2
{res}{txt}
{com}. 
. merge m:1 geoid2 year_grade`census_grade' using `lagged_acs' ///
>   , keep(3) gen(merge_acs)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         526,647{txt}  (merge_acs==3)
{col 5}{hline 41}

{com}. rename geoid2 census_sct
{res}{txt}
{com}. foreach v of varlist `census_controls' {c -(}
{txt}  2{com}.   drop if mi(`v')
{txt}  3{com}. {c )-}
{txt}(39 observations deleted)
(0 observations deleted)
(0 observations deleted)
(1 observation deleted)
(0 observations deleted)
(17 observations deleted)
(0 observations deleted)

{com}. 
. // create a sample indicator for obs with census controls
. gen byte census_controls_sample = 1
{txt}
{com}. 
. 
. if "`purpose'" == "create_va" {c -(}
.   // only keep obs needed for the current VA estimation
.   keep if touse_g11_`va_name'==1
{txt}(93,277 observations deleted)
{com}.   di "ACS controls merged successfully to `va_dataset_name'"
{res}ACS controls merged successfully to va_g11_out_sibling_dataset
{com}.   di "Ready to create VA estimates for `va_name'"
{res}Ready to create VA estimates for enr_2year
{com}. {c )-}
{txt}
{com}. else if "`purpose'" == "create_sample" {c -(}
.   di "VA sample including ACS controls created"
. {c )-}
{txt}
{com}. 
{txt}end of do-file
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(36, 433276)   = {res}   675.04
{txt}       Model {c |} {res} 5306.03575        36  147.389882   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  94602.849   433,276  .218343155   {txt}R-squared       ={res}    0.0531
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0530
{txt}       Total {c |} {res} 99908.8848   433,312  .230570316   {txt}Root MSE        =   {res} .46727

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0088359{col 26}{space 2} .0028272{col 37}{space 1}   -3.13{col 46}{space 3}0.002{col 54}{space 4}-.0143771{col 67}{space 3}-.0032947
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0363714{col 26}{space 2} .0028363{col 37}{space 1}  -12.82{col 46}{space 3}0.000{col 54}{space 4}-.0419305{col 67}{space 3}-.0308123
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0109105{col 26}{space 2} .0028607{col 37}{space 1}   -3.81{col 46}{space 3}0.000{col 54}{space 4}-.0165173{col 67}{space 3}-.0053037
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000738{col 26}{space 2} 5.14e-06{col 37}{space 1}  -14.35{col 46}{space 3}0.000{col 54}{space 4}-.0000839{col 67}{space 3}-.0000637
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0220021{col 26}{space 2} .0014525{col 37}{space 1}   15.15{col 46}{space 3}0.000{col 54}{space 4} .0191552{col 67}{space 3} .0248489
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0106871{col 26}{space 2} .0022715{col 37}{space 1}   -4.70{col 46}{space 3}0.000{col 54}{space 4}-.0151391{col 67}{space 3} -.006235
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0068894{col 26}{space 2} .0019921{col 37}{space 1}   -3.46{col 46}{space 3}0.001{col 54}{space 4}-.0107939{col 67}{space 3}-.0029848
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0380581{col 26}{space 2} .0040116{col 37}{space 1}   -9.49{col 46}{space 3}0.000{col 54}{space 4}-.0459208{col 67}{space 3}-.0301955
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0019439{col 26}{space 2} .0043162{col 37}{space 1}    0.45{col 46}{space 3}0.652{col 54}{space 4}-.0065158{col 67}{space 3} .0104035
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0255885{col 26}{space 2} .0016883{col 37}{space 1}  -15.16{col 46}{space 3}0.000{col 54}{space 4}-.0288976{col 67}{space 3}-.0222794
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2} -.024987{col 26}{space 2} .0038798{col 37}{space 1}   -6.44{col 46}{space 3}0.000{col 54}{space 4}-.0325913{col 67}{space 3}-.0173827
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0300342{col 26}{space 2} .0037915{col 37}{space 1}    7.92{col 46}{space 3}0.000{col 54}{space 4} .0226029{col 67}{space 3} .0374654
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0601664{col 26}{space 2} .0028538{col 37}{space 1}  -21.08{col 46}{space 3}0.000{col 54}{space 4}-.0657597{col 67}{space 3}-.0545731
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0561431{col 26}{space 2} .0027846{col 37}{space 1}  -20.16{col 46}{space 3}0.000{col 54}{space 4}-.0616009{col 67}{space 3}-.0506853
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0519468{col 26}{space 2} .0029531{col 37}{space 1}  -17.59{col 46}{space 3}0.000{col 54}{space 4}-.0577348{col 67}{space 3}-.0461588
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0265222{col 26}{space 2} .0036786{col 37}{space 1}   -7.21{col 46}{space 3}0.000{col 54}{space 4}-.0337321{col 67}{space 3}-.0193123
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0421198{col 26}{space 2}  .001511{col 37}{space 1}  -27.87{col 46}{space 3}0.000{col 54}{space 4}-.0450814{col 67}{space 3}-.0391582
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0408507{col 26}{space 2} .0015144{col 37}{space 1}  -26.97{col 46}{space 3}0.000{col 54}{space 4}-.0438189{col 67}{space 3}-.0378825
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0312781{col 26}{space 2} .0015784{col 37}{space 1}  -19.82{col 46}{space 3}0.000{col 54}{space 4}-.0343718{col 67}{space 3}-.0281844
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.032296{col 26}{space 2} .0015745{col 37}{space 1}  -20.51{col 46}{space 3}0.000{col 54}{space 4} -.035382{col 67}{space 3}-.0292099
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .010949{col 26}{space 2} .0006828{col 37}{space 1}   16.03{col 46}{space 3}0.000{col 54}{space 4} .0096107{col 67}{space 3} .0122874
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0107743{col 26}{space 2} .0006275{col 37}{space 1}   17.17{col 46}{space 3}0.000{col 54}{space 4} .0095444{col 67}{space 3} .0120042
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0083567{col 26}{space 2} .0006235{col 37}{space 1}   13.40{col 46}{space 3}0.000{col 54}{space 4} .0071346{col 67}{space 3} .0095787
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0042262{col 26}{space 2} .0010333{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4}  .002201{col 67}{space 3} .0062514
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0656131{col 26}{space 2} .0028392{col 37}{space 1}  -23.11{col 46}{space 3}0.000{col 54}{space 4}-.0711779{col 67}{space 3}-.0600484
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0661042{col 26}{space 2} .0028874{col 37}{space 1}  -22.89{col 46}{space 3}0.000{col 54}{space 4}-.0717635{col 67}{space 3}-.0604449
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0668462{col 26}{space 2} .0030363{col 37}{space 1}  -22.02{col 46}{space 3}0.000{col 54}{space 4}-.0727973{col 67}{space 3}-.0608952
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0559496{col 26}{space 2} .0036984{col 37}{space 1}  -15.13{col 46}{space 3}0.000{col 54}{space 4}-.0631983{col 67}{space 3}-.0487009
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0297278{col 26}{space 2} .0018954{col 37}{space 1}  -15.68{col 46}{space 3}0.000{col 54}{space 4}-.0334428{col 67}{space 3}-.0260128
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0338607{col 26}{space 2} .0018482{col 37}{space 1}  -18.32{col 46}{space 3}0.000{col 54}{space 4}-.0374832{col 67}{space 3}-.0302383
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0267713{col 26}{space 2} .0019458{col 37}{space 1}  -13.76{col 46}{space 3}0.000{col 54}{space 4} -.030585{col 67}{space 3}-.0229577
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0360725{col 26}{space 2} .0015411{col 37}{space 1}  -23.41{col 46}{space 3}0.000{col 54}{space 4}-.0390931{col 67}{space 3} -.033052
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0097408{col 26}{space 2} .0007688{col 37}{space 1}   12.67{col 46}{space 3}0.000{col 54}{space 4}  .008234{col 67}{space 3} .0112476
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0115107{col 26}{space 2} .0008161{col 37}{space 1}   14.11{col 46}{space 3}0.000{col 54}{space 4} .0099112{col 67}{space 3} .0131101
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0093169{col 26}{space 2} .0008196{col 37}{space 1}   11.37{col 46}{space 3}0.000{col 54}{space 4} .0077105{col 67}{space 3} .0109234
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0021713{col 26}{space 2} .0010156{col 37}{space 1}    2.14{col 46}{space 3}0.033{col 54}{space 4} .0001807{col 67}{space 3} .0041618
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .911522{col 26}{space 2} .0314931{col 37}{space 1}   28.94{col 46}{space 3}0.000{col 54}{space 4} .8497964{col 67}{space 3} .9732475
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_enr_2year_census_nosib_noacs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46727204 .09867961 .4567335 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .009177939   .7460293792          3445{txt}  {c |}
  2 {c |}  {res}.0083226199   .6822244309          2240{txt}  {c |}
  3 {c |}  {res}.0074436809   .6297817764          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .009177939{txt}  {c |}
  2 {c |}  {res}.0083226199{txt}  {c |}
  3 {c |}  {res}.0083226199{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res} 14462.38
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0354
                                                {txt}Root MSE          =    {res} .45889

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2year_~s{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_2ye~s {c |}{col 14}{res}{space 2} .9879006{col 26}{space 2} .0082147{col 37}{space 1}  120.26{col 46}{space 3}0.000{col 54}{space 4} .9717843{col 67}{space 3} 1.004017
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0011909{col 26}{space 2} .0003926{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-.0019611{col 67}{space 3}-.0004207
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_enr_2year_census_nosib_noacs.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_enr_2year_census_nosib_noacs.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(38, 433274)   = {res}   694.96
{txt}       Model {c |} {res} 5739.70404        38  151.044843   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 94169.1807   433,274  .217343253   {txt}R-squared       ={res}    0.0574
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0574
{txt}       Total {c |} {res} 99908.8848   433,312  .230570316   {txt}Root MSE        =   {res}  .4662

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0091682{col 26}{space 2} .0028209{col 37}{space 1}   -3.25{col 46}{space 3}0.001{col 54}{space 4} -.014697{col 67}{space 3}-.0036393
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0369478{col 26}{space 2} .0028306{col 37}{space 1}  -13.05{col 46}{space 3}0.000{col 54}{space 4}-.0424957{col 67}{space 3}-.0313999
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.012608{col 26}{space 2}  .002856{col 37}{space 1}   -4.41{col 46}{space 3}0.000{col 54}{space 4}-.0182056{col 67}{space 3}-.0070104
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .1014943{col 26}{space 2} .0027967{col 37}{space 1}   36.29{col 46}{space 3}0.000{col 54}{space 4}  .096013{col 67}{space 3} .1069757
{txt}1.has_~4year {c |}{col 14}{res}{space 2}-.0852628{col 26}{space 2} .0030201{col 37}{space 1}  -28.23{col 46}{space 3}0.000{col 54}{space 4}-.0911821{col 67}{space 3}-.0793435
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0000733{col 26}{space 2} 5.13e-06{col 37}{space 1}  -14.28{col 46}{space 3}0.000{col 54}{space 4}-.0000833{col 67}{space 3}-.0000632
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0221835{col 26}{space 2} .0014492{col 37}{space 1}   15.31{col 46}{space 3}0.000{col 54}{space 4} .0193431{col 67}{space 3} .0250238
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0110293{col 26}{space 2} .0022673{col 37}{space 1}   -4.86{col 46}{space 3}0.000{col 54}{space 4}-.0154731{col 67}{space 3}-.0065855
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0088319{col 26}{space 2} .0019881{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-.0127285{col 67}{space 3}-.0049354
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0382803{col 26}{space 2} .0040024{col 37}{space 1}   -9.56{col 46}{space 3}0.000{col 54}{space 4}-.0461249{col 67}{space 3}-.0304357
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0012966{col 26}{space 2} .0043064{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4}-.0071438{col 67}{space 3} .0097371
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0262682{col 26}{space 2} .0016847{col 37}{space 1}  -15.59{col 46}{space 3}0.000{col 54}{space 4}-.0295702{col 67}{space 3}-.0229662
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0256491{col 26}{space 2} .0038709{col 37}{space 1}   -6.63{col 46}{space 3}0.000{col 54}{space 4} -.033236{col 67}{space 3}-.0180622
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0302117{col 26}{space 2}  .003783{col 37}{space 1}    7.99{col 46}{space 3}0.000{col 54}{space 4} .0227971{col 67}{space 3} .0376262
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0587672{col 26}{space 2} .0028474{col 37}{space 1}  -20.64{col 46}{space 3}0.000{col 54}{space 4}-.0643481{col 67}{space 3}-.0531864
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0546605{col 26}{space 2} .0027785{col 37}{space 1}  -19.67{col 46}{space 3}0.000{col 54}{space 4}-.0601062{col 67}{space 3}-.0492147
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0498938{col 26}{space 2} .0029468{col 37}{space 1}  -16.93{col 46}{space 3}0.000{col 54}{space 4}-.0556694{col 67}{space 3}-.0441182
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0249624{col 26}{space 2} .0036703{col 37}{space 1}   -6.80{col 46}{space 3}0.000{col 54}{space 4}-.0321561{col 67}{space 3}-.0177687
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0417928{col 26}{space 2} .0015076{col 37}{space 1}  -27.72{col 46}{space 3}0.000{col 54}{space 4}-.0447476{col 67}{space 3}-.0388379
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0405008{col 26}{space 2}  .001511{col 37}{space 1}  -26.80{col 46}{space 3}0.000{col 54}{space 4}-.0434623{col 67}{space 3}-.0375393
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0310181{col 26}{space 2} .0015749{col 37}{space 1}  -19.70{col 46}{space 3}0.000{col 54}{space 4}-.0341048{col 67}{space 3}-.0279314
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0320836{col 26}{space 2} .0015709{col 37}{space 1}  -20.42{col 46}{space 3}0.000{col 54}{space 4}-.0351626{col 67}{space 3}-.0290046
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0107811{col 26}{space 2} .0006813{col 37}{space 1}   15.82{col 46}{space 3}0.000{col 54}{space 4} .0094457{col 67}{space 3} .0121164
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0106225{col 26}{space 2} .0006261{col 37}{space 1}   16.97{col 46}{space 3}0.000{col 54}{space 4} .0093954{col 67}{space 3} .0118496
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0081665{col 26}{space 2} .0006221{col 37}{space 1}   13.13{col 46}{space 3}0.000{col 54}{space 4} .0069472{col 67}{space 3} .0093858
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0040396{col 26}{space 2} .0010309{col 37}{space 1}    3.92{col 46}{space 3}0.000{col 54}{space 4}  .002019{col 67}{space 3} .0060602
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0644419{col 26}{space 2} .0028329{col 37}{space 1}  -22.75{col 46}{space 3}0.000{col 54}{space 4}-.0699943{col 67}{space 3}-.0588894
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0645777{col 26}{space 2} .0028813{col 37}{space 1}  -22.41{col 46}{space 3}0.000{col 54}{space 4} -.070225{col 67}{space 3}-.0589305
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0653849{col 26}{space 2} .0030297{col 37}{space 1}  -21.58{col 46}{space 3}0.000{col 54}{space 4} -.071323{col 67}{space 3}-.0594468
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0535092{col 26}{space 2} .0036904{col 37}{space 1}  -14.50{col 46}{space 3}0.000{col 54}{space 4}-.0607422{col 67}{space 3}-.0462761
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0295248{col 26}{space 2} .0018911{col 37}{space 1}  -15.61{col 46}{space 3}0.000{col 54}{space 4}-.0332313{col 67}{space 3}-.0258183
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0335673{col 26}{space 2}  .001844{col 37}{space 1}  -18.20{col 46}{space 3}0.000{col 54}{space 4}-.0371815{col 67}{space 3}-.0299531
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0265601{col 26}{space 2} .0019413{col 37}{space 1}  -13.68{col 46}{space 3}0.000{col 54}{space 4} -.030365{col 67}{space 3}-.0227552
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0353967{col 26}{space 2} .0015377{col 37}{space 1}  -23.02{col 46}{space 3}0.000{col 54}{space 4}-.0384106{col 67}{space 3}-.0323829
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0096388{col 26}{space 2}  .000767{col 37}{space 1}   12.57{col 46}{space 3}0.000{col 54}{space 4} .0081355{col 67}{space 3} .0111421
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0113375{col 26}{space 2} .0008142{col 37}{space 1}   13.92{col 46}{space 3}0.000{col 54}{space 4} .0097417{col 67}{space 3} .0129334
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0091954{col 26}{space 2} .0008178{col 37}{space 1}   11.24{col 46}{space 3}0.000{col 54}{space 4} .0075926{col 67}{space 3} .0107982
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0019474{col 26}{space 2} .0010133{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}-.0000387{col 67}{space 3} .0039334
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .9071638{col 26}{space 2} .0314331{col 37}{space 1}   28.86{col 46}{space 3}0.000{col 54}{space 4} .8455559{col 67}{space 3} .9687718
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_enr_2year_census_noacs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46620087 .0968756 .45602453 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .008833778    .739436961          3445{txt}  {c |}
  2 {c |}  {res}.0079856748   .6742992091          2240{txt}  {c |}
  3 {c |}  {res}.0071244185   .6215851946          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .008833778{txt}  {c |}
  2 {c |}  {res}.0079856748{txt}  {c |}
  3 {c |}  {res}.0079856748{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res} 13781.55
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0341
                                                {txt}Root MSE          =    {res} .45815

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_~r_noacs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_e~r_noacs {c |}{col 14}{res}{space 2} .9884735{col 26}{space 2} .0084201{col 37}{space 1}  117.39{col 46}{space 3}0.000{col 54}{space 4} .9719544{col 67}{space 3} 1.004993
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0012233{col 26}{space 2}  .000393{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-.0019943{col 67}{space 3}-.0004523
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_enr_2year_census_noacs.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_enr_2year_census_noacs.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(45, 433267)   = {res}   664.47
{txt}       Model {c |} {res} 6449.94981        45  143.332218   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  93458.935   433,267  .215707485   {txt}R-squared       ={res}    0.0646
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0645
{txt}       Total {c |} {res} 99908.8848   433,312  .230570316   {txt}Root MSE        =   {res} .46444

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0070702{col 26}{space 2}  .002812{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.0125816{col 67}{space 3}-.0015587
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0343355{col 26}{space 2} .0028275{col 37}{space 1}  -12.14{col 46}{space 3}0.000{col 54}{space 4}-.0398772{col 67}{space 3}-.0287937
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0095491{col 26}{space 2} .0028602{col 37}{space 1}   -3.34{col 46}{space 3}0.001{col 54}{space 4} -.015155{col 67}{space 3}-.0039432
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0987736{col 26}{space 2}  .002787{col 37}{space 1}   35.44{col 46}{space 3}0.000{col 54}{space 4} .0933112{col 67}{space 3}  .104236
{txt}1.has_~4year {c |}{col 14}{res}{space 2}-.0811922{col 26}{space 2} .0030101{col 37}{space 1}  -26.97{col 46}{space 3}0.000{col 54}{space 4}-.0870919{col 67}{space 3}-.0752925
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0000732{col 26}{space 2} 5.12e-06{col 37}{space 1}  -14.29{col 46}{space 3}0.000{col 54}{space 4}-.0000832{col 67}{space 3}-.0000631
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0213554{col 26}{space 2}  .001444{col 37}{space 1}   14.79{col 46}{space 3}0.000{col 54}{space 4} .0185251{col 67}{space 3} .0241856
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0223847{col 26}{space 2} .0025512{col 37}{space 1}   -8.77{col 46}{space 3}0.000{col 54}{space 4} -.027385{col 67}{space 3}-.0173844
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} .0100271{col 26}{space 2}  .002203{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 54}{space 4} .0057092{col 67}{space 3} .0143449
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0144426{col 26}{space 2} .0041875{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4}-.0226499{col 67}{space 3}-.0062352
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0000547{col 26}{space 2} .0043065{col 37}{space 1}   -0.01{col 46}{space 3}0.990{col 54}{space 4}-.0084952{col 67}{space 3} .0083859
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0185921{col 26}{space 2} .0017979{col 37}{space 1}  -10.34{col 46}{space 3}0.000{col 54}{space 4}-.0221159{col 67}{space 3}-.0150683
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0270107{col 26}{space 2} .0038577{col 37}{space 1}   -7.00{col 46}{space 3}0.000{col 54}{space 4}-.0345716{col 67}{space 3}-.0194497
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0264214{col 26}{space 2} .0037744{col 37}{space 1}    7.00{col 46}{space 3}0.000{col 54}{space 4} .0190237{col 67}{space 3} .0338192
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0620657{col 26}{space 2} .0028398{col 37}{space 1}  -21.86{col 46}{space 3}0.000{col 54}{space 4}-.0676315{col 67}{space 3}-.0564998
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0578482{col 26}{space 2} .0027712{col 37}{space 1}  -20.87{col 46}{space 3}0.000{col 54}{space 4}-.0632797{col 67}{space 3}-.0524168
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0523134{col 26}{space 2} .0029399{col 37}{space 1}  -17.79{col 46}{space 3}0.000{col 54}{space 4}-.0580754{col 67}{space 3}-.0465513
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0266553{col 26}{space 2} .0036579{col 37}{space 1}   -7.29{col 46}{space 3}0.000{col 54}{space 4}-.0338247{col 67}{space 3} -.019486
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0404578{col 26}{space 2} .0015022{col 37}{space 1}  -26.93{col 46}{space 3}0.000{col 54}{space 4}-.0434021{col 67}{space 3}-.0375135
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0391309{col 26}{space 2} .0015056{col 37}{space 1}  -25.99{col 46}{space 3}0.000{col 54}{space 4}-.0420819{col 67}{space 3}-.0361799
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.029453{col 26}{space 2} .0015693{col 37}{space 1}  -18.77{col 46}{space 3}0.000{col 54}{space 4}-.0325288{col 67}{space 3}-.0263772
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0309882{col 26}{space 2} .0015652{col 37}{space 1}  -19.80{col 46}{space 3}0.000{col 54}{space 4}-.0340559{col 67}{space 3}-.0279206
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0107681{col 26}{space 2} .0006787{col 37}{space 1}   15.86{col 46}{space 3}0.000{col 54}{space 4} .0094377{col 67}{space 3} .0120984
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0106082{col 26}{space 2} .0006238{col 37}{space 1}   17.01{col 46}{space 3}0.000{col 54}{space 4} .0093857{col 67}{space 3} .0118307
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0080601{col 26}{space 2} .0006198{col 37}{space 1}   13.00{col 46}{space 3}0.000{col 54}{space 4} .0068453{col 67}{space 3} .0092749
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0041865{col 26}{space 2} .0010271{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} .0021735{col 67}{space 3} .0061995
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.063519{col 26}{space 2} .0028226{col 37}{space 1}  -22.50{col 46}{space 3}0.000{col 54}{space 4}-.0690513{col 67}{space 3}-.0579867
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0637329{col 26}{space 2} .0028707{col 37}{space 1}  -22.20{col 46}{space 3}0.000{col 54}{space 4}-.0693595{col 67}{space 3}-.0581064
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0641532{col 26}{space 2} .0030187{col 37}{space 1}  -21.25{col 46}{space 3}0.000{col 54}{space 4}-.0700696{col 67}{space 3}-.0582367
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0552669{col 26}{space 2} .0036778{col 37}{space 1}  -15.03{col 46}{space 3}0.000{col 54}{space 4}-.0624753{col 67}{space 3}-.0480585
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0272803{col 26}{space 2} .0018845{col 37}{space 1}  -14.48{col 46}{space 3}0.000{col 54}{space 4}-.0309738{col 67}{space 3}-.0235868
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0317962{col 26}{space 2} .0018374{col 37}{space 1}  -17.30{col 46}{space 3}0.000{col 54}{space 4}-.0353975{col 67}{space 3}-.0281949
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0255454{col 26}{space 2} .0019341{col 37}{space 1}  -13.21{col 46}{space 3}0.000{col 54}{space 4}-.0293363{col 67}{space 3}-.0217545
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.034228{col 26}{space 2} .0015326{col 37}{space 1}  -22.33{col 46}{space 3}0.000{col 54}{space 4}-.0372318{col 67}{space 3}-.0312242
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0090354{col 26}{space 2} .0007642{col 37}{space 1}   11.82{col 46}{space 3}0.000{col 54}{space 4} .0075376{col 67}{space 3} .0105333
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0108946{col 26}{space 2} .0008112{col 37}{space 1}   13.43{col 46}{space 3}0.000{col 54}{space 4} .0093047{col 67}{space 3} .0124845
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0089439{col 26}{space 2} .0008147{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .0073471{col 67}{space 3} .0105407
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0023692{col 26}{space 2} .0010097{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0003903{col 67}{space 3} .0043481
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2} .0006699{col 26}{space 2} .0000538{col 37}{space 1}   12.44{col 46}{space 3}0.000{col 54}{space 4} .0005644{col 67}{space 3} .0007754
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0010112{col 26}{space 2} .0000535{col 37}{space 1}  -18.89{col 46}{space 3}0.000{col 54}{space 4}-.0011162{col 67}{space 3}-.0009063
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0024909{col 26}{space 2} .0000993{col 37}{space 1}  -25.08{col 46}{space 3}0.000{col 54}{space 4}-.0026856{col 67}{space 3}-.0022963
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-2.086824{col 26}{space 2} .1437657{col 37}{space 1}  -14.52{col 46}{space 3}0.000{col 54}{space 4}  -2.3686{col 67}{space 3}-1.805047
{txt}educ~us_prop {c |}{col 14}{res}{space 2} -1.75916{col 26}{space 2} .1312026{col 37}{space 1}  -13.41{col 46}{space 3}0.000{col 54}{space 4}-2.016313{col 67}{space 3}-1.502007
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0012668{col 26}{space 2} .0000819{col 37}{space 1}  -15.47{col 46}{space 3}0.000{col 54}{space 4}-.0014274{col 67}{space 3}-.0011063
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2}-1.18e-06{col 26}{space 2} 3.73e-08{col 37}{space 1}  -31.53{col 46}{space 3}0.000{col 54}{space 4}-1.25e-06{col 67}{space 3}-1.10e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.070388{col 26}{space 2}  .031625{col 37}{space 1}   33.85{col 46}{space 3}0.000{col 54}{space 4} 1.008404{col 67}{space 3} 1.132373
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_enr_2year_sib_census.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.4644432 .08687414 .45624595 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0069181974   .6877463941          3445{txt}  {c |}
  2 {c |}  {res}.0060912743    .608843009          2240{txt}  {c |}
  3 {c |}  {res}.0053734278   .5515214675          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0069181974{txt}  {c |}
  2 {c |}  {res}.0060912743{txt}  {c |}
  3 {c |}  {res}.0060912743{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   256.72
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0980
                                                {txt}Root MSE          =    {res} .03845

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2year_~d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_e~r_noacs {c |}{col 14}{res}{space 2}  .145408{col 26}{space 2} .0090752{col 37}{space 1}   16.02{col 46}{space 3}0.000{col 54}{space 4} .1276037{col 67}{space 3} .1632123
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0002132{col 26}{space 2} .0007862{col 37}{space 1}   -0.27{col 46}{space 3}0.786{col 54}{space 4}-.0017556{col 67}{space 3} .0013292
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/fb_test_enr_2year_census.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/fb_test_enr_2year_census.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outcome_va/va_g11_enr_2year_sibling_census.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_va/va_g11_enr_2year_sibling_census.dta{rm}
saved
{p_end}

{com}. ********************************************************************************
. /* do helper file to merge census tract controls to VA sample. Arguments need
> to be set for
> -- what type of VA, test score or outcome
> -- which VA dataset file is being merged to using the tempfile macro in calling file
> -- the name for the tempfile being merged to, using a string
> -- what purpose does the calling do file have, create VA estimates or create VA sample
> -- what is the exact name for the VA being created, what subject or outcome
> 
> If purpose is create_va, this produces a dataset with obs that has non-missing
> census controls, and that are in the touse sample for the corresponding VA estimation 
> 
> See comments above the args command for details on how to set arguments */
. ********************************************************************************
. ********************************************************************************
. *************** written by Che Sun. Email: ucsun@ucdavis.edu *******************
. ********************** First written on April 27. 2022 *************************
. 
. 
. /* To call this do helper file:
> 
> do $vaprojdir/do_files/sbac/merge_va_smp_acs.doh
> 
> AND ADD NECESSARY ARGUMENTS
> 
>  */
. 
. /* CHANGE LOG
> 
>  */
. 
. /*
> -- set va_type to either test_score or outcome
> -- set va_dataset_file to `va_g11_dataset', `va_g11_out_dataset', `va_g11_sibling_dataset',
> or `va_g11_out_sibling_dataset'. MUST pass as macros to give file location
> -- set va_dataset_name to any of the options in va_dataset_file but without macro quotes
> -- set purpose to create_va or create_sample
> -- set va_name to `subject' or `outcome' or none
> */
. 
. 
. args va_type va_dataset_file va_dataset_name purpose va_name
{txt}
{com}. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. import delimited $vaprojdir/data/restricted_access/clean/crosswalks/address_list_census_batch_geocoded.csv ///
>   , delimiter(tab) varnames(1) case(lower) stringcols(_all) clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(13 vars, 11,090,000 obs)

{com}. rename id address_id
{res}{txt}
{com}. gen census_sct = statefp + countyfp + tract
{txt}(2,838,343 missing values generated)

{com}. keep address_id census_sct
{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile census_geocode
{txt}
{com}. save `census_geocode'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000002{rm}
saved
as .dta format
{p_end}

{com}. 
. use merge_id_k12_test_scores state_student_id student_id cdscode year grade ///
>   street_address_line_one street_address_line_two city state zip_code ///
>   using $vaprojdir/data/restricted_access/clean/k12_test_scores/k12_test_scores_clean.dta, clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. //keep students in grade 6 in years 2010-2013 to match with census. the census_grade macro is set to 6
. keep if grade==`census_grade' & inrange(year, ``va_type'_min_year'-(11-`census_grade'), ``va_type'_max_year'-(11-`census_grade'))
{txt}(76,338,017 observations deleted)

{com}. drop if mi(state_student_id)
{txt}(2,272 observations deleted)

{com}. duplicates tag state_student_id, gen(dup_ssid)

{p 0 4}{txt}Duplicates in terms of {res} state_student_id{p_end}
{txt}
{com}. egen year_min = min(year) if dup_ssid!=0, by(state_student_id)
{txt}(1,846,043 missing values generated)

{com}. drop if year!=year_min & dup_ssid!=0
{txt}(2,526 observations deleted)

{com}. duplicates drop state_student_id, force

{p 0 4}{txt}Duplicates in terms of {res} state_student_id{p_end}

{txt}(9,913 observations deleted)

{com}. rename year year_grade`census_grade'
{res}{txt}
{com}. keep state_student_id student_id year_grade`census_grade' street_address_line_one street_address_line_two city state zip_code
{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile lagged_address
{txt}
{com}. save `lagged_address'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000003{rm}
saved
as .dta format
{p_end}

{com}. 
. use $vaprojdir/data/restricted_access/clean/crosswalks/address_list.dta, clear
{txt}
{com}. keep address_id street_address_line_one city state zip_code
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(14,185,218 observations deleted)

{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile address_id
{txt}
{com}. save `address_id'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000004{rm}
saved
as .dta format
{p_end}

{com}. 
. use $vaprojdir/data/public_access/clean/acs/acs_ca_census_tract_clean.dta, clear
{txt}
{com}. rename year year_grade`census_grade'
{res}{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile lagged_acs
{txt}
{com}. save `lagged_acs'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000005{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. use `va_dataset_file', clear
{txt}(Enrollment Outcome Grade 11 VA Sample)

{com}. merge m:1 state_student_id using `lagged_address' ///
>   , keep(3) keepusing(street_address_line_one city state zip_code year_grade`census_grade') gen(merge_lagged_address)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         849,331{txt}  (merge_lagged_address==3)
{col 5}{hline 41}

{com}. merge m:1 street_address_line_one city state zip_code using `address_id' ///
>   , keep(3) gen(merge_address_id)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         849,331{txt}  (merge_address_id==3)
{col 5}{hline 41}

{com}. merge m:1 address_id using `census_geocode' ///
>   , keep(3) gen(merge_census_geocode)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         848,975{txt}  (merge_census_geocode==3)
{col 5}{hline 41}

{com}. rename census_sct geoid2
{res}{txt}
{com}. 
. merge m:1 geoid2 year_grade`census_grade' using `lagged_acs' ///
>   , keep(3) gen(merge_acs)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         526,647{txt}  (merge_acs==3)
{col 5}{hline 41}

{com}. rename geoid2 census_sct
{res}{txt}
{com}. foreach v of varlist `census_controls' {c -(}
{txt}  2{com}.   drop if mi(`v')
{txt}  3{com}. {c )-}
{txt}(39 observations deleted)
(0 observations deleted)
(0 observations deleted)
(1 observation deleted)
(0 observations deleted)
(17 observations deleted)
(0 observations deleted)

{com}. 
. // create a sample indicator for obs with census controls
. gen byte census_controls_sample = 1
{txt}
{com}. 
. 
. if "`purpose'" == "create_va" {c -(}
.   // only keep obs needed for the current VA estimation
.   keep if touse_g11_`va_name'==1
{txt}(93,277 observations deleted)
{com}.   di "ACS controls merged successfully to `va_dataset_name'"
{res}ACS controls merged successfully to va_g11_out_sibling_dataset
{com}.   di "Ready to create VA estimates for `va_name'"
{res}Ready to create VA estimates for enr_4year
{com}. {c )-}
{txt}
{com}. else if "`purpose'" == "create_sample" {c -(}
.   di "VA sample including ACS controls created"
. {c )-}
{txt}
{com}. 
{txt}end of do-file
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(36, 433276)   = {res}  3794.91
{txt}       Model {c |} {res} 24124.1901        36  670.116391   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 76509.1332   433,276  .176582901   {txt}R-squared       ={res}    0.2397
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2397
{txt}       Total {c |} {res} 100633.323   433,312  .232242179   {txt}Root MSE        =   {res} .42022

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0170234{col 26}{space 2} .0025425{col 37}{space 1}    6.70{col 46}{space 3}0.000{col 54}{space 4} .0120402{col 67}{space 3} .0220066
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0208863{col 26}{space 2} .0025507{col 37}{space 1}    8.19{col 46}{space 3}0.000{col 54}{space 4}  .015887{col 67}{space 3} .0258856
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0174632{col 26}{space 2} .0025726{col 37}{space 1}   -6.79{col 46}{space 3}0.000{col 54}{space 4}-.0225054{col 67}{space 3} -.012421
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000755{col 26}{space 2} 4.62e-06{col 37}{space 1}  -16.32{col 46}{space 3}0.000{col 54}{space 4}-.0000845{col 67}{space 3}-.0000664
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0896716{col 26}{space 2} .0013062{col 37}{space 1}  -68.65{col 46}{space 3}0.000{col 54}{space 4}-.0922318{col 67}{space 3}-.0871114
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0666746{col 26}{space 2} .0020428{col 37}{space 1}   32.64{col 46}{space 3}0.000{col 54}{space 4} .0626708{col 67}{space 3} .0706783
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0228213{col 26}{space 2} .0017915{col 37}{space 1}  -12.74{col 46}{space 3}0.000{col 54}{space 4}-.0263327{col 67}{space 3}  -.01931
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0378637{col 26}{space 2} .0036076{col 37}{space 1}   10.50{col 46}{space 3}0.000{col 54}{space 4} .0307928{col 67}{space 3} .0449345
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} -.014251{col 26}{space 2} .0038816{col 37}{space 1}   -3.67{col 46}{space 3}0.000{col 54}{space 4}-.0218588{col 67}{space 3}-.0066432
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0430801{col 26}{space 2} .0015183{col 37}{space 1}  -28.37{col 46}{space 3}0.000{col 54}{space 4} -.046056{col 67}{space 3}-.0401043
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0247897{col 26}{space 2} .0034891{col 37}{space 1}   -7.10{col 46}{space 3}0.000{col 54}{space 4}-.0316282{col 67}{space 3}-.0179512
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0475722{col 26}{space 2} .0034097{col 37}{space 1}  -13.95{col 46}{space 3}0.000{col 54}{space 4}-.0542552{col 67}{space 3}-.0408893
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1413601{col 26}{space 2} .0025664{col 37}{space 1}   55.08{col 46}{space 3}0.000{col 54}{space 4}   .13633{col 67}{space 3} .1463901
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1280738{col 26}{space 2} .0025042{col 37}{space 1}   51.14{col 46}{space 3}0.000{col 54}{space 4} .1231656{col 67}{space 3}  .132982
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1263107{col 26}{space 2} .0026557{col 37}{space 1}   47.56{col 46}{space 3}0.000{col 54}{space 4} .1211056{col 67}{space 3} .1315159
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0979171{col 26}{space 2} .0033081{col 37}{space 1}   29.60{col 46}{space 3}0.000{col 54}{space 4} .0914332{col 67}{space 3}  .104401
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0238147{col 26}{space 2} .0013589{col 37}{space 1}   17.53{col 46}{space 3}0.000{col 54}{space 4} .0211513{col 67}{space 3}  .026478
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0181988{col 26}{space 2} .0013619{col 37}{space 1}   13.36{col 46}{space 3}0.000{col 54}{space 4} .0155295{col 67}{space 3} .0208682
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0192971{col 26}{space 2} .0014195{col 37}{space 1}   13.59{col 46}{space 3}0.000{col 54}{space 4}  .016515{col 67}{space 3} .0220793
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0189836{col 26}{space 2}  .001416{col 37}{space 1}   13.41{col 46}{space 3}0.000{col 54}{space 4} .0162083{col 67}{space 3} .0217589
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  -.01151{col 26}{space 2} .0006141{col 37}{space 1}  -18.74{col 46}{space 3}0.000{col 54}{space 4}-.0127136{col 67}{space 3}-.0103064
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0095631{col 26}{space 2} .0005643{col 37}{space 1}  -16.95{col 46}{space 3}0.000{col 54}{space 4}-.0106692{col 67}{space 3}-.0084571
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0102495{col 26}{space 2} .0005607{col 37}{space 1}  -18.28{col 46}{space 3}0.000{col 54}{space 4}-.0113485{col 67}{space 3}-.0091505
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0090058{col 26}{space 2} .0009292{col 37}{space 1}   -9.69{col 46}{space 3}0.000{col 54}{space 4} -.010827{col 67}{space 3}-.0071845
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .122289{col 26}{space 2} .0025533{col 37}{space 1}   47.89{col 46}{space 3}0.000{col 54}{space 4} .1172846{col 67}{space 3} .1272933
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1292095{col 26}{space 2} .0025967{col 37}{space 1}   49.76{col 46}{space 3}0.000{col 54}{space 4} .1241201{col 67}{space 3} .1342989
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1251134{col 26}{space 2} .0027305{col 37}{space 1}   45.82{col 46}{space 3}0.000{col 54}{space 4} .1197616{col 67}{space 3} .1304652
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1449453{col 26}{space 2} .0033259{col 37}{space 1}   43.58{col 46}{space 3}0.000{col 54}{space 4} .1384265{col 67}{space 3}  .151464
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0178444{col 26}{space 2} .0017046{col 37}{space 1}   10.47{col 46}{space 3}0.000{col 54}{space 4} .0145036{col 67}{space 3} .0211853
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .018356{col 26}{space 2} .0016621{col 37}{space 1}   11.04{col 46}{space 3}0.000{col 54}{space 4} .0150983{col 67}{space 3} .0216137
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0134031{col 26}{space 2} .0017498{col 37}{space 1}    7.66{col 46}{space 3}0.000{col 54}{space 4} .0099735{col 67}{space 3} .0168327
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0332113{col 26}{space 2} .0013859{col 37}{space 1}   23.96{col 46}{space 3}0.000{col 54}{space 4} .0304949{col 67}{space 3} .0359277
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0101661{col 26}{space 2} .0006913{col 37}{space 1}  -14.70{col 46}{space 3}0.000{col 54}{space 4}-.0115211{col 67}{space 3}-.0088111
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0108745{col 26}{space 2} .0007339{col 37}{space 1}  -14.82{col 46}{space 3}0.000{col 54}{space 4}-.0123129{col 67}{space 3}-.0094361
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0093004{col 26}{space 2} .0007371{col 37}{space 1}  -12.62{col 46}{space 3}0.000{col 54}{space 4} -.010745{col 67}{space 3}-.0078557
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0092022{col 26}{space 2} .0009133{col 37}{space 1}  -10.08{col 46}{space 3}0.000{col 54}{space 4}-.0109923{col 67}{space 3}-.0074121
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .8096241{col 26}{space 2} .0283218{col 37}{space 1}   28.59{col 46}{space 3}0.000{col 54}{space 4} .7541143{col 67}{space 3} .8651339
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_enr_4year_census_nosib_noacs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.42021768 .09076259 .41029874 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0078669166    .768767781          3445{txt}  {c |}
  2 {c |}  {res}.0076120441   .7454761302          2240{txt}  {c |}
  3 {c |}  {res} .007143041   .7126992407          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0078669166{txt}  {c |}
  2 {c |}  {res}.0076120441{txt}  {c |}
  3 {c |}  {res}.0076120441{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res} 24862.23
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0392
                                                {txt}Root MSE          =    {res} .41195

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4year_~s{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_4ye~s {c |}{col 14}{res}{space 2} 1.021422{col 26}{space 2} .0064779{col 37}{space 1}  157.68{col 46}{space 3}0.000{col 54}{space 4} 1.008713{col 67}{space 3} 1.034131
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.000353{col 26}{space 2} .0002432{col 37}{space 1}   -1.45{col 46}{space 3}0.147{col 54}{space 4}-.0008301{col 67}{space 3} .0001242
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_enr_4year_census_nosib_noacs.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_enr_4year_census_nosib_noacs.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(38, 433274)   = {res}  3722.97
{txt}       Model {c |} {res} 24770.6875        38  651.860198   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75862.6357   433,274  .175091595   {txt}R-squared       ={res}    0.2461
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2461
{txt}       Total {c |} {res} 100633.323   433,312  .232242179   {txt}Root MSE        =   {res} .41844

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0167978{col 26}{space 2} .0025319{col 37}{space 1}    6.63{col 46}{space 3}0.000{col 54}{space 4} .0118353{col 67}{space 3} .0217602
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0202257{col 26}{space 2} .0025406{col 37}{space 1}    7.96{col 46}{space 3}0.000{col 54}{space 4} .0152462{col 67}{space 3} .0252052
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0174785{col 26}{space 2} .0025634{col 37}{space 1}   -6.82{col 46}{space 3}0.000{col 54}{space 4}-.0225026{col 67}{space 3}-.0124543
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0821487{col 26}{space 2} .0025102{col 37}{space 1}  -32.73{col 46}{space 3}0.000{col 54}{space 4}-.0870685{col 67}{space 3}-.0772289
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .1439901{col 26}{space 2} .0027107{col 37}{space 1}   53.12{col 46}{space 3}0.000{col 54}{space 4} .1386772{col 67}{space 3}  .149303
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0000738{col 26}{space 2} 4.61e-06{col 37}{space 1}  -16.03{col 46}{space 3}0.000{col 54}{space 4}-.0000828{col 67}{space 3}-.0000648
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0899025{col 26}{space 2} .0013007{col 37}{space 1}  -69.12{col 46}{space 3}0.000{col 54}{space 4}-.0924518{col 67}{space 3}-.0873532
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0657238{col 26}{space 2}  .002035{col 37}{space 1}   32.30{col 46}{space 3}0.000{col 54}{space 4} .0617352{col 67}{space 3} .0697123
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0206885{col 26}{space 2} .0017844{col 37}{space 1}  -11.59{col 46}{space 3}0.000{col 54}{space 4}-.0241859{col 67}{space 3}-.0171912
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0380228{col 26}{space 2} .0035924{col 37}{space 1}   10.58{col 46}{space 3}0.000{col 54}{space 4} .0309818{col 67}{space 3} .0450637
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} -.012971{col 26}{space 2} .0038652{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-.0205468{col 67}{space 3}-.0053953
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0428262{col 26}{space 2} .0015121{col 37}{space 1}  -28.32{col 46}{space 3}0.000{col 54}{space 4}-.0457899{col 67}{space 3}-.0398624
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0240449{col 26}{space 2} .0034744{col 37}{space 1}   -6.92{col 46}{space 3}0.000{col 54}{space 4}-.0308545{col 67}{space 3}-.0172353
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0470655{col 26}{space 2} .0033954{col 37}{space 1}  -13.86{col 46}{space 3}0.000{col 54}{space 4}-.0537204{col 67}{space 3}-.0404105
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1398705{col 26}{space 2} .0025557{col 37}{space 1}   54.73{col 46}{space 3}0.000{col 54}{space 4} .1348614{col 67}{space 3} .1448796
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1266532{col 26}{space 2} .0024938{col 37}{space 1}   50.79{col 46}{space 3}0.000{col 54}{space 4} .1217653{col 67}{space 3}  .131541
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1244796{col 26}{space 2} .0026449{col 37}{space 1}   47.06{col 46}{space 3}0.000{col 54}{space 4} .1192957{col 67}{space 3} .1296636
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0960133{col 26}{space 2} .0032943{col 37}{space 1}   29.15{col 46}{space 3}0.000{col 54}{space 4} .0895566{col 67}{space 3}   .10247
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0235566{col 26}{space 2} .0013531{col 37}{space 1}   17.41{col 46}{space 3}0.000{col 54}{space 4} .0209045{col 67}{space 3} .0262088
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0179673{col 26}{space 2} .0013562{col 37}{space 1}   13.25{col 46}{space 3}0.000{col 54}{space 4} .0153092{col 67}{space 3} .0206254
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0192593{col 26}{space 2} .0014135{col 37}{space 1}   13.62{col 46}{space 3}0.000{col 54}{space 4} .0164888{col 67}{space 3} .0220298
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0188166{col 26}{space 2}   .00141{col 37}{space 1}   13.35{col 46}{space 3}0.000{col 54}{space 4} .0160531{col 67}{space 3} .0215802
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0113064{col 26}{space 2} .0006115{col 37}{space 1}  -18.49{col 46}{space 3}0.000{col 54}{space 4}-.0125049{col 67}{space 3}-.0101079
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0094142{col 26}{space 2} .0005619{col 37}{space 1}  -16.75{col 46}{space 3}0.000{col 54}{space 4}-.0105156{col 67}{space 3}-.0083128
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0100829{col 26}{space 2} .0005584{col 37}{space 1}  -18.06{col 46}{space 3}0.000{col 54}{space 4}-.0111773{col 67}{space 3}-.0089886
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0086964{col 26}{space 2} .0009253{col 37}{space 1}   -9.40{col 46}{space 3}0.000{col 54}{space 4}-.0105099{col 67}{space 3}-.0068828
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1204667{col 26}{space 2} .0025427{col 37}{space 1}   47.38{col 46}{space 3}0.000{col 54}{space 4} .1154831{col 67}{space 3} .1254502
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1266712{col 26}{space 2} .0025861{col 37}{space 1}   48.98{col 46}{space 3}0.000{col 54}{space 4} .1216024{col 67}{space 3} .1317399
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1227883{col 26}{space 2} .0027193{col 37}{space 1}   45.15{col 46}{space 3}0.000{col 54}{space 4} .1174585{col 67}{space 3} .1281181
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .141611{col 26}{space 2} .0033123{col 37}{space 1}   42.75{col 46}{space 3}0.000{col 54}{space 4}  .135119{col 67}{space 3} .1481031
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0177595{col 26}{space 2} .0016974{col 37}{space 1}   10.46{col 46}{space 3}0.000{col 54}{space 4} .0144328{col 67}{space 3} .0210863
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0181254{col 26}{space 2} .0016551{col 37}{space 1}   10.95{col 46}{space 3}0.000{col 54}{space 4} .0148814{col 67}{space 3} .0213693
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0131921{col 26}{space 2} .0017424{col 37}{space 1}    7.57{col 46}{space 3}0.000{col 54}{space 4}  .009777{col 67}{space 3} .0166072
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0326959{col 26}{space 2} .0013802{col 37}{space 1}   23.69{col 46}{space 3}0.000{col 54}{space 4} .0299908{col 67}{space 3}  .035401
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0100357{col 26}{space 2} .0006884{col 37}{space 1}  -14.58{col 46}{space 3}0.000{col 54}{space 4} -.011385{col 67}{space 3}-.0086864
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106043{col 26}{space 2} .0007308{col 37}{space 1}  -14.51{col 46}{space 3}0.000{col 54}{space 4}-.0120367{col 67}{space 3} -.009172
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0090986{col 26}{space 2}  .000734{col 37}{space 1}  -12.40{col 46}{space 3}0.000{col 54}{space 4}-.0105372{col 67}{space 3}  -.00766
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0088178{col 26}{space 2} .0009095{col 37}{space 1}   -9.70{col 46}{space 3}0.000{col 54}{space 4}-.0106004{col 67}{space 3}-.0070353
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7969736{col 26}{space 2} .0282129{col 37}{space 1}   28.25{col 46}{space 3}0.000{col 54}{space 4} .7416772{col 67}{space 3}   .85227
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_enr_4year_census_noacs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41843948 .08861685 .40894822 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .007497821   .7617146919          3445{txt}  {c |}
  2 {c |}  {res}.0072295401   .7368737765          2240{txt}  {c |}
  3 {c |}  {res} .006754941   .7027696277          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .007497821{txt}  {c |}
  2 {c |}  {res}.0072295401{txt}  {c |}
  3 {c |}  {res}.0072295401{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res} 22786.69
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0374
                                                {txt}Root MSE          =    {res} .41059

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_~r_noacs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_e~r_noacs {c |}{col 14}{res}{space 2} 1.021645{col 26}{space 2}  .006768{col 37}{space 1}  150.95{col 46}{space 3}0.000{col 54}{space 4} 1.008367{col 67}{space 3} 1.034923
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0003298{col 26}{space 2} .0002464{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-.0008131{col 67}{space 3} .0001536
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_enr_4year_census_noacs.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_enr_4year_census_noacs.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   433,313
{txt}{hline 13}{c +}{hline 34}   F(45, 433267)   = {res}  3281.02
{txt}       Model {c |} {res} 25577.1358        45  568.380795   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75056.1875   433,267  .173233105   {txt}R-squared       ={res}    0.2542
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2541
{txt}       Total {c |} {res} 100633.323   433,312  .232242179   {txt}Root MSE        =   {res} .41621

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0147627{col 26}{space 2}   .00252{col 37}{space 1}    5.86{col 46}{space 3}0.000{col 54}{space 4} .0098236{col 67}{space 3} .0197018
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0172755{col 26}{space 2} .0025339{col 37}{space 1}    6.82{col 46}{space 3}0.000{col 54}{space 4} .0123092{col 67}{space 3} .0222418
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.019381{col 26}{space 2} .0025632{col 37}{space 1}   -7.56{col 46}{space 3}0.000{col 54}{space 4}-.0244047{col 67}{space 3}-.0143572
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0785721{col 26}{space 2} .0024976{col 37}{space 1}  -31.46{col 46}{space 3}0.000{col 54}{space 4}-.0834673{col 67}{space 3}-.0736769
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .1397799{col 26}{space 2} .0026975{col 37}{space 1}   51.82{col 46}{space 3}0.000{col 54}{space 4} .1344929{col 67}{space 3} .1450669
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0000785{col 26}{space 2} 4.59e-06{col 37}{space 1}  -17.11{col 46}{space 3}0.000{col 54}{space 4}-.0000875{col 67}{space 3}-.0000695
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0901442{col 26}{space 2} .0012941{col 37}{space 1}  -69.66{col 46}{space 3}0.000{col 54}{space 4}-.0926805{col 67}{space 3}-.0876079
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0687116{col 26}{space 2} .0022863{col 37}{space 1}   30.05{col 46}{space 3}0.000{col 54}{space 4} .0642305{col 67}{space 3} .0731927
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0121448{col 26}{space 2} .0019742{col 37}{space 1}   -6.15{col 46}{space 3}0.000{col 54}{space 4}-.0160142{col 67}{space 3}-.0082754
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0407627{col 26}{space 2} .0037526{col 37}{space 1}   10.86{col 46}{space 3}0.000{col 54}{space 4} .0334076{col 67}{space 3} .0481177
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0090825{col 26}{space 2} .0038593{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0166465{col 67}{space 3}-.0015184
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0233142{col 26}{space 2} .0016112{col 37}{space 1}  -14.47{col 46}{space 3}0.000{col 54}{space 4}-.0264721{col 67}{space 3}-.0201563
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0228366{col 26}{space 2} .0034571{col 37}{space 1}   -6.61{col 46}{space 3}0.000{col 54}{space 4}-.0296124{col 67}{space 3}-.0160608
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0526477{col 26}{space 2} .0033825{col 37}{space 1}  -15.56{col 46}{space 3}0.000{col 54}{space 4}-.0592772{col 67}{space 3}-.0460182
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1375814{col 26}{space 2} .0025449{col 37}{space 1}   54.06{col 46}{space 3}0.000{col 54}{space 4} .1325935{col 67}{space 3} .1425692
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1243281{col 26}{space 2} .0024834{col 37}{space 1}   50.06{col 46}{space 3}0.000{col 54}{space 4} .1194607{col 67}{space 3} .1291955
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1200595{col 26}{space 2} .0026346{col 37}{space 1}   45.57{col 46}{space 3}0.000{col 54}{space 4} .1148958{col 67}{space 3} .1252232
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .093844{col 26}{space 2}  .003278{col 37}{space 1}   28.63{col 46}{space 3}0.000{col 54}{space 4} .0874191{col 67}{space 3} .1002688
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0221342{col 26}{space 2} .0013462{col 37}{space 1}   16.44{col 46}{space 3}0.000{col 54}{space 4} .0194957{col 67}{space 3} .0247728
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0165582{col 26}{space 2} .0013493{col 37}{space 1}   12.27{col 46}{space 3}0.000{col 54}{space 4} .0139136{col 67}{space 3} .0192027
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0174806{col 26}{space 2} .0014063{col 37}{space 1}   12.43{col 46}{space 3}0.000{col 54}{space 4} .0147242{col 67}{space 3}  .020237
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0181502{col 26}{space 2} .0014026{col 37}{space 1}   12.94{col 46}{space 3}0.000{col 54}{space 4} .0154011{col 67}{space 3} .0208992
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0111868{col 26}{space 2} .0006083{col 37}{space 1}  -18.39{col 46}{space 3}0.000{col 54}{space 4} -.012379{col 67}{space 3}-.0099946
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0093875{col 26}{space 2}  .000559{col 37}{space 1}  -16.79{col 46}{space 3}0.000{col 54}{space 4}-.0104831{col 67}{space 3}-.0082919
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0097445{col 26}{space 2} .0005554{col 37}{space 1}  -17.54{col 46}{space 3}0.000{col 54}{space 4}-.0108332{col 67}{space 3}-.0086559
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.008875{col 26}{space 2} .0009204{col 37}{space 1}   -9.64{col 46}{space 3}0.000{col 54}{space 4} -.010679{col 67}{space 3}-.0070711
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1182077{col 26}{space 2} .0025295{col 37}{space 1}   46.73{col 46}{space 3}0.000{col 54}{space 4}   .11325{col 67}{space 3} .1231655
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1245517{col 26}{space 2} .0025726{col 37}{space 1}   48.41{col 46}{space 3}0.000{col 54}{space 4} .1195094{col 67}{space 3} .1295939
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1209131{col 26}{space 2} .0027052{col 37}{space 1}   44.70{col 46}{space 3}0.000{col 54}{space 4}  .115611{col 67}{space 3} .1262152
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1394807{col 26}{space 2} .0032959{col 37}{space 1}   42.32{col 46}{space 3}0.000{col 54}{space 4} .1330209{col 67}{space 3} .1459406
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0158418{col 26}{space 2} .0016888{col 37}{space 1}    9.38{col 46}{space 3}0.000{col 54}{space 4} .0125319{col 67}{space 3} .0191518
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0166923{col 26}{space 2} .0016466{col 37}{space 1}   10.14{col 46}{space 3}0.000{col 54}{space 4}  .013465{col 67}{space 3} .0199196
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .012038{col 26}{space 2} .0017333{col 37}{space 1}    6.95{col 46}{space 3}0.000{col 54}{space 4} .0086408{col 67}{space 3} .0154352
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0302593{col 26}{space 2} .0013734{col 37}{space 1}   22.03{col 46}{space 3}0.000{col 54}{space 4} .0275674{col 67}{space 3} .0329512
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.009691{col 26}{space 2} .0006848{col 37}{space 1}  -14.15{col 46}{space 3}0.000{col 54}{space 4}-.0110333{col 67}{space 3}-.0083487
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0103686{col 26}{space 2}  .000727{col 37}{space 1}  -14.26{col 46}{space 3}0.000{col 54}{space 4}-.0117934{col 67}{space 3}-.0089437
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0089788{col 26}{space 2} .0007301{col 37}{space 1}  -12.30{col 46}{space 3}0.000{col 54}{space 4}-.0104097{col 67}{space 3}-.0075478
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0095443{col 26}{space 2} .0009048{col 37}{space 1}  -10.55{col 46}{space 3}0.000{col 54}{space 4}-.0113178{col 67}{space 3}-.0077709
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2}-8.79e-06{col 26}{space 2} .0000482{col 37}{space 1}   -0.18{col 46}{space 3}0.855{col 54}{space 4}-.0001033{col 67}{space 3} .0000858
{txt}eth_hispan~t {c |}{col 14}{res}{space 2} .0006485{col 26}{space 2}  .000048{col 37}{space 1}   13.52{col 46}{space 3}0.000{col 54}{space 4} .0005545{col 67}{space 3} .0007425
{txt}eth_black_~t {c |}{col 14}{res}{space 2} .0013075{col 26}{space 2}  .000089{col 37}{space 1}   14.69{col 46}{space 3}0.000{col 54}{space 4}  .001133{col 67}{space 3} .0014819
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}  1.74924{col 26}{space 2} .1288362{col 37}{space 1}   13.58{col 46}{space 3}0.000{col 54}{space 4} 1.496724{col 67}{space 3} 2.001755
{txt}educ~us_prop {c |}{col 14}{res}{space 2} 2.503256{col 26}{space 2} .1175778{col 37}{space 1}   21.29{col 46}{space 3}0.000{col 54}{space 4} 2.272807{col 67}{space 3} 2.733705
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}   .00075{col 26}{space 2} .0000734{col 37}{space 1}   10.22{col 46}{space 3}0.000{col 54}{space 4} .0006061{col 67}{space 3} .0008939
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 1.63e-06{col 26}{space 2} 3.34e-08{col 37}{space 1}   48.89{col 46}{space 3}0.000{col 54}{space 4} 1.57e-06{col 67}{space 3} 1.70e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6186015{col 26}{space 2} .0283409{col 37}{space 1}   21.83{col 46}{space 3}0.000{col 54}{space 4} .5630542{col 67}{space 3} .6741488
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_enr_4year_sib_census.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41621281 .07835309 .40877121 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0057800583   .7119900722          3445{txt}  {c |}
  2 {c |}  {res}.0055366738   .6816020879          2240{txt}  {c |}
  3 {c |}  {res}.0050837808   .6383457158          1077{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0057800583{txt}  {c |}
  2 {c |}  {res}.0055366738{txt}  {c |}
  3 {c |}  {res}.0055366738{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   432,331
                                                {txt}F(1, 1248)        =  {res}   159.75
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1007
                                                {txt}Root MSE          =    {res} .04092

{txt}{ralign 78:(Std. err. adjusted for {res:1,249} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4year_~d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_e~r_noacs {c |}{col 14}{res}{space 2} .1728357{col 26}{space 2} .0136747{col 37}{space 1}   12.64{col 46}{space 3}0.000{col 54}{space 4} .1460078{col 67}{space 3} .1996636
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000522{col 26}{space 2} .0009243{col 37}{space 1}   -0.06{col 46}{space 3}0.955{col 54}{space 4}-.0018655{col 67}{space 3} .0017612
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/fb_test_enr_4year_census.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/fb_test_enr_4year_census.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outcome_va/va_g11_enr_4year_sibling_census.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_va/va_g11_enr_4year_sibling_census.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:    888.29 /        1 =     888.2920
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling_out_forecast_bias.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Jul 2022, 22:03:33
{txt}{.-}
{smcl}
{txt}{sf}{ul off}