-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling.smcl
  log type:  smcl
 opened on:   3 May 2022, 22:01:34

. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. #delimit ;
delimiter now ;
. #delimit cr
delimiter now cr
. macro list
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset
_setlimit:      0
_1:             0
_0:             0

. 
. 
. timer on 1

. 
. *****************************************************************************
> ***
. 
. 
. //load the VA grade 11 sample
. use `va_g11_dataset', clear
(Test Score Grade 11 VA Sample)

. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk', nogen keep(1 3)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       884,570
        from master                   884,570  
        from using                          0  

    Matched                           900,294  
    -----------------------------------------

. 
. drop if mi(has_older_sibling_enr_2year)
(884,570 observations deleted)

. drop if mi(has_older_sibling_enr_4year)
(0 observations deleted)

. 
. compress
  variable age was float now int
  (1,800,588 bytes saved)

. tempfile va_g11_sibling_dataset

. save `va_g11_sibling_dataset'
file /home/tmp/St16505.000001 saved as .dta format

. 
. 
. 
. 
. *****************************************************************************
> ***
. *********** VA estimates for VA samples matched to siblings sample
. *****************************************************************************
> ***
. 
. 
. if `setlimit' == 0 {
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 
> 1)
. }

. else {
.   local drift_limit = `setlimit'
. }

. 
. foreach subject in ela math {
  2. 
. 
.     /* load the VA g11 subject sample with siblings outcome sample
>      (those who have at least one older sibling matched to the postsecondary
>    outcomes) */
.     use `va_g11_sibling_dataset' if touse_g11_`subject'==1 & sibling_out_samp
> le == 1, clear
  3. 
.     *************************************************************************
> *****
.     ************ Value added estimation with no peer controls ***************
> *****
.     ****** No TFX, without sibling college going controls
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`su
> bject'_nosibctrl.ster, replace)
  4. 
.     //rename the first time to make sure indep var names for spec test are al
> l the same
.     rename tv va_cfr_g11_`subject'
  5.         rename score_r sbac_g11_`subject'_r
  6. 
. 
.     ************ specification test: regressing score residuals on VA estimat
> es
.     ******* No peer controls
.     ******** sibling sample without sibling controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
  7.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_
> g11_`subject'_sibling_nocontrol.ster, replace
  8.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va
> _cfr_g11_`subject'_sibling_nocontrol.ster, replace
  9. 
.     //rename again to distinguish between nocontrol and with control va estim
> ates
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
 10.     rename sbac_g11_`subject'_r sbac_g11_`subject'_r_nosibctrl
 11.     label var va_cfr_g11_`subject'_nosibctrl "`subject' VA with family FE 
> without TFX without sibling control"
 12.     label var sbac_g11_`subject'_r_nosibctrl "`subject' score residual wit
> h family FE without TFX without sibling control"
 13. 
.     ****** No TFX (teacher fixed effects), include sibling controls
.     vam sbac_`subject'_z_score ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`su
> bject'.ster, replace)
 14. 
. 
.     rename tv va_cfr_g11_`subject'
 15.         rename score_r sbac_g11_`subject'_r
 16. 
.     ************ specification test: regressing score residuals on VA estimat
> es
.     ******* No peer controls
.     ******** sibling sample with sibling controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
 17.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_
> g11_`subject'_sibling.ster, replace
 18.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va
> _cfr_g11_`subject'_sibling.ster, replace
 19. 
. 
. 
.     label var va_cfr_g11_`subject' "`subject' VA with family FE without TFX"
 20.     label var sbac_g11_`subject'_r "`subject' score residual with family F
> E without TFX"
 21. 
. /*
>     ****** With TFX, and TFX is added back in the the VA estimates
>     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_tfx_g11_`subject'
>     drop score_r
>     label var va_tfx_g11_`subject' "`subject' VA with family FE with TFX"
> 
> 
>  */
. 
. 
. 
. 
. 
. 
. 
.     *************************************************************************
> *****
.     ************ Value added estimation with peer controls ******************
> **
.     ****** No TFX (teacher fixed effects)
.     /* vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_cfr_g11_`subject'_peer
>     rename score_r sbac_g11_`subject'_r_peer
>     label var va_cfr_g11_`subject'_peer "`subject' VA with family FE with TFX
> "
>     label var sbac_g11_`subject'_r_peer "`subject' score residual with family
>  FE with TFX"
> 
> 
>     ****** With TFX
>     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_tfx_g11_`subject'_peer
>     drop score_r */
. 
. 
.     *************************************************************************
> *****
.     ************ specification test: regressing score residuals on VA estimat
> es
. 
.     /* ******* With peer controls
>     reg sbac_g11_`subject'_r_peer va_cfr_g11_`subject'_peer, cluster(school_i
> d)
>     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_
> g11_`subject'_peer_sibling.ster, replace */
. 
. 
. 
. 
.     *************************************************************************
> *****
.     /* CFR Forecast Bias Test */
.     ***** leave out variable is sibling controls
.     **no peer controls
.     gen sbac_g11_`subject'_r_d = sbac_g11_`subject'_r_nosibctrl - sbac_g11_`s
> ubject'_r
 22.     //var rename gymnastics to make sure the indep var names are all the s
> ame when making tables later
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_temp
 23.     rename va_cfr_g11_`subject'_nosibctrl va_cfr_g11_`subject'
 24. 
.     reg sbac_g11_`subject'_r_d va_cfr_g11_`subject',    cluster(school_id)
 25.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/fb_test_va_cfr_g1
> 1_`subject'_sibling.ster, replace
 26.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/fb_test_va_c
> fr_g11_`subject'_sibling.ster, replace
 27. 
.     //roll back the rename gymnastics to restore original var names
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
 28.     rename va_cfr_g11_`subject'_temp va_cfr_g11_`subject'
 29. 
. 
.     **************** Save Value Added Estimates
.     collapse (firstnm) va_* ///
>                 (mean) sbac_*_r* ///
>                 (sum) n_g11_`subject' = touse_g11_`subject' ///
>       if sibling_full_sample == 1 & sibling_out_sample == 1 ///
>                 , by(school_id cdscode grade year)
 30.     //save to my personal folder
.         save $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibli
> ng.dta, replace
 31.     //save to VA project folder
.     save $vaprojdir/data/sibling_va/test_score_va/va_g11_`subject'_sibling.dt
> a, replace
 32. 
. 
. }
(Test Score Grade 11 VA Sample)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   677,254
-------------+----------------------------------   F(36, 677217)   =  28471.16
       Model |  329901.804        36  9163.93899   Prob > F        =    0.0000
    Residual |  217974.086   677,217  .321867416   R-squared       =    0.6021
-------------+----------------------------------   Adj R-squared   =    0.6021
       Total |  547875.889   677,253  .808967829   Root MSE        =    .56733

------------------------------------------------------------------------------
sbac_ela_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0499644   .0027484    18.18   0.000     .0445776    .0553512
       2017  |   .0676601   .0027356    24.73   0.000     .0622985    .0730217
       2018  |  -.0710576   .0027417   -25.92   0.000    -.0764313    -.065684
             |
         age |  -.0003426   4.88e-06   -70.14   0.000    -.0003522    -.000333
             |
        male |
       Male  |  -.0902902   .0014094   -64.06   0.000    -.0930527   -.0875278
 1.eth_asian |   .1036863    .002264    45.80   0.000     .0992489    .1081236
1.eth_hisp~c |  -.0050762   .0019297    -2.63   0.009    -.0088584    -.001294
 1.eth_black |  -.1444525   .0037981   -38.03   0.000    -.1518967   -.1370083
 1.eth_other |   .0043308   .0042032     1.03   0.303    -.0039074    .0125689
             |
econ_disad~e |
Economic ..  |  -.0366117   .0016359   -22.38   0.000     -.039818   -.0334053
             |
limited_en~f |
Limited E..  |  -.2115924   .0036819   -57.47   0.000    -.2188087    -.204376
             |
    disabled |
   Disabled  |  -.1861937   .0037187   -50.07   0.000    -.1934822   -.1789052
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .6117768   .0027977   218.67   0.000     .6062934    .6172602
       2016  |    .593261   .0027254   217.68   0.000     .5879193    .5986027
       2017  |   .5819387   .0028658   203.07   0.000     .5763219    .5875555
       2018  |   .5727827   .0034906   164.09   0.000     .5659413    .5796241
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0002419   .0014746     0.16   0.870    -.0026483    .0031321
       2016  |  -.0138144   .0014878    -9.29   0.000    -.0167304   -.0108984
       2017  |  -.0132171   .0014998    -8.81   0.000    -.0161566   -.0102775
       2018  |   .0110561   .0015063     7.34   0.000     .0081038    .0140084
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0275553   .0006825   -40.37   0.000    -.0288931   -.0262176
       2016  |  -.0226716   .0006239   -36.34   0.000    -.0238944   -.0214489
       2017  |  -.0236694   .0006071   -38.99   0.000    -.0248592   -.0224796
       2018  |  -.0294713   .0009879   -29.83   0.000    -.0314076    -.027535
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1695626    .002779    61.01   0.000     .1641157    .1750094
       2016  |   .1896512   .0028265    67.10   0.000     .1841112    .1951911
       2017  |   .1889889   .0029484    64.10   0.000     .1832101    .1947678
       2018  |   .2478465   .0035318    70.18   0.000     .2409242    .2547687
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0045974   .0018502    -2.48   0.013    -.0082238   -.0009711
       2016  |  -.0127122   .0018014    -7.06   0.000    -.0162428   -.0091815
       2017  |  -.0071678   .0018429    -3.89   0.000    -.0107798   -.0035559
       2018  |   .0042888   .0014656     2.93   0.003     .0014163    .0071613
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0031236   .0007616    -4.10   0.000    -.0046164   -.0016309
       2016  |  -.0035752   .0008052    -4.44   0.000    -.0051535    -.001997
       2017  |  -.0066743   .0007956    -8.39   0.000    -.0082336   -.0051149
       2018  |   -.005854   .0009793    -5.98   0.000    -.0077734   -.0039346
             |
       _cons |   2.270121   .0299192    75.88   0.000      2.21148    2.328761
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/vam_cfr_g11_ela_nosibctrl.ster saved
Standard deviations: total, classes, students, teachers same year
.5673336 .18211037 .53731111 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0199303169   .5743741184          3541  |
  2 |  .0151232796   .4358772714          2299  |
  3 |  .0085328264   .2388976851          1105  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0199303169  |
  2 |  .0151232796  |
  3 |  .0151232796  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    675,586
                                                F(1, 1275)        =    2114.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0410
                                                Root MSE          =     .55544

                          (Std. err. adjusted for 1,276 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_e~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~a |   .9820442   .0213554    45.99   0.000     .9401486     1.02394
       _cons |  -.0002073   .0012526    -0.17   0.869    -.0026646    .0022501
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   677,254
-------------+----------------------------------   F(38, 677215)   =  26986.67
       Model |  329970.233        38  8683.42718   Prob > F        =    0.0000
    Residual |  217905.656   677,215  .321767321   R-squared       =    0.6023
-------------+----------------------------------   Adj R-squared   =    0.6022
       Total |  547875.889   677,253  .808967829   Root MSE        =    .56725

------------------------------------------------------------------------------
sbac_ela_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0498498   .0027482    18.14   0.000     .0444634    .0552361
       2017  |   .0673758   .0027359    24.63   0.000     .0620135    .0727382
       2018  |   -.071269   .0027432   -25.98   0.000    -.0766456   -.0658924
             |
1.has_~2year |  -.0175035   .0026999    -6.48   0.000    -.0227952   -.0122119
1.has_~4year |    .039867   .0029653    13.44   0.000      .034055    .0456789
         age |  -.0003419   4.89e-06   -69.98   0.000    -.0003514   -.0003323
             |
        male |
       Male  |  -.0903183   .0014092   -64.09   0.000    -.0930803   -.0875563
 1.eth_asian |   .1032116   .0022649    45.57   0.000     .0987725    .1076507
1.eth_hisp~c |   -.004525   .0019299    -2.34   0.019    -.0083076   -.0007424
 1.eth_black |   -.144409   .0037975   -38.03   0.000     -.151852   -.1369659
 1.eth_other |   .0046592   .0042026     1.11   0.268    -.0035778    .0128962
             |
econ_disad~e |
Economic ..  |  -.0366289    .001636   -22.39   0.000    -.0398356   -.0334223
             |
limited_en~f |
Limited E..  |  -.2114748   .0036813   -57.45   0.000    -.2186901   -.2042595
             |
    disabled |
   Disabled  |  -.1860965   .0037182   -50.05   0.000    -.1933841   -.1788088
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .6114396   .0027974   218.57   0.000     .6059567    .6169225
       2016  |   .5929491   .0027252   217.58   0.000     .5876078    .5982904
       2017  |   .5815692   .0028657   202.94   0.000     .5759525    .5871858
       2018  |   .5722926   .0034902   163.97   0.000     .5654519    .5791333
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |     .00022   .0014744     0.15   0.881    -.0026698    .0031099
       2016  |   -.013837   .0014876    -9.30   0.000    -.0167526   -.0109213
       2017  |  -.0132133   .0014996    -8.81   0.000    -.0161525   -.0102741
       2018  |   .0110797   .0015061     7.36   0.000     .0081278    .0140316
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0275112   .0006824   -40.31   0.000    -.0288488   -.0261737
       2016  |  -.0226352   .0006238   -36.29   0.000    -.0238577   -.0214126
       2017  |  -.0236356    .000607   -38.94   0.000    -.0248252   -.0224459
       2018  |  -.0293958   .0009878   -29.76   0.000    -.0313318   -.0274597
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1690369   .0027789    60.83   0.000     .1635904    .1744833
       2016  |    .188978   .0028265    66.86   0.000     .1834381    .1945179
       2017  |   .1883251   .0029483    63.87   0.000     .1825465    .1941038
       2018  |   .2470745   .0035317    69.96   0.000     .2401525    .2539964
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0046344   .0018499    -2.51   0.012    -.0082602   -.0010085
       2016  |  -.0127756   .0018011    -7.09   0.000    -.0163057   -.0092454
       2017  |  -.0071923   .0018426    -3.90   0.000    -.0108037   -.0035809
       2018  |   .0041748   .0014655     2.85   0.004     .0013025    .0070471
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0030776   .0007615    -4.04   0.000    -.0045702   -.0015851
       2016  |  -.0035084   .0008051    -4.36   0.000    -.0050865   -.0019304
       2017  |  -.0066265   .0007955    -8.33   0.000    -.0081856   -.0050673
       2018  |  -.0057665   .0009792    -5.89   0.000    -.0076857   -.0038473
             |
       _cons |    2.26474   .0299302    75.67   0.000     2.206078    2.323403
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/vam_cfr_g11_ela.ster saved
Standard deviations: total, classes, students, teachers same year
.56724538 .18200216 .53725463 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0198934192   .5739685075          3541  |
  2 |   .015092812   .4354752096          2299  |
  3 |  .0084986285   .2381615671          1105  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0198934192  |
  2 |   .015092812  |
  3 |   .015092812  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    675,586
                                                F(1, 1275)        =    2110.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0409
                                                Root MSE          =     .55538

                          (Std. err. adjusted for 1,276 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_e~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~a |   .9819345   .0213763    45.94   0.000      .939998    1.023871
       _cons |  -.0002035   .0012535    -0.16   0.871    -.0026626    .0022555
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/spec_test_va_cfr_g11_ela_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/spec_test_va_cfr_g11_ela_sibling.ster saved

Linear regression                               Number of obs     =    675,586
                                                F(1, 1275)        =      20.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0001
                                                Root MSE          =     .01005

                          (Std. err. adjusted for 1,276 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_e~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~a |   .0010195   .0002228     4.58   0.000     .0005824    .0014566
       _cons |  -7.85e-07   .0000279    -0.03   0.978    -.0000556     .000054
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/fb_test_va_cfr_g11_ela_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/fb_test_va_cfr_g11_ela_sibling.ster saved
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/test
    > _score_va/va_g11_ela_sibling.dta saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/test_sco
    > re_va/va_g11_ela_sibling.dta saved
(Test Score Grade 11 VA Sample)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   674,462
-------------+----------------------------------   F(36, 674425)   =  37012.66
       Model |  400184.449        36  11116.2347   Prob > F        =    0.0000
    Residual |  202554.093   674,425  .300335979   R-squared       =    0.6639
-------------+----------------------------------   Adj R-squared   =    0.6639
       Total |  602738.541   674,461  .893659591   Root MSE        =    .54803

------------------------------------------------------------------------------
sbac_math_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |     .05854   .0026615    22.00   0.000     .0533236    .0637563
       2017  |   .0686921   .0026501    25.92   0.000      .063498    .0738862
       2018  |  -.0883919   .0026544   -33.30   0.000    -.0935944   -.0831894
             |
         age |  -.0003538   4.73e-06   -74.82   0.000    -.0003631   -.0003445
             |
        male |
       Male  |    .052894   .0013642    38.77   0.000     .0502202    .0555679
 1.eth_asian |   .1902327   .0021907    86.83   0.000      .185939    .1945265
1.eth_hisp~c |  -.0668171   .0018686   -35.76   0.000    -.0704794   -.0631548
 1.eth_black |  -.1697084   .0036767   -46.16   0.000    -.1769147   -.1625022
 1.eth_other |   .0057796    .004072     1.42   0.156    -.0022015    .0137606
             |
econ_disad~e |
Economic ..  |  -.0650642   .0015838   -41.08   0.000    -.0681685   -.0619599
             |
limited_en~f |
Limited E..  |  -.0853626   .0035675   -23.93   0.000    -.0923547   -.0783705
             |
    disabled |
   Disabled  |  -.1559783   .0036066   -43.25   0.000    -.1630471   -.1489095
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .3460793   .0027089   127.76   0.000     .3407699    .3513887
       2016  |   .3328641    .002639   126.13   0.000     .3276918    .3380365
       2017  |   .3021307   .0027744   108.90   0.000     .2966929    .3075685
       2018  |   .1877411   .0033763    55.61   0.000     .1811236    .1943586
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0241664   .0014326    16.87   0.000     .0213586    .0269742
       2016  |   .0056111    .001441     3.89   0.000     .0027867    .0084354
       2017  |   .0197895   .0014526    13.62   0.000     .0169424    .0226366
       2018  |  -.0001293    .001457    -0.09   0.929     -.002985    .0027264
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0156205   .0006613   -23.62   0.000    -.0169166   -.0143244
       2016  |  -.0104033   .0006037   -17.23   0.000    -.0115865   -.0092201
       2017  |  -.0133383   .0005876   -22.70   0.000      -.01449   -.0121866
       2018  |  -.0065435   .0009548    -6.85   0.000    -.0084149   -.0046721
             |
        year#|
          c. |
prior_math~e |
       2015  |   .4873828   .0026899   181.19   0.000     .4821107    .4926549
       2016  |    .509296   .0027366   186.10   0.000     .5039323    .5146596
       2017  |    .532375   .0028544   186.51   0.000     .5267805    .5379695
       2018  |   .6711163   .0034189   196.29   0.000     .6644153    .6778174
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0240714    .001793    13.43   0.000     .0205572    .0275857
       2016  |   .0046303   .0017438     2.66   0.008     .0012126     .008048
       2017  |  -.0006828   .0017864    -0.38   0.702    -.0041841    .0028184
       2018  |   .0777338   .0014196    54.76   0.000     .0749514    .0805163
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0227705   .0007368   -30.90   0.000    -.0242147   -.0213264
       2016  |  -.0202824   .0007792   -26.03   0.000    -.0218095   -.0187552
       2017  |  -.0213844   .0007705   -27.76   0.000    -.0228945   -.0198743
       2018  |  -.0265723   .0009485   -28.01   0.000    -.0284315   -.0247132
             |
       _cons |   2.248523   .0289643    77.63   0.000     2.191754    2.305292
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/vam_cfr_g11_math_nosibctrl.ster saved
Standard deviations: total, classes, students, teachers same year
.54802918 .16390201 .52294561 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0194658737   .6783396224          3534  |
  2 |  .0154052278   .5463185172          2296  |
  3 |  .0098236127   .3639788075          1105  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0194658737  |
  2 |  .0154052278  |
  3 |  .0154052278  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    672,870
                                                F(1, 1273)        =    4237.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0479
                                                Root MSE          =     .53469

                          (Std. err. adjusted for 1,274 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_m~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~h |   .9690228   .0148865    65.09   0.000      .939818    .9982275
       _cons |   -.000864   .0008938    -0.97   0.334    -.0026175    .0008894
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   674,462
-------------+----------------------------------   F(38, 674423)   =  35112.12
       Model |   400366.82        38   10535.969   Prob > F        =    0.0000
    Residual |  202371.721   674,423  .300066459   R-squared       =    0.6642
-------------+----------------------------------   Adj R-squared   =    0.6642
       Total |  602738.541   674,461  .893659591   Root MSE        =    .54778

------------------------------------------------------------------------------
sbac_math_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0583161   .0026605    21.92   0.000     .0531017    .0635305
       2017  |     .06815   .0026497    25.72   0.000     .0629567    .0733433
       2018  |  -.0888705   .0026551   -33.47   0.000    -.0940743   -.0836666
             |
1.has_~2year |  -.0257658    .002612    -9.86   0.000    -.0308854   -.0206463
1.has_~4year |   .0664619   .0028684    23.17   0.000       .06084    .0720837
         age |  -.0003525   4.73e-06   -74.55   0.000    -.0003617   -.0003432
             |
        male |
       Male  |   .0528537   .0013636    38.76   0.000      .050181    .0555263
 1.eth_asian |    .189382    .002191    86.44   0.000     .1850878    .1936762
1.eth_hisp~c |  -.0659531   .0018682   -35.30   0.000    -.0696147   -.0622915
 1.eth_black |  -.1696506   .0036751   -46.16   0.000    -.1768536   -.1624476
 1.eth_other |   .0063197   .0040703     1.55   0.121     -.001658    .0142973
             |
econ_disad~e |
Economic ..  |  -.0651353   .0015835   -41.13   0.000    -.0682389   -.0620317
             |
limited_en~f |
Limited E..  |  -.0851729   .0035659   -23.89   0.000     -.092162   -.0781839
             |
    disabled |
   Disabled  |   -.155758   .0036051   -43.21   0.000    -.1628239   -.1486922
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .3455483   .0027079   127.61   0.000      .340241    .3508557
       2016  |   .3323749   .0026381   125.99   0.000     .3272044    .3375454
       2017  |   .3015533   .0027736   108.72   0.000     .2961173    .3069894
       2018  |   .1869776    .003375    55.40   0.000     .1803628    .1935925
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0241348    .001432    16.85   0.000     .0213282    .0269415
       2016  |    .005581   .0014404     3.87   0.000     .0027578    .0084042
       2017  |   .0198104    .001452    13.64   0.000     .0169645    .0226563
       2018  |  -.0000811   .0014564    -0.06   0.956    -.0029356    .0027734
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0155503    .000661   -23.53   0.000    -.0168458   -.0142548
       2016  |   -.010345   .0006034   -17.14   0.000    -.0115277   -.0091623
       2017  |  -.0132864   .0005874   -22.62   0.000    -.0144376   -.0121352
       2018  |  -.0064213   .0009544    -6.73   0.000    -.0082918   -.0045507
             |
        year#|
          c. |
prior_math~e |
       2015  |   .4865136   .0026889   180.93   0.000     .4812434    .4917838
       2016  |   .5081895   .0027358   185.76   0.000     .5028275    .5135516
       2017  |   .5312935   .0028535   186.19   0.000     .5257007    .5368862
       2018  |   .6698344   .0034178   195.98   0.000     .6631356    .6765332
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0240231   .0017922    13.40   0.000     .0205104    .0275359
       2016  |   .0045412    .001743     2.61   0.009      .001125    .0079574
       2017  |  -.0007193   .0017856    -0.40   0.687    -.0042191    .0027804
       2018  |   .0775742   .0014191    54.66   0.000     .0747928    .0803556
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0226939   .0007365   -30.81   0.000    -.0241375   -.0212504
       2016  |  -.0201758   .0007788   -25.90   0.000    -.0217023   -.0186493
       2017  |  -.0213052   .0007701   -27.66   0.000    -.0228146   -.0197957
       2018  |  -.0264218   .0009481   -27.87   0.000    -.0282801   -.0245634
             |
       _cons |   2.238644   .0289663    77.28   0.000     2.181871    2.295417
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/vam_cfr_g11_math.ster saved
Standard deviations: total, classes, students, teachers same year
.54778322 .16371553 .52274629 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0194140802   .6779384445          3534  |
  2 |   .015356176   .5457502346          2296  |
  3 |  .0097630068   .3626400715          1105  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0194140802  |
  2 |   .015356176  |
  3 |   .015356176  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    672,870
                                                F(1, 1273)        =    4234.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0477
                                                Root MSE          =     .53449

                          (Std. err. adjusted for 1,274 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_m~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~h |   .9686532   .0148849    65.08   0.000     .9394516    .9978548
       _cons |  -.0008575   .0008948    -0.96   0.338    -.0026129     .000898
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/spec_test_va_cfr_g11_math_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/spec_test_va_cfr_g11_math_sibling.ster saved

Linear regression                               Number of obs     =    672,870
                                                F(1, 1273)        =      16.31
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0001
                                                Root MSE          =     .01644

                          (Std. err. adjusted for 1,274 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_m~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~h |   .0014631   .0003623     4.04   0.000     .0007523    .0021739
       _cons |  -1.99e-06    .000046    -0.04   0.965    -.0000922    .0000882
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/fb_test_va_cfr_g11_math_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/fb_test_va_cfr_g11_math_sibling.ster saved
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/test
    > _score_va/va_g11_math_sibling.dta saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/test_sco
    > re_va/va_g11_math_sibling.dta saved

. 
. 
. 
. 
. 
. 
. set trace off

. 
. timer off 1

. timer list
   1:     31.23 /        1 =      31.2300

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling.smcl
  log type:  smcl
 closed on:   3 May 2022, 22:02:05
-------------------------------------------------------------------------------
