-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 22:14:25

. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative fil
> e paths  */
. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;

. local acs_str
>         "Original + Census"
>         ;

. local sib_str
>         "Original + Sibling"
>         ;

. local both_str
>         "Original + Census + Sibling"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. macro list
T_gm_fix_span:  0
S_4:            .0039002308063216
S_2:            300
S_3:            .0206002574343117
S_1:            epanechnikov
S_6:            .7098361624622439
S_5:            4
ReS_jv2:        __000006 __000007 __000008 __000009 __00000A __00000B __00000C
                __00000D __00000E __00000F __00000G __00000H __00000I __00000J
                __00000K
dropv:          _cdscode_x
n_offset:       0
sort:           0
dots:           nois _dots 5 0
dotss:          nois _dots 0, title(Survey results being calculated)
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_both_str:      Original + Census + Sibling
_sib_str:       Original + Sibling
_acs_str:       Original + Census
_og_str:        Original Specification
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. //startomg timer
. timer on 1

. 
. 
. *****************************************************************************
> ***
. 
. 
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)

. 
. foreach subject in ela math {
  2.   // load the resctricted sample with sibling and acs controls
.   use $vaprojdir/data/va_samples/va_sib_acs_restr_smp.dta if touse_g11_`subje
> ct'==1, clear
  3. 
.   ***************************************************************************
> *****
.   /* Primary test score va specification, no tfx, no peer fx, no sibling ctrl
> , no acs ctrl */
.   ***************************************************************************
> *****
.   vam sbac_`subject'_z_score ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subje
> ct'_og.ster, replace)
  4. 
.     // rename the va estimates and the test score residuals
.     rename tv va_`subject'_og
  5.     rename score_r `subject'_r_og
  6.     label var va_`subject'_og "``subject'_str' VA OG Specification"
  7.     label var `subject'_r_og "Score Residual from ``subject'_str' VA OG Sp
> ecification"
  8. 
.     *******************
.     // specification test: regress score residuals on va estimates
.     reg `subject'_r_og va_`subject'_og, cluster(school_id)
  9. 
.     // save spec test estimates
.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_
> test_`subject'_og.ster, replace
 10. 
. 
. 
.     *************************************************************************
> *******
.     /* Test score VA, no tfx, no peer fx, no sibling ctrl, with acs ctrl */
.     *************************************************************************
> *******
. 
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `census_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`sub
> ject'_acs.ster, replace)
 11. 
.     // rename va estimates and score residuals
.     rename tv va_`subject'_acs
 12.     rename score_r `subject'_r_acs
 13.     label var va_`subject'_acs "``subject'_str' VA with Census Controls"
 14.     label var `subject'_r_acs "Score Residual from ``subject'_str' VA with
>  Census Controls"
 15. 
. 
.     *******************
.     // specification test: regress score residuals on va estimates
.     reg `subject'_r_acs va_`subject'_acs, cluster(school_id)
 16. 
.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_
> test_`subject'_acs.ster, replace
 17. 
.     *******************
.     // forecast bias test for ACS leave out vars
. 
.     // difference in score residuals
.     gen `subject'_r_d_og_acs = `subject'_r_og - `subject'_r_acs
 18.     // fb test
.     reg `subject'_r_d_og_acs va_`subject'_og, cluster(school_id)
 19.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb
> _test_`subject'_acs_og.ster, replace
 20. 
. 
. 
.     *************************************************************************
> *******
.     /* Test score VA, no tfx, no peer fx, with sibling ctrl, no acs ctrl */
.     *************************************************************************
> *******
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `sibling_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`sub
> ject'_sib.ster, replace)
 21. 
.     //rename va estimates sand score residuals
.     rename tv va_`subject'_sib
 22.     rename score_r `subject'_r_sib
 23.     label var va_`subject'_sib "``subject'_str' VA with Sibling Controls"
 24.     label var `subject'_r_sib "Score Residual from ``subject'_str' VA with
>  Sibling Controls"
 25. 
.     *******************
.     // specification test: regress score residuals on va estimates
.     reg `subject'_r_sib va_`subject'_sib, cluster(school_id)
 26. 
.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_
> test_`subject'_sib.ster, replace
 27. 
. 
.     *******************
.     // forecast bias test for sibling controls as leave out vars
.     // difference in score residuals
.     gen `subject'_r_d_og_sib = `subject'_r_og - `subject'_r_sib
 28.     // fb test
.     reg `subject'_r_d_og_sib va_`subject'_og, cluster(school_id)
 29.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb
> _test_`subject'_sib_og.ster, replace
 30. 
. 
. 
. 
.     *************************************************************************
> *******
.     /* Test score VA, no tfx, no peer fx, with sibling ctrl, with acs ctrl */
.     *************************************************************************
> *******
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `sibling_controls' ///
>         `census_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`sub
> ject'_both.ster, replace)
 31. 
.       //rename va estimates sand score residuals
.       rename tv va_`subject'_both
 32.       rename score_r `subject'_r_both
 33.       label var va_`subject'_both "``subject'_str' VA with Sibling and Cen
> sus Controls"
 34.       label var `subject'_r_both "Score Residual from ``subject'_str' VA w
> ith Sibling and Census Controls"
 35. 
.       *******************
.       // specification test: regress score residuals on va estimates
.       reg `subject'_r_both va_`subject'_both, cluster(school_id)
 36. 
.       estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spe
> c_test_`subject'_both.ster, replace
 37. 
. 
.       *******************
.       // forecast bias test for sibling controls as leave out vars against sp
> ecification with only census controls
.       // difference in score residuals with census controls and residuals wit
> h both census and sibling controls
.       gen `subject'_r_d_acs_both = `subject'_r_acs - `subject'_r_both
 38.       // fb test
.       reg `subject'_r_d_acs_both va_`subject'_acs, cluster(school_id)
 39.       //naming convention: forecast bias test for leave out variables bein
> g sibling controls, against VA with only acs controls
.       estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb_
> test_`subject'_sib_acs.ster, replace
 40. 
. 
.       *******************
.       // forecast bias test for census controls as leave out vars against spe
> cification with only sibling controls
.       // difference in score residuals with census controls and residuals wit
> h both census and sibling controls
.       gen `subject'_r_d_sib_both = `subject'_r_sib - `subject'_r_both
 41.       // fb test
.       reg `subject'_r_d_sib_both va_`subject'_sib, cluster(school_id)
 42.       estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/
> fb_test_`subject'_acs_sib.ster, replace
 43. 
. 
. 
. 
. 
.       ********* Save VA estimates
.       collapse (firstnm) va_* ///
>         (mean) `subject'* ///
>         (sum) n_g11_`subject' = touse_g11_`subject' ///
>         , by(school_id cdscode grade year)
 44.       // save to VA project data folder
.       save $vaprojdir/data/sib_acs_restr_smp/test_score_va/va_`subject'_sib_a
> cs.dta, replace
 45. 
. 
. 
. }
(Test Score VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   419,149
-------------+----------------------------------   F(36, 419112)   =  17608.47
       Model |  202018.827        36   5611.6341   Prob > F        =    0.0000
    Residual |  133566.601   419,112  .318689518   R-squared       =    0.6020
-------------+----------------------------------   Adj R-squared   =    0.6020
       Total |  335585.429   419,148  .800637075   Root MSE        =    .56453

------------------------------------------------------------------------------
sbac_ela_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0515525   .0035085    14.69   0.000     .0446758    .0584291
       2017  |   .0678864   .0034891    19.46   0.000     .0610479    .0747249
       2018  |  -.0706394   .0035257   -20.04   0.000    -.0775496   -.0637291
             |
         age |   -.000345   6.34e-06   -54.42   0.000    -.0003574   -.0003325
             |
        male |
       Male  |  -.0894528   .0017839   -50.14   0.000    -.0929492   -.0859564
 1.eth_asian |   .1036124   .0027924    37.11   0.000     .0981394    .1090854
1.eth_hisp~c |  -.0046053   .0024525    -1.88   0.060    -.0094122    .0002016
 1.eth_black |  -.1439177   .0049616   -29.01   0.000    -.1536422   -.1341933
 1.eth_other |   .0057273   .0053352     1.07   0.283    -.0047296    .0161841
             |
econ_disad~e |
Economic ..  |  -.0314355   .0020702   -15.18   0.000     -.035493   -.0273779
             |
limited_en~f |
Limited E..  |  -.2221998   .0047803   -46.48   0.000     -.231569   -.2128305
             |
    disabled |
   Disabled  |  -.1889417   .0047312   -39.94   0.000    -.1982147   -.1796687
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .6080455     .00356   170.80   0.000     .6010679     .615023
       2016  |   .5873242   .0034326   171.10   0.000     .5805963     .594052
       2017  |   .5751975   .0035894   160.25   0.000     .5681625    .5822325
       2018  |   .5714068   .0044809   127.52   0.000     .5626243    .5801893
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0007997   .0019102     0.42   0.675    -.0029441    .0045435
       2016  |  -.0152522   .0018993    -8.03   0.000    -.0189749   -.0115296
       2017  |  -.0116381   .0019105    -6.09   0.000    -.0153826   -.0078936
       2018  |   .0109029    .001922     5.67   0.000     .0071358      .01467
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0275758   .0008616   -32.01   0.000    -.0292645   -.0258871
       2016  |   -.021703   .0007834   -27.70   0.000    -.0232385   -.0201675
       2017  |  -.0237676   .0007562   -31.43   0.000    -.0252497   -.0222855
       2018  |  -.0291061    .001261   -23.08   0.000    -.0315777   -.0266344
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1682358   .0035339    47.61   0.000     .1613096     .175162
       2016  |   .1891424   .0035523    53.25   0.000       .18218    .1961047
       2017  |    .193594   .0036901    52.46   0.000     .1863615    .2008265
       2018  |   .2443822   .0045075    54.22   0.000     .2355476    .2532168
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0035334   .0023873    -1.48   0.139    -.0082124    .0011456
       2016  |  -.0137091   .0022989    -5.96   0.000    -.0182149   -.0092033
       2017  |  -.0062249   .0023618    -2.64   0.008    -.0108541   -.0015958
       2018  |   .0042117   .0018843     2.24   0.025     .0005187    .0079048
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0031544   .0009657    -3.27   0.001    -.0050472   -.0012617
       2016  |  -.0032413   .0010101    -3.21   0.001     -.005221   -.0012616
       2017  |  -.0074933   .0009986    -7.50   0.000    -.0094506    -.005536
       2018  |  -.0052972   .0012425    -4.26   0.000    -.0077325   -.0028619
             |
       _cons |    2.28628   .0388193    58.90   0.000     2.210195    2.362365
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/vam_ela_og.ster saved
Standard deviations: total, classes, students, teachers same year
.56452592 .17858803 .53553322 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0185911114   .5400622475          3423  |
  2 |  .0136391948   .3903378218          2227  |
  3 |  .0080309411   .2174287391          1066  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0185911114  |
  2 |  .0136391948  |
  3 |  .0136391948  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    418,240
                                                F(1, 1244)        =    1452.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0375
                                                Root MSE          =     .55365

                          (Std. err. adjusted for 1,245 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
    ela_r_og | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   1.001787   .0262865    38.11   0.000     .9502159    1.053357
       _cons |  -.0006593   .0013913    -0.47   0.636    -.0033889    .0020702
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/spec_test_ela_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   419,149
-------------+----------------------------------   F(43, 419105)   =  14777.72
       Model |  202214.844        43  4702.67078   Prob > F        =    0.0000
    Residual |  133370.585   419,105  .318227139   R-squared       =    0.6026
-------------+----------------------------------   Adj R-squared   =    0.6025
       Total |  335585.429   419,148  .800637075   Root MSE        =    .56412

------------------------------------------------------------------------------
sbac_ela_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0511089   .0035083    14.57   0.000     .0442327     .057985
       2017  |   .0664867   .0034964    19.02   0.000     .0596339    .0733394
       2018  |  -.0717678   .0035424   -20.26   0.000    -.0787107   -.0648248
             |
         age |  -.0003414   6.35e-06   -53.80   0.000    -.0003538   -.0003289
             |
        male |
       Male  |  -.0895977    .001783   -50.25   0.000    -.0930923    -.086103
 1.eth_asian |   .0864213   .0031564    27.38   0.000     .0802347    .0926078
1.eth_hisp~c |  -.0111211   .0027246    -4.08   0.000    -.0164612    -.005781
 1.eth_black |  -.1293107   .0052005   -24.86   0.000    -.1395036   -.1191178
 1.eth_other |   .0039866   .0053515     0.74   0.456    -.0065021    .0144753
             |
econ_disad~e |
Economic ..  |  -.0265626   .0022155   -11.99   0.000    -.0309049   -.0222203
             |
limited_en~f |
Limited E..  |  -.2234309   .0047785   -46.76   0.000    -.2327967   -.2140651
             |
    disabled |
   Disabled  |  -.1919718   .0047343   -40.55   0.000     -.201251   -.1826927
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .6065912    .003561   170.34   0.000     .5996117    .6135708
       2016  |   .5860272   .0034339   170.66   0.000     .5792969    .5927576
       2017  |    .573812    .003592   159.75   0.000     .5667718    .5808523
       2018  |   .5704669   .0044795   127.35   0.000     .5616872    .5792466
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0005925   .0019091     0.31   0.756    -.0031492    .0043343
       2016  |  -.0152569   .0018984    -8.04   0.000    -.0189776   -.0115362
       2017  |  -.0117209   .0019096    -6.14   0.000    -.0154636   -.0079782
       2018  |   .0110284   .0019208     5.74   0.000     .0072637    .0147931
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0275683    .000861   -32.02   0.000    -.0292558   -.0258807
       2016  |  -.0218069   .0007829   -27.85   0.000    -.0233413   -.0202724
       2017  |  -.0237683   .0007557   -31.45   0.000    -.0252494   -.0222871
       2018  |  -.0291979   .0012602   -23.17   0.000    -.0316678   -.0267281
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1675593   .0035317    47.44   0.000     .1606373    .1744813
       2016  |   .1884786     .00355    53.09   0.000     .1815207    .1954365
       2017  |   .1924179   .0036879    52.18   0.000     .1851897     .199646
       2018  |    .243525   .0045059    54.05   0.000     .2346937    .2523564
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0037494   .0023861    -1.57   0.116    -.0084261    .0009273
       2016  |  -.0140656   .0022977    -6.12   0.000     -.018569   -.0095623
       2017  |   -.006624   .0023603    -2.81   0.005    -.0112502   -.0019979
       2018  |   .0034592   .0018837     1.84   0.066    -.0002328    .0071511
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0032222   .0009651    -3.34   0.001    -.0051138   -.0013306
       2016  |  -.0032762   .0010094    -3.25   0.001    -.0052546   -.0012979
       2017  |  -.0074601   .0009979    -7.48   0.000     -.009416   -.0055041
       2018  |  -.0056712   .0012418    -4.57   0.000    -.0081052   -.0032373
             |
eth_asian_~t |   .0009568   .0000665    14.39   0.000     .0008264    .0010871
eth_hispan~t |   .0006979    .000066    10.57   0.000     .0005685    .0008272
eth_black_~t |  -.0014348   .0001231   -11.66   0.000     -.001676   -.0011936
educ_hs_dr~p |  -.1060921   .1764661    -0.60   0.548    -.4519604    .2397761
educ~us_prop |   .5613235   .1661179     3.38   0.001     .2357374    .8869095
pov_fam_ch~t |  -.0000196   .0001012    -0.19   0.846    -.0002179    .0001787
inc_medi~_hh |   3.38e-07   4.68e-08     7.22   0.000     2.46e-07    4.29e-07
       _cons |   2.206429   .0391867    56.31   0.000     2.129624    2.283234
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/vam_ela_acs.ster saved
Standard deviations: total, classes, students, teachers same year
.56411625 .17702249 .5356213 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0180449027   .5331671737          3423  |
  2 |  .0131279486    .381492773          2227  |
  3 |  .0077236438   .2111821808          1066  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0180449027  |
  2 |  .0131279486  |
  3 |  .0131279486  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    418,240
                                                F(1, 1244)        =    1375.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0360
                                                Root MSE          =     .55366

                          (Std. err. adjusted for 1,245 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   ela_r_acs | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_acs |    1.00248   .0270307    37.09   0.000     .9494493    1.055511
       _cons |  -.0004911      .0014    -0.35   0.726    -.0032378    .0022556
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/spec_test_ela_acs.ster saved

Linear regression                               Number of obs     =    418,240
                                                F(1, 1244)        =      34.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0133
                                                Root MSE          =     .02148

                          (Std. err. adjusted for 1,245 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
ela_r_d_og~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0228853   .0039201     5.84   0.000     .0151946     .030576
       _cons |  -4.37e-06   .0005721    -0.01   0.994    -.0011267     .001118
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/fb_test_ela_acs_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   419,149
-------------+----------------------------------   F(38, 419110)   =  16690.32
       Model |  202060.724        38  5317.38748   Prob > F        =    0.0000
    Residual |  133524.705   419,110  .318591073   R-squared       =    0.6021
-------------+----------------------------------   Adj R-squared   =    0.6021
       Total |  335585.429   419,148  .800637075   Root MSE        =    .56444

------------------------------------------------------------------------------
sbac_ela_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0514532   .0035082    14.67   0.000     .0445772    .0583292
       2017  |   .0676508   .0034895    19.39   0.000     .0608116    .0744901
       2018  |  -.0707717   .0035274   -20.06   0.000    -.0776853   -.0638581
             |
         age |  -.0003444   6.34e-06   -54.33   0.000    -.0003568    -.000332
             |
        male |
       Male  |  -.0895009   .0017836   -50.18   0.000    -.0929967    -.086005
 1.eth_asian |   .1032629   .0027932    36.97   0.000     .0977883    .1087375
1.eth_hisp~c |  -.0040925   .0024527    -1.67   0.095    -.0088998    .0007147
 1.eth_black |  -.1439029   .0049608   -29.01   0.000    -.1536259   -.1341798
 1.eth_other |   .0060441   .0053345     1.13   0.257    -.0044114    .0164996
             |
econ_disad~e |
Economic ..  |  -.0314232   .0020702   -15.18   0.000    -.0354808   -.0273656
             |
limited_en~f |
Limited E..  |  -.2220109   .0047796   -46.45   0.000    -.2313788   -.2126431
             |
    disabled |
   Disabled  |  -.1887865   .0047307   -39.91   0.000    -.1980585   -.1795145
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .6076914   .0035597   170.71   0.000     .6007145    .6146683
       2016  |   .5870117   .0034324   171.02   0.000     .5802843     .593739
       2017  |   .5747793   .0035894   160.13   0.000     .5677443    .5818143
       2018  |   .5709102   .0044805   127.42   0.000     .5621286    .5796918
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0007584   .0019099     0.40   0.691     -.002985    .0045017
       2016  |  -.0153045   .0018991    -8.06   0.000    -.0190267   -.0115824
       2017  |  -.0116345   .0019103    -6.09   0.000    -.0153786   -.0078904
       2018  |   .0108675   .0019217     5.66   0.000      .007101    .0146341
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0275315   .0008615   -31.96   0.000      -.02922   -.0258431
       2016  |   -.021671   .0007833   -27.67   0.000    -.0232063   -.0201357
       2017  |  -.0237296   .0007561   -31.38   0.000    -.0252115   -.0222477
       2018  |  -.0290262   .0012609   -23.02   0.000    -.0314975   -.0265549
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1677507   .0035336    47.47   0.000      .160825    .1746764
       2016  |   .1884373   .0035523    53.05   0.000     .1814749    .1953997
       2017  |   .1929734     .00369    52.30   0.000     .1857411    .2002057
       2018  |   .2435415   .0045074    54.03   0.000     .2347071    .2523759
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0035531   .0023869    -1.49   0.137    -.0082314    .0011251
       2016  |  -.0137485   .0022986    -5.98   0.000    -.0182536   -.0092434
       2017  |  -.0062782   .0023615    -2.66   0.008    -.0109066   -.0016498
       2018  |   .0040992   .0018841     2.18   0.030     .0004064     .007792
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0031203   .0009656    -3.23   0.001    -.0050128   -.0012279
       2016  |  -.0031683   .0010099    -3.14   0.002    -.0051477   -.0011888
       2017  |  -.0074388   .0009985    -7.45   0.000    -.0093958   -.0054818
       2018  |  -.0051951   .0012424    -4.18   0.000    -.0076301   -.0027601
             |
1.has_~2year |  -.0182408   .0034276    -5.32   0.000    -.0249589   -.0115228
1.has_~4year |   .0388366   .0037088    10.47   0.000     .0315675    .0461057
       _cons |   2.281911   .0388281    58.77   0.000     2.205809    2.358013
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/vam_ela_sib.ster saved
Standard deviations: total, classes, students, teachers same year
.56443872 .17847971 .53547742 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0185571343   .5397430147          3423  |
  2 |   .013603888   .3897812242          2227  |
  3 |  .0080055991   .2169599582          1066  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0185571343  |
  2 |   .013603888  |
  3 |   .013603888  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    418,240
                                                F(1, 1244)        =    1448.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0374
                                                Root MSE          =     .55359

                          (Std. err. adjusted for 1,245 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   ela_r_sib | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_sib |   1.001781   .0263193    38.06   0.000     .9501455    1.053416
       _cons |  -.0006531   .0013922    -0.47   0.639    -.0033844    .0020781
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/spec_test_ela_sib.ster saved

Linear regression                               Number of obs     =    418,240
                                                F(1, 1244)        =      14.38
                                                Prob > F          =     0.0002
                                                R-squared         =     0.0001
                                                Root MSE          =        .01

                          (Std. err. adjusted for 1,245 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
ela_r_d_og~b | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |    .001003   .0002645     3.79   0.000     .0004842    .0015219
       _cons |  -1.34e-06   .0000312    -0.04   0.966    -.0000626    .0000599
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/fb_test_ela_sib_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   419,149
-------------+----------------------------------   F(45, 419103)   =  14128.05
       Model |   202255.76        45  4494.57244   Prob > F        =    0.0000
    Residual |  133329.669   419,103  .318131029   R-squared       =    0.6027
-------------+----------------------------------   Adj R-squared   =    0.6027
       Total |  335585.429   419,148  .800637075   Root MSE        =    .56403

------------------------------------------------------------------------------
sbac_ela_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0510265    .003508    14.55   0.000     .0441509     .057902
       2017  |   .0662705   .0034968    18.95   0.000     .0594169    .0731241
       2018  |  -.0718886   .0035441   -20.28   0.000    -.0788349   -.0649422
             |
         age |  -.0003408   6.35e-06   -53.70   0.000    -.0003532   -.0003283
             |
        male |
       Male  |  -.0896458   .0017827   -50.29   0.000    -.0931399   -.0861517
 1.eth_asian |   .0859257   .0031572    27.22   0.000     .0797376    .0921138
1.eth_hisp~c |  -.0105959   .0027247    -3.89   0.000    -.0159362   -.0052557
 1.eth_black |  -.1292772   .0051998   -24.86   0.000    -.1394685   -.1190858
 1.eth_other |   .0042537   .0053507     0.79   0.427    -.0062336     .014741
             |
econ_disad~e |
Economic ..  |   -.026622   .0022154   -12.02   0.000    -.0309642   -.0222798
             |
limited_en~f |
Limited E..  |  -.2232602   .0047778   -46.73   0.000    -.2326246   -.2138958
             |
    disabled |
   Disabled  |  -.1918125   .0047338   -40.52   0.000    -.2010906   -.1825344
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .6062377   .0035607   170.26   0.000     .5992587    .6132166
       2016  |   .5857192   .0034336   170.58   0.000     .5789894     .592449
       2017  |   .5734128    .003592   159.64   0.000     .5663726     .580453
       2018  |   .5699838   .0044791   127.26   0.000      .561205    .5787626
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0005605   .0019088     0.29   0.769    -.0031808    .0043017
       2016  |  -.0152984   .0018981    -8.06   0.000    -.0190186   -.0115782
       2017  |  -.0117041   .0019094    -6.13   0.000    -.0154464   -.0079618
       2018  |   .0110012   .0019205     5.73   0.000      .007237    .0147654
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0275244   .0008609   -31.97   0.000    -.0292117   -.0258371
       2016  |  -.0217752   .0007828   -27.82   0.000    -.0233094    -.020241
       2017  |   -.023733   .0007556   -31.41   0.000     -.025214    -.022252
       2018  |  -.0291174     .00126   -23.11   0.000    -.0315869   -.0266478
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1670898   .0035314    47.32   0.000     .1601684    .1740113
       2016  |   .1877908   .0035501    52.90   0.000     .1808327    .1947488
       2017  |   .1918157   .0036878    52.01   0.000     .1845878    .1990436
       2018  |   .2426969   .0045058    53.86   0.000     .2338657    .2515281
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0037548   .0023858    -1.57   0.116    -.0084308    .0009213
       2016  |  -.0140941   .0022973    -6.13   0.000    -.0185969   -.0095914
       2017  |  -.0066693     .00236    -2.83   0.005    -.0112948   -.0020439
       2018  |   .0033607   .0018835     1.78   0.074     -.000331    .0070524
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0031916    .000965    -3.31   0.001    -.0050829   -.0013003
       2016  |  -.0032058   .0010093    -3.18   0.001    -.0051839   -.0012277
       2017  |  -.0074075   .0009978    -7.42   0.000    -.0093631   -.0054518
       2018  |  -.0055674   .0012417    -4.48   0.000     -.008001   -.0031337
             |
1.has_~2year |  -.0178358   .0034262    -5.21   0.000    -.0245511   -.0111206
1.has_~4year |   .0384972   .0037077    10.38   0.000     .0312302    .0457643
eth_asian_~t |   .0009633   .0000665    14.49   0.000     .0008331    .0010936
eth_hispan~t |   .0006921    .000066    10.49   0.000     .0005627    .0008214
eth_black_~t |  -.0014465    .000123   -11.76   0.000    -.0016877   -.0012053
educ_hs_dr~p |  -.1212975   .1764461    -0.69   0.492    -.4671266    .2245316
educ~us_prop |   .5585126   .1661283     3.36   0.001     .2329063     .884119
pov_fam_ch~t |  -.0000256   .0001011    -0.25   0.801    -.0002238    .0001727
inc_medi~_hh |   3.24e-07   4.68e-08     6.92   0.000     2.32e-07    4.16e-07
       _cons |   2.203305   .0391951    56.21   0.000     2.126484    2.280126
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/vam_ela_both.ster saved
Standard deviations: total, classes, students, teachers same year
.56403105 .17691869 .53556588 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0180117491   .5328362127          3423  |
  2 |  .0130943582   .3809425305          2227  |
  3 |  .0077018757   .2107748118          1066  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0180117491  |
  2 |  .0130943582  |
  3 |  .0130943582  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    418,240
                                                F(1, 1244)        =    1372.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0360
                                                Root MSE          =      .5536

                          (Std. err. adjusted for 1,245 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
  ela_r_both | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_ela_both |   1.002509   .0270641    37.04   0.000     .9494128    1.055605
       _cons |  -.0004847   .0014008    -0.35   0.729    -.0032329    .0022635
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/spec_test_ela_both.ster saved

Linear regression                               Number of obs     =    418,240
                                                F(1, 1244)        =      16.18
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0001
                                                Root MSE          =     .00988

                          (Std. err. adjusted for 1,245 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
ela_r_d_ac~h | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_acs |   .0009972   .0002479     4.02   0.000     .0005108    .0014835
       _cons |  -1.30e-06   .0000293    -0.04   0.965    -.0000587    .0000561
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/fb_test_ela_sib_acs.ster saved

Linear regression                               Number of obs     =    418,240
                                                F(1, 1244)        =      34.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0133
                                                Root MSE          =     .02143

                          (Std. err. adjusted for 1,245 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
ela_r_d_si~h | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_ela_sib |   .0228576   .0039157     5.84   0.000     .0151755    .0305397
       _cons |  -4.37e-06   .0005706    -0.01   0.994    -.0011238    .0011151
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/fb_test_ela_acs_sib.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/t
    > est_score_va/va_ela_sib_acs.dta saved
(Test Score VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   417,486
-------------+----------------------------------   F(36, 417449)   =  23369.83
       Model |  251901.033        36  6997.25091   Prob > F        =    0.0000
    Residual |  124989.991   417,449  .299413798   R-squared       =    0.6684
-------------+----------------------------------   Adj R-squared   =    0.6683
       Total |  376891.023   417,485  .902765425   Root MSE        =    .54719

------------------------------------------------------------------------------
sbac_math_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0572803    .003408    16.81   0.000     .0506008    .0639598
       2017  |   .0677824   .0033908    19.99   0.000     .0611364    .0744283
       2018  |  -.0904965   .0034249   -26.42   0.000    -.0972092   -.0837837
             |
         age |  -.0003526   6.16e-06   -57.28   0.000    -.0003647   -.0003405
             |
        male |
       Male  |   .0543913   .0017326    31.39   0.000     .0509955     .057787
 1.eth_asian |   .1901069   .0027116    70.11   0.000     .1847924    .1954215
1.eth_hisp~c |  -.0713131   .0023826   -29.93   0.000     -.075983   -.0666432
 1.eth_black |  -.1717524   .0048185   -35.64   0.000    -.1811966   -.1623083
 1.eth_other |    .012823   .0051865     2.47   0.013     .0026576    .0229883
             |
econ_disad~e |
Economic ..  |   -.064167    .002011   -31.91   0.000    -.0681086   -.0602255
             |
limited_en~f |
Limited E..  |  -.0877959    .004646   -18.90   0.000    -.0969019     -.07869
             |
    disabled |
   Disabled  |  -.1575772   .0046068   -34.21   0.000    -.1666064    -.148548
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .3460863   .0034591   100.05   0.000     .3393065    .3528662
       2016  |   .3291477   .0033343    98.72   0.000     .3226126    .3356829
       2017  |   .2987881   .0034852    85.73   0.000     .2919572    .3056189
       2018  |   .1858319   .0043494    42.73   0.000     .1773071    .1943567
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0231196   .0018625    12.41   0.000     .0194691      .02677
       2016  |   .0059113   .0018452     3.20   0.001     .0022947    .0095278
       2017  |    .019425   .0018558    10.47   0.000     .0157877    .0230623
       2018  |  -.0000348   .0018653    -0.02   0.985    -.0036908    .0036212
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0159373   .0008383   -19.01   0.000    -.0175803   -.0142942
       2016  |  -.0102204   .0007605   -13.44   0.000    -.0117109     -.00873
       2017  |  -.0134865   .0007341   -18.37   0.000    -.0149254   -.0120477
       2018  |  -.0060232   .0012227    -4.93   0.000    -.0084196   -.0036268
             |
        year#|
          c. |
prior_math~e |
       2015  |   .4903138   .0034319   142.87   0.000     .4835874    .4970402
       2016  |   .5124285   .0034502   148.52   0.000     .5056661    .5191909
       2017  |   .5382762    .003584   150.19   0.000     .5312517    .5453007
       2018  |   .6696836   .0043788   152.94   0.000     .6611012    .6782661
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0243071   .0023218    10.47   0.000     .0197564    .0288577
       2016  |   .0019406   .0022313     0.87   0.384    -.0024326    .0063138
       2017  |   .0014475   .0022952     0.63   0.528    -.0030509    .0059459
       2018  |   .0787112   .0018314    42.98   0.000     .0751218    .0823006
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0228218   .0009373   -24.35   0.000    -.0246589   -.0209846
       2016  |  -.0193277   .0009803   -19.72   0.000     -.021249   -.0174064
       2017  |   -.022374   .0009695   -23.08   0.000    -.0242742   -.0204737
       2018  |  -.0268415   .0012075   -22.23   0.000    -.0292081    -.024475
             |
       _cons |    2.25064   .0376979    59.70   0.000     2.176753    2.324526
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/vam_math_og.ster saved
Standard deviations: total, classes, students, teachers same year
.54718717 .16245832 .5225142 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0187565705   .6369881249          3414  |
  2 |  .0147715093   .5053267744          2221  |
  3 |  .0095871342   .3363071807          1065  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0187565705  |
  2 |  .0147715093  |
  3 |  .0147715093  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    416,620
                                                F(1, 1241)        =    2895.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0454
                                                Root MSE          =     .53451

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   math_r_og | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_math_og |   .9859257   .0183218    53.81   0.000     .9499805    1.021871
       _cons |   -.001402   .0009959    -1.41   0.159    -.0033559    .0005519
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/spec_test_math_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   417,486
-------------+----------------------------------   F(43, 417442)   =  19822.80
       Model |  252991.704        43  5883.52799   Prob > F        =    0.0000
    Residual |   123899.32   417,442  .296806071   R-squared       =    0.6713
-------------+----------------------------------   Adj R-squared   =    0.6712
       Total |  376891.023   417,485  .902765425   Root MSE        =     .5448

------------------------------------------------------------------------------
sbac_math_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0552724   .0033953    16.28   0.000     .0486177    .0619271
       2017  |   .0635511   .0033854    18.77   0.000     .0569157    .0701864
       2018  |  -.0935917   .0034283   -27.30   0.000    -.1003111   -.0868723
             |
         age |  -.0003568   6.14e-06   -58.11   0.000    -.0003688   -.0003447
             |
        male |
       Male  |   .0534287   .0017254    30.97   0.000     .0500471    .0568104
 1.eth_asian |   .1658128   .0030534    54.30   0.000     .1598282    .1717975
1.eth_hisp~c |  -.0450394    .002637   -17.08   0.000    -.0502078    -.039871
 1.eth_black |  -.1354746   .0050325   -26.92   0.000    -.1453381   -.1256112
 1.eth_other |   .0144946   .0051834     2.80   0.005     .0043353    .0246539
             |
econ_disad~e |
Economic ..  |  -.0313395   .0021445   -14.61   0.000    -.0355426   -.0271363
             |
limited_en~f |
Limited E..  |  -.0896501   .0046274   -19.37   0.000    -.0987196   -.0805806
             |
    disabled |
   Disabled  |  -.1697749   .0045931   -36.96   0.000    -.1787773   -.1607725
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .3394684   .0034474    98.47   0.000     .3327115    .3462253
       2016  |   .3228313   .0033234    97.14   0.000     .3163175    .3293451
       2017  |   .2903166   .0034751    83.54   0.000     .2835055    .2971276
       2018  |   .1817488   .0043322    41.95   0.000     .1732577    .1902398
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0220379   .0018547    11.88   0.000     .0184028     .025673
       2016  |   .0049546   .0018375     2.70   0.007     .0013531    .0085561
       2017  |   .0182424   .0018482     9.87   0.000       .01462    .0218647
       2018  |   .0000775   .0018574     0.04   0.967    -.0035628    .0037179
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0157808   .0008347   -18.91   0.000    -.0174167   -.0141449
       2016  |  -.0102667   .0007572   -13.56   0.000    -.0117507   -.0087827
       2017  |  -.0131349    .000731   -17.97   0.000    -.0145677   -.0117022
       2018  |  -.0062574   .0012174    -5.14   0.000    -.0086434   -.0038714
             |
        year#|
          c. |
prior_math~e |
       2015  |     .48799   .0034173   142.80   0.000     .4812922    .4946877
       2016  |   .5097761   .0034355   148.38   0.000     .5030426    .5165097
       2017  |   .5361965   .0035688   150.25   0.000     .5292017    .5431912
       2018  |   .6647175   .0043613   152.41   0.000     .6561695    .6732654
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0235072   .0023122    10.17   0.000     .0189753    .0280391
       2016  |   .0012144    .002222     0.55   0.585    -.0031407    .0055694
       2017  |   .0006395   .0022853     0.28   0.780    -.0038397    .0051187
       2018  |   .0759591   .0018241    41.64   0.000     .0723839    .0795344
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0229657   .0009334   -24.61   0.000    -.0247951   -.0211364
       2016  |  -.0193959   .0009761   -19.87   0.000    -.0213089   -.0174829
       2017  |  -.0224468   .0009653   -23.25   0.000    -.0243388   -.0205548
       2018  |  -.0277409   .0012024   -23.07   0.000    -.0300975   -.0253843
             |
eth_asian_~t |   .0014632   .0000643    22.75   0.000     .0013371    .0015893
eth_hispan~t |  -.0000435   .0000639    -0.68   0.496    -.0001689    .0000818
eth_black_~t |  -.0018994   .0001192   -15.93   0.000     -.002133   -.0016657
educ_hs_dr~p |   1.048649     .17072     6.14   0.000     .7140425    1.383254
educ~us_prop |    2.39462   .1626595    14.72   0.000     2.075812    2.713427
pov_fam_ch~t |   .0008068   .0000979     8.24   0.000      .000615    .0009987
inc_medi~_hh |   1.28e-06   4.53e-08    28.23   0.000     1.19e-06    1.37e-06
       _cons |   2.112028   .0379162    55.70   0.000     2.037714    2.186343
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/vam_math_acs.ster saved
Standard deviations: total, classes, students, teachers same year
.54479911 .15595198 .52200101 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0165920999   .6103443498          3414  |
  2 |  .0128558473   .4718084344          2221  |
  3 |  .0084589009   .3093444236          1065  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0165920999  |
  2 |  .0128558473  |
  3 |  .0128558473  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    416,620
                                                F(1, 1241)        =    2492.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0395
                                                Root MSE          =     .53381

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
  math_r_acs | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_math_acs |   .9979418   .0199897    49.92   0.000     .9587244    1.037159
       _cons |  -.0010706   .0009949    -1.08   0.282    -.0030225    .0008813
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/spec_test_math_acs.ster saved

Linear regression                               Number of obs     =    416,620
                                                F(1, 1241)        =      57.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0413
                                                Root MSE          =     .05006

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
math_r_d_o~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_math_og |   .0878644   .0115894     7.58   0.000     .0651273    .1106014
       _cons |  -.0001107   .0012026    -0.09   0.927    -.0024699    .0022486
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/fb_test_math_acs_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   417,486
-------------+----------------------------------   F(38, 417447)   =  22173.83
       Model |  252029.556        38  6632.35675   Prob > F        =    0.0000
    Residual |  124861.467   417,447  .299107353   R-squared       =    0.6687
-------------+----------------------------------   Adj R-squared   =    0.6687
       Total |  376891.023   417,485  .902765425   Root MSE        =    .54691

------------------------------------------------------------------------------
sbac_math_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |    .057094   .0034064    16.76   0.000     .0504175    .0637705
       2017  |   .0673349     .00339    19.86   0.000     .0606906    .0739793
       2018  |  -.0907959   .0034253   -26.51   0.000    -.0975094   -.0840824
             |
         age |  -.0003515   6.15e-06   -57.12   0.000    -.0003636   -.0003395
             |
        male |
       Male  |   .0543142   .0017317    31.37   0.000     .0509201    .0577082
 1.eth_asian |   .1894661   .0027114    69.88   0.000     .1841519    .1947803
1.eth_hisp~c |   -.070432   .0023819   -29.57   0.000    -.0751006   -.0657635
 1.eth_black |  -.1717539    .004816   -35.66   0.000    -.1811932   -.1623145
 1.eth_other |   .0133797   .0051839     2.58   0.010     .0032193    .0235401
             |
econ_disad~e |
Economic ..  |  -.0641564   .0020103   -31.91   0.000    -.0680966   -.0602162
             |
limited_en~f |
Limited E..  |  -.0874547   .0046436   -18.83   0.000    -.0965561   -.0783534
             |
    disabled |
   Disabled  |  -.1572572   .0046046   -34.15   0.000    -.1662821   -.1482322
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .3454692   .0034576    99.92   0.000     .3386925     .352246
       2016  |   .3285923   .0033329    98.59   0.000       .32206    .3351246
       2017  |   .2980741   .0034839    85.56   0.000     .2912457    .3049025
       2018  |   .1850088   .0043474    42.56   0.000      .176488    .1935296
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0230447   .0018616    12.38   0.000      .019396    .0266933
       2016  |   .0058165   .0018443     3.15   0.002     .0022017    .0094313
       2017  |    .019437   .0018549    10.48   0.000     .0158015    .0230726
       2018  |  -.0000881   .0018644    -0.05   0.962    -.0037423     .003566
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0158602   .0008379   -18.93   0.000    -.0175024    -.014218
       2016  |  -.0101625   .0007601   -13.37   0.000    -.0116522   -.0086728
       2017  |   -.013422   .0007338   -18.29   0.000    -.0148601   -.0119838
       2018  |   -.005889   .0012221    -4.82   0.000    -.0082842   -.0034938
             |
        year#|
          c. |
prior_math~e |
       2015  |   .4894781   .0034304   142.69   0.000     .4827547    .4962016
       2016  |   .5111985   .0034491   148.21   0.000     .5044385    .5179586
       2017  |   .5371836   .0035826   149.94   0.000     .5301619    .5442054
       2018  |   .6681732   .0043772   152.65   0.000      .659594    .6767524
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0242823   .0023206    10.46   0.000     .0197339    .0288306
       2016  |   .0018775   .0022302     0.84   0.400    -.0024936    .0062485
       2017  |   .0013523    .002294     0.59   0.556    -.0031439    .0058485
       2018  |   .0785276   .0018306    42.90   0.000     .0749397    .0821154
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0227634   .0009369   -24.30   0.000    -.0245996   -.0209271
       2016  |  -.0192007   .0009798   -19.60   0.000    -.0211211   -.0172804
       2017  |   -.022277    .000969   -22.99   0.000    -.0241763   -.0203777
       2018  |  -.0266564   .0012069   -22.09   0.000    -.0290218    -.024291
             |
1.has_~2year |  -.0307962    .003327    -9.26   0.000    -.0373171   -.0242753
1.has_~4year |   .0686885   .0035981    19.09   0.000     .0616364    .0757407
       _cons |   2.242488   .0376928    59.49   0.000     2.168612    2.316365
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/vam_math_sib.ster saved
Standard deviations: total, classes, students, teachers same year
.54690708 .16221069 .52229785 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0186836768   .6363194072          3414  |
  2 |  .0146888766   .5039745289          2221  |
  3 |   .009504036   .3344669041          1065  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0186836768  |
  2 |  .0146888766  |
  3 |  .0146888766  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    416,620
                                                F(1, 1241)        =    2884.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0452
                                                Root MSE          =     .53429

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
  math_r_sib | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_math_sib |    .985615   .0183526    53.70   0.000     .9496094    1.021621
       _cons |  -.0013916   .0009977    -1.39   0.163     -.003349    .0005657
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/spec_test_math_sib.ster saved

Linear regression                               Number of obs     =    416,620
                                                F(1, 1241)        =      24.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .01755

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
math_r_d_o~b | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_math_og |   .0020992   .0004206     4.99   0.000     .0012739    .0029244
       _cons |  -3.94e-06   .0000547    -0.07   0.943    -.0001113    .0001034
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/fb_test_math_sib_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   417,486
-------------+----------------------------------   F(45, 417440)   =  18969.23
       Model |   253112.48        45  5624.72177   Prob > F        =    0.0000
    Residual |  123778.544   417,440  .296518167   R-squared       =    0.6716
-------------+----------------------------------   Adj R-squared   =    0.6715
       Total |  376891.023   417,485  .902765425   Root MSE        =    .54453

------------------------------------------------------------------------------
sbac_math_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0551043   .0033939    16.24   0.000     .0484524    .0617561
       2017  |   .0631148   .0033847    18.65   0.000     .0564809    .0697487
       2018  |  -.0939147   .0034288   -27.39   0.000    -.1006351   -.0871944
             |
         age |  -.0003556   6.14e-06   -57.94   0.000    -.0003676   -.0003436
             |
        male |
       Male  |   .0533534   .0017245    30.94   0.000     .0499734    .0567335
 1.eth_asian |   .1648983   .0030532    54.01   0.000     .1589142    .1708825
1.eth_hisp~c |  -.0441568   .0026362   -16.75   0.000    -.0493236     -.03899
 1.eth_black |  -.1354454     .00503   -26.93   0.000    -.1453041   -.1255867
 1.eth_other |   .0149635    .005181     2.89   0.004      .004809    .0251181
             |
econ_disad~e |
Economic ..  |  -.0314604   .0021437   -14.68   0.000     -.035662   -.0272588
             |
limited_en~f |
Limited E..  |  -.0893516   .0046251   -19.32   0.000    -.0984167   -.0802864
             |
    disabled |
   Disabled  |  -.1694428   .0045911   -36.91   0.000    -.1784411   -.1604445
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .3388725    .003446    98.34   0.000     .3321185    .3456265
       2016  |   .3223067   .0033221    97.02   0.000     .3157955    .3288179
       2017  |    .289668   .0034739    83.38   0.000     .2828592    .2964767
       2018  |   .1809694   .0043303    41.79   0.000     .1724821    .1894568
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0219843   .0018538    11.86   0.000     .0183509    .0256177
       2016  |    .004885   .0018367     2.66   0.008     .0012852    .0084848
       2017  |   .0182834   .0018473     9.90   0.000     .0146627    .0219041
       2018  |   .0000418   .0018565     0.02   0.982    -.0035968    .0036804
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0157063   .0008343   -18.83   0.000    -.0173414   -.0140712
       2016  |  -.0102119   .0007568   -13.49   0.000    -.0116952   -.0087286
       2017  |  -.0130782   .0007307   -17.90   0.000    -.0145103   -.0116462
       2018  |  -.0061234   .0012168    -5.03   0.000    -.0085083   -.0037385
             |
        year#|
          c. |
prior_math~e |
       2015  |   .4871912   .0034159   142.63   0.000     .4804962    .4938862
       2016  |   .5085893   .0034344   148.08   0.000     .5018578    .5153207
       2017  |   .5351494   .0035675   150.01   0.000     .5281573    .5421415
       2018  |   .6632555   .0043597   152.13   0.000     .6547106    .6718005
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0235113   .0023111    10.17   0.000     .0189815     .028041
       2016  |   .0011741   .0022209     0.53   0.597    -.0031789     .005527
       2017  |   .0005618   .0022842     0.25   0.806    -.0039152    .0050388
       2018  |   .0758112   .0018234    41.58   0.000     .0722374     .079385
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0229147   .0009329   -24.56   0.000    -.0247432   -.0210863
       2016  |  -.0192749   .0009756   -19.76   0.000    -.0211871   -.0173628
       2017  |  -.0223544   .0009649   -23.17   0.000    -.0242455   -.0204633
       2018  |  -.0275547   .0012018   -22.93   0.000    -.0299103   -.0251992
             |
1.has_~2year |  -.0283035   .0033136    -8.54   0.000     -.034798   -.0218089
1.has_~4year |   .0673296   .0035841    18.79   0.000     .0603049    .0743543
eth_asian_~t |   .0014749   .0000643    22.94   0.000     .0013489    .0016009
eth_hispan~t |  -.0000535   .0000639    -0.84   0.403    -.0001787    .0000718
eth_black_~t |  -.0019194   .0001192   -16.11   0.000     -.002153   -.0016859
educ_hs_dr~p |   1.021699   .1706435     5.99   0.000     .6872426    1.356155
educ~us_prop |   2.392699   .1626155    14.71   0.000     2.073978     2.71142
pov_fam_ch~t |   .0007971   .0000978     8.15   0.000     .0006053    .0009888
inc_medi~_hh |   1.26e-06   4.53e-08    27.71   0.000     1.17e-06    1.34e-06
       _cons |   2.105774   .0379116    55.54   0.000     2.031468    2.180079
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/vam_math_both.ster saved
Standard deviations: total, classes, students, teachers same year
.54453482 .15573821 .52178902 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0165301758   .6096481124          3414  |
  2 |  .0127862416   .4704700645          2221  |
  3 |  .0083927169   .3077101532          1065  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0165301758  |
  2 |  .0127862416  |
  3 |  .0127862416  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    416,620
                                                F(1, 1241)        =    2488.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0394
                                                Root MSE          =     .53359

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
 math_r_both | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_math_both |   .9977772    .020003    49.88   0.000     .9585338    1.037021
       _cons |  -.0010593   .0009964    -1.06   0.288    -.0030141    .0008955
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/spec_test_math_both.ster saved

Linear regression                               Number of obs     =    416,620
                                                F(1, 1241)        =      22.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .01701

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
math_r_d_a~h | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_math_acs |    .002007    .000422     4.76   0.000     .0011792    .0028348
       _cons |  -3.21e-06   .0000504    -0.06   0.949    -.0001022    .0000958
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/fb_test_math_sib_acs.ster saved

Linear regression                               Number of obs     =    416,620
                                                F(1, 1241)        =      57.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0412
                                                Root MSE          =     .04988

                          (Std. err. adjusted for 1,242 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
math_r_d_s~h | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_math_sib |   .0876624   .0115882     7.56   0.000     .0649278     .110397
       _cons |  -.0001097   .0011986    -0.09   0.927    -.0024611    .0022417
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/test_score_va/fb_test_math_acs_sib.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/t
    > est_score_va/va_math_sib_acs.dta saved

. 
. 
. timer off 1

. timer list
   1:     40.59 /        1 =      40.5950

. 
. //change directory back to my own personal directory
. cd $projdir
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 22:15:05
-------------------------------------------------------------------------------
