-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 21:46:00

. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;

. local acs_str
>         "Original + Census"
>         ;

. local sib_str
>         "Original + Sibling"
>         ;

. local both_str
>         "Original + Census + Sibling"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. #delimit ;
delimiter now ;
. #delimit cr
delimiter now cr
. macro list
T_gm_fix_span:  0
S_6:            .7098361624622439
S_5:            4
S_4:            .3794917847397928
ReS_jv2:        __000006 __000007 __000008 __000009 __00000A __00000B __00000C
                __00000D __00000E __00000F __00000G __00000H __00000I __00000J
                __00000K
dropv:          _cdscode_x
n_offset:       0
sort:           0
dots:           nois _dots 5 0
dotss:          nois _dots 0, title(Survey results being calculated)
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_both_str:      Original + Census + Sibling
_sib_str:       Original + Sibling
_acs_str:       Original + Census
_og_str:        Original Specification
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset
_setlimit:      0
_1:             0
_0:             0

. 
. 
. timer on 1

. 
. *****************************************************************************
> ***
. 
. 
. //load the VA grade 11 sample
. use `va_g11_dataset', clear
(Test Score Grade 11 VA Sample)

. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk', nogen keep(1 3)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       884,312
        from master                   884,312  
        from using                          0  

    Matched                           900,133  
    -----------------------------------------

. 
. drop if mi(has_older_sibling_enr_2year)
(884,312 observations deleted)

. drop if mi(has_older_sibling_enr_4year)
(0 observations deleted)

. 
. compress
  variable age was float now int
  (1,800,266 bytes saved)

. tempfile va_g11_sibling_dataset

. save `va_g11_sibling_dataset'
file /home/tmp/St35924.000001 saved as .dta format

. 
. 
. 
. 
. *****************************************************************************
> ***
. *********** VA estimates for VA samples matched to siblings sample
. *****************************************************************************
> ***
. 
. 
. if `setlimit' == 0 {
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 
> 1)
. }

. else {
.   local drift_limit = `setlimit'
. }

. 
. foreach subject in ela math {
  2. 
. 
.     /* load the VA g11 subject sample with siblings outcome sample
>      (those who have at least one older sibling matched to the postsecondary
>    outcomes) */
.     use `va_g11_sibling_dataset' if touse_g11_`subject'==1 & sibling_out_samp
> le == 1, clear
  3. 
.     *************************************************************************
> *****
.     ************ Value added estimation with no peer controls ***************
> *****
.     ****** No TFX, without sibling college going controls
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`su
> bject'_nosibctrl.ster, replace)
  4. 
.     //rename the first time to make sure indep var names for spec test are al
> l the same
.     rename tv va_cfr_g11_`subject'
  5.         rename score_r sbac_g11_`subject'_r
  6. 
. 
.     ************ specification test: regressing score residuals on VA estimat
> es
.     ******* No peer controls
.     ******** sibling sample without sibling controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
  7.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_
> g11_`subject'_sibling_nocontrol.ster, replace
  8.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va
> _cfr_g11_`subject'_sibling_nocontrol.ster, replace
  9. 
.     //rename again to distinguish between nocontrol and with control va estim
> ates
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
 10.     rename sbac_g11_`subject'_r sbac_g11_`subject'_r_nosibctrl
 11.     label var va_cfr_g11_`subject'_nosibctrl "`subject' VA with family FE 
> without TFX without sibling control"
 12.     label var sbac_g11_`subject'_r_nosibctrl "`subject' score residual wit
> h family FE without TFX without sibling control"
 13. 
.     ****** No TFX (teacher fixed effects), include sibling controls
.     vam sbac_`subject'_z_score ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`su
> bject'.ster, replace)
 14. 
. 
.     rename tv va_cfr_g11_`subject'
 15.         rename score_r sbac_g11_`subject'_r
 16. 
.     ************ specification test: regressing score residuals on VA estimat
> es
.     ******* No peer controls
.     ******** sibling sample with sibling controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
 17.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_
> g11_`subject'_sibling.ster, replace
 18.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va
> _cfr_g11_`subject'_sibling.ster, replace
 19. 
. 
. 
.     label var va_cfr_g11_`subject' "`subject' VA with family FE without TFX"
 20.     label var sbac_g11_`subject'_r "`subject' score residual with family F
> E without TFX"
 21. 
. /*
>     ****** With TFX, and TFX is added back in the the VA estimates
>     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_tfx_g11_`subject'
>     drop score_r
>     label var va_tfx_g11_`subject' "`subject' VA with family FE with TFX"
> 
> 
>  */
. 
. 
. 
. 
. 
. 
. 
.     *************************************************************************
> *****
.     ************ Value added estimation with peer controls ******************
> **
.     ****** No TFX (teacher fixed effects)
.     /* vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_cfr_g11_`subject'_peer
>     rename score_r sbac_g11_`subject'_r_peer
>     label var va_cfr_g11_`subject'_peer "`subject' VA with family FE with TFX
> "
>     label var sbac_g11_`subject'_r_peer "`subject' score residual with family
>  FE with TFX"
> 
> 
>     ****** With TFX
>     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_tfx_g11_`subject'_peer
>     drop score_r */
. 
. 
.     *************************************************************************
> *****
.     ************ specification test: regressing score residuals on VA estimat
> es
. 
.     /* ******* With peer controls
>     reg sbac_g11_`subject'_r_peer va_cfr_g11_`subject'_peer, cluster(school_i
> d)
>     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_
> g11_`subject'_peer_sibling.ster, replace */
. 
. 
. 
. 
.     *************************************************************************
> *****
.     /* CFR Forecast Bias Test */
.     ***** leave out variable is sibling controls
.     **no peer controls
.     gen sbac_g11_`subject'_r_d = sbac_g11_`subject'_r_nosibctrl - sbac_g11_`s
> ubject'_r
 22.     //var rename gymnastics to make sure the indep var names are all the s
> ame when making tables later
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_temp
 23.     rename va_cfr_g11_`subject'_nosibctrl va_cfr_g11_`subject'
 24. 
.     reg sbac_g11_`subject'_r_d va_cfr_g11_`subject',    cluster(school_id)
 25.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/fb_test_va_cfr_g1
> 1_`subject'_sibling.ster, replace
 26.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/fb_test_va_c
> fr_g11_`subject'_sibling.ster, replace
 27. 
.     //roll back the rename gymnastics to restore original var names
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
 28.     rename va_cfr_g11_`subject'_temp va_cfr_g11_`subject'
 29. 
. 
.     **************** Save Value Added Estimates
.     collapse (firstnm) va_* ///
>                 (mean) sbac_*_r* ///
>                 (sum) n_g11_`subject' = touse_g11_`subject' ///
>       if sibling_full_sample == 1 & sibling_out_sample == 1 ///
>                 , by(school_id cdscode grade year)
 30.     //save to my personal folder
.         save $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibli
> ng.dta, replace
 31.     //save to VA project folder
.     save $vaprojdir/data/sibling_va/test_score_va/va_g11_`subject'_sibling.dt
> a, replace
 32. 
. 
. }
(Test Score Grade 11 VA Sample)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   677,216
-------------+----------------------------------   F(36, 677179)   =  28469.80
       Model |  329882.534        36  9163.40374   Prob > F        =    0.0000
    Residual |   217959.52   677,179  .321863968   R-squared       =    0.6021
-------------+----------------------------------   Adj R-squared   =    0.6021
       Total |  547842.055   677,215  .808963261   Root MSE        =    .56733

------------------------------------------------------------------------------
sbac_ela_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |    .049952   .0027484    18.17   0.000     .0445651    .0553388
       2017  |   .0676661   .0027358    24.73   0.000      .062304    .0730282
       2018  |  -.0710663   .0027417   -25.92   0.000    -.0764399   -.0656926
             |
         age |  -.0003427   4.88e-06   -70.16   0.000    -.0003523   -.0003331
             |
        male |
       Male  |  -.0902762   .0014095   -64.05   0.000    -.0930386   -.0875137
 1.eth_asian |   .1037072    .002264    45.81   0.000     .0992697    .1081446
1.eth_hisp~c |  -.0050483   .0019298    -2.62   0.009    -.0088306    -.001266
 1.eth_black |  -.1444415   .0037983   -38.03   0.000    -.1518861    -.136997
 1.eth_other |   .0042174   .0042036     1.00   0.316    -.0040216    .0124564
             |
econ_disad~e |
Economic ..  |  -.0366379    .001636   -22.39   0.000    -.0398444   -.0334314
             |
limited_en~f |
Limited E..  |  -.2115791   .0036822   -57.46   0.000     -.218796   -.2043622
             |
    disabled |
   Disabled  |  -.1861578    .003719   -50.06   0.000    -.1934468   -.1788687
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .6117589   .0027975   218.68   0.000     .6062758     .617242
       2016  |   .5932779   .0027254   217.69   0.000     .5879363    .5986195
       2017  |   .5819199   .0028658   203.06   0.000      .576303    .5875368
       2018  |   .5727928   .0034906   164.09   0.000     .5659513    .5796343
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0002492   .0014745     0.17   0.866    -.0026408    .0031391
       2016  |  -.0138123   .0014878    -9.28   0.000    -.0167283   -.0108963
       2017  |  -.0132221   .0015001    -8.81   0.000    -.0161622   -.0102821
       2018  |   .0110503   .0015063     7.34   0.000     .0080979    .0140027
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0275497   .0006825   -40.37   0.000    -.0288874    -.026212
       2016  |   -.022671   .0006239   -36.34   0.000    -.0238938   -.0214483
       2017  |   -.023669   .0006071   -38.99   0.000    -.0248589   -.0224791
       2018  |   -.029471   .0009879   -29.83   0.000    -.0314073   -.0275347
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1695979   .0027789    61.03   0.000     .1641514    .1750444
       2016  |   .1896205   .0028265    67.09   0.000     .1840806    .1951604
       2017  |   .1890129   .0029485    64.10   0.000     .1832339    .1947919
       2018  |   .2478752   .0035319    70.18   0.000     .2409528    .2547975
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0045602     .00185    -2.46   0.014    -.0081861   -.0009343
       2016  |  -.0127178   .0018013    -7.06   0.000    -.0162483   -.0091872
       2017  |  -.0071474   .0018435    -3.88   0.000    -.0107606   -.0035341
       2018  |   .0042926   .0014656     2.93   0.003     .0014201    .0071652
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0031363   .0007616    -4.12   0.000    -.0046289   -.0016436
       2016  |  -.0035725   .0008053    -4.44   0.000    -.0051508   -.0019942
       2017  |  -.0066826   .0007958    -8.40   0.000    -.0082422   -.0051229
       2018  |  -.0058624   .0009793    -5.99   0.000    -.0077818   -.0039429
             |
       _cons |   2.270805   .0299199    75.90   0.000     2.212163    2.329447
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/vam_cfr_g11_ela_nosibctrl.ster saved
Standard deviations: total, classes, students, teachers same year
.56733056 .18211111 .53730765 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0199278225   .5743594084          3540  |
  2 |  .0151241222   .4358937078          2298  |
  3 |  .0085309078   .2388253579          1104  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0199278225  |
  2 |  .0151241222  |
  3 |  .0151241222  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    675,524
                                                F(1, 1274)        =    2114.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0410
                                                Root MSE          =     .55544

                          (Std. err. adjusted for 1,275 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_e~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~a |    .982105   .0213574    45.98   0.000     .9402053    1.024005
       _cons |  -.0002089   .0012526    -0.17   0.868    -.0026663    .0022485
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   677,216
-------------+----------------------------------   F(38, 677177)   =  26985.55
       Model |  329951.783        38  8682.94165   Prob > F        =    0.0000
    Residual |  217890.272   677,177  .321762659   R-squared       =    0.6023
-------------+----------------------------------   Adj R-squared   =    0.6023
       Total |  547842.055   677,215  .808963261   Root MSE        =    .56724

------------------------------------------------------------------------------
sbac_ela_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0498408   .0027482    18.14   0.000     .0444544    .0552272
       2017  |   .0674022   .0027362    24.63   0.000     .0620393    .0727651
       2018  |  -.0712742   .0027432   -25.98   0.000    -.0766509   -.0658976
             |
1.has_~2year |  -.0178002   .0027014    -6.59   0.000    -.0230949   -.0125056
1.has_~4year |   .0400088   .0029644    13.50   0.000     .0341987    .0458189
         age |   -.000342   4.89e-06   -70.00   0.000    -.0003515   -.0003324
             |
        male |
       Male  |  -.0903037   .0014092   -64.08   0.000    -.0930657   -.0875416
 1.eth_asian |   .1032379   .0022649    45.58   0.000     .0987987     .107677
1.eth_hisp~c |  -.0044891     .00193    -2.33   0.020    -.0082718   -.0007064
 1.eth_black |  -.1444057   .0037977   -38.02   0.000    -.1518491   -.1369623
 1.eth_other |   .0045368   .0042031     1.08   0.280     -.003701    .0127747
             |
econ_disad~e |
Economic ..  |  -.0366641   .0016361   -22.41   0.000    -.0398708   -.0334574
             |
limited_en~f |
Limited E..  |   -.211465   .0036816   -57.44   0.000    -.2186808   -.2042492
             |
    disabled |
   Disabled  |  -.1860572   .0037185   -50.04   0.000    -.1933453   -.1787691
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .6114281   .0027973   218.58   0.000     .6059456    .6169107
       2016  |   .5929625   .0027252   217.59   0.000     .5876212    .5983037
       2017  |   .5815574   .0028657   202.93   0.000     .5759406    .5871741
       2018  |   .5723095   .0034903   163.97   0.000     .5654687    .5791503
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0002213   .0014743     0.15   0.881    -.0026682    .0031109
       2016  |  -.0138438   .0014876    -9.31   0.000    -.0167594   -.0109281
       2017  |  -.0132139   .0014999    -8.81   0.000    -.0161536   -.0102742
       2018  |   .0110746   .0015061     7.35   0.000     .0081226    .0140265
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0275084   .0006824   -40.31   0.000    -.0288459   -.0261709
       2016  |  -.0226359   .0006238   -36.29   0.000    -.0238585   -.0214134
       2017  |  -.0236347    .000607   -38.93   0.000    -.0248244   -.0224449
       2018  |  -.0294001   .0009878   -29.76   0.000    -.0313361    -.027464
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1690658   .0027787    60.84   0.000     .1636196    .1745119
       2016  |   .1889454   .0028265    66.85   0.000     .1834056    .1944853
       2017  |   .1883338   .0029484    63.88   0.000     .1825549    .1941126
       2018  |   .2470778   .0035317    69.96   0.000     .2401558    .2539999
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0045907   .0018497    -2.48   0.013    -.0082161   -.0009654
       2016  |  -.0127765   .0018011    -7.09   0.000    -.0163066   -.0092465
       2017  |  -.0071828   .0018433    -3.90   0.000    -.0107956   -.0035701
       2018  |     .00418   .0014655     2.85   0.004     .0013077    .0070523
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0030898   .0007614    -4.06   0.000    -.0045822   -.0015974
       2016  |  -.0035057   .0008052    -4.35   0.000    -.0050838   -.0019276
       2017  |  -.0066325   .0007956    -8.34   0.000    -.0081919    -.005073
       2018  |  -.0057689   .0009792    -5.89   0.000    -.0076881   -.0038497
             |
       _cons |   2.265456   .0299306    75.69   0.000     2.206793    2.324119
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/vam_cfr_g11_ela.ster saved
Standard deviations: total, classes, students, teachers same year
.56724127 .18200275 .53725009 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0198912767   .5739682018          3540  |
  2 |  .0150935022   .4354864531          2298  |
  3 |  .0084951172   .2380391636          1104  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0198912767  |
  2 |  .0150935022  |
  3 |  .0150935022  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    675,524
                                                F(1, 1274)        =    2109.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0409
                                                Root MSE          =     .55538

                          (Std. err. adjusted for 1,275 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_e~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~a |   .9819917   .0213791    45.93   0.000     .9400497    1.023934
       _cons |  -.0002055   .0012535    -0.16   0.870    -.0026646    .0022536
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/spec_test_va_cfr_g11_ela_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/spec_test_va_cfr_g11_ela_sibling.ster saved

Linear regression                               Number of obs     =    675,524
                                                F(1, 1274)        =      20.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0001
                                                Root MSE          =     .01011

                          (Std. err. adjusted for 1,275 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_e~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~a |   .0010172   .0002236     4.55   0.000     .0005785    .0014558
       _cons |  -8.40e-07    .000028    -0.03   0.976    -.0000558    .0000541
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/fb_test_va_cfr_g11_ela_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/fb_test_va_cfr_g11_ela_sibling.ster saved
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/test
    > _score_va/va_g11_ela_sibling.dta saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/test_sco
    > re_va/va_g11_ela_sibling.dta saved
(Test Score Grade 11 VA Sample)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   674,426
-------------+----------------------------------   F(36, 674389)   =  37011.24
       Model |  400154.962        36  11115.4156   Prob > F        =    0.0000
    Residual |  202536.153   674,389   .30032541   R-squared       =    0.6639
-------------+----------------------------------   Adj R-squared   =    0.6639
       Total |  602691.115   674,425  .893636972   Root MSE        =    .54802

------------------------------------------------------------------------------
sbac_math_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0585371   .0026614    21.99   0.000     .0533207    .0637534
       2017  |   .0687273   .0026503    25.93   0.000     .0635328    .0739218
       2018  |  -.0883836   .0026544   -33.30   0.000    -.0935861   -.0831812
             |
         age |  -.0003539   4.73e-06   -74.85   0.000    -.0003632   -.0003447
             |
        male |
       Male  |   .0528948   .0013643    38.77   0.000     .0502209    .0555687
 1.eth_asian |   .1902215   .0021907    86.83   0.000     .1859277    .1945153
1.eth_hisp~c |  -.0668278   .0018686   -35.76   0.000    -.0704902   -.0631655
 1.eth_black |  -.1696988   .0036768   -46.15   0.000    -.1769053   -.1624923
 1.eth_other |   .0057668   .0040724     1.42   0.157     -.002215    .0137486
             |
econ_disad~e |
Economic ..  |  -.0650876   .0015839   -41.09   0.000     -.068192   -.0619833
             |
limited_en~f |
Limited E..  |  -.0853586   .0035677   -23.93   0.000    -.0923512   -.0783661
             |
    disabled |
   Disabled  |  -.1559516   .0036068   -43.24   0.000    -.1630208   -.1488823
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .3460561   .0027087   127.76   0.000     .3407471    .3513651
       2016  |   .3328509   .0026389   126.13   0.000     .3276786    .3380231
       2017  |   .3021774   .0027745   108.91   0.000     .2967395    .3076153
       2018  |   .1877728   .0033763    55.61   0.000     .1811553    .1943903
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0241553   .0014324    16.86   0.000     .0213477    .0269628
       2016  |   .0055992    .001441     3.89   0.000     .0027748    .0084235
       2017  |   .0197738   .0014529    13.61   0.000     .0169262    .0226214
       2018  |  -.0001263    .001457    -0.09   0.931     -.002982    .0027294
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0156138   .0006612   -23.61   0.000    -.0169098   -.0143178
       2016  |  -.0103964   .0006037   -17.22   0.000    -.0115796   -.0092133
       2017  |  -.0133398   .0005877   -22.70   0.000    -.0144916    -.012188
       2018  |  -.0065488   .0009548    -6.86   0.000    -.0084202   -.0046774
             |
        year#|
          c. |
prior_math~e |
       2015  |   .4874256   .0026897   181.22   0.000     .4821539    .4926973
       2016  |   .5093071   .0027366   186.11   0.000     .5039435    .5146706
       2017  |   .5323158   .0028544   186.49   0.000     .5267212    .5379104
       2018  |   .6711123    .003419   196.29   0.000     .6644113    .6778134
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0241346   .0017928    13.46   0.000     .0206208    .0276483
       2016  |   .0046484   .0017437     2.67   0.008     .0012309     .008066
       2017  |  -.0006538    .001787    -0.37   0.714    -.0041563    .0028487
       2018  |   .0777257   .0014196    54.75   0.000     .0749432    .0805081
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0227954   .0007368   -30.94   0.000    -.0242395   -.0213514
       2016  |  -.0202957   .0007792   -26.05   0.000    -.0218229   -.0187684
       2017  |  -.0213882   .0007706   -27.75   0.000    -.0228986   -.0198778
       2018  |  -.0265735   .0009485   -28.02   0.000    -.0284326   -.0247144
             |
       _cons |   2.249231   .0289646    77.65   0.000     2.192461       2.306
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/vam_cfr_g11_math_nosibctrl.ster saved
Standard deviations: total, classes, students, teachers same year
.54801953 .16389467 .5229378 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0194655457   .6783718957          3533  |
  2 |  .0154051059   .5463654546          2295  |
  3 |  .0098230485   .3639729819          1104  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0194655457  |
  2 |  .0154051059  |
  3 |  .0154051059  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    672,810
                                                F(1, 1272)        =    4233.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0479
                                                Root MSE          =     .53469

                          (Std. err. adjusted for 1,273 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_m~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~h |   .9689093   .0148912    65.07   0.000     .9396952    .9981233
       _cons |  -.0008554    .000894    -0.96   0.339    -.0026094    .0008985
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   674,426
-------------+----------------------------------   F(38, 674387)   =  35111.74
       Model |  400341.058        38   10535.291   Prob > F        =    0.0000
    Residual |  202350.056   674,387  .300050351   R-squared       =    0.6643
-------------+----------------------------------   Adj R-squared   =    0.6642
       Total |  602691.115   674,425  .893636972   Root MSE        =    .54777

------------------------------------------------------------------------------
sbac_math_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0583165   .0026604    21.92   0.000     .0531021    .0635308
       2017  |   .0682077   .0026499    25.74   0.000      .063014    .0734014
       2018  |  -.0888678    .002655   -33.47   0.000    -.0940716   -.0836641
             |
1.has_~2year |  -.0261661   .0026133   -10.01   0.000    -.0312881   -.0210441
1.has_~4year |   .0670659   .0028672    23.39   0.000     .0614462    .0726857
         age |  -.0003526   4.73e-06   -74.57   0.000    -.0003619   -.0003433
             |
        male |
       Male  |   .0528551   .0013636    38.76   0.000     .0501824    .0555278
 1.eth_asian |   .1893682    .002191    86.43   0.000      .185074    .1936624
1.eth_hisp~c |  -.0659517   .0018682   -35.30   0.000    -.0696133     -.06229
 1.eth_black |  -.1696526   .0036752   -46.16   0.000    -.1768558   -.1624494
 1.eth_other |   .0062942   .0040706     1.55   0.122    -.0016841    .0142726
             |
econ_disad~e |
Economic ..  |   -.065175   .0015835   -41.16   0.000    -.0682786   -.0620714
             |
limited_en~f |
Limited E..  |  -.0851761   .0035661   -23.89   0.000    -.0921655   -.0781866
             |
    disabled |
   Disabled  |  -.1557237   .0036053   -43.19   0.000    -.1627899   -.1486574
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .3455319   .0027076   127.61   0.000      .340225    .3508388
       2016  |   .3323551    .002638   125.99   0.000     .3271848    .3375255
       2017  |   .3016123   .0027736   108.75   0.000     .2961762    .3070484
       2018  |   .1870211   .0033749    55.41   0.000     .1804063    .1936358
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0241136   .0014318    16.84   0.000     .0213073    .0269199
       2016  |   .0055542   .0014404     3.86   0.000     .0027311    .0083773
       2017  |    .019802   .0014522    13.64   0.000     .0169557    .0226484
       2018  |  -.0000757   .0014564    -0.05   0.959    -.0029302    .0027788
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0155478   .0006609   -23.52   0.000    -.0168433   -.0142524
       2016  |  -.0103402   .0006034   -17.14   0.000    -.0115229   -.0091576
       2017  |   -.013287   .0005874   -22.62   0.000    -.0144383   -.0121357
       2018  |  -.0064334   .0009544    -6.74   0.000     -.008304   -.0045629
             |
        year#|
          c. |
prior_math~e |
       2015  |   .4865422   .0026887   180.96   0.000     .4812724     .491812
       2016  |   .5081904   .0027357   185.76   0.000     .5028285    .5135523
       2017  |   .5312035   .0028535   186.16   0.000     .5256108    .5367963
       2018  |   .6697783   .0034178   195.97   0.000     .6630795    .6764771
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0240978    .001792    13.45   0.000     .0205857      .02761
       2016  |   .0045671   .0017429     2.62   0.009     .0011511    .0079831
       2017  |  -.0007047   .0017862    -0.39   0.693    -.0042056    .0027963
       2018  |   .0775677   .0014191    54.66   0.000     .0747863    .0803491
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0227176   .0007364   -30.85   0.000     -.024161   -.0212742
       2016  |  -.0201881   .0007789   -25.92   0.000    -.0217147   -.0186616
       2017  |  -.0213057   .0007703   -27.66   0.000    -.0228154    -.019796
       2018  |   -.026412   .0009481   -27.86   0.000    -.0282703   -.0245537
             |
       _cons |   2.239301   .0289661    77.31   0.000     2.182529    2.296074
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/vam_cfr_g11_math.ster saved
Standard deviations: total, classes, students, teachers same year
.54776852 .16370998 .52273262 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0194144452   .6779754953          3533  |
  2 |  .0153565768   .5458004638          2295  |
  3 |  .0097590142   .3625035724          1104  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0194144452  |
  2 |  .0153565768  |
  3 |  .0153565768  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    672,810
                                                F(1, 1272)        =    4230.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0477
                                                Root MSE          =     .53448

                          (Std. err. adjusted for 1,273 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_m~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~h |   .9685101   .0148896    65.05   0.000     .9392992     .997721
       _cons |  -.0008494   .0008951    -0.95   0.343    -.0026053    .0009066
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/spec_test_va_cfr_g11_math_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/spec_test_va_cfr_g11_math_sibling.ster saved

Linear regression                               Number of obs     =    672,810
                                                F(1, 1272)        =      15.98
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0001
                                                Root MSE          =     .01661

                          (Std. err. adjusted for 1,273 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
sbac_g11_m~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~h |   .0014613   .0003655     4.00   0.000     .0007442    .0021783
       _cons |  -2.06e-06   .0000463    -0.04   0.965    -.0000929    .0000888
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_s
> core_va/fb_test_va_cfr_g11_math_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test
> _score_va/fb_test_va_cfr_g11_math_sibling.ster saved
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/test
    > _score_va/va_g11_math_sibling.dta saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/test_sco
    > re_va/va_g11_math_sibling.dta saved

. 
. 
. 
. 
. 
. 
. set trace off

. 
. timer off 1

. timer list
   1:     37.46 /        1 =      37.4600

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 21:46:37
-------------------------------------------------------------------------------
