-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvareg
> s/va_sibling.smcl
  log type:  smcl
 opened on:  10 Nov 2021, 15:28:52

. 
. //include macros
. include do_files/sbac/macros_va.doh

. #delimit ;
delimiter now ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2019
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. #delimit cr
delimiter now cr
. 
. 
. #delimit ;
delimiter now ;
. #delimit cr
delimiter now cr
. macro list
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cst
vadtadir:       /home/research/ca_ed_lab/msnaven/common_core_va/data/sbac
projdir:        /home/research/ca_ed_lab/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2019
_test_score_min_year:
                2015
_sibling_out_xwalk:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/si
                > bling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/uf
                > amilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/si
                > blingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > va_dataset
_k12_test_scores_public:
                /home/research/ca_ed_lab/msnaven/data/public_access/clean/k12_t
                > est_scores
_k12_public_schools:
                /home/research/ca_ed_lab/msnaven/data/public_access/clean/k12_p
                > ublic_schools
_public_access: /home/research/ca_ed_lab/data/public_access
_k12_test_scores:
                /home/research/ca_ed_lab/msnaven/data/restricted_access/clean/k
                > 12_test_scores
_ca_ed_lab:     /home/research/ca_ed_lab
_common_core_va:
                /home/research/ca_ed_lab/msnaven/common_core_va
_mattdofiles:   /home/research/ca_ed_lab/msnaven/common_core_va/do_files/sbac
_matthomedir:   /home/research/ca_ed_lab/msnaven/common_core_va
_setlimit:      0
_1:             0
_0:             0

. 
. 
. timer on 1

. 
. *****************************************************************************
> ***
. 
. 
. //load the VA grade 11 sample
. use `va_g11_dataset', clear
(CST/SBAC Student Test Score Samples)

. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk'

    Result                      Number of obs
    -----------------------------------------
    Not matched                     4,360,629
        from master                 1,252,476  (_merge==1)
        from using                  3,108,153  (_merge==2)

    Matched                         1,169,409  (_merge==3)
    -----------------------------------------

. drop _merge

. /*
> Result                      Number of obs
>     -----------------------------------------
>     Not matched                     4,360,629
>         from master                 1,252,476  (_merge==1)
>         from using                  3,108,153  (_merge==2)
> 
>     Matched                         1,169,409  (_merge==3)
>     -----------------------------------------
> 
>  */
. 
. compress
  (0 bytes saved)

. tempfile va_g11_sibling_dataset

. save `va_g11_sibling_dataset'
file /home/tmp/St241407.000001 saved as .dta format

. 
. 
. 
. 
. *****************************************************************************
> ***
. *********** VA estimates for VA samples matched to siblings sample
. *****************************************************************************
> ***
. 
. 
. if `setlimit' == 0 {
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 
> 1)
. }

. else {
.   local drift_limit = `setlimit'
. }

. 
. foreach subject in ela math {
  2. 
. 
.     /* load the VA g11 subject sample with siblings outcome sample
>      (those who have at least one older sibling matched to the postsecondary
>    outcomes) */
.     use `va_g11_sibling_dataset' if touse_g11_`subject'==1 & sibling_out_samp
> le == 1, clear
  3. 
.     *************************************************************************
> *****
.     ************ Value added estimation with no peer controls ***************
> *****
.     ****** No TFX (teacher fixed effects)
.     vam sbac_`subject'_z_score ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
  4.         rename tv va_cfr_g11_`subject'
  5.         rename score_r sbac_g11_`subject'_r
  6.     label var va_cfr_g11_`subject' "`subject' VA with family FE without TF
> X"
  7.     label var sbac_g11_`subject'_r "`subject' score residual with family F
> E without TFX"
  8. 
. 
.     ****** With TFX, and TFX is added back in the the VA estimates
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
  9.     rename tv va_tfx_g11_`subject'
 10.     drop score_r
 11.     label var va_tfx_g11_`subject' "`subject' VA with family FE with TFX"
 12. 
. 
.     ****** No TFX, without sibling college going controls
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
 13.     rename tv va_cfr_g11_`subject'_nosiblingcontrol
 14.     rename score_r sbac_g11_`subject'_r_nosiblingcontrol
 15.     label var va_cfr_g11_`subject'_nosiblingcontrol "`subject' VA with fam
> ily FE without TFX without sibling control"
 16.     label var sbac_g11_`subject'_r_nosiblingcontrol "`subject' score resid
> ual with family FE without TFX without sibling control"
 17. 
. 
. 
. 
. 
. 
. 
.     *************************************************************************
> *****
.     ************ Value added estimation with peer controls ******************
> **
.     ****** No TFX (teacher fixed effects)
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
 18.     rename tv va_cfr_g11_`subject'_peer
 19.     rename score_r sbac_g11_`subject'_r_peer
 20.     label var va_cfr_g11_`subject'_peer "`subject' VA with family FE with 
> TFX"
 21.     label var sbac_g11_`subject'_r_peer "`subject' score residual with fam
> ily FE with TFX"
 22. 
. 
.     ****** With TFX
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
 23.     rename tv va_tfx_g11_`subject'_peer
 24.     drop score_r
 25. 
. 
.     *************************************************************************
> *****
.     ************ specification test: regressing score residuals on VA estimat
> es
.     ******* No peer controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
 26.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_c
> fr_g11_`subject'_sibling.ster, replace
 27. 
. 
.     ******* With peer controls
.     reg sbac_g11_`subject'_r_peer va_cfr_g11_`subject'_peer, cluster(school_i
> d)
 28.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_c
> fr_g11_`subject'_peer_sibling.ster, replace
 29. 
. 
.     ******** sibling sample without sibling controls
.     reg sbac_g11_`subject'_r_nosiblingcontrol va_cfr_g11_`subject'_nosiblingc
> ontrol, cluster(school_id)
 30.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_c
> fr_g11_`subject'_sibling_nocontrol.ster, replace
 31. 
. 
. 
.     **************** Save Value Added Estimates
.     collapse (firstnm) va_* ///
>                 (mean) sbac_*_r* ///
>                 (sum) n_g11_`subject' = touse_g11_`subject' ///
>       if sibling_full_sample == 1 & sibling_out_sample == 1 ///
>                 , by(school_id cdscode grade year)
 32.         save $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_si
> bling.dta, replace
 33. 
. 
. }
(CST/SBAC Student Test Score Samples)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   452,964
-------------+----------------------------------   F(45, 452918)   =  14712.18
       Model |  219147.278        45  4869.93952   Prob > F        =    0.0000
    Residual |  149922.215   452,918  .331014035   R-squared       =    0.5938
-------------+----------------------------------   Adj R-squared   =    0.5937
       Total |  369069.493   452,963  .814789493   Root MSE        =    .57534

-------------------------------------------------------------------------------
sbac_ela_z_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0298998   .0033396    -8.95   0.000    -.0364453   -.0233543
        2017  |   .0698685   .0036643    19.07   0.000     .0626865    .0770504
        2018  |  -.0689968   .0035907   -19.22   0.000    -.0760344   -.0619593
        2019  |  -.0612501   .0037775   -16.21   0.000    -.0686538   -.0538463
              |
1.has_o~2year |   -.016858   .0035483    -4.75   0.000    -.0238126   -.0099034
1.has_o~4year |   .0433794   .0041385    10.48   0.000     .0352681    .0514907
          age |  -.0003434   5.97e-06   -57.54   0.000    -.0003551   -.0003317
              |
         male |
        Male  |  -.0876943   .0017488   -50.14   0.000    -.0911219   -.0842666
  1.eth_asian |   .1009889   .0029062    34.75   0.000     .0952929    .1066849
1.eth_hispa~c |  -.0018301   .0023894    -0.77   0.444    -.0065133    .0028531
  1.eth_black |  -.1430062   .0047267   -30.25   0.000    -.1522704    -.133742
  1.eth_other |   .0092999   .0052137     1.78   0.074    -.0009187    .0195185
              |
econ_disadv~e |
Economic D..  |  -.0314605   .0020171   -15.60   0.000    -.0354139   -.0275071
              |
limited_eng~f |
Limited En..  |  -.2086666    .004396   -47.47   0.000    -.2172826   -.2000506
              |
     disabled |
    Disabled  |  -.1774127   .0043441   -40.84   0.000     -.185927   -.1688984
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .6130925    .002853   214.90   0.000     .6075008    .6186842
        2016  |   .6004433    .004073   147.42   0.000     .5924604    .6084262
        2017  |   .5760748    .004639   124.18   0.000     .5669824    .5851671
        2018  |   .5687551   .0054016   105.29   0.000      .558168    .5793421
        2019  |   .5878995   .0059471    98.85   0.000     .5762433    .5995556
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0001277   .0015044     0.08   0.932    -.0028209    .0030763
        2016  |  -.0016633   .0019734    -0.84   0.399    -.0055312    .0022045
        2017  |  -.0126169   .0023959    -5.27   0.000    -.0173129   -.0079209
        2018  |   .0124129   .0023815     5.21   0.000     .0077453    .0170806
        2019  |   .0028565   .0026843     1.06   0.287    -.0024047    .0081178
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0275191   .0006939   -39.66   0.000     -.028879   -.0261592
        2016  |  -.0254418   .0009608   -26.48   0.000     -.027325   -.0235586
        2017  |   -.022947   .0009842   -23.31   0.000     -.024876   -.0210179
        2018  |  -.0292467   .0015715   -18.61   0.000    -.0323269   -.0261666
        2019  |  -.0302267   .0018348   -16.47   0.000    -.0338229   -.0266305
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .1696447   .0028288    59.97   0.000     .1641004     .175189
        2016  |   .1759296   .0042762    41.14   0.000     .1675483    .1843109
        2017  |   .1817219     .00479    37.94   0.000     .1723337    .1911101
        2018  |   .2433192   .0054883    44.33   0.000     .2325624     .254076
        2019  |   .2215885   .0059766    37.08   0.000     .2098746    .2333024
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   -.004932   .0018818    -2.62   0.009    -.0086204   -.0012437
        2016  |  -.0117351   .0023607    -4.97   0.000     -.016362   -.0071082
        2017  |  -.0035037   .0029318    -1.20   0.232      -.00925    .0022425
        2018  |   .0051017   .0023207     2.20   0.028     .0005532    .0096502
        2019  |    .006743   .0025715     2.62   0.009     .0017029    .0117832
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0030164   .0007737    -3.90   0.000    -.0045327      -.0015
        2016  |  -.0008814   .0012196    -0.72   0.470    -.0032718    .0015091
        2017  |  -.0073345   .0012974    -5.65   0.000    -.0098774   -.0047916
        2018  |  -.0048497   .0015641    -3.10   0.002    -.0079154   -.0017841
        2019  |  -.0027961   .0017693    -1.58   0.114    -.0062638    .0006716
              |
        _cons |    2.26835   .0365411    62.08   0.000     2.196731     2.33997
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.57533819 .18751397 .54392329 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0203300178   .5001644035          4536  |
  2 |    .01546222   .3871272185          3325  |
  3 |  .0100934583    .247913472          2148  |
  4 |  .0083374416   .2052408158          1062  |
    +-------------------------------------------+
Drift limit specified:
3
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0203300178  |
  2 |    .01546222  |
  3 |  .0100934583  |
  4 |  .0100934583  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

Linear regression, absorbing indicators           Number of obs     =  452,964
Absorbed variable: school_id                      No. of categories =    1,375
                                                  F(45, 451544)     = 12529.60
                                                  Prob > F          =   0.0000
                                                  R-squared         =   0.6213
                                                  Adj R-squared     =   0.6201
                                                  Root MSE          =   0.5564

-------------------------------------------------------------------------------
sbac_ela_z_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0221758   .0032604    -6.80   0.000    -.0285661   -.0157855
        2017  |   .0624956   .0035894    17.41   0.000     .0554604    .0695307
        2018  |  -.0787611   .0035255   -22.34   0.000     -.085671   -.0718512
        2019  |  -.0715258   .0037071   -19.29   0.000    -.0787916   -.0642601
              |
1.has_o~2year |  -.0137635   .0034461    -3.99   0.000    -.0205178   -.0070092
1.has_o~4year |   .0359533   .0040176     8.95   0.000     .0280788    .0438277
          age |  -.0003104   5.84e-06   -53.15   0.000    -.0003219    -.000299
              |
         male |
        Male  |  -.0894618   .0016966   -52.73   0.000    -.0927871   -.0861366
  1.eth_asian |   .0836003   .0031413    26.61   0.000     .0774436    .0897571
1.eth_hispa~c |  -.0187147   .0025474    -7.35   0.000    -.0237075   -.0137219
  1.eth_black |  -.1215254   .0047879   -25.38   0.000    -.1309096   -.1121411
  1.eth_other |   .0031213   .0051095     0.61   0.541    -.0068931    .0131357
              |
econ_disadv~e |
Economic D..  |  -.0229596   .0021041   -10.91   0.000    -.0270836   -.0188355
              |
limited_eng~f |
Limited En..  |  -.2065689   .0043234   -47.78   0.000    -.2150427   -.1980952
              |
     disabled |
    Disabled  |  -.1880126   .0042398   -44.35   0.000    -.1963224   -.1797028
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .6035885   .0027825   216.92   0.000     .5981349    .6090421
        2016  |   .5891751   .0039644   148.62   0.000     .5814051    .5969452
        2017  |   .5735753   .0045049   127.32   0.000     .5647459    .5824048
        2018  |   .5688986   .0052421   108.53   0.000     .5586243    .5791729
        2019  |   .5869758   .0057711   101.71   0.000     .5756646    .5982871
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0038138   .0014614     2.61   0.009     .0009495     .006678
        2016  |   .0023887   .0019176     1.25   0.213    -.0013697    .0061471
        2017  |  -.0098322   .0023239    -4.23   0.000    -.0143871   -.0052774
        2018  |   .0126649   .0023087     5.49   0.000     .0081399    .0171899
        2019  |   .0045002   .0026027     1.73   0.084    -.0006009    .0096013
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0278651   .0006725   -41.43   0.000    -.0291833   -.0265469
        2016  |   -.025489   .0009313   -27.37   0.000    -.0273143   -.0236637
        2017  |  -.0235864   .0009536   -24.73   0.000    -.0254555   -.0217174
        2018  |  -.0301719   .0015224   -19.82   0.000    -.0331558   -.0271881
        2019  |  -.0307722   .0017777   -17.31   0.000    -.0342564    -.027288
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .1712333   .0027561    62.13   0.000     .1658314    .1766353
        2016  |   .1764081   .0041539    42.47   0.000     .1682667    .1845496
        2017  |   .1832181   .0046495    39.41   0.000     .1741053     .192331
        2018  |    .238054   .0053286    44.67   0.000       .22761    .2484979
        2019  |   .2170437   .0058028    37.40   0.000     .2056703     .228417
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0034401   .0018269    -1.88   0.060    -.0070207    .0001405
        2016  |  -.0107672   .0022903    -4.70   0.000    -.0152561   -.0062782
        2017  |  -.0026828   .0028417    -0.94   0.345    -.0082525    .0028869
        2018  |   .0070716   .0022522     3.14   0.002     .0026574    .0114858
        2019  |    .008558   .0024958     3.43   0.001     .0036662    .0134498
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0036181     .00075    -4.82   0.000    -.0050882   -.0021481
        2016  |  -.0013452   .0011819    -1.14   0.255    -.0036617    .0009712
        2017  |  -.0075501   .0012571    -6.01   0.000     -.010014   -.0050863
        2018  |  -.0034451   .0015169    -2.27   0.023    -.0064183   -.0004719
        2019  |   -.001819   .0017155    -1.06   0.289    -.0051814    .0015434
              |
        _cons |   2.074344   .0357352    58.05   0.000     2.004304    2.144384
-------------------------------------------------------------------------------
F test of absorbed indicators: F(1374, 451544) = 23.840       Prob > F = 0.000
Standard deviations: total, classes, students, teachers same year
.57555987 .18877508 .54372155 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0208195875   .5064698537          4536  |
  2 |  .0157698851   .3913986234          3325  |
  3 |  .0102605055   .2500832832          2148  |
  4 |  .0084750377   .2075713335          1062  |
    +-------------------------------------------+
Drift limit specified:
3
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0208195875  |
  2 |  .0157698851  |
  3 |  .0102605055  |
  4 |  .0102605055  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   452,964
-------------+----------------------------------   F(43, 452920)   =  15389.28
       Model |  219105.262        43  5095.47122   Prob > F        =    0.0000
    Residual |  149964.231   452,920   .33110534   R-squared       =    0.5937
-------------+----------------------------------   Adj R-squared   =    0.5936
       Total |  369069.493   452,963  .814789493   Root MSE        =    .57542

-------------------------------------------------------------------------------
sbac_ela_z_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0300337     .00334    -8.99   0.000      -.03658   -.0234875
        2017  |   .0698796   .0036646    19.07   0.000     .0626972     .077062
        2018  |  -.0693147    .003591   -19.30   0.000    -.0763528   -.0622765
        2019  |  -.0616753   .0037778   -16.33   0.000    -.0690796   -.0542709
              |
          age |   -.000344   5.97e-06   -57.64   0.000    -.0003557   -.0003323
              |
         male |
        Male  |  -.0876389    .001749   -50.11   0.000    -.0910669   -.0842108
  1.eth_asian |   .1015406   .0029046    34.96   0.000     .0958477    .1072335
1.eth_hispa~c |   -.002268   .0023892    -0.95   0.342    -.0069507    .0024148
  1.eth_black |  -.1430176   .0047274   -30.25   0.000    -.1522831   -.1337521
  1.eth_other |   .0089877   .0052143     1.72   0.085    -.0012321    .0192075
              |
econ_disadv~e |
Economic D..  |  -.0313818   .0020171   -15.56   0.000    -.0353352   -.0274283
              |
limited_eng~f |
Limited En..  |  -.2087285   .0043966   -47.48   0.000    -.2173457   -.2001113
              |
     disabled |
    Disabled  |  -.1774577   .0043445   -40.85   0.000    -.1859729   -.1689426
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .6134674    .002853   215.02   0.000     .6078756    .6190592
        2016  |   .6007496   .0040733   147.49   0.000     .5927661    .6087331
        2017  |   .5764748   .0046395   124.25   0.000     .5673816     .585568
        2018  |   .5691538   .0054023   105.35   0.000     .5585655     .579742
        2019  |   .5881943   .0059479    98.89   0.000     .5765367     .599852
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |    .000152   .0015046     0.10   0.920    -.0027969    .0031009
        2016  |  -.0015928   .0019736    -0.81   0.420    -.0054611    .0022755
        2017  |  -.0126407   .0023962    -5.28   0.000    -.0173372   -.0079441
        2018  |   .0123758   .0023818     5.20   0.000     .0077076    .0170441
        2019  |   .0028498   .0026847     1.06   0.288    -.0024121    .0081117
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0275623   .0006939   -39.72   0.000    -.0289224   -.0262022
        2016  |  -.0254621    .000961   -26.50   0.000    -.0273455   -.0235787
        2017  |  -.0229813   .0009844   -23.35   0.000    -.0249107    -.021052
        2018  |  -.0293136   .0015717   -18.65   0.000    -.0323942   -.0262331
        2019  |  -.0302746   .0018351   -16.50   0.000    -.0338713    -.026678
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .1702202   .0028287    60.18   0.000     .1646761    .1757643
        2016  |   .1764775   .0042765    41.27   0.000     .1680958    .1848593
        2017  |   .1822134   .0047904    38.04   0.000     .1728243    .1916025
        2018  |   .2437346   .0054889    44.41   0.000     .2329765    .2544926
        2019  |   .2217726   .0059773    37.10   0.000     .2100571     .233488
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0049024   .0018821    -2.60   0.009    -.0085912   -.0012136
        2016  |  -.0116797    .002361    -4.95   0.000    -.0163072   -.0070521
        2017  |  -.0034449   .0029322    -1.17   0.240    -.0091918    .0023021
        2018  |   .0051972    .002321     2.24   0.025     .0006482    .0097462
        2019  |   .0067557   .0025719     2.63   0.009     .0017149    .0117964
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0030665   .0007738    -3.96   0.000    -.0045831     -.00155
        2016  |  -.0009282   .0012198    -0.76   0.447     -.003319    .0014625
        2017  |  -.0073824   .0012976    -5.69   0.000    -.0099256   -.0048391
        2018  |  -.0048784   .0015643    -3.12   0.002    -.0079445   -.0018124
        2019  |  -.0027882   .0017695    -1.58   0.115    -.0062564    .0006799
              |
        _cons |   2.273042   .0365328    62.22   0.000     2.201439    2.344645
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.57541754 .1875999 .54397759 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0203686018   .5007553144          4536  |
  2 |  .0154963355   .3877138811          3325  |
  3 |  .0101251558   .2485978165          2148  |
  4 |  .0083612244   .2058031489          1062  |
    +-------------------------------------------+
Drift limit specified:
3
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0203686018  |
  2 |  .0154963355  |
  3 |  .0101251558  |
  4 |  .0101251558  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   452,964
-------------+----------------------------------   F(84, 452879)   =   8020.34
       Model |  220706.537        84  2627.45877   Prob > F        =    0.0000
    Residual |  148362.957   452,879   .32759955   R-squared       =    0.5980
-------------+----------------------------------   Adj R-squared   =    0.5979
       Total |  369069.493   452,963  .814789493   Root MSE        =    .57236

-------------------------------------------------------------------------------
sbac_ela_z_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0136378   .0037261    -3.66   0.000    -.0209408   -.0063347
        2017  |   .0730129   .0041759    17.48   0.000     .0648283    .0811975
        2018  |  -.0583274   .0041648   -14.00   0.000    -.0664902   -.0501645
        2019  |  -.0540231   .0044247   -12.21   0.000    -.0626954   -.0453507
              |
1.has_o~2year |  -.0181593   .0035315    -5.14   0.000    -.0250809   -.0112377
1.has_o~4year |   .0418904   .0041189    10.17   0.000     .0338175    .0499634
          age |   -.000317   5.99e-06   -52.88   0.000    -.0003287   -.0003052
              |
         male |
        Male  |  -.0887691    .001742   -50.96   0.000    -.0921833   -.0853549
  1.eth_asian |   .0833955   .0032212    25.89   0.000      .077082    .0897089
1.eth_hispa~c |  -.0196756   .0026124    -7.53   0.000    -.0247959   -.0145553
  1.eth_black |  -.1216911   .0049074   -24.80   0.000    -.1313095   -.1120728
  1.eth_other |    .004834   .0052373     0.92   0.356     -.005431    .0150989
              |
econ_disadv~e |
Economic D..  |  -.0222181   .0021751   -10.21   0.000    -.0264813   -.0179549
              |
limited_eng~f |
Limited En..  |  -.2051479   .0044258   -46.35   0.000    -.2138222   -.1964735
              |
     disabled |
    Disabled  |  -.1774304   .0043471   -40.82   0.000    -.1859507   -.1689102
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .5968084   .0028939   206.23   0.000     .5911364    .6024803
        2016  |   .5875762   .0041426   141.84   0.000     .5794569    .5956955
        2017  |   .5694721    .004724   120.55   0.000     .5602133     .578731
        2018  |    .580558   .0054286   106.94   0.000     .5699181     .591198
        2019  |   .5954808   .0059661    99.81   0.000     .5837874    .6071741
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0014913   .0015032     0.99   0.321     -.001455    .0044377
        2016  |   .0015755   .0019751     0.80   0.425    -.0022956    .0054466
        2017  |   -.011143   .0023942    -4.65   0.000    -.0158355   -.0064504
        2018  |   .0117981   .0023746     4.97   0.000      .007144    .0164523
        2019  |   .0026429   .0026776     0.99   0.324    -.0026051     .007891
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0272762   .0006911   -39.47   0.000    -.0286308   -.0259217
        2016  |  -.0255221   .0009571   -26.67   0.000     -.027398   -.0236462
        2017  |  -.0230554   .0009814   -23.49   0.000    -.0249789   -.0211319
        2018  |  -.0301161   .0015641   -19.25   0.000    -.0331818   -.0270505
        2019  |  -.0311625   .0018259   -17.07   0.000    -.0347412   -.0275837
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .1686049   .0028513    59.13   0.000     .1630165    .1741933
        2016  |   .1752538   .0042975    40.78   0.000     .1668308    .1836767
        2017  |   .1835379   .0048186    38.09   0.000     .1740936    .1929823
        2018  |   .2499183   .0055449    45.07   0.000     .2390504    .2607861
        2019  |   .2330346   .0060466    38.54   0.000     .2211834    .2448858
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0050319    .001878    -2.68   0.007    -.0087127    -.001351
        2016  |   -.010581   .0023552    -4.49   0.000    -.0151971    -.005965
        2017  |  -.0028997   .0029213    -0.99   0.321    -.0086252    .0028259
        2018  |   .0101573   .0023369     4.35   0.000     .0055771    .0147375
        2019  |   .0113928   .0025852     4.41   0.000     .0063259    .0164597
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   -.003283   .0007706    -4.26   0.000    -.0047934   -.0017726
        2016  |  -.0014131   .0012143    -1.16   0.245    -.0037931    .0009669
        2017  |  -.0075275   .0012925    -5.82   0.000    -.0100607   -.0049942
        2018  |  -.0038704   .0015659    -2.47   0.013    -.0069395   -.0008013
        2019  |  -.0023736   .0017697    -1.34   0.180    -.0058423     .001095
              |
     peer_age |  -.0005149   .0000275   -18.76   0.000    -.0005687   -.0004611
    peer_male |  -.1538648   .0244757    -6.29   0.000    -.2018365   -.1058931
peer_eth_as~n |   .1393057   .0087892    15.85   0.000     .1220791    .1565323
peer_eth_hi~c |   .1580352   .0080932    19.53   0.000     .1421728    .1738977
peer_eth_bl~k |  -.2540903   .0159352   -15.95   0.000    -.2853227   -.2228578
peer_eth_ot~r |   .1251965   .0319308     3.92   0.000      .062613      .18778
peer_econ_d~e |  -.0658925   .0081458    -8.09   0.000     -.081858    -.049927
peer_limite~f |  -.1179204   .0177522    -6.64   0.000    -.1527141   -.0831267
peer_disabled |  -.1783343   .0295162    -6.04   0.000    -.2361852   -.1204834
              |
         year#|
           c. |
peer_prior_e~ |
        2015  |   .1489019   .0134704    11.05   0.000     .1225003    .1753036
        2016  |   .1156173   .0184782     6.26   0.000     .0794006     .151834
        2017  |   .1436189   .0222821     6.45   0.000     .0999466    .1872912
        2018  |  -.3180452   .0263706   -12.06   0.000    -.3697307   -.2663597
        2019  |  -.2001942   .0275022    -7.28   0.000    -.2540978   -.1462907
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.2673397   .0161439   -16.56   0.000    -.2989813   -.2356982
        2016  |  -.1832424   .0213579    -8.58   0.000    -.2251031   -.1413816
        2017  |  -.0905125   .0291054    -3.11   0.002    -.1475581   -.0334669
        2018  |   .1223368   .0320124     3.82   0.000     .0595934    .1850801
        2019  |   .1126703   .0342786     3.29   0.001     .0454853    .1798553
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |   .1464966   .0179877     8.14   0.000     .1112412     .181752
        2016  |  -.0066559   .0275456    -0.24   0.809    -.0606445    .0473327
        2017  |    .019345   .0293029     0.66   0.509    -.0380878    .0767777
        2018  |   .2053756   .0358705     5.73   0.000     .1350706    .2756806
        2019  |   .1598907   .0364539     4.39   0.000     .0884421    .2313393
              |
         year#|
           c. |
peer_prior_m~ |
        2015  |  -.0889209   .0123668    -7.19   0.000    -.1131595   -.0646823
        2016  |  -.0580106   .0181555    -3.20   0.001    -.0935948   -.0224264
        2017  |  -.1346971   .0215507    -6.25   0.000    -.1769357   -.0924585
        2018  |   .1720206   .0238577     7.21   0.000     .1252602    .2187811
        2019  |   .0489581   .0241374     2.03   0.043     .0016496    .0962666
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   .2297445   .0184156    12.48   0.000     .1936505    .2658385
        2016  |    .034626   .0242069     1.43   0.153    -.0128188    .0820707
        2017  |   .0139122   .0330634     0.42   0.674     -.050891    .0787153
        2018  |  -.1902691   .0308435    -6.17   0.000    -.2507214   -.1298168
        2019  |  -.1515079   .0319864    -4.74   0.000    -.2142003   -.0888155
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |  -.1250548   .0129804    -9.63   0.000     -.150496   -.0996135
        2016  |   .0467003   .0252069     1.85   0.064    -.0027045    .0961051
        2017  |   .0047549   .0233014     0.20   0.838    -.0409152     .050425
        2018  |  -.0617351   .0240145    -2.57   0.010    -.1088027   -.0146675
        2019  |  -.0298797   .0224742    -1.33   0.184    -.0739285    .0141691
              |
        _cons |   5.315335   .1688308    31.48   0.000     4.984432    5.646238
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.57236313 .17907639 .54362781 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0170558678    .455134734          4536  |
  2 |  .0131424703   .3523761024          3325  |
  3 |  .0089728938   .2340085958          2148  |
  4 |  .0083583733   .2151385431          1062  |
    +-------------------------------------------+
Drift limit specified:
3
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0170558678  |
  2 |  .0131424703  |
  3 |  .0089728938  |
  4 |  .0089728938  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

Linear regression, absorbing indicators            Number of obs     = 452,964
Absorbed variable: school_id                       No. of categories =   1,375
                                                   F(84, 451505)     = 6756.16
                                                   Prob > F          =  0.0000
                                                   R-squared         =  0.6226
                                                   Adj R-squared     =  0.6214
                                                   Root MSE          =  0.5554

-------------------------------------------------------------------------------
sbac_ela_z_~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0149685   .0037437    -4.00   0.000     -.022306   -.0076309
        2017  |   .0637801   .0042702    14.94   0.000     .0554107    .0721496
        2018  |  -.0639868   .0043742   -14.63   0.000    -.0725601   -.0554135
        2019  |  -.0508087   .0047652   -10.66   0.000    -.0601483   -.0414691
              |
1.has_o~2year |  -.0137922   .0034402    -4.01   0.000    -.0205349   -.0070496
1.has_o~4year |   .0349194   .0040108     8.71   0.000     .0270583    .0427806
          age |  -.0003101   5.84e-06   -53.12   0.000    -.0003216   -.0002987
              |
         male |
        Male  |  -.0892022   .0016938   -52.66   0.000    -.0925221   -.0858823
  1.eth_asian |   .0830203   .0031362    26.47   0.000     .0768734    .0891673
1.eth_hispa~c |  -.0184575   .0025444    -7.25   0.000    -.0234445   -.0134705
  1.eth_black |  -.1210827     .00478   -25.33   0.000    -.1304514    -.111714
  1.eth_other |   .0041313   .0051025     0.81   0.418    -.0058695    .0141321
              |
econ_disadv~e |
Economic D..  |  -.0224543   .0021157   -10.61   0.000     -.026601   -.0183076
              |
limited_eng~f |
Limited En..  |  -.2057351   .0043204   -47.62   0.000    -.2142029   -.1972673
              |
     disabled |
    Disabled  |  -.1816216   .0042367   -42.87   0.000    -.1899254   -.1733178
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .5965804   .0028125   212.12   0.000      .591068    .6020929
        2016  |   .5861044   .0040284   145.49   0.000     .5782088        .594
        2017  |   .5695205   .0045916   124.03   0.000      .560521      .57852
        2018  |   .5805813   .0052764   110.03   0.000     .5702397    .5909229
        2019  |   .5956054   .0058003   102.69   0.000     .5842371    .6069737
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0029926   .0014623     2.05   0.041     .0001266    .0058586
        2016  |   .0022683   .0019217     1.18   0.238    -.0014981    .0060348
        2017  |  -.0101835   .0023284    -4.37   0.000    -.0147471     -.00562
        2018  |   .0118624   .0023088     5.14   0.000     .0073372    .0163876
        2019  |   .0033034   .0026036     1.27   0.205    -.0017996    .0084065
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0275398   .0006719   -40.99   0.000    -.0288566   -.0262229
        2016  |  -.0252534   .0009305   -27.14   0.000    -.0270773   -.0234296
        2017  |  -.0233097   .0009539   -24.44   0.000    -.0251793   -.0214402
        2018  |  -.0306927   .0015203   -20.19   0.000    -.0336724    -.027713
        2019  |    -.03118   .0017749   -17.57   0.000    -.0346588   -.0277012
              |
         year#|
           c. |
prior_math_~e |
        2015  |    .168186   .0027711    60.69   0.000     .1627548    .1736173
        2016  |   .1753708   .0041781    41.97   0.000     .1671818    .1835598
        2017  |   .1842228   .0046831    39.34   0.000     .1750441    .1934015
        2018  |   .2485099   .0053898    46.11   0.000     .2379461    .2590737
        2019  |   .2326123   .0058781    39.57   0.000     .2210914    .2441332
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0039027   .0018266    -2.14   0.033    -.0074827   -.0003226
        2016  |  -.0107034   .0022907    -4.67   0.000    -.0151932   -.0062137
        2017  |  -.0026407   .0028404    -0.93   0.353    -.0082078    .0029264
        2018  |   .0107719    .002272     4.74   0.000     .0063188    .0152249
        2019  |   .0123547    .002514     4.91   0.000     .0074274     .017282
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0035642   .0007492    -4.76   0.000    -.0050326   -.0020958
        2016  |  -.0014024   .0011805    -1.19   0.235    -.0037162    .0009113
        2017  |  -.0076101   .0012562    -6.06   0.000    -.0100722    -.005148
        2018  |  -.0029852   .0015222    -1.96   0.050    -.0059687   -1.63e-06
        2019  |  -.0022305   .0017204    -1.30   0.195    -.0056024    .0011414
              |
     peer_age |   .0001139   .0000561     2.03   0.042     3.91e-06    .0002239
    peer_male |  -.4010857   .0348934   -11.49   0.000    -.4694757   -.3326958
peer_eth_as~n |  -.0964917   .0568075    -1.70   0.089    -.2078326    .0148492
peer_eth_hi~c |  -.0394117   .0420962    -0.94   0.349    -.1219189    .0430956
peer_eth_bl~k |  -.1085662   .0801146    -1.36   0.175    -.2655884     .048456
peer_eth_ot~r |  -.0537128   .0560699    -0.96   0.338    -.1636081    .0561824
peer_econ_d~e |  -.0007698   .0154412    -0.05   0.960    -.0310341    .0294945
peer_limite~f |   .0001324   .0420679     0.00   0.997    -.0823195    .0825843
peer_disabled |  -.1966523   .0527005    -3.73   0.000    -.2999437   -.0933609
              |
         year#|
           c. |
peer_prior_e~ |
        2015  |  -.1539413   .0209703    -7.34   0.000    -.1950425   -.1128402
        2016  |  -.1120818   .0242196    -4.63   0.000    -.1595514   -.0646121
        2017  |  -.0988758    .026505    -3.73   0.000    -.1508248   -.0469269
        2018  |  -.4128308   .0299805   -13.77   0.000    -.4715917   -.3540698
        2019  |  -.3052451   .0308407    -9.90   0.000    -.3656919   -.2447984
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |   -.175766   .0245576    -7.16   0.000    -.2238983   -.1276338
        2016  |  -.1077206   .0284149    -3.79   0.000    -.1634128   -.0520283
        2017  |   .0225428   .0336199     0.67   0.503    -.0433513    .0884368
        2018  |   .0237387   .0357306     0.66   0.506    -.0462921    .0937696
        2019  |    .078136   .0378734     2.06   0.039     .0039053    .1523666
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |   .1429459   .0271287     5.27   0.000     .0897744    .1961174
        2016  |  -.0855574   .0369178    -2.32   0.020    -.1579152   -.0131996
        2017  |   -.047191   .0346697    -1.36   0.173    -.1151426    .0207606
        2018  |   .1904439   .0402374     4.73   0.000     .1115797     .269308
        2019  |   .1348777   .0414698     3.25   0.001     .0535982    .2161573
              |
         year#|
           c. |
peer_prior_m~ |
        2015  |  -.0219368   .0176805    -1.24   0.215      -.05659    .0127165
        2016  |  -.0626689    .022004    -2.85   0.004     -.105796   -.0195418
        2017  |  -.0990432   .0240923    -4.11   0.000    -.1462633    -.051823
        2018  |     .04359   .0265906     1.64   0.101    -.0085268    .0957068
        2019  |  -.0697826   .0268469    -2.60   0.009    -.1224018   -.0171635
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   .1366414   .0259146     5.27   0.000     .0858495    .1874333
        2016  |   .0242818   .0300788     0.81   0.420    -.0346716    .0832353
        2017  |   -.084251   .0367342    -2.29   0.022    -.1562488   -.0122532
        2018  |  -.0632856   .0341274    -1.85   0.064    -.1301742     .003603
        2019  |  -.1337579   .0354614    -3.77   0.000    -.2032611   -.0642547
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |  -.0809051   .0206426    -3.92   0.000    -.1213641   -.0404461
        2016  |   .0931042    .031709     2.94   0.003     .0309555    .1552528
        2017  |   .0888708   .0273001     3.26   0.001     .0353634    .1423782
        2018  |  -.0561193   .0289986    -1.94   0.053    -.1129556    .0007171
        2019  |   .0229396    .028335     0.81   0.418    -.0325961    .0784753
              |
        _cons |   1.663167   .3454738     4.81   0.000     .9860493    2.340285
-------------------------------------------------------------------------------
F test of absorbed indicators: F(1374, 451505) = 21.455       Prob > F = 0.000
Standard deviations: total, classes, students, teachers same year
.5822704 .20858662 .54362712 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0286804241   .5900004867          4536  |
  2 |   .024696017    .514431013          3325  |
  3 |  .0204478833   .4191577593          2148  |
  4 |  .0193228929   .3942376277          1062  |
    +-------------------------------------------+
Drift limit specified:
3
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0286804241  |
  2 |   .024696017  |
  3 |  .0204478833  |
  4 |  .0204478833  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    451,951
                                                F(1, 1288)        =    1502.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0389
                                                Root MSE          =     .56394

                           (Std. err. adjusted for 1,289 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
sbac_g11_e~_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11_~a |    .978004   .0252294    38.76   0.000     .9285087    1.027499
        _cons |   .0025361    .001978     1.28   0.200    -.0013443    .0064166
-------------------------------------------------------------------------------
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_v
> a/spec_test_va_cfr_g11_ela_sibling.ster saved

Linear regression                               Number of obs     =    451,951
                                                F(1, 1288)        =    1287.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0314
                                                Root MSE          =     .56321

                           (Std. err. adjusted for 1,289 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
sbac_g11_e~er | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11_~r |   .9816671   .0273629    35.88   0.000     .9279863    1.035348
        _cons |   .0036903   .0019947     1.85   0.065     -.000223    .0076035
-------------------------------------------------------------------------------
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_v
> a/spec_test_va_cfr_g11_ela_peer_sibling.ster saved

Linear regression                               Number of obs     =    451,951
                                                F(1, 1288)        =    1507.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0390
                                                Root MSE          =       .564

                           (Std. err. adjusted for 1,289 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
sbac_g11_el~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11_~l |   .9778905    .025188    38.82   0.000     .9284764    1.027305
        _cons |   .0025426   .0019773     1.29   0.199    -.0013364    .0064216
-------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_
> score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster not found)
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_v
> a/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster saved
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/test_score
    > _va/va_g11_ela_sibling.dta saved
(CST/SBAC Student Test Score Samples)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   450,884
-------------+----------------------------------   F(45, 450838)   =  18829.60
       Model |  259853.532        45  5774.52294   Prob > F        =    0.0000
    Residual |   138259.71   450,838  .306672708   R-squared       =    0.6527
-------------+----------------------------------   Adj R-squared   =    0.6527
       Total |  398113.243   450,883  .882963524   Root MSE        =    .55378

-------------------------------------------------------------------------------
sbac_math_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |   -.028826   .0032227    -8.94   0.000    -.0351424   -.0225095
        2017  |   .0644934   .0035359    18.24   0.000     .0575632    .0714236
        2018  |  -.0986977   .0034623   -28.51   0.000    -.1054836   -.0919117
        2019  |  -.0874809   .0036447   -24.00   0.000    -.0946244   -.0803374
              |
1.has_o~2year |  -.0272423   .0034222    -7.96   0.000    -.0339497    -.020535
1.has_o~4year |   .0684723   .0039915    17.15   0.000     .0606491    .0762955
          age |  -.0003445   5.76e-06   -59.82   0.000    -.0003557   -.0003332
              |
         male |
        Male  |   .0450584   .0016872    26.71   0.000     .0417515    .0483652
  1.eth_asian |   .1892636   .0028029    67.52   0.000       .18377    .1947571
1.eth_hispa~c |  -.0587001   .0023065   -25.45   0.000    -.0632207   -.0541795
  1.eth_black |  -.1617109   .0045598   -35.46   0.000     -.170648   -.1527737
  1.eth_other |   .0090093   .0050373     1.79   0.074    -.0008636    .0188823
              |
econ_disadv~e |
Economic D..  |  -.0540127   .0019464   -27.75   0.000    -.0578277   -.0501977
              |
limited_eng~f |
Limited En..  |  -.0847221   .0042422   -19.97   0.000    -.0930368   -.0764075
              |
     disabled |
    Disabled  |  -.1462322   .0041974   -34.84   0.000    -.1544591   -.1380054
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .3474403   .0027526   126.22   0.000     .3420453    .3528353
        2016  |   .3273125   .0039321    83.24   0.000     .3196058    .3350193
        2017  |   .2869143   .0044748    64.12   0.000     .2781439    .2956847
        2018  |   .1794743   .0052049    34.48   0.000     .1692729    .1896757
        2019  |   .1758171   .0057377    30.64   0.000     .1645714    .1870629
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0244351   .0014563    16.78   0.000     .0215808    .0272895
        2016  |    .012539   .0019049     6.58   0.000     .0088054    .0162726
        2017  |   .0185524   .0023102     8.03   0.000     .0140244    .0230804
        2018  |   .0027989   .0022933     1.22   0.222    -.0016958    .0072937
        2019  |  -.0052027   .0025925    -2.01   0.045     -.010284   -.0001214
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0157218   .0006698   -23.47   0.000    -.0170347   -.0144089
        2016  |  -.0109952   .0009263   -11.87   0.000    -.0128107   -.0091797
        2017  |  -.0120584   .0009484   -12.71   0.000    -.0139173   -.0101996
        2018  |  -.0063998   .0015115    -4.23   0.000    -.0093622   -.0034374
        2019  |  -.0043233   .0017732    -2.44   0.015    -.0077987    -.000848
              |
         year#|
           c. |
prior_math_~e |
        2015  |    .489133   .0027282   179.29   0.000     .4837858    .4944803
        2016  |    .493011   .0041292   119.40   0.000     .4849179     .501104
        2017  |   .5361936   .0046224   116.00   0.000     .5271339    .5452534
        2018  |   .6735463   .0052934   127.24   0.000     .6631714    .6839211
        2019  |   .6691098   .0057626   116.11   0.000     .6578153    .6804043
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0238966   .0018172    13.15   0.000      .020335    .0274582
        2016  |   .0106909   .0022772     4.69   0.000     .0062276    .0151542
        2017  |   .0041726   .0028314     1.47   0.141    -.0013769    .0097221
        2018  |   .0770304   .0022402    34.39   0.000     .0726398     .081421
        2019  |   .0840011   .0024812    33.85   0.000      .079138    .0888642
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0227885   .0007458   -30.55   0.000    -.0242503   -.0213267
        2016  |  -.0188542    .001177   -16.02   0.000    -.0211611   -.0165473
        2017  |   -.022384   .0012519   -17.88   0.000    -.0248377   -.0199303
        2018  |  -.0257703   .0015099   -17.07   0.000    -.0287297    -.022811
        2019  |  -.0249101   .0017067   -14.60   0.000    -.0282552   -.0215649
              |
        _cons |   2.183024   .0352539    61.92   0.000     2.113928    2.252121
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.55378038 .16516553 .52857644 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0191198935   .6153393206          4527  |
  2 |  .0153863698   .4819808362          3319  |
  3 |  .0098456634   .3282460821          2147  |
  4 |  .0081998828    .259205235          1060  |
    +-------------------------------------------+
Drift limit specified:
3
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0191198935  |
  2 |  .0153863698  |
  3 |  .0098456634  |
  4 |  .0098456634  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

Linear regression, absorbing indicators           Number of obs     =  450,884
Absorbed variable: school_id                      No. of categories =    1,372
                                                  F(45, 449467)     = 14796.11
                                                  Prob > F          =   0.0000
                                                  R-squared         =   0.6768
                                                  Adj R-squared     =   0.6758
                                                  Root MSE          =   0.5350

-------------------------------------------------------------------------------
sbac_math_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |    -.02113   .0031434    -6.72   0.000     -.027291   -.0149691
        2017  |   .0573762   .0034599    16.58   0.000     .0505948    .0641575
        2018  |   -.107677   .0033961   -31.71   0.000    -.1143332   -.1010207
        2019  |  -.0963689   .0035734   -26.97   0.000    -.1033726   -.0893652
              |
1.has_o~2year |  -.0185747   .0033205    -5.59   0.000    -.0250827   -.0120666
1.has_o~4year |   .0663898   .0038711    17.15   0.000     .0588025     .073977
          age |  -.0003165   5.63e-06   -56.23   0.000    -.0003275   -.0003055
              |
         male |
        Male  |    .041387   .0016351    25.31   0.000     .0381823    .0445917
  1.eth_asian |   .1617886   .0030267    53.45   0.000     .1558564    .1677208
1.eth_hispa~c |   -.042248   .0024562   -17.20   0.000    -.0470621   -.0374339
  1.eth_black |  -.1099071   .0046148   -23.82   0.000    -.1189519   -.1008623
  1.eth_other |   .0071427   .0049321     1.45   0.148    -.0025241    .0168096
              |
econ_disadv~e |
Economic D..  |   -.017532   .0020286    -8.64   0.000    -.0215081    -.013556
              |
limited_eng~f |
Limited En..  |   -.081349   .0041684   -19.52   0.000    -.0895188   -.0731791
              |
     disabled |
    Disabled  |  -.1723219   .0040926   -42.11   0.000    -.1803432   -.1643006
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .3272866   .0026819   122.03   0.000     .3220301    .3325431
        2016  |   .3062342   .0038236    80.09   0.000     .2987402    .3137283
        2017  |   .2718287   .0043411    62.62   0.000     .2633204    .2803371
        2018  |   .1786762   .0050462    35.41   0.000     .1687858    .1885667
        2019  |   .1769984   .0055625    31.82   0.000      .166096    .1879007
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0240343   .0014132    17.01   0.000     .0212645     .026804
        2016  |   .0124827   .0018492     6.75   0.000     .0088583    .0161071
        2017  |   .0177187   .0022385     7.92   0.000     .0133313    .0221061
        2018  |   .0049407   .0022211     2.22   0.026     .0005875    .0092939
        2019  |  -.0029192   .0025112    -1.16   0.245     -.007841    .0020026
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   -.015234   .0006486   -23.49   0.000    -.0165052   -.0139628
        2016  |  -.0109318   .0008969   -12.19   0.000    -.0126898   -.0091738
        2017  |  -.0117423    .000918   -12.79   0.000    -.0135415   -.0099431
        2018  |  -.0072673   .0014628    -4.97   0.000    -.0101343   -.0044004
        2019  |  -.0051718   .0017163    -3.01   0.003    -.0085356    -.001808
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .4910406   .0026555   184.91   0.000     .4858359    .4962454
        2016  |   .4913631   .0040071   122.62   0.000     .4835094    .4992169
        2017  |   .5379518   .0044824   120.01   0.000     .5291664    .5467373
        2018  |   .6619228   .0051345   128.92   0.000     .6518594    .6719862
        2019  |   .6529008   .0055895   116.81   0.000     .6419455    .6638561
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0239841   .0017624    13.61   0.000     .0205299    .0274383
        2016  |   .0093524   .0022073     4.24   0.000     .0050262    .0136787
        2017  |   .0040523   .0027417     1.48   0.139    -.0013214     .009426
        2018  |   .0737722   .0021719    33.97   0.000     .0695154     .078029
        2019  |   .0799522   .0024059    33.23   0.000     .0752367    .0846676
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0235905   .0007224   -32.66   0.000    -.0250063   -.0221747
        2016  |  -.0189493   .0011395   -16.63   0.000    -.0211827   -.0167159
        2017  |  -.0229211   .0012118   -18.92   0.000    -.0252962   -.0205461
        2018  |  -.0271055   .0014629   -18.53   0.000    -.0299728   -.0242382
        2019  |  -.0249508   .0016533   -15.09   0.000    -.0281912   -.0217104
              |
        _cons |   1.993432   .0344393    57.88   0.000     1.925932    2.060932
-------------------------------------------------------------------------------
F test of absorbed indicators: F(1371, 449467) = 24.482       Prob > F = 0.000
Standard deviations: total, classes, students, teachers same year
.55533511 .17332101 .5275954 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0216623692   .6449585385          4527  |
  2 |  .0179795918   .5213005115          3319  |
  3 |  .0117902082   .3705808949          2147  |
  4 |  .0101455031    .301975568          1060  |
    +-------------------------------------------+
Drift limit specified:
3
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0216623692  |
  2 |  .0179795918  |
  3 |  .0117902082  |
  4 |  .0117902082  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   450,884
-------------+----------------------------------   F(43, 450840)   =  19682.56
       Model |  259748.494        43  6040.66265   Prob > F        =    0.0000
    Residual |  138364.749   450,840  .306904331   R-squared       =    0.6524
-------------+----------------------------------   Adj R-squared   =    0.6524
       Total |  398113.243   450,883  .882963524   Root MSE        =    .55399

-------------------------------------------------------------------------------
sbac_math_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0290513   .0032239    -9.01   0.000      -.03537   -.0227326
        2017  |   .0645053   .0035369    18.24   0.000      .057573    .0714376
        2018  |  -.0991996   .0034634   -28.64   0.000    -.1059877   -.0924115
        2019  |  -.0881471   .0036459   -24.18   0.000    -.0952929   -.0810012
              |
          age |  -.0003454   5.76e-06   -59.98   0.000    -.0003567   -.0003341
              |
         male |
        Male  |   .0451434   .0016878    26.75   0.000     .0418353    .0484515
  1.eth_asian |   .1901206    .002802    67.85   0.000     .1846287    .1956124
1.eth_hispa~c |  -.0593884   .0023068   -25.74   0.000    -.0639097   -.0548672
  1.eth_black |  -.1617214   .0045615   -35.45   0.000    -.1706619   -.1527809
  1.eth_other |   .0085242   .0050391     1.69   0.091    -.0013523    .0184006
              |
econ_disadv~e |
Economic D..  |  -.0538919   .0019469   -27.68   0.000    -.0577078    -.050076
              |
limited_eng~f |
Limited En..  |  -.0848509   .0042438   -19.99   0.000    -.0931686   -.0765331
              |
     disabled |
    Disabled  |  -.1463288   .0041989   -34.85   0.000    -.1545585   -.1380992
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .3480452   .0027533   126.41   0.000     .3426488    .3534416
        2016  |   .3278474   .0039333    83.35   0.000     .3201383    .3355566
        2017  |   .2875629   .0044762    64.24   0.000     .2787896    .2963362
        2018  |   .1801134   .0052067    34.59   0.000     .1699083    .1903184
        2019  |    .176292   .0057398    30.71   0.000     .1650422    .1875419
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0244856   .0014568    16.81   0.000     .0216303    .0273409
        2016  |   .0126646   .0019056     6.65   0.000     .0089296    .0163995
        2017  |   .0185101   .0023111     8.01   0.000     .0139804    .0230397
        2018  |   .0027381   .0022941     1.19   0.233    -.0017583    .0072345
        2019  |  -.0052049   .0025935    -2.01   0.045     -.010288   -.0001218
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0157913   .0006701   -23.57   0.000    -.0171046   -.0144779
        2016  |  -.0110349   .0009266   -11.91   0.000    -.0128511   -.0092187
        2017  |  -.0121108   .0009487   -12.77   0.000    -.0139703   -.0102513
        2018  |  -.0065113    .001512    -4.31   0.000    -.0094748   -.0035478
        2019  |  -.0043949   .0017738    -2.48   0.013    -.0078715   -.0009182
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .4900393   .0027288   179.58   0.000      .484691    .4953877
        2016  |   .4938488   .0041304   119.56   0.000     .4857534    .5019442
        2017  |   .5369525   .0046239   116.12   0.000     .5278897    .5460153
        2018  |   .6742098   .0052953   127.32   0.000     .6638312    .6845883
        2019  |   .6694058   .0057647   116.12   0.000     .6581072    .6807045
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0239409   .0018178    13.17   0.000      .020378    .0275038
        2016  |   .0107749   .0022781     4.73   0.000     .0063099    .0152398
        2017  |   .0042717   .0028325     1.51   0.132    -.0012798    .0098233
        2018  |   .0771853   .0022409    34.44   0.000     .0727931    .0815775
        2019  |   .0840208   .0024821    33.85   0.000     .0791559    .0888858
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0228698   .0007461   -30.65   0.000    -.0243321   -.0214075
        2016  |  -.0189244   .0011774   -16.07   0.000    -.0212322   -.0166167
        2017  |  -.0224597   .0012524   -17.93   0.000    -.0249143   -.0200051
        2018  |  -.0258145   .0015105   -17.09   0.000    -.0287749    -.022854
        2019  |  -.0249031   .0017074   -14.59   0.000    -.0282495   -.0215567
              |
        _cons |   2.190325   .0352546    62.13   0.000     2.121227    2.259423
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.55398947 .16531116 .52874999 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0191682204   .6159097159          4527  |
  2 |  .0154291954   .4826210432          3319  |
  3 |  .0098785582   .3287809055          2147  |
  4 |  .0082447827   .2601079798          1060  |
    +-------------------------------------------+
Drift limit specified:
3
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0191682204  |
  2 |  .0154291954  |
  3 |  .0098785582  |
  4 |  .0098785582  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   450,884
-------------+----------------------------------   F(84, 450799)   =  10393.93
       Model |  262551.218        84  3125.60974   Prob > F        =    0.0000
    Residual |  135562.025   450,799  .300715007   R-squared       =    0.6595
-------------+----------------------------------   Adj R-squared   =    0.6594
       Total |  398113.243   450,883  .882963524   Root MSE        =    .54837

-------------------------------------------------------------------------------
sbac_math_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |   -.014529   .0035787    -4.06   0.000    -.0215431   -.0075149
        2017  |    .066411   .0040061    16.58   0.000     .0585592    .0742628
        2018  |   -.077674   .0039965   -19.44   0.000     -.085507   -.0698409
        2019  |  -.0751619   .0042477   -17.69   0.000    -.0834873   -.0668365
              |
1.has_o~2year |  -.0252018   .0033903    -7.43   0.000    -.0318467   -.0185569
1.has_o~4year |   .0696395   .0039543    17.61   0.000     .0618892    .0773898
          age |   -.000322   5.76e-06   -55.94   0.000    -.0003333   -.0003108
              |
         male |
        Male  |   .0420868   .0016728    25.16   0.000     .0388082    .0453653
  1.eth_asian |    .160207   .0030924    51.81   0.000      .154146     .166268
1.eth_hispa~c |  -.0432966   .0025098   -17.25   0.000    -.0482157   -.0383774
  1.eth_black |  -.1110542   .0047127   -23.57   0.000    -.1202909   -.1018175
  1.eth_other |   .0081946   .0050371     1.63   0.104    -.0016781    .0180672
              |
econ_disadv~e |
Economic D..  |  -.0172799   .0020895    -8.27   0.000    -.0213753   -.0131845
              |
limited_eng~f |
Limited En..  |   -.083666   .0042513   -19.68   0.000    -.0919985   -.0753336
              |
     disabled |
    Disabled  |  -.1595441   .0041808   -38.16   0.000    -.1677384   -.1513498
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .3211035   .0027794   115.53   0.000      .315656    .3265509
        2016  |   .2998693   .0039812    75.32   0.000     .2920662    .3076724
        2017  |   .2634476   .0045362    58.08   0.000     .2545568    .2723383
        2018  |     .18515   .0052065    35.56   0.000     .1749454    .1953546
        2019  |   .1795972   .0057301    31.34   0.000     .1683664     .190828
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0227807   .0014485    15.73   0.000     .0199418    .0256197
        2016  |   .0127747   .0018978     6.73   0.000     .0090551    .0164943
        2017  |   .0170718   .0022979     7.43   0.000      .012568    .0215755
        2018  |   .0028284   .0022764     1.24   0.214    -.0016332      .00729
        2019  |  -.0049242   .0025741    -1.91   0.056    -.0099693    .0001209
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0149813   .0006641   -22.56   0.000     -.016283   -.0136797
        2016  |  -.0106166   .0009185   -11.56   0.000    -.0124168   -.0088164
        2017  |  -.0114135   .0009413   -12.13   0.000    -.0132584   -.0095686
        2018  |  -.0072925   .0014974    -4.87   0.000    -.0102274   -.0043577
        2019  |  -.0055599   .0017564    -3.17   0.002    -.0090024   -.0021174
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .4884284   .0027373   178.43   0.000     .4830634    .4937935
        2016  |   .4934914   .0041306   119.47   0.000     .4853954    .5015873
        2017  |   .5402981   .0046294   116.71   0.000     .5312247    .5493716
        2018  |   .6804924   .0053234   127.83   0.000     .6700587    .6909261
        2019  |    .678773   .0058032   116.97   0.000     .6673989     .690147
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0226175   .0018052    12.53   0.000     .0190794    .0261555
        2016  |   .0102762   .0022615     4.54   0.000     .0058438    .0147087
        2017  |    .004177   .0028083     1.49   0.137    -.0013271    .0096812
        2018  |   .0801395    .002245    35.70   0.000     .0757393    .0845397
        2019  |     .08709   .0024833    35.07   0.000     .0822229    .0919571
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0233327   .0007395   -31.55   0.000    -.0247821   -.0218833
        2016  |  -.0193266   .0011665   -16.57   0.000    -.0216129   -.0170403
        2017  |   -.023246   .0012414   -18.73   0.000     -.025679   -.0208129
        2018  |  -.0262665   .0015046   -17.46   0.000    -.0292154   -.0233175
        2019  |  -.0251857   .0016994   -14.82   0.000    -.0285164   -.0218549
              |
     peer_age |  -.0005553   .0000266   -20.85   0.000    -.0006075   -.0005031
    peer_male |   .1403639   .0235653     5.96   0.000     .0941765    .1865512
peer_eth_as~n |   .1660534   .0084502    19.65   0.000     .1494912    .1826156
peer_eth_hi~c |   .0601031    .007777     7.73   0.000     .0448605    .0753457
peer_eth_bl~k |  -.4113508   .0152964   -26.89   0.000    -.4413313   -.3813703
peer_eth_ot~r |   .1537064   .0307279     5.00   0.000     .0934808    .2139321
peer_econ_d~e |  -.0430745   .0078278    -5.50   0.000    -.0584167   -.0277322
peer_limite~f |   -.099457   .0170433    -5.84   0.000    -.1328613   -.0660526
peer_disabled |  -.1507072    .028343    -5.32   0.000    -.2062587   -.0951557
              |
         year#|
           c. |
peer_prior_e~ |
        2015  |   .2698495   .0129514    20.84   0.000     .2444652    .2952338
        2016  |   .2817819   .0177555    15.87   0.000     .2469816    .3165822
        2017  |   .3221462   .0213893    15.06   0.000     .2802238    .3640686
        2018  |  -.1303876   .0253142    -5.15   0.000    -.1800026   -.0807726
        2019  |  -.0999888   .0263733    -3.79   0.000    -.1516796    -.048298
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.0501665    .015486    -3.24   0.001    -.0805185   -.0198145
        2016  |   -.005541   .0205608    -0.27   0.788    -.0458396    .0347576
        2017  |   .0610997   .0279191     2.19   0.029     .0063791    .1158202
        2018  |   .1268626   .0306347     4.14   0.000     .0668194    .1869057
        2019  |   .1414574   .0328581     4.31   0.000     .0770566    .2058582
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |    .102867   .0172341     5.97   0.000     .0690887    .1366453
        2016  |   .1121834   .0265389     4.23   0.000     .0601679    .1641989
        2017  |   .0430159    .027974     1.54   0.124    -.0118122    .0978441
        2018  |    .172417   .0344566     5.00   0.000      .104883    .2399509
        2019  |   .2562647    .034938     7.33   0.000     .1877873    .3247421
              |
         year#|
           c. |
peer_prior_m~ |
        2015  |  -.1847456   .0118868   -15.54   0.000    -.2080433   -.1614479
        2016  |  -.1867991   .0174304   -10.72   0.000    -.2209621   -.1526361
        2017  |  -.2604675   .0207025   -12.58   0.000    -.3010437   -.2198913
        2018  |   .0365074   .0229013     1.59   0.111    -.0083786    .0813933
        2019  |  -.0178369   .0231514    -0.77   0.441    -.0632129     .027539
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   .1661698   .0176922     9.39   0.000     .1314935     .200846
        2016  |   .0456613   .0233372     1.96   0.050    -.0000789    .0914015
        2017  |  -.0006034   .0318059    -0.02   0.985    -.0629419    .0617351
        2018  |  -.1516841   .0295636    -5.13   0.000    -.2096278   -.0937404
        2019  |  -.0932078    .030706    -3.04   0.002    -.1533906   -.0330249
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |  -.0874419   .0124505    -7.02   0.000    -.1118445   -.0630393
        2016  |  -.0584149   .0242834    -2.41   0.016    -.1060096   -.0108203
        2017  |  -.0291372    .022361    -1.30   0.193    -.0729641    .0146897
        2018  |  -.0394539   .0230443    -1.71   0.087      -.08462    .0057122
        2019  |  -.1016808   .0215787    -4.71   0.000    -.1439745   -.0593872
              |
        _cons |   5.336312   .1637438    32.59   0.000     5.015379    5.657244
-------------------------------------------------------------------------------
Standard deviations: total, classes, students, teachers same year
.54837488 .15023109 .52739513 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0147564592   .5518862816          4527  |
  2 |  .0115461428   .4212644593          3319  |
  3 |  .0084573474   .3139994113          2147  |
  4 |  .0073904053   .2614705228          1060  |
    +-------------------------------------------+
Drift limit specified:
3
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0147564592  |
  2 |  .0115461428  |
  3 |  .0084573474  |
  4 |  .0084573474  |
    +---------------+
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

Linear regression, absorbing indicators            Number of obs     = 450,884
Absorbed variable: school_id                       No. of categories =   1,372
                                                   F(84, 449428)     = 8007.61
                                                   Prob > F          =  0.0000
                                                   R-squared         =  0.6788
                                                   Adj R-squared     =  0.6778
                                                   Root MSE          =  0.5334

-------------------------------------------------------------------------------
sbac_math_z~e | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         year |
        2016  |  -.0124706   .0036032    -3.46   0.001    -.0195327   -.0054084
        2017  |   .0632789   .0041075    15.41   0.000     .0552284    .0713295
        2018  |   -.080318   .0042072   -19.09   0.000    -.0885641    -.072072
        2019  |  -.0707083   .0045869   -15.42   0.000    -.0796984   -.0617182
              |
1.has_o~2year |  -.0183993   .0033106    -5.56   0.000     -.024888   -.0119105
1.has_o~4year |   .0647306   .0038598    16.77   0.000     .0571656    .0722957
          age |  -.0003146   5.62e-06   -55.98   0.000    -.0003256   -.0003036
              |
         male |
        Male  |   .0411389   .0016304    25.23   0.000     .0379433    .0443345
  1.eth_asian |   .1604771   .0030181    53.17   0.000     .1545618    .1663925
1.eth_hispa~c |  -.0417523   .0024503   -17.04   0.000    -.0465549   -.0369497
  1.eth_black |    -.10868   .0046015   -23.62   0.000    -.1176988   -.0996612
  1.eth_other |   .0077995   .0049194     1.59   0.113    -.0018424    .0174414
              |
econ_disadv~e |
Economic D..  |  -.0173464   .0020373    -8.51   0.000    -.0213394   -.0133533
              |
limited_eng~f |
Limited En..  |  -.0802424   .0041603   -19.29   0.000    -.0883964   -.0720885
              |
     disabled |
    Disabled  |  -.1653415   .0040845   -40.48   0.000    -.1733469    -.157336
              |
         year#|
           c. |
prior_ela_z~e |
        2015  |   .3194639   .0027076   117.99   0.000     .3141571    .3247708
        2016  |   .2989885   .0038809    77.04   0.000      .291382     .306595
        2017  |   .2622104   .0044197    59.33   0.000      .253548    .2708729
        2018  |   .1852397   .0050727    36.52   0.000     .1752973    .1951821
        2019  |   .1818413   .0055842    32.56   0.000     .1708964    .1927861
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |   .0225418   .0014123    15.96   0.000     .0197737    .0253098
        2016  |   .0116712   .0018509     6.31   0.000     .0080435    .0152989
        2017  |   .0169507     .00224     7.57   0.000     .0125604     .021341
        2018  |   .0039578   .0022187     1.78   0.074    -.0003908    .0083063
        2019  |  -.0048872    .002509    -1.95   0.051    -.0098047    .0000304
              |
         year#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e#|
           c. |
prior_ela_z~e |
        2015  |  -.0147601   .0006471   -22.81   0.000    -.0160285   -.0134918
        2016  |  -.0105593   .0008951   -11.80   0.000    -.0123138   -.0088049
        2017  |  -.0112457   .0009171   -12.26   0.000    -.0130432   -.0094482
        2018  |  -.0075522   .0014589    -5.18   0.000    -.0104117   -.0046928
        2019  |  -.0057297   .0017115    -3.35   0.001    -.0090842   -.0023752
              |
         year#|
           c. |
prior_math_~e |
        2015  |   .4886489   .0026667   183.24   0.000     .4834222    .4938756
        2016  |   .4928999   .0040256   122.44   0.000     .4850099      .50079
        2017  |   .5403091     .00451   119.80   0.000     .5314697    .5491485
        2018  |   .6812782    .005187   131.34   0.000     .6711118    .6914445
        2019  |   .6767952   .0056549   119.68   0.000     .6657117    .6878786
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |   .0232531     .00176    13.21   0.000     .0198037    .0267026
        2016  |    .008842    .002205     4.01   0.000     .0045202    .0131638
        2017  |   .0039386   .0027371     1.44   0.150     -.001426    .0093032
        2018  |   .0803663    .002188    36.73   0.000     .0760778    .0846547
        2019  |   .0869165   .0024207    35.91   0.000      .082172    .0916609
              |
         year#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e#|
           c. |
prior_math_~e |
        2015  |  -.0235644   .0007207   -32.70   0.000    -.0249769   -.0221519
        2016  |  -.0189535   .0011368   -16.67   0.000    -.0211816   -.0167254
        2017  |  -.0231459   .0012094   -19.14   0.000    -.0255163   -.0207755
        2018  |  -.0265608   .0014662   -18.12   0.000    -.0294344   -.0236871
        2019  |  -.0248616    .001656   -15.01   0.000    -.0281073   -.0216159
              |
     peer_age |   -.000017   .0000541    -0.31   0.754     -.000123    .0000891
    peer_male |  -.2192751   .0335944    -6.53   0.000    -.2851191   -.1534311
peer_eth_as~n |  -.0469868   .0546841    -0.86   0.390    -.1541659    .0601924
peer_eth_hi~c |  -.2093839   .0405258    -5.17   0.000    -.2888132   -.1299546
peer_eth_bl~k |   -.220273   .0771292    -2.86   0.004    -.3714439    -.069102
peer_eth_ot~r |   .1328936   .0540688     2.46   0.014     .0269204    .2388667
peer_econ_d~e |   .0356067   .0148616     2.40   0.017     .0064785     .064735
peer_limite~f |  -.1516476    .040498    -3.74   0.000    -.2310225   -.0722727
peer_disabled |  -.3220524   .0507086    -6.35   0.000    -.4214396   -.2226651
              |
         year#|
           c. |
peer_prior_e~ |
        2015  |  -.0070759   .0202005    -0.35   0.726    -.0466683    .0325164
        2016  |   .0493568   .0233097     2.12   0.034     .0036706     .095043
        2017  |   .0391181   .0254818     1.54   0.125    -.0108254    .0890617
        2018  |   -.053262   .0288634    -1.85   0.065    -.1098334    .0033094
        2019  |  -.0276671    .029655    -0.93   0.351    -.0857899    .0304557
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |  -.0790484   .0236225    -3.35   0.001    -.1253477   -.0327491
        2016  |  -.0621619   .0273107    -2.28   0.023    -.1156901   -.0086337
        2017  |  -.0807549   .0322517    -2.50   0.012    -.1439672   -.0175427
        2018  |   .0355588   .0342994     1.04   0.300     -.031667    .1027846
        2019  |    .148103   .0364345     4.06   0.000     .0766924    .2195136
              |
         year#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~#|
           c. |
peer_prior_e~ |
        2015  |   .0463696    .026105     1.78   0.076    -.0047954    .0975345
        2016  |   .0229196   .0354952     0.65   0.518      -.04665    .0924892
        2017  |   .0656715   .0330495     1.99   0.047     .0008954    .1304475
        2018  |   .1031731   .0387807     2.66   0.008     .0271642     .179182
        2019  |   .1717454   .0399045     4.30   0.000     .0935339    .2499569
              |
         year#|
           c. |
peer_prior_m~ |
        2015  |  -.2271071   .0170329   -13.33   0.000    -.2604912   -.1937231
        2016  |  -.3034359   .0211777   -14.33   0.000    -.3449435   -.2619282
        2017  |  -.3018573   .0231955   -13.01   0.000    -.3473197    -.256395
        2018  |  -.3486245    .025606   -13.61   0.000    -.3988115   -.2984376
        2019  |  -.3858119   .0258117   -14.95   0.000     -.436402   -.3352219
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |   .0314473    .024964     1.26   0.208    -.0174813    .0803759
        2016  |  -.0050691   .0289664    -0.17   0.861    -.0618423    .0517042
        2017  |   .0086895    .035421     0.25   0.806    -.0607346    .0781136
        2018  |  -.1758597   .0328047    -5.36   0.000    -.2401558   -.1115636
        2019  |    -.22408   .0341532    -6.56   0.000    -.2910192   -.1571407
              |
         year#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~#|
           c. |
peer_prior_m~ |
        2015  |  -.0005647   .0198952    -0.03   0.977    -.0395587    .0384294
        2016  |   .0170704   .0305398     0.56   0.576    -.0427867    .0769274
        2017  |   -.001035   .0263036    -0.04   0.969    -.0525893    .0505193
        2018  |   .0399962   .0279761     1.43   0.153     -.014836    .0948285
        2019  |   .0027722   .0272945     0.10   0.919    -.0507242    .0562685
              |
        _cons |   2.374157   .3329787     7.13   0.000     1.721529    3.026785
-------------------------------------------------------------------------------
F test of absorbed indicators: F(1371, 449428) = 19.735       Prob > F = 0.000
Standard deviations: total, classes, students, teachers same year
.56656532 .20700162 .52739604 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0349699629   .7589861457          4527  |
  2 |  .0320295849   .6891448177          3319  |
  3 |  .0291740358   .6394940157          2147  |
  4 |  .0284297175   .5975998074          1060  |
    +-------------------------------------------+
Drift limit specified:
3
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0349699629  |
  2 |  .0320295849  |
  3 |  .0291740358  |
  4 |  .0291740358  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    449,911
                                                F(1, 1287)        =    2411.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0462
                                                Root MSE          =     .54068

                           (Std. err. adjusted for 1,288 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
sbac_g11_m~_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11_~h |   1.007595   .0205183    49.11   0.000     .9673417    1.047848
        _cons |   .0012324   .0014729     0.84   0.403    -.0016571     .004122
-------------------------------------------------------------------------------
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_v
> a/spec_test_va_cfr_g11_math_sibling.ster saved

Linear regression                               Number of obs     =    449,911
                                                F(1, 1287)        =    2554.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0343
                                                Root MSE          =     .53873

                           (Std. err. adjusted for 1,288 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
sbac_g11_m~er | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11_~r |   1.026132   .0203042    50.54   0.000     .9862991    1.065965
        _cons |   .0034765   .0014062     2.47   0.014     .0007178    .0062352
-------------------------------------------------------------------------------
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_v
> a/spec_test_va_cfr_g11_math_peer_sibling.ster saved

Linear regression                               Number of obs     =    449,911
                                                F(1, 1287)        =    2425.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0463
                                                Root MSE          =     .54085

                           (Std. err. adjusted for 1,288 clusters in school_id)
-------------------------------------------------------------------------------
              |               Robust
sbac_g11_ma~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
va_cfr_g11_~l |   1.007328    .020455    49.25   0.000     .9671992    1.047457
        _cons |   .0012434   .0014721     0.84   0.398    -.0016447    .0041314
-------------------------------------------------------------------------------
(note: file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_
> score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster not found)
file /home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_v
> a/spec_test_va_cfr_g11_math_sibling_nocontrol.ster saved
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/test_score
    > _va/va_g11_math_sibling.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:    170.62 /        1 =     170.6150

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvareg
> s/va_sibling.smcl
  log type:  smcl
 closed on:  10 Nov 2021, 15:31:42
-------------------------------------------------------------------------------
