-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling_out.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 21:47:49

. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;

. local acs_str
>         "Original + Census"
>         ;

. local sib_str
>         "Original + Sibling"
>         ;

. local both_str
>         "Original + Census + Sibling"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. #delimit ;
delimiter now ;
. #delimit cr
delimiter now cr
. macro list
T_gm_fix_span:  0
S_4:            .0039002308063216
S_2:            300
S_3:            .0206002574343117
S_1:            epanechnikov
S_6:            .7098361624622439
S_5:            4
ReS_jv2:        __000006 __000007 __000008 __000009 __00000A __00000B __00000C
                __00000D __00000E __00000F __00000G __00000H __00000I __00000J
                __00000K
dropv:          _cdscode_x
n_offset:       0
sort:           0
dots:           nois _dots 5 0
dotss:          nois _dots 0, title(Survey results being calculated)
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_both_str:      Original + Census + Sibling
_sib_str:       Original + Sibling
_acs_str:       Original + Census
_og_str:        Original Specification
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset
_setlimit:      0
_1:             0
_0:             0

. 
. 
. timer on 1

. 
. 
. //load the VA grade 11 college outcomes sample
. use `va_g11_out_dataset', clear
(Enrollment Outcome Grade 11 VA Sample)

. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk', nogen keep(1 3)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       884,312
        from master                   884,312  
        from using                          0  

    Matched                           900,133  
    -----------------------------------------

. 
. drop if mi(has_older_sibling_enr_2year)
(884,312 observations deleted)

. drop if mi(has_older_sibling_enr_4year)
(0 observations deleted)

. 
. compress
  variable age was float now int
  variable major was long now int
  (3,600,532 bytes saved)

. tempfile va_g11_out_sibling_dataset

. save `va_g11_out_sibling_dataset'
file /home/tmp/St35924.000001 saved as .dta format

. 
. 
. 
. 
. *****************************************************************************
> ***
. *********** VA estimates for VA samples matched to siblings sample
. *****************************************************************************
> ***
. if `setlimit' == 0 {
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 
> 1)
. }

. else {
.   local drift_limit = `setlimit'
. }

. 
. foreach outcome in enr enr_2year enr_4year {
  2.   use `va_g11_out_sibling_dataset' if touse_g11_`outcome'==1 & sibling_out
> _sample == 1, clear
  3. 
.   ***********************Overall value added
.   **** No Peer Controls
.   ** No TFX
.     ***without sibling college going controls
.     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_cfr_g11_`outco
> me'_nosibctrl.ster, replace)
  4. 
.     //rename the first time to make sure indep var names for spec test are al
> l the same
.     rename tv va_cfr_g11_`outcome'
  5.     rename score_r g11_`outcome'_r
  6. 
.     **************** Specification Test
.     *************** No Peer Controls
.     ****** sibling sample without sibling controls
.     reg g11_`outcome'_r va_cfr_g11_`outcome', cluster(school_id)
  7.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11
> _`outcome'_sibling_nocontrol.ster, replace
  8.     //save to va project folder
.     estimates save $vaprojdir/estimates/sibling_va/outcome_va/spec_test_va_cf
> r_g11_`outcome'_sibling_nocontrol.ster, replace
  9. 
.     //rename again to distinguish between nocontrol and with control va estim
> ates
.     rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl
 10.     rename g11_`outcome'_r g11_`outcome'_r_nosibctrl
 11. 
. 
.     *** with sibling controls
.     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_cfr_g11_`outco
> me'.ster, replace)
 12.     rename tv va_cfr_g11_`outcome'
 13.     rename score_r g11_`outcome'_r
 14. 
.     **************** Specification Test
.     *************** No Peer Controls
.     ****** sibling sample with sibling controls
.     reg g11_`outcome'_r va_cfr_g11_`outcome', cluster(school_id)
 15.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11
> _`outcome'_sibling.ster, replace
 16.     //save to va project folder
.     estimates save $vaprojdir/estimates/sibling_va/outcome_va/spec_test_va_cf
> r_g11_`outcome'_sibling.ster, replace
 17. 
. 
. 
. 
. 
. 
. /*
> 
>   ** TFX
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 tfx_resid(school_id) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_tfx_g11_`outcome'
>         drop score_r
> 
>   corr va_cfr_g11_`outcome' va_tfx_g11_`outcome'
> 
>  */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
.   **** Peer Controls
.         ** No TFX
. 
.     /* ***without sibling college going controls
>     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv
>     rename score_r
> 
>     //with sibling controls
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                         `peer_demographic_controls' ///
>                         `peer_ela_score_controls' ///
>                         `peer_math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_cfr_g11_`outcome'_peer
>         rename score_r g11_`outcome'_r_peer
> 
>         ** TFX
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                         `peer_demographic_controls' ///
>                         `peer_ela_score_controls' ///
>                         `peer_math_score_controls' ///
>                 ) ///
>                 tfx_resid(school_id) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_tfx_g11_`outcome'_peer
>         drop score_r
> 
>         corr va_cfr_g11_`outcome'_peer va_tfx_g11_`outcome'_peer
>  */
. 
. 
. 
. *****************************************************************************
> ***
.   **************** Specification Test
. 
.   /* **** Peer Controls
>   reg g11_`outcome'_r_peer va_cfr_g11_`outcome'_peer, cluster(school_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`
> outcome'_peer_sibling.ster, replace
> 
>  */
. 
. 
.   *** no peer controls
. 
.   /* *** with peer controls
>   reg g11_`outcome'_r_nosibctrl_peer va_cfr_g11_`outcome'_nosibctrl_peer, clu
> ster(school_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`
> outcome'_peer_sibling_nocontrol.ster, replace */
. 
.   **************Do we need deep knowledge VA with sibling controls?? No.
. 
. 
. 
. 
.   ***************************************************************************
> ***
.   /* CFR Forecast Bias Test */
.   ***** leave out variable is sibling controls
. 
. 
.   **no peer controls
.   gen g11_`outcome'_r_d = g11_`outcome'_r_nosibctrl - g11_`outcome'_r
 18. 
.   //var rename gymnastics to make sure the indep var names are all the same w
> hen making tables later
.   rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_temp
 19.   rename va_cfr_g11_`outcome'_nosibctrl va_cfr_g11_`outcome'
 20. 
.   reg g11_`outcome'_r_d va_cfr_g11_`outcome', cluster(school_id)
 21.   //save to my personal folder
.   estimates save $projdir/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_`ou
> tcome'_sibling.ster, replace
 22.   //save to va project folder
.   estimates save $vaprojdir/estimates/sibling_va/outcome_va/fb_test_va_cfr_g1
> 1_`outcome'_sibling.ster, replace
 23. 
.   //roll back the rename gymnastics to restore original var names
.   rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl
 24.   rename va_cfr_g11_`outcome'_temp va_cfr_g11_`outcome'
 25. 
. 
.   /* ** with peer controls
>   gen g11_`outcome'_r_d_peer = g11_`outcome'_r_nosibctrl_peer - g11_`outcome'
> _r_peer
>   reg g11_`outcome'_r_d_peer va_cfr_g11_`outcome'_nosibctrl_peer, cluster(sch
> ool_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_`ou
> tcome'_sibling_peer.ster, replace
>  */
. 
. 
. 
.   **************** Save Value Added Estimates
.   collapse (firstnm) va_* ///
>     (mean) g11_`outcome'* ///
>     (sum) n_g11_`outcome' = touse_g11_`outcome' ///
>     , by(school_id cdscode grade year)
 26.   //save to my personal folder
.   save $projdir/dta/common_core_va/outcome_va/va_g11_`outcome'_sibling.dta, r
> eplace
 27.   //save to VA project folder
.   save $vaprojdir/data/sibling_va/outcome_va/va_g11_`outcome'_sibling.dta, re
> place
 28. 
. 
. }
(Enrollment Outcome Grade 11 VA Sample)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,398
-------------+----------------------------------   F(36, 700361)   =   2552.73
       Model |  16446.4038        36   456.84455   Prob > F        =    0.0000
    Residual |  125338.933   700,361  .178963324   R-squared       =    0.1160
-------------+----------------------------------   Adj R-squared   =    0.1159
       Total |  141785.336   700,397  .202435671   Root MSE        =    .42304

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0125059   .0019937     6.27   0.000     .0085982    .0164135
       2017  |  -.0114683    .002003    -5.73   0.000    -.0153942   -.0075424
       2018  |  -.0279555    .002004   -13.95   0.000    -.0318833   -.0240276
             |
         age |  -.0001742   3.51e-06   -49.67   0.000    -.0001811   -.0001673
             |
        male |
       Male  |  -.0695989   .0010335   -67.34   0.000    -.0716246   -.0675732
 1.eth_asian |   .0634443     .00166    38.22   0.000     .0601907    .0666978
1.eth_hisp~c |  -.0159828   .0014112   -11.33   0.000    -.0187488   -.0132169
 1.eth_black |   .0090516   .0027647     3.27   0.001      .003633    .0144703
 1.eth_other |  -.0105803   .0030645    -3.45   0.001    -.0165867    -.004574
             |
econ_disad~e |
Economic ..  |  -.0674784   .0012008   -56.19   0.000     -.069832   -.0651248
             |
limited_en~f |
Limited E..  |  -.0442232   .0026865   -16.46   0.000    -.0494887   -.0389577
             |
    disabled |
   Disabled  |  -.0173869   .0026817    -6.48   0.000    -.0226429   -.0121309
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0831014   .0020207    41.13   0.000      .079141    .0870618
       2016  |    .072925   .0019904    36.64   0.000     .0690238    .0768261
       2017  |   .0708344   .0021245    33.34   0.000     .0666705    .0749984
       2018  |   .0716667   .0025843    27.73   0.000     .0666015    .0767319
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.016063   .0010458   -15.36   0.000    -.0181127   -.0140132
       2016  |  -.0204097   .0010679   -19.11   0.000    -.0225028   -.0183167
       2017  |  -.0120708   .0011156   -10.82   0.000    -.0142573   -.0098843
       2018  |  -.0119936   .0011129   -10.78   0.000    -.0141748   -.0098123
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0013374   .0004869    -2.75   0.006    -.0022918    -.000383
       2016  |   .0007652   .0004504     1.70   0.089    -.0001176    .0016479
       2017  |   -.001685   .0004506    -3.74   0.000    -.0025683   -.0008018
       2018  |  -.0049773   .0007306    -6.81   0.000    -.0064093   -.0035454
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0586889   .0020117    29.17   0.000     .0547461    .0626317
       2016  |   .0621699   .0020683    30.06   0.000      .058116    .0662238
       2017  |   .0614841   .0021862    28.12   0.000     .0571992    .0657689
       2018  |   .0896567   .0026129    34.31   0.000     .0845355     .094778
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0147048   .0013197   -11.14   0.000    -.0172914   -.0121182
       2016  |  -.0165649   .0013018   -12.73   0.000    -.0191163   -.0140135
       2017  |  -.0116747   .0013689    -8.53   0.000    -.0143577   -.0089917
       2018  |  -.0009424   .0010813    -0.87   0.383    -.0030616    .0011769
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0005795   .0005458     1.06   0.288    -.0004904    .0016493
       2016  |   .0011826   .0005851     2.02   0.043     .0000358    .0023295
       2017  |  -.0004824   .0005892    -0.82   0.413    -.0016372    .0006724
       2018  |   -.007588   .0007223   -10.51   0.000    -.0090037   -.0061723
             |
       _cons |   1.858684   .0214889    86.49   0.000     1.816566    1.900801
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr_nosibctrl.ster saved
Standard deviations: total, classes, students, teachers same year
.42304057 .08267799 .41488272 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |   .005874217   .7563132727          3571  |
  2 |   .004992483   .6817276703          2319  |
  3 |  .0042665172   .6199087965          1117  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                1
    +--------------+
  1 |  .005874217  |
  2 |  .004992483  |
  3 |  .004992483  |
    +--------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,536
                                                F(1, 1276)        =    8278.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0282
                                                Root MSE          =     .41681

                          (Std. err. adjusted for 1,277 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   g11_enr_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.053127   .0115747    90.98   0.000      1.03042    1.075835
       _cons |  -.0015751    .000285    -5.53   0.000    -.0021342    -.001016
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,398
-------------+----------------------------------   F(38, 700359)   =   2447.97
       Model |  16624.1504        38  437.477643   Prob > F        =    0.0000
    Residual |  125161.186   700,359  .178710042   R-squared       =    0.1172
-------------+----------------------------------   Adj R-squared   =    0.1172
       Total |  141785.336   700,397  .202435671   Root MSE        =    .42274

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0118341   .0019925     5.94   0.000      .007929    .0157393
       2017  |  -.0128821   .0020023    -6.43   0.000    -.0168065   -.0089577
       2018  |  -.0299256   .0020041   -14.93   0.000    -.0338535   -.0259976
             |
1.has_~2year |   .0216657   .0019881    10.90   0.000     .0177692    .0255623
1.has_~4year |    .062914   .0021802    28.86   0.000     .0586408    .0671871
         age |  -.0001715   3.51e-06   -48.91   0.000    -.0001784   -.0001646
             |
        male |
       Male  |  -.0696291   .0010328   -67.42   0.000    -.0716533   -.0676048
 1.eth_asian |   .0618054   .0016597    37.24   0.000     .0585524    .0650584
1.eth_hisp~c |  -.0157639   .0014106   -11.18   0.000    -.0185286   -.0129991
 1.eth_black |   .0091413   .0027627     3.31   0.001     .0037265    .0145561
 1.eth_other |  -.0099587   .0030624    -3.25   0.001     -.015961   -.0039565
             |
econ_disad~e |
Economic ..  |  -.0680535   .0012002   -56.70   0.000    -.0704059   -.0657012
             |
limited_en~f |
Limited E..  |   -.044291   .0026846   -16.50   0.000    -.0495528   -.0390292
             |
    disabled |
   Disabled  |  -.0167822   .0026799    -6.26   0.000    -.0220346   -.0115297
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0830585   .0020193    41.13   0.000     .0791007    .0870163
       2016  |   .0730329   .0019892    36.72   0.000     .0691342    .0769316
       2017  |   .0711126   .0021233    33.49   0.000      .066951    .0752741
       2018  |   .0713808   .0025826    27.64   0.000     .0663189    .0764426
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0159419   .0010451   -15.25   0.000    -.0179903   -.0138936
       2016  |   -.020241   .0010672   -18.97   0.000    -.0223326   -.0181493
       2017  |  -.0118729   .0011148   -10.65   0.000    -.0140579   -.0096879
       2018  |  -.0118483   .0011121   -10.65   0.000    -.0140281   -.0096686
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0013171   .0004866    -2.71   0.007    -.0022708   -.0003633
       2016  |   .0007566   .0004501     1.68   0.093    -.0001255    .0016387
       2017  |  -.0017029   .0004503    -3.78   0.000    -.0025855   -.0008203
       2018  |  -.0048651   .0007301    -6.66   0.000     -.006296   -.0034341
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0579346   .0020104    28.82   0.000     .0539942     .061875
       2016  |   .0611853   .0020672    29.60   0.000     .0571337    .0652369
       2017  |   .0605455   .0021849    27.71   0.000     .0562632    .0648279
       2018  |   .0887088   .0026114    33.97   0.000     .0835906    .0938271
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0146061   .0013188   -11.08   0.000    -.0171909   -.0120213
       2016  |  -.0165061   .0013009   -12.69   0.000    -.0190557   -.0139564
       2017  |  -.0115881   .0013679    -8.47   0.000    -.0142692    -.008907
       2018  |  -.0007845   .0010806    -0.73   0.468    -.0029024    .0013334
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0006308   .0005455     1.16   0.247    -.0004383    .0016999
       2016  |   .0012667   .0005847     2.17   0.030     .0001206    .0024127
       2017  |  -.0004222   .0005888    -0.72   0.473    -.0015762    .0007318
       2018  |  -.0074158   .0007218   -10.27   0.000    -.0088305   -.0060011
             |
       _cons |   1.838208   .0214851    85.56   0.000     1.796098    1.880318
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr.ster saved
Standard deviations: total, classes, students, teachers same year
.4227411 .08242408 .41462792 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |    .00583675   .7554594714          3571  |
  2 |  .0049612938    .680815299          2319  |
  3 |   .004234727   .6184978003          1117  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |    .00583675  |
  2 |  .0049612938  |
  3 |  .0049612938  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,536
                                                F(1, 1276)        =    8258.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0281
                                                Root MSE          =     .41655

                          (Std. err. adjusted for 1,277 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   g11_enr_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.052731    .011584    90.88   0.000     1.030006    1.075457
       _cons |  -.0015497    .000285    -5.44   0.000    -.0021088   -.0009907
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_sibling.ster saved

Linear regression                               Number of obs     =    698,536
                                                F(1, 1276)        =      26.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .01593

                          (Std. err. adjusted for 1,277 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
 g11_enr_r_d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   .0034699   .0006785     5.11   0.000     .0021388    .0048009
       _cons |  -5.15e-06   .0000481    -0.11   0.915    -.0000996    .0000893
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/fb_test_va_cfr_g11_enr_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/fb_test_va_cfr_g11_enr_sibling.ster saved
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outc
    > ome_va/va_g11_enr_sibling.dta saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_
    > va/va_g11_enr_sibling.dta saved
(Enrollment Outcome Grade 11 VA Sample)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,398
-------------+----------------------------------   F(36, 700361)   =   1032.34
       Model |  8181.89797        36  227.274944   Prob > F        =    0.0000
    Residual |  154187.582   700,361  .220154437   R-squared       =    0.0504
-------------+----------------------------------   Adj R-squared   =    0.0503
       Total |   162369.48   700,397  .231824922   Root MSE        =    .46921

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   -.005689   .0022113    -2.57   0.010     -.010023   -.0013549
       2017  |  -.0316629   .0022216   -14.25   0.000    -.0360172   -.0273085
       2018  |  -.0086862   .0022227    -3.91   0.000    -.0130427   -.0043297
             |
         age |  -.0000933   3.89e-06   -24.00   0.000     -.000101   -.0000857
             |
        male |
       Male  |   .0191837   .0011463    16.74   0.000      .016937    .0214305
 1.eth_asian |  -.0140261   .0018411    -7.62   0.000    -.0176347   -.0104175
1.eth_hisp~c |   .0017761   .0015652     1.13   0.256    -.0012917    .0048439
 1.eth_black |  -.0359011   .0030664   -11.71   0.000    -.0419111   -.0298911
 1.eth_other |   .0021605   .0033989     0.64   0.525    -.0045014    .0088223
             |
econ_disad~e |
Economic ..  |  -.0241276   .0013319   -18.12   0.000     -.026738   -.0215172
             |
limited_en~f |
Limited E..  |  -.0234462   .0029797    -7.87   0.000    -.0292863   -.0176061
             |
    disabled |
   Disabled  |   .0270978   .0029743     9.11   0.000     .0212682    .0329274
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0573769   .0022412   -25.60   0.000    -.0617695   -.0529843
       2016  |  -.0534688   .0022076   -24.22   0.000    -.0577956   -.0491419
       2017  |  -.0546342   .0023563   -23.19   0.000    -.0592526   -.0500159
       2018  |  -.0280082   .0028663    -9.77   0.000    -.0336262   -.0223903
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0399888   .0011599   -34.48   0.000    -.0422622   -.0377154
       2016  |  -.0378814   .0011844   -31.98   0.000    -.0402028   -.0355599
       2017  |  -.0310776   .0012373   -25.12   0.000    -.0335027   -.0286525
       2018  |  -.0309297   .0012344   -25.06   0.000     -.033349   -.0285104
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0100909   .0005401    18.68   0.000     .0090324    .0111495
       2016  |   .0097951   .0004995    19.61   0.000      .008816    .0107741
       2017  |   .0083838   .0004998    16.77   0.000     .0074042    .0093634
       2018  |   .0037116   .0008103     4.58   0.000     .0021233    .0052998
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0640321   .0022312   -28.70   0.000    -.0684052    -.059659
       2016  |  -.0665134   .0022941   -28.99   0.000    -.0710097   -.0620171
       2017  |  -.0617518   .0024248   -25.47   0.000    -.0665042   -.0569993
       2018  |  -.0513113   .0028981   -17.71   0.000    -.0569914   -.0456312
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0335671   .0014637   -22.93   0.000    -.0364359   -.0306983
       2016  |  -.0354717   .0014438   -24.57   0.000    -.0383015   -.0326419
       2017  |  -.0254956   .0015183   -16.79   0.000    -.0284714   -.0225198
       2018  |  -.0344037   .0011993   -28.69   0.000    -.0367542   -.0320532
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0110098   .0006054    18.19   0.000     .0098232    .0121964
       2016  |   .0120303    .000649    18.54   0.000     .0107583    .0133023
       2017  |   .0084638   .0006535    12.95   0.000      .007183    .0097446
       2018  |   .0010413   .0008011     1.30   0.194    -.0005288    .0026115
             |
       _cons |   1.025151    .023834    43.01   0.000     .9784376    1.071865
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr_2year_nosibctrl.ster saved
Standard deviations: total, classes, students, teachers same year
.46920618 .09832406 .45878842 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0090359214   .8131155134          3571  |
  2 |  .0083692914   .7646063866          2319  |
  3 |  .0076539234   .7182533446          1117  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0090359214  |
  2 |  .0083692914  |
  3 |  .0083692914  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,536
                                                F(1, 1276)        =   33821.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0366
                                                Root MSE          =     .46054

                          (Std. err. adjusted for 1,277 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_2y~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.003268   .0054554   183.91   0.000     .9925655     1.01397
       _cons |  -.0011242     .00027    -4.16   0.000     -.001654   -.0005945
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,398
-------------+----------------------------------   F(38, 700359)   =   1061.45
       Model |  8841.94286        38  232.682707   Prob > F        =    0.0000
    Residual |  153527.537   700,359  .219212628   R-squared       =    0.0545
-------------+----------------------------------   Adj R-squared   =    0.0544
       Total |   162369.48   700,397  .231824922   Root MSE        =     .4682

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |  -.0060655   .0022067    -2.75   0.006    -.0103906   -.0017403
       2017  |  -.0322535   .0022176   -14.54   0.000    -.0365999   -.0279071
       2018  |   -.010237   .0022196    -4.61   0.000    -.0145873   -.0058866
             |
1.has_~2year |   .0977161   .0022019    44.38   0.000     .0934005    .1020317
1.has_~4year |  -.0844635   .0024147   -34.98   0.000    -.0891962   -.0797308
         age |  -.0000927   3.88e-06   -23.89   0.000    -.0001004   -.0000851
             |
        male |
       Male  |   .0192626   .0011439    16.84   0.000     .0170207    .0215045
 1.eth_asian |  -.0141909   .0018382    -7.72   0.000    -.0177937   -.0105881
1.eth_hisp~c |  -.0002279   .0015623    -0.15   0.884      -.00329    .0028341
 1.eth_black |  -.0359563   .0030598   -11.75   0.000    -.0419534   -.0299592
 1.eth_other |    .001529   .0033917     0.45   0.652    -.0051187    .0081767
             |
econ_disad~e |
Economic ..  |  -.0247724   .0013293   -18.64   0.000    -.0273778   -.0221671
             |
limited_en~f |
Limited E..  |  -.0239961   .0029733    -8.07   0.000    -.0298237   -.0181684
             |
    disabled |
   Disabled  |    .027357   .0029681     9.22   0.000     .0215397    .0331743
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0560808   .0022365   -25.08   0.000    -.0604642   -.0516973
       2016  |  -.0520111   .0022031   -23.61   0.000    -.0563291   -.0476932
       2017  |  -.0528285   .0023516   -22.46   0.000    -.0574375   -.0482194
       2018  |  -.0264511   .0028603    -9.25   0.000    -.0320573    -.020845
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0396963   .0011575   -34.30   0.000     -.041965   -.0374277
       2016  |  -.0375631   .0011819   -31.78   0.000    -.0398797   -.0352465
       2017  |  -.0308677   .0012347   -25.00   0.000    -.0332877   -.0284478
       2018  |  -.0308318   .0012317   -25.03   0.000    -.0332459   -.0284176
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0099324   .0005389    18.43   0.000     .0088761    .0109887
       2016  |   .0096348   .0004985    19.33   0.000     .0086579    .0106118
       2017  |   .0082242   .0004987    16.49   0.000     .0072467    .0092017
       2018  |    .003547   .0008086     4.39   0.000     .0019622    .0051319
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0628007   .0022266   -28.20   0.000    -.0671649   -.0584365
       2016  |  -.0650504   .0022895   -28.41   0.000    -.0695377    -.060563
       2017  |  -.0601655   .0024199   -24.86   0.000    -.0649084   -.0554226
       2018  |  -.0491914   .0028922   -17.01   0.000    -.0548601   -.0435228
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0333052   .0014606   -22.80   0.000    -.0361679   -.0304424
       2016  |  -.0351463   .0014407   -24.39   0.000    -.0379701   -.0323225
       2017  |  -.0252764    .001515   -16.68   0.000    -.0282458    -.022307
       2018  |  -.0337687   .0011968   -28.22   0.000    -.0361143    -.031423
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0108704   .0006041    17.99   0.000     .0096864    .0120545
       2016  |   .0118702   .0006476    18.33   0.000      .010601    .0131395
       2017  |   .0083405   .0006521    12.79   0.000     .0070624    .0096186
       2018  |    .000866   .0007994     1.08   0.279    -.0007008    .0024329
             |
       _cons |   1.020533   .0237956    42.89   0.000     .9738944    1.067172
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr_2year.ster saved
Standard deviations: total, classes, students, teachers same year
.46820148 .09666669 .45811372 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0087166298   .8082492216          3571  |
  2 |  .0080523485   .7582762279          2319  |
  3 |  .0073546703   .7120875084          1117  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0087166298  |
  2 |  .0080523485  |
  3 |  .0080523485  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,536
                                                F(1, 1276)        =   32134.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0353
                                                Root MSE          =     .45985

                          (Std. err. adjusted for 1,277 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_2y~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.003964   .0056006   179.26   0.000     .9929771    1.014952
       _cons |  -.0011436   .0002712    -4.22   0.000    -.0016756   -.0006115
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_2year_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_2year_sibling.ster saved

Linear regression                               Number of obs     =    698,536
                                                F(1, 1276)        =     659.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0028
                                                Root MSE          =     .03066

                          (Std. err. adjusted for 1,277 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_2y~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   .0182879   .0007119    25.69   0.000     .0168913    .0196845
       _cons |   -.000021   .0000591    -0.36   0.722    -.0001371     .000095
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/fb_test_va_cfr_g11_enr_2year_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/fb_test_va_cfr_g11_enr_2year_sibling.ster saved
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outc
    > ome_va/va_g11_enr_2year_sibling.dta saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_
    > va/va_g11_enr_2year_sibling.dta saved
(Enrollment Outcome Grade 11 VA Sample)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,398
-------------+----------------------------------   F(36, 700361)   =   6092.31
       Model |  38143.3552        36  1059.53765   Prob > F        =    0.0000
    Residual |  121802.571   700,361  .173913984   R-squared       =    0.2385
-------------+----------------------------------   Adj R-squared   =    0.2384
       Total |  159945.927   700,397  .228364666   Root MSE        =    .41703

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0181949   .0019654     9.26   0.000     .0143427     .022047
       2017  |   .0201945   .0019746    10.23   0.000     .0163244    .0240647
       2018  |  -.0192693   .0019756    -9.75   0.000    -.0231414   -.0153972
             |
         age |  -.0000808   3.46e-06   -23.38   0.000    -.0000876   -.0000741
             |
        male |
       Male  |  -.0887826   .0010188   -87.14   0.000    -.0907796   -.0867857
 1.eth_asian |   .0774704   .0016364    47.34   0.000     .0742631    .0806777
1.eth_hisp~c |  -.0177589   .0013912   -12.77   0.000    -.0204856   -.0150323
 1.eth_black |   .0449527   .0027254    16.49   0.000     .0396111    .0502944
 1.eth_other |  -.0127408    .003021    -4.22   0.000    -.0186618   -.0068198
             |
econ_disad~e |
Economic ..  |  -.0433508   .0011838   -36.62   0.000    -.0456709   -.0410307
             |
limited_en~f |
Limited E..  |   -.020777   .0026484    -7.85   0.000    -.0259677   -.0155863
             |
    disabled |
   Disabled  |  -.0444847   .0026436   -16.83   0.000     -.049666   -.0393033
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1404783   .0019919    70.52   0.000     .1365742    .1443825
       2016  |   .1263937   .0019621    64.42   0.000      .122548    .1302394
       2017  |   .1254687   .0020943    59.91   0.000     .1213639    .1295734
       2018  |   .0996749   .0025476    39.12   0.000     .0946817    .1046681
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0239258   .0010309    23.21   0.000     .0219052    .0259465
       2016  |   .0174717   .0010527    16.60   0.000     .0154084     .019535
       2017  |   .0190068   .0010997    17.28   0.000     .0168514    .0211622
       2018  |   .0189361   .0010971    17.26   0.000     .0167859    .0210864
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0114283     .00048   -23.81   0.000    -.0123691   -.0104874
       2016  |  -.0090299    .000444   -20.34   0.000    -.0099001   -.0081597
       2017  |  -.0100688   .0004442   -22.67   0.000    -.0109395   -.0091981
       2018  |  -.0086889   .0007202   -12.06   0.000    -.0101005   -.0072773
             |
        year#|
          c. |
prior_math~e |
       2015  |    .122721   .0019831    61.88   0.000     .1188342    .1266078
       2016  |   .1286833    .002039    63.11   0.000      .124687    .1326796
       2017  |   .1232358   .0021551    57.18   0.000     .1190118    .1274598
       2018  |   .1409681   .0025758    54.73   0.000     .1359196    .1460165
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0188623   .0013009    14.50   0.000     .0163125    .0214121
       2016  |   .0189068   .0012833    14.73   0.000     .0163917     .021422
       2017  |   .0138209   .0013494    10.24   0.000     .0111761    .0164658
       2018  |   .0334613   .0010659    31.39   0.000     .0313722    .0355505
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0104303   .0005381   -19.38   0.000     -.011485   -.0093757
       2016  |  -.0108477   .0005768   -18.81   0.000    -.0119782   -.0097171
       2017  |  -.0089462   .0005808   -15.40   0.000    -.0100846   -.0078078
       2018  |  -.0086293    .000712   -12.12   0.000    -.0100249   -.0072337
             |
       _cons |   .8335325   .0211836    39.35   0.000     .7920133    .8750517
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr_4year_nosibctrl.ster saved
Standard deviations: total, classes, students, teachers same year
.41702996 .08807319 .40762372 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0073188689   .8201082302          3571  |
  2 |  .0070452477   .8049253272          2319  |
  3 |   .006544451   .7734469672          1117  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0073188689  |
  2 |  .0070452477  |
  3 |  .0070452477  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,536
                                                F(1, 1276)        =   36172.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0377
                                                Root MSE          =     .40916

                          (Std. err. adjusted for 1,277 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_4y~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.015877   .0053414   190.19   0.000     1.005398    1.026356
       _cons |   -.000188   .0001867    -1.01   0.314    -.0005542    .0001783
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   700,398
-------------+----------------------------------   F(38, 700359)   =   5976.92
       Model |  39167.7741        38   1030.7309   Prob > F        =    0.0000
    Residual |  120778.153   700,359  .172451775   R-squared       =    0.2449
-------------+----------------------------------   Adj R-squared   =    0.2448
       Total |  159945.927   700,397  .228364666   Root MSE        =    .41527

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0178996   .0019573     9.15   0.000     .0140634    .0217358
       2017  |   .0193714   .0019669     9.85   0.000     .0155164    .0232264
       2018  |  -.0196886   .0019687   -10.00   0.000    -.0235472   -.0158301
             |
1.has_~2year |  -.0760504    .001953   -38.94   0.000    -.0798781   -.0722227
1.has_~4year |   .1473775   .0021417    68.81   0.000     .1431798    .1515751
         age |  -.0000787   3.44e-06   -22.86   0.000    -.0000855    -.000072
             |
        male |
       Male  |  -.0888917   .0010146   -87.62   0.000    -.0908802   -.0869032
 1.eth_asian |   .0759963   .0016304    46.61   0.000     .0728007    .0791918
1.eth_hisp~c |  -.0155359   .0013857   -11.21   0.000    -.0182518     -.01282
 1.eth_black |   .0450976   .0027139    16.62   0.000     .0397784    .0504167
 1.eth_other |  -.0114877   .0030083    -3.82   0.000    -.0173839   -.0055915
             |
econ_disad~e |
Economic ..  |  -.0432811    .001179   -36.71   0.000    -.0455919   -.0409703
             |
limited_en~f |
Limited E..  |  -.0202949   .0026372    -7.70   0.000    -.0254638   -.0151261
             |
    disabled |
   Disabled  |  -.0441392   .0026325   -16.77   0.000    -.0492989   -.0389795
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1391393   .0019837    70.14   0.000     .1352514    .1430272
       2016  |    .125044    .001954    63.99   0.000     .1212142    .1288739
       2017  |    .123941   .0020858    59.42   0.000      .119853    .1280291
       2018  |   .0978319    .002537    38.56   0.000     .0928595    .1028043
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0237544   .0010266    23.14   0.000     .0217423    .0257666
       2016  |   .0173222   .0010483    16.52   0.000     .0152675    .0193768
       2017  |   .0189949   .0010951    17.35   0.000     .0168485    .0211413
       2018  |   .0189834   .0010925    17.38   0.000     .0168422    .0211247
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112495    .000478   -23.53   0.000    -.0121864   -.0103126
       2016  |  -.0088782   .0004421   -20.08   0.000    -.0097448   -.0080117
       2017  |  -.0099271   .0004424   -22.44   0.000    -.0107941     -.00906
       2018  |  -.0084121   .0007172   -11.73   0.000    -.0098178   -.0070064
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1207353   .0019749    61.13   0.000     .1168645    .1246061
       2016  |   .1262357   .0020307    62.16   0.000     .1222556    .1302157
       2017  |   .1207111   .0021463    56.24   0.000     .1165043    .1249178
       2018  |   .1379003   .0025653    53.76   0.000     .1328724    .1429281
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0186991   .0012955    14.43   0.000       .01616    .0212382
       2016  |   .0186402   .0012779    14.59   0.000     .0161356    .0211448
       2017  |   .0136883   .0013438    10.19   0.000     .0110546    .0163221
       2018  |   .0329842   .0010615    31.07   0.000     .0309037    .0350647
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0102396   .0005358   -19.11   0.000    -.0112898   -.0091894
       2016  |  -.0106036   .0005744   -18.46   0.000    -.0117294   -.0094778
       2017  |  -.0087627   .0005784   -15.15   0.000    -.0098963   -.0076291
       2018  |  -.0082819   .0007091   -11.68   0.000    -.0096716   -.0068921
             |
       _cons |   .8176753   .0211056    38.74   0.000     .7763091    .8590415
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/vam_cfr_g11_enr_4year.ster saved
Standard deviations: total, classes, students, teachers same year
.41527313 .08609161 .40625117 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |   .006985064   .8147183159          3571  |
  2 |  .0067035401    .798030138          2319  |
  3 |  .0061998612   .7651471305          1117  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |   .006985064  |
  2 |  .0067035401  |
  3 |  .0067035401  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    698,536
                                                F(1, 1276)        =   33553.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0361
                                                Root MSE          =     .40777

                          (Std. err. adjusted for 1,277 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_4y~r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   1.016357   .0055485   183.18   0.000     1.005472    1.027243
       _cons |  -.0001714   .0001888    -0.91   0.364    -.0005418    .0001991
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/spec_test_va_cfr_g11_enr_4year_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/spec_test_va_cfr_g11_enr_4year_sibling.ster saved

Linear regression                               Number of obs     =    698,536
                                                F(1, 1276)        =     630.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0026
                                                Root MSE          =      .0382

                          (Std. err. adjusted for 1,277 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
g11_enr_4y~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_cfr_g11~r |   .0245096   .0009763    25.11   0.000     .0225943    .0264249
       _cons |  -.0000107   .0000777    -0.14   0.890    -.0001631    .0001416
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcom
> e_va/fb_test_va_cfr_g11_enr_4year_sibling.ster saved
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outc
> ome_va/fb_test_va_cfr_g11_enr_4year_sibling.ster saved
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outc
    > ome_va/va_g11_enr_4year_sibling.dta saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_
    > va/va_g11_enr_4year_sibling.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:     56.21 /        1 =      56.2090

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling_out.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 21:48:45
-------------------------------------------------------------------------------
