-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling_est_sumstats.smcl
  log type:  smcl
 opened on:   3 May 2022, 22:03:09

. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. #delimit ;
delimiter now ;
. #delimit cr
delimiter now cr
. macro list
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. 
. timer on 1

. 
. // 11th Grade (8th Grade ELA Controls, 6th Grade Math Controls)
. **************** Two Way Kernel Density for ELA and Math
. foreach subject in ela math {
  2. 
.     use $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibling.dt
> a, clear
  3.     sort school_id year
  4.         xtset school_id year
  5. 
.     * Normalize to have mean zero
.         foreach v of varlist va_* {
  6.                 sum `v', meanonly
  7.                 replace `v' = `v' - r(mean)
  8.         }
  9. 
.     sum va_cfr_g11_`subject'
 10.     local mean_`subject' = 0
 11.     local sd_`subject' : di %4.3f = r(sd)
 12. 
.     /* sum va_cfr_g11_`subject'_peer
>     local mean_`subject'_peer = 0
>     local sd_`subject'_peer : di %4.3f = r(sd) */
. 
.     tempfile va_`subject'
 13.     save `va_`subject''
 14. 
. }
(Test Score Grade 11 VA Sample)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2018, but with gaps
         Delta: 1 year
(4,841 real changes made)
(4,841 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~a |      4,841    9.72e-10    .1338945  -.6005455   .5052347
file /home/tmp/St16505.000001 saved as .dta format
(Test Score Grade 11 VA Sample)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2018, but with gaps
         Delta: 1 year
(4,834 real changes made)
(4,834 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~h |      4,834   -6.66e-10    .1373837  -.5025851   .6632896
file /home/tmp/St16505.000002 saved as .dta format

. 
. 
.   use `va_ela', clear
(Test Score Grade 11 VA Sample)

.   merge 1:1 cdscode year using `va_math', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                            17
        from master                        12  
        from using                          5  

    Matched                             4,919  
    -----------------------------------------

. 
.   corr va_cfr_g11_ela va_cfr_g11_ela_nosibctrl
(obs=4,841)

             | va_cfr~a va_cfr..
-------------+------------------
va_cfr_g11~a |   1.0000
~a_nosibctrl |   1.0000   1.0000


.   local corr_coef_ela_sibling : di %5.3f r(rho)

. 
.   corr va_cfr_g11_math va_cfr_g11_math_nosibctrl
(obs=4,834)

             | va_cfr~h va_cfr..
-------------+------------------
va_cfr_g11~h |   1.0000
~h_nosibctrl |   1.0000   1.0000


.   local corr_coef_math_sibling : di %5.3f r(rho)

. 
.   tempfile va_ela_math_sibling

.   save `va_ela_math_sibling'
file /home/tmp/St16505.000003 saved as .dta format

. 
. 
.   *************** two way scatter plot of VA with and without sibling control
> s
.   ***ELA
.   twoway ///
>   (scatter va_cfr_g11_ela va_cfr_g11_ela_nosibctrl) ///
>   (lfit va_cfr_g11_ela va_cfr_g11_ela_nosibctrl) ///
>   (function y = x), ///
>   ytitle("ELA VA with Sibling Control") ///
>   xtitle("ELA VA without Sibling Control") ///
>   title("Scatter Plot of ELA VA with and without Sibling Control") ///
>   legend(label(1 "ELA VA") label(3 "45 degree line") ) ///
>   note("Correlation Coefficient = `corr_coef_ela_sibling' ")

. 
.   graph export $projdir/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_
> g11_ela_sibling.pdf, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/scatter_va_cfr_g11_ela_sibling.pdf saved as PDF format

. 
. 
.   ***math
.   twoway ///
>   (scatter va_cfr_g11_math va_cfr_g11_math_nosibctrl) ///
>   (lfit va_cfr_g11_math va_cfr_g11_math_nosibctrl) ///
>   (function y = x), ///
>   ytitle("Math VA with Sibling Control") ///
>   xtitle("Math VA without Sibling Control") ///
>   title("Scatter Plot of Math VA with and without Sibling Control") ///
>   legend(label(1 "Math VA") label(3 "45 degree line") ) ///
>   note("Correlation Coefficient = `corr_coef_math_sibling' ")

. 
.   graph export $projdir/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_
> g11_math_sibling.pdf, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/scatter_va_cfr_g11_math_sibling.pdf saved as PDF format

. 
. 
. 
. 
. 
. 
. 
. 
. 
.   **** No Peer Controls
.   twoway ///
>         (kdensity va_cfr_g11_ela) ///
>         (kdensity va_cfr_g11_math) ///
>     , ytitle("Density") xtitle("Value Added") ///
>     title("11th Grade Test Score VA") ///
>         legend(label(1 "ELA") label(2 "Math")) ///
>     note("Mean (Standard Deviation) = `mean_ela' (`sd_ela')" ///
>         "Mean (Standard Deviation) = `mean_math' (`sd_math')")

.     graph export $projdir/out/graph/siblingvaregs/test_score_va/kdensity_va_c
> fr_g11_sibling.pdf, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/kdensity_va_cfr_g11_sibling.pdf saved as PDF format

. 
. /*
>   ****  Peer Controls
>   twoway ///
>         (kdensity va_cfr_g11_ela_peer) ///
>         (kdensity va_cfr_g11_math_peer) ///
>     , ytitle("Density") xtitle("Value Added") ///
>     title("11th Grade Test Score VA") ///
>         legend(label(1 "ELA") label(2 "Math")) ///
>     note("Mean (Standard Deviation) = `mean_ela_peer' (`sd_ela_peer')" ///
>         "Mean (Standard Deviation) = `mean_math_peer' (`sd_math_peer')")
>     graph export $projdir/out/graph/siblingvaregs/test_score_va/kdensity_va_c
> fr_g11_peer_sibling.pdf, replace
>  */
. 
. 
. 
. *************** correlation with original VA estimates
. //load orignal VA dataset and merge ELA with math
. foreach subject in ela math {
  2.         use data/sbac/va_g11_`subject'.dta, clear
  3.   sort school_id year
  4. 
.         tempfile va_`subject'_original
  5.         save `va_`subject'_original'
  6. }
(CST/SBAC Student Test Score Samples)
file /home/tmp/St16505.000004 saved as .dta format
(CST/SBAC Student Test Score Samples)
file /home/tmp/St16505.000005 saved as .dta format

. 
. use `va_ela_original'
(CST/SBAC Student Test Score Samples)

. merge 1:1 cdscode year using `va_math_original', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                            14
        from master                         9  
        from using                          5  

    Matched                             4,957  
    -----------------------------------------

. 
. keep cdscode year va_cfr_g11_*

. rename va* va*_original

. 
. merge 1:1 cdscode year using `va_ela_math_sibling', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                            35
        from master                        35  
        from using                          0  

    Matched                             4,936  
    -----------------------------------------

. 
. corr va_cfr_g11_ela va_cfr_g11_ela_original
(obs=4,841)

             | va_cfr~a va_cfr..
-------------+------------------
va_cfr_g11~a |   1.0000
v~a_original |   0.9626   1.0000


. local corr_coef_ela_original : di %5.3f r(rho)

. 
. corr va_cfr_g11_math va_cfr_g11_math_original
(obs=4,834)

             | va_cfr~h va_cfr..
-------------+------------------
va_cfr_g11~h |   1.0000
v~h_original |   0.9537   1.0000


. local corr_coef_math_original : di %5.3f r(rho)

. 
. 
. *************** two way scatter plot of VA with sibling control and original 
> VA
. ***ELA
. twoway ///
> (scatter va_cfr_g11_ela va_cfr_g11_ela_original) ///
> (lfit va_cfr_g11_ela va_cfr_g11_ela_original) ///
> (function y = x), ///
> ytitle("ELA VA with Sibling Control") ///
> xtitle("Original ELA VA") ///
> title("Scatter Plot of ELA VA with Sibling Control and Original") ///
> legend(label(1 "ELA VA") label(3 "45 degree line") ) ///
> note("Correlation Coefficient = `corr_coef_ela_original' ")

. 
. graph export $projdir/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_g1
> 1_ela_original.pdf, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/scatter_va_cfr_g11_ela_original.pdf saved as PDF format

. 
. 
. ***math
. twoway ///
> (scatter va_cfr_g11_math va_cfr_g11_math_original) ///
> (lfit va_cfr_g11_math va_cfr_g11_math_original) ///
> (function y = x), ///
> ytitle("Math VA with Sibling Control") ///
> xtitle("Original Math VA") ///
>   title("Scatter Plot of Math VA with Sibling Control and Original") ///
> legend(label(1 "Math VA") label(3 "45 degree line") ) ///
> note("Correlation Coefficient = `corr_coef_math_original' ")

. 
. graph export $projdir/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_g1
> 1_math_original.pdf, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/scatter_va_cfr_g11_math_original.pdf saved as PDF format

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. **************************************************
. //specification tests
. *****No peer controls
. foreach subject in ela math {
  2. 
.     estimates use $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g
> 11_`subject'_sibling.ster
  3. 
.     test _b[va_cfr_g11_`subject'] = 1
  4.     matrix test_p = r(p)
  5.         matrix rownames test_p = pvalue
  6.         matrix colnames test_p = va_cfr_g11_`subject'
  7.         estadd matrix test_p = test_p
  8. 
.     local slope : di %5.3f _b[va_cfr_g11_`subject']
  9.         local std_err : di %4.3f _se[va_cfr_g11_`subject']
 10.         binscatter sbac_g11_`subject'_r va_cfr_g11_`subject' ///
>                 [aw = n_g11_`subject'] ///
>                 , ytitle("11th Grade Score") xtitle("Value Added") ///
>       title("11th Grade ``subject'_str' Specification Test") ///
>                 yline(0) xline(0) ///
>                 yscale(range(-.3 .3)) xscale(range(-.3 .3)) ylabel(-.3 (0.1) 
> .3) xlabel(-.3 (0.1) .3) ///
>                 note("Slope (Standard Error) = `slope' (`std_err')")
 11.         graph export $projdir/out/graph/siblingvaregs/test_score_va/spec_t
> est_va_cfr_g11_`subject'_sibling.pdf, replace
 12. 
. /*
> ******* with peer controls
>     estimates use $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g
> 11_`subject'_peer_sibling.ster
> 
>     test _b[va_cfr_g11_`subject'_peer] = 1
>     matrix test_p = r(p)
>         matrix rownames test_p = pvalue
>         matrix colnames test_p = va_cfr_g11_`subject'_peer
>         estadd matrix test_p = test_p
> 
>         local slope : di %5.3f _b[va_cfr_g11_`subject'_peer]
>         local std_err : di %4.3f _se[va_cfr_g11_`subject'_peer]
>         binscatter sbac_g11_`subject'_r_peer va_cfr_g11_`subject'_peer ///
>                 [aw = n_g11_`subject'] ///
>                 , ytitle("11th Grade Score") xtitle("Value Added") ///
>       title("11th Grade ``subject'_str' Specification Test") ///
>                 yline(0) xline(0) ///
>                 yscale(range(-.3 .3)) xscale(range(-.3 .3)) ylabel(-.3 (0.1) 
> .3) xlabel(-.3 (0.1) .3) ///
>                 note("Slope (Standard Error) = `slope' (`std_err')")
>     graph export $projdir/out/graph/siblingvaregs/test_score_va/spec_test_va_
> cfr_g11_`subject'_peer_sibling.pdf, replace */
. 
. 
. }

 ( 1)  va_cfr_g11_ela = 1

       F(  1,  1275) =    0.71
            Prob > F =    0.3982

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/spec_test_va_cfr_g11_ela_sibling.pdf saved as PDF format

 ( 1)  va_cfr_g11_math = 1

       F(  1,  1273) =    4.44
            Prob > F =    0.0354

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/spec_test_va_cfr_g11_math_sibling.pdf saved as PDF
    format

. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:      3.30 /        1 =       3.3010

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling_est_sumstats.smcl
  log type:  smcl
 closed on:   3 May 2022, 22:03:12
-------------------------------------------------------------------------------
