-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_out.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 22:15:05

. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative fil
> e paths  */
. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;

. local acs_str
>         "Original + Census"
>         ;

. local sib_str
>         "Original + Sibling"
>         ;

. local both_str
>         "Original + Census + Sibling"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. macro list
T_gm_fix_span:  0
S_4:            .0039002308063216
S_2:            300
S_3:            .0206002574343117
S_1:            epanechnikov
S_6:            .7098361624622439
S_5:            4
ReS_jv2:        __000006 __000007 __000008 __000009 __00000A __00000B __00000C
                __00000D __00000E __00000F __00000G __00000H __00000I __00000J
                __00000K
dropv:          _cdscode_x
n_offset:       0
sort:           0
dots:           nois _dots 5 0
dotss:          nois _dots 0, title(Survey results being calculated)
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_both_str:      Original + Census + Sibling
_sib_str:       Original + Sibling
_acs_str:       Original + Census
_og_str:        Original Specification
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. //startomg timer
. timer on 1

. 
. 
. 
. 
. *****************************************************************************
> ***
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)

. 
. 
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* Outcome VA, 4 specifications  */
. 
. foreach outcome in enr enr_2year enr_4year {
  2.   // load the resctricted sample with sibling and acs controls
.   use $vaprojdir/data/va_samples/va_sib_acs_out_restr_smp.dta if touse_g11_`o
> utcome'==1, clear
  3. 
.   ***************************************************************************
> *****
.   /* Primary outcome va specification, no tfx, no peer fx, no sibling ctrl, n
> o acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _og.ster, replace)
  4. 
.   // rename the va estimates and the residuals
.   rename tv va_`outcome'_og
  5.   rename score_r `outcome'_r_og
  6.   label var va_`outcome'_og "``outcome'_str' VA OG Specification"
  7.   label var `outcome'_r_og "Outcome Residual from ``outcome'_str' VA OG Sp
> ecification"
  8. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_og va_`outcome'_og, cluster(school_id)
  9. 
.   // save spec test estimates
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_og.ster, replace
 10. 
. 
. 
.   ***************************************************************************
> *****
.   /* Outcome VA, no tfx, no peer fx, no sibling ctrl, with acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `census_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _acs.ster, replace)
 11. 
.   // rename va estimates and score residuals
.   rename tv va_`outcome'_acs
 12.   rename score_r `outcome'_r_acs
 13.   label var va_`outcome'_acs "``outcome'_str' VA with Census Controls"
 14.   label var `outcome'_r_acs "Outcome Residual from ``outcome'_str' VA with
>  Census Controls"
 15. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_acs va_`outcome'_acs, cluster(school_id)
 16. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_acs.ster, replace
 17. 
. 
.   *******************
.   // forecast bias test for ACS leave out vars
. 
.   // difference in outcome residuals
.   gen `outcome'_r_d_og_acs = `outcome'_r_og - `outcome'_r_acs
 18.   // fb test
.   reg `outcome'_r_d_og_acs va_`outcome'_og, cluster(school_id)
 19.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test
> _`outcome'_acs_og.ster, replace
 20. 
. 
. 
. 
.   ***************************************************************************
> *****
.   /* Outcome VA, no tfx, no peer fx, with sibling ctrl, no acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `sibling_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _sib.ster, replace)
 21. 
.   //rename va estimates sand score residuals
.   rename tv va_`outcome'_sib
 22.   rename score_r `outcome'_r_sib
 23.   label var va_`outcome'_sib "``outcome'_str' VA with Sibling Controls"
 24.   label var `outcome'_r_sib "Outcome Residual from ``outcome'_str' VA with
>  Sibling Controls"
 25. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_sib va_`outcome'_sib, cluster(school_id)
 26. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_sib.ster, replace
 27. 
. 
.   *******************
.   // forecast bias test for sibling controls as leave out vars
.   // difference in outcome residuals
.   gen `outcome'_r_d_og_sib = `outcome'_r_og - `outcome'_r_sib
 28.   // fb test
.   reg `outcome'_r_d_og_sib va_`outcome'_og, cluster(school_id)
 29.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test
> _`outcome'_sib_og.ster, replace
 30. 
. 
. 
. 
.   ***************************************************************************
> *****
.   /* Outcome VA, no tfx, no peer fx, with sibling ctrl, with acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `sibling_controls' ///
>       `census_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _both.ster, replace)
 31. 
.   //rename va estimates sand outcome residuals
.   rename tv va_`outcome'_both
 32.   rename score_r `outcome'_r_both
 33.   label var va_`outcome'_both "``outcome'_str' VA with Sibling and Census 
> Controls"
 34.   label var `outcome'_r_both "Outcome Residual from ``outcome'_str' VA wit
> h Sibling and Census Controls"
 35. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_both va_`outcome'_both, cluster(school_id)
 36. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_both.ster, replace
 37. 
. 
.   *******************
.   // forecast bias test for sibling controls as leave out vars against specif
> ication with only census controls
.   // difference in outcome residuals with census controls and residuals with 
> both census and sibling controls
.   gen `outcome'_r_d_acs_both = `outcome'_r_acs - `outcome'_r_both
 38.   // fb test
.   reg `outcome'_r_d_acs_both va_`outcome'_acs, cluster(school_id)
 39.   //naming convention: forecast bias test for leave out variables being si
> bling controls, against VA with only acs controls
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`o
> utcome'_sib_acs.ster, replace
 40. 
. 
.   *******************
.   // forecast bias test for census controls as leave out vars against specifi
> cation with only sibling controls
.   // difference in outcome residuals with census controls and residuals with 
> both census and sibling controls
.   gen `outcome'_r_d_sib_both = `outcome'_r_sib - `outcome'_r_both
 41.   // fb test
.   reg `outcome'_r_d_sib_both va_`outcome'_sib, cluster(school_id)
 42.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test
> _`outcome'_acs_sib.ster, replace
 43. 
. 
. 
. 
. 
.   ********* Save VA estimates
.   collapse (firstnm) va_* ///
>     (mean) `outcome'* ///
>     (sum) n_g11_`outcome' = touse_g11_`outcome' ///
>     , by(school_id cdscode grade year)
 44.   // save to VA project data folder
.   save $vaprojdir/data/sib_acs_restr_smp/outcome_va/va_`outcome'_sib_acs.dta,
>  replace
 45. 
. }
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(36, 433276)   =   1626.54
       Model |  10230.7049        36  284.186247   Prob > F        =    0.0000
    Residual |  75701.0035   433,276   .17471774   R-squared       =    0.1191
-------------+----------------------------------   Adj R-squared   =    0.1190
       Total |  85931.7083   433,312  .198313705   Root MSE        =    .41799

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0081875    .002529     3.24   0.001     .0032306    .0131443
       2017  |  -.0154851   .0025372    -6.10   0.000    -.0204579   -.0105122
       2018  |  -.0283736    .002559   -11.09   0.000    -.0333891   -.0233581
             |
         age |  -.0001493   4.60e-06   -32.45   0.000    -.0001583   -.0001402
             |
        male |
       Male  |  -.0676695   .0012993   -52.08   0.000    -.0702161   -.0651229
 1.eth_asian |   .0559875   .0020319    27.55   0.000      .052005    .0599701
1.eth_hisp~c |  -.0297107    .001782   -16.67   0.000    -.0332035    -.026218
 1.eth_black |  -.0001945   .0035885    -0.05   0.957    -.0072279     .006839
 1.eth_other |  -.0123071    .003861    -3.19   0.001    -.0198746   -.0047397
             |
econ_disad~e |
Economic ..  |  -.0686687   .0015103   -45.47   0.000    -.0716288   -.0657086
             |
limited_en~f |
Limited E..  |  -.0497767   .0034706   -14.34   0.000     -.056579   -.0429744
             |
    disabled |
   Disabled  |  -.0175381   .0033917    -5.17   0.000    -.0241856   -.0108905
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0811937   .0025528    31.81   0.000     .0761902    .0861971
       2016  |   .0719307    .002491    28.88   0.000     .0670484    .0768129
       2017  |    .074364   .0026417    28.15   0.000     .0691864    .0795416
       2018  |   .0713949   .0032906    21.70   0.000     .0649454    .0778444
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0183052   .0013517   -13.54   0.000    -.0209544   -.0156559
       2016  |  -.0226519   .0013547   -16.72   0.000    -.0253071   -.0199967
       2017  |   -.011981    .001412    -8.49   0.000    -.0147484   -.0092136
       2018  |  -.0133124   .0014085    -9.45   0.000     -.016073   -.0105518
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.000561   .0006108    -0.92   0.358    -.0017582    .0006362
       2016  |   .0012112   .0005613     2.16   0.031      .000111    .0023114
       2017  |  -.0018928   .0005577    -3.39   0.001     -.002986   -.0007997
       2018  |  -.0047795   .0009243    -5.17   0.000    -.0065912   -.0029679
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0566758   .0025398    22.32   0.000      .051698    .0616537
       2016  |   .0631053   .0025829    24.43   0.000     .0580428    .0681677
       2017  |   .0582672   .0027161    21.45   0.000     .0529437    .0635906
       2018  |   .0889956   .0033083    26.90   0.000     .0825114    .0954799
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0118834   .0016955    -7.01   0.000    -.0152066   -.0085602
       2016  |  -.0155047   .0016533    -9.38   0.000    -.0187451   -.0122643
       2017  |  -.0133682   .0017406    -7.68   0.000    -.0167797   -.0099568
       2018  |  -.0028613   .0013786    -2.08   0.038    -.0055633   -.0001593
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0004253   .0006877    -0.62   0.536    -.0017731    .0009226
       2016  |   .0006362     .00073     0.87   0.384    -.0007946     .002067
       2017  |   .0000166   .0007332     0.02   0.982    -.0014205    .0014536
       2018  |   -.007031   .0009085    -7.74   0.000    -.0088116   -.0052503
             |
       _cons |   1.721146   .0281718    61.09   0.000      1.66593    1.776362
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_og.ster saved
Standard deviations: total, classes, students, teachers same year
.41799251 .07930353 .41040065 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0052947343   .6470484039          3445  |
  2 |  .0044305046   .5609940705          2240  |
  3 |  .0037898405   .4978511877          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0052947343  |
  2 |  .0044305046  |
  3 |  .0044305046  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =    3831.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0234
                                                Root MSE          =     .41287

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
    enr_r_og | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_enr_og |   1.060904   .0171392    61.90   0.000     1.027279    1.094529
       _cons |  -.0018621   .0003807    -4.89   0.000     -.002609   -.0011152
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(43, 433269)   =   1431.56
       Model |  10690.0214        43  248.605148   Prob > F        =    0.0000
    Residual |   75241.687   433,269  .173660444   R-squared       =    0.1244
-------------+----------------------------------   Adj R-squared   =    0.1243
       Total |  85931.7083   433,312  .198313705   Root MSE        =    .41673

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0082433   .0025229     3.27   0.001     .0032984    .0131882
       2017  |  -.0158179   .0025363    -6.24   0.000    -.0207889   -.0108469
       2018  |  -.0271906   .0025646   -10.60   0.000    -.0322172   -.0221639
             |
         age |  -.0001539   4.59e-06   -33.51   0.000    -.0001629   -.0001449
             |
        male |
       Male  |  -.0687376   .0012956   -53.05   0.000     -.071277   -.0661981
 1.eth_asian |   .0477829   .0022882    20.88   0.000      .043298    .0522677
1.eth_hisp~c |  -.0023709   .0019763    -1.20   0.230    -.0062444    .0015026
 1.eth_black |   .0263682   .0037573     7.02   0.000     .0190041    .0337324
 1.eth_other |  -.0097244   .0038639    -2.52   0.012    -.0172976   -.0021512
             |
econ_disad~e |
Economic ..  |  -.0414402    .001613   -25.69   0.000    -.0446017   -.0382788
             |
limited_en~f |
Limited E..  |  -.0499151   .0034613   -14.42   0.000    -.0566992    -.043131
             |
    disabled |
   Disabled  |  -.0268962   .0033865    -7.94   0.000    -.0335336   -.0202587
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0756169   .0025478    29.68   0.000     .0706232    .0806106
       2016  |   .0664225   .0024863    26.72   0.000     .0615495    .0712955
       2017  |   .0675111   .0026374    25.60   0.000     .0623419    .0726804
       2018  |   .0675218   .0032819    20.57   0.000     .0610894    .0739543
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0183999   .0013479   -13.65   0.000    -.0210417   -.0157582
       2016  |   -.022699   .0013509   -16.80   0.000    -.0253468   -.0200513
       2017  |  -.0122056    .001408    -8.67   0.000    -.0149653   -.0094459
       2018  |  -.0128909   .0014043    -9.18   0.000    -.0156434   -.0101384
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0004542    .000609    -0.75   0.456    -.0016479    .0007394
       2016  |    .001224   .0005597     2.19   0.029     .0001271    .0023209
       2017  |  -.0016579   .0005561    -2.98   0.003    -.0027479    -.000568
       2018  |  -.0048119   .0009215    -5.22   0.000    -.0066181   -.0030058
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0553293   .0025324    21.85   0.000     .0503657    .0602928
       2016  |   .0618222   .0025754    24.01   0.000     .0567745    .0668698
       2017  |   .0576098   .0027082    21.27   0.000     .0523018    .0629178
       2018  |   .0851022   .0032995    25.79   0.000     .0786353    .0915691
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0115685   .0016908    -6.84   0.000    -.0148825   -.0082545
       2016  |   -.015175   .0016486    -9.20   0.000    -.0184062   -.0119438
       2017  |  -.0135136   .0017354    -7.79   0.000     -.016915   -.0101122
       2018  |    -.00414    .001375    -3.01   0.003     -.006835    -.001445
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0006807   .0006857    -0.99   0.321    -.0020246    .0006632
       2016  |   .0004304   .0007278     0.59   0.554    -.0009961     .001857
       2017  |  -.0001139    .000731    -0.16   0.876    -.0015466    .0013188
       2018  |   -.007337   .0009059    -8.10   0.000    -.0091125   -.0055614
             |
eth_asian_~t |   .0006532   .0000483    13.52   0.000     .0005585    .0007479
eth_hispan~t |  -.0003596    .000048    -7.49   0.000    -.0004537   -.0002654
eth_black_~t |  -.0011749   .0000891   -13.19   0.000    -.0013495   -.0010002
educ_hs_dr~p |  -.3131407   .1289904    -2.43   0.015    -.5659579   -.0603234
educ~us_prop |   .7060729   .1176986     6.00   0.000     .4753872    .9367587
pov_fam_ch~t |  -.0005161   .0000735    -7.02   0.000    -.0006602   -.0003721
inc_medi~_hh |   4.75e-07   3.34e-08    14.21   0.000     4.10e-07    5.41e-07
       _cons |   1.705141   .0283653    60.11   0.000     1.649546    1.760736
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_acs.ster saved
Standard deviations: total, classes, students, teachers same year
.41672586 .07576588 .4097804 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0047230319   .6211796298          3445  |
  2 |   .003876107   .5263430594          2240  |
  3 |  .0033710667    .469764882          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0047230319  |
  2 |   .003876107  |
  3 |   .003876107  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =    2977.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0204
                                                Root MSE          =     .41225

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_r_acs | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_enr_acs |   1.076636   .0197321    54.56   0.000     1.037925    1.115348
       _cons |   -.001414   .0003823    -3.70   0.000    -.0021641    -.000664
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_acs.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =     151.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0364
                                                Root MSE          =     .03196

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d_og~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_enr_og |   .1030607   .0083679    12.32   0.000     .0866441    .1194774
       _cons |  -.0001929   .0006978    -0.28   0.782    -.0015619    .0011762
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_acs_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(38, 433274)   =   1557.46
       Model |  10327.2617        38  271.770046   Prob > F        =    0.0000
    Residual |  75604.4466   433,274  .174495692   R-squared       =    0.1202
-------------+----------------------------------   Adj R-squared   =    0.1201
       Total |  85931.7083   433,312  .198313705   Root MSE        =    .41773

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0076296   .0025276     3.02   0.003     .0026756    .0125836
       2017  |  -.0167221   .0025363    -6.59   0.000    -.0216931    -.011751
       2018  |  -.0300865    .002559   -11.76   0.000     -.035102   -.0250709
             |
         age |  -.0001471   4.60e-06   -31.99   0.000    -.0001561   -.0001381
             |
        male |
       Male  |   -.067719   .0012985   -52.15   0.000     -.070264    -.065174
 1.eth_asian |   .0546945   .0020315    26.92   0.000     .0507127    .0586762
1.eth_hisp~c |  -.0295205   .0017813   -16.57   0.000    -.0330119   -.0260291
 1.eth_black |  -.0002575   .0035863    -0.07   0.943    -.0072865    .0067714
 1.eth_other |  -.0116744   .0038587    -3.03   0.002    -.0192373   -.0041116
             |
econ_disad~e |
Economic ..  |  -.0690944   .0015096   -45.77   0.000     -.072053   -.0661357
             |
limited_en~f |
Limited E..  |   -.049694   .0034684   -14.33   0.000     -.056492    -.042896
             |
    disabled |
   Disabled  |  -.0168538   .0033896    -4.97   0.000    -.0234974   -.0102102
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0811033   .0025514    31.79   0.000     .0761027    .0861038
       2016  |   .0719927   .0024896    28.92   0.000     .0671132    .0768722
       2017  |   .0745858   .0026404    28.25   0.000     .0694107    .0797609
       2018  |   .0710509   .0032887    21.60   0.000     .0646051    .0774966
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0182362   .0013508   -13.50   0.000    -.0208838   -.0155886
       2016  |  -.0225335   .0013539   -16.64   0.000    -.0251871   -.0198799
       2017  |  -.0117588   .0014111    -8.33   0.000    -.0145246    -.008993
       2018  |   -.013267   .0014076    -9.43   0.000    -.0160259   -.0105082
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0005253   .0006105    -0.86   0.389    -.0017218    .0006712
       2016  |   .0012083    .000561     2.15   0.031     .0001088    .0023078
       2017  |  -.0019164   .0005574    -3.44   0.001    -.0030089   -.0008239
       2018  |  -.0046567   .0009237    -5.04   0.000    -.0064672   -.0028462
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0560248   .0025384    22.07   0.000     .0510497    .0609999
       2016  |   .0620934   .0025817    24.05   0.000     .0570334    .0671535
       2017  |   .0574034   .0027147    21.15   0.000     .0520827    .0627241
       2018  |   .0881019   .0033067    26.64   0.000     .0816209    .0945829
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0117653   .0016945    -6.94   0.000    -.0150864   -.0084442
       2016  |  -.0154419   .0016523    -9.35   0.000    -.0186803   -.0122035
       2017  |   -.013368   .0017395    -7.69   0.000    -.0167773   -.0099588
       2018  |  -.0027008   .0013778    -1.96   0.050    -.0054014   -3.27e-07
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0003968   .0006873    -0.58   0.564    -.0017438    .0009502
       2016  |   .0007332   .0007296     1.01   0.315    -.0006967    .0021631
       2017  |   .0000968   .0007327     0.13   0.895    -.0013393    .0015329
       2018  |  -.0068705   .0009079    -7.57   0.000      -.00865   -.0050909
             |
1.has_~2year |   .0193456   .0025059     7.72   0.000     .0144342    .0242571
1.has_~4year |   .0587273   .0027061    21.70   0.000     .0534235    .0640311
       _cons |   1.704137   .0281648    60.51   0.000     1.648935     1.75934
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_sib.ster saved
Standard deviations: total, classes, students, teachers same year
.41772682 .07909487 .41017032 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0052672265   .6465161824          3445  |
  2 |  .0044060826   .5603988327          2240  |
  3 |  .0037610667   .4965062514          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0052672265  |
  2 |  .0044060826  |
  3 |  .0044060826  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =    3825.59
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0233
                                                Root MSE          =     .41263

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
   enr_r_sib | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_enr_sib |   1.060337   .0171433    61.85   0.000     1.026704     1.09397
       _cons |  -.0018323   .0003805    -4.82   0.000    -.0025788   -.0010858
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_sib.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =      16.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0001
                                                Root MSE          =     .01493

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d_og~b | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_enr_og |   .0026713   .0006537     4.09   0.000     .0013888    .0039538
       _cons |  -4.31e-06   .0000478    -0.09   0.928    -.0000981    .0000895
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_sib_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(45, 433267)   =   1382.15
       Model |  10787.2162        45  239.715915   Prob > F        =    0.0000
    Residual |  75144.4922   433,267  .173436916   R-squared       =    0.1255
-------------+----------------------------------   Adj R-squared   =    0.1254
       Total |  85931.7083   433,312  .198313705   Root MSE        =    .41646

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0076925   .0025215     3.05   0.002     .0027505    .0126345
       2017  |    -.01706   .0025353    -6.73   0.000    -.0220292   -.0120908
       2018  |  -.0289301   .0025647   -11.28   0.000    -.0339568   -.0239033
             |
         age |  -.0001517   4.59e-06   -33.04   0.000    -.0001607   -.0001427
             |
        male |
       Male  |  -.0687889   .0012948   -53.13   0.000    -.0713267   -.0662511
 1.eth_asian |   .0463269   .0022876    20.25   0.000     .0418432    .0508106
1.eth_hisp~c |  -.0021178   .0019754    -1.07   0.284    -.0059895    .0017539
 1.eth_black |   .0263201   .0037548     7.01   0.000     .0189607    .0336795
 1.eth_other |  -.0091372   .0038615    -2.37   0.018    -.0167056   -.0015687
             |
econ_disad~e |
Economic ..  |  -.0419063   .0016121   -25.99   0.000     -.045066   -.0387465
             |
limited_en~f |
Limited E..  |  -.0498473   .0034591   -14.41   0.000     -.056627   -.0430675
             |
    disabled |
   Disabled  |  -.0262263   .0033845    -7.75   0.000    -.0328597   -.0195928
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0755157   .0025464    29.66   0.000     .0705249    .0805065
       2016  |   .0664799   .0024849    26.75   0.000     .0616096    .0713501
       2017  |   .0677461   .0026361    25.70   0.000     .0625793    .0729128
       2018  |   .0671886     .00328    20.48   0.000       .06076    .0736172
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0183235    .001347   -13.60   0.000    -.0209636   -.0156834
       2016  |  -.0225727   .0013501   -16.72   0.000    -.0252188   -.0199266
       2017  |  -.0119725   .0014072    -8.51   0.000    -.0147305   -.0092144
       2018  |  -.0128381   .0014034    -9.15   0.000    -.0155888   -.0100874
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0004187   .0006086    -0.69   0.491    -.0016116    .0007741
       2016  |   .0012207   .0005593     2.18   0.029     .0001244    .0023169
       2017  |  -.0016844   .0005558    -3.03   0.002    -.0027737   -.0005952
       2018  |  -.0046885    .000921    -5.09   0.000    -.0064936   -.0028835
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0546887    .002531    21.61   0.000      .049728    .0596494
       2016  |   .0608188   .0025741    23.63   0.000     .0557735     .065864
       2017  |   .0567599   .0027068    20.97   0.000     .0514547    .0620651
       2018  |   .0842139   .0032978    25.54   0.000     .0777502    .0906775
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0114385   .0016898    -6.77   0.000    -.0147504   -.0081265
       2016  |  -.0151039   .0016476    -9.17   0.000    -.0183331   -.0118748
       2017  |  -.0135074   .0017343    -7.79   0.000    -.0169066   -.0101082
       2018  |  -.0039687   .0013742    -2.89   0.004    -.0066622   -.0012753
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0006555   .0006852    -0.96   0.339    -.0019986    .0006875
       2016  |   .0005261   .0007274     0.72   0.470    -.0008996    .0019517
       2017  |  -.0000349   .0007305    -0.05   0.962    -.0014667    .0013969
       2018  |  -.0071751   .0009053    -7.93   0.000    -.0089496   -.0054007
             |
1.has_~2year |   .0202015   .0024991     8.08   0.000     .0153034    .0250996
1.has_~4year |   .0585877   .0026991    21.71   0.000     .0532976    .0638778
eth_asian_~t |   .0006611   .0000483    13.69   0.000     .0005665    .0007557
eth_hispan~t |  -.0003627    .000048    -7.56   0.000    -.0004568   -.0002687
eth_black_~t |  -.0011835   .0000891   -13.29   0.000     -.001358   -.0010089
educ_hs_dr~p |  -.3375843    .128912    -2.62   0.009    -.5902479   -.0849207
educ~us_prop |   .7440957    .117647     6.32   0.000     .5135112    .9746801
pov_fam_ch~t |  -.0005168   .0000735    -7.04   0.000    -.0006608   -.0003729
inc_medi~_hh |   4.58e-07   3.34e-08    13.70   0.000     3.92e-07    5.23e-07
       _cons |    1.68899   .0283576    59.56   0.000      1.63341     1.74457
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_both.ster saved
Standard deviations: total, classes, students, teachers same year
.41645758 .07549254 .40955805 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0046866199   .6200224248          3445  |
  2 |  .0038429403   .5249523496          2240  |
  3 |  .0033350788   .4676491674          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0046866199  |
  2 |  .0038429403  |
  3 |  .0038429403  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =    2951.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0203
                                                Root MSE          =     .41201

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
  enr_r_both | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 va_enr_both |   1.076392   .0198141    54.32   0.000     1.037519    1.115264
       _cons |  -.0013836   .0003824    -3.62   0.000    -.0021338   -.0006335
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_both.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =      38.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .01498

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d_ac~h | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_enr_acs |   .0042659    .000687     6.21   0.000     .0029182    .0056136
       _cons |  -5.73e-06    .000046    -0.12   0.901    -.0000959    .0000844
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_sib_acs.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =     154.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0372
                                                Root MSE          =     .03197

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d_si~h | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  va_enr_sib |   .1046008   .0084121    12.43   0.000     .0880975    .1211041
       _cons |  -.0001932   .0006959    -0.28   0.781    -.0015585    .0011721
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_acs_sib.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/o
    > utcome_va/va_enr_sib_acs.dta saved
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(36, 433276)   =    675.04
       Model |  5306.03575        36  147.389882   Prob > F        =    0.0000
    Residual |   94602.849   433,276  .218343155   R-squared       =    0.0531
-------------+----------------------------------   Adj R-squared   =    0.0530
       Total |  99908.8848   433,312  .230570316   Root MSE        =    .46727

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |  -.0088359   .0028272    -3.13   0.002    -.0143771   -.0032947
       2017  |  -.0363714   .0028363   -12.82   0.000    -.0419305   -.0308123
       2018  |  -.0109105   .0028607    -3.81   0.000    -.0165173   -.0053037
             |
         age |  -.0000738   5.14e-06   -14.35   0.000    -.0000839   -.0000637
             |
        male |
       Male  |   .0220021   .0014525    15.15   0.000     .0191552    .0248489
 1.eth_asian |  -.0106871   .0022715    -4.70   0.000    -.0151391    -.006235
1.eth_hisp~c |  -.0068894   .0019921    -3.46   0.001    -.0107939   -.0029848
 1.eth_black |  -.0380581   .0040116    -9.49   0.000    -.0459208   -.0301955
 1.eth_other |   .0019439   .0043162     0.45   0.652    -.0065158    .0104035
             |
econ_disad~e |
Economic ..  |  -.0255885   .0016883   -15.16   0.000    -.0288976   -.0222794
             |
limited_en~f |
Limited E..  |   -.024987   .0038798    -6.44   0.000    -.0325913   -.0173827
             |
    disabled |
   Disabled  |   .0300342   .0037915     7.92   0.000     .0226029    .0374654
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0601664   .0028538   -21.08   0.000    -.0657597   -.0545731
       2016  |  -.0561431   .0027846   -20.16   0.000    -.0616009   -.0506853
       2017  |  -.0519468   .0029531   -17.59   0.000    -.0577348   -.0461588
       2018  |  -.0265222   .0036786    -7.21   0.000    -.0337321   -.0193123
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0421198    .001511   -27.87   0.000    -.0450814   -.0391582
       2016  |  -.0408507   .0015144   -26.97   0.000    -.0438189   -.0378825
       2017  |  -.0312781   .0015784   -19.82   0.000    -.0343718   -.0281844
       2018  |   -.032296   .0015745   -20.51   0.000     -.035382   -.0292099
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    .010949   .0006828    16.03   0.000     .0096107    .0122874
       2016  |   .0107743   .0006275    17.17   0.000     .0095444    .0120042
       2017  |   .0083567   .0006235    13.40   0.000     .0071346    .0095787
       2018  |   .0042262   .0010333     4.09   0.000      .002201    .0062514
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0656131   .0028392   -23.11   0.000    -.0711779   -.0600484
       2016  |  -.0661042   .0028874   -22.89   0.000    -.0717635   -.0604449
       2017  |  -.0668462   .0030363   -22.02   0.000    -.0727973   -.0608952
       2018  |  -.0559496   .0036984   -15.13   0.000    -.0631983   -.0487009
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0297278   .0018954   -15.68   0.000    -.0334428   -.0260128
       2016  |  -.0338607   .0018482   -18.32   0.000    -.0374832   -.0302383
       2017  |  -.0267713   .0019458   -13.76   0.000     -.030585   -.0229577
       2018  |  -.0360725   .0015411   -23.41   0.000    -.0390931    -.033052
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0097408   .0007688    12.67   0.000      .008234    .0112476
       2016  |   .0115107   .0008161    14.11   0.000     .0099112    .0131101
       2017  |   .0093169   .0008196    11.37   0.000     .0077105    .0109234
       2018  |   .0021713   .0010156     2.14   0.033     .0001807    .0041618
             |
       _cons |    .911522   .0314931    28.94   0.000     .8497964    .9732475
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_og.ster saved
Standard deviations: total, classes, students, teachers same year
.46727204 .09867961 .4567335 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |   .009177939   .7460293792          3445  |
  2 |  .0083226199   .6822244309          2240  |
  3 |  .0074436809   .6297817764          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |   .009177939  |
  2 |  .0083226199  |
  3 |  .0083226199  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =   14462.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0354
                                                Root MSE          =     .45889

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2year_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye~g |   .9879006   .0082147   120.26   0.000     .9717843    1.004017
       _cons |  -.0011909   .0003926    -3.03   0.002    -.0019611   -.0004207
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(43, 433269)   =    649.04
       Model |  6046.06394        43  140.606138   Prob > F        =    0.0000
    Residual |  93862.8208   433,269  .216638672   R-squared       =    0.0605
-------------+----------------------------------   Adj R-squared   =    0.0604
       Total |  99908.8848   433,312  .230570316   Root MSE        =    .46544

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |  -.0066825   .0028179    -2.37   0.018    -.0122054   -.0011595
       2017  |  -.0336715   .0028328   -11.89   0.000    -.0392237   -.0281194
       2018  |  -.0077949   .0028645    -2.72   0.007    -.0134092   -.0021806
             |
         age |  -.0000736   5.13e-06   -14.35   0.000    -.0000837   -.0000636
             |
        male |
       Male  |   .0211803   .0014471    14.64   0.000      .018344    .0240166
 1.eth_asian |  -.0223999   .0025557    -8.76   0.000     -.027409   -.0173907
1.eth_hisp~c |   .0118743   .0022073     5.38   0.000      .007548    .0162006
 1.eth_black |  -.0141867   .0041965    -3.38   0.001    -.0224118   -.0059617
 1.eth_other |   .0004198   .0043157     0.10   0.923    -.0080388    .0088783
             |
econ_disad~e |
Economic ..  |   -.018186   .0018016   -10.09   0.000     -.021717   -.0146549
             |
limited_en~f |
Limited E..  |  -.0264173    .003866    -6.83   0.000    -.0339945   -.0188401
             |
    disabled |
   Disabled  |   .0262886   .0037824     6.95   0.000     .0188752     .033702
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0634038   .0028457   -22.28   0.000    -.0689813   -.0578263
       2016  |  -.0592668   .0027769   -21.34   0.000    -.0647096   -.0538241
       2017  |  -.0542546   .0029458   -18.42   0.000    -.0600282   -.0484809
       2018  |  -.0281332   .0036656    -7.67   0.000    -.0353177   -.0209487
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0407432   .0015054   -27.06   0.000    -.0436938   -.0377926
       2016  |  -.0394397   .0015088   -26.14   0.000    -.0423969   -.0364824
       2017  |  -.0296691   .0015726   -18.87   0.000    -.0327514   -.0265868
       2018  |  -.0311738   .0015685   -19.87   0.000    -.0342481   -.0280996
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0109277   .0006802    16.07   0.000     .0095946    .0122609
       2016  |    .010754   .0006251    17.20   0.000     .0095288    .0119791
       2017  |   .0082386   .0006211    13.26   0.000     .0070212    .0094559
       2018  |   .0043686   .0010293     4.24   0.000     .0023513     .006386
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0645901   .0028285   -22.84   0.000    -.0701339   -.0590463
       2016  |  -.0651449   .0028765   -22.65   0.000    -.0707827   -.0595072
       2017  |  -.0655069   .0030248   -21.66   0.000    -.0714354   -.0595783
       2018  |  -.0575899   .0036852   -15.63   0.000    -.0648129    -.050367
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0274338   .0018885   -14.53   0.000    -.0311352   -.0237324
       2016  |   -.032047   .0018414   -17.40   0.000     -.035656    -.028438
       2017  |  -.0257249   .0019383   -13.27   0.000    -.0295239   -.0219258
       2018  |  -.0348421   .0015358   -22.69   0.000    -.0378521    -.031832
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0091231   .0007658    11.91   0.000      .007622    .0106241
       2016  |   .0110526   .0008129    13.60   0.000     .0094593    .0126459
       2017  |   .0090554   .0008164    11.09   0.000     .0074552    .0106556
       2018  |   .0025951   .0010118     2.56   0.010      .000612    .0045783
             |
eth_asian_~t |   .0006855    .000054    12.71   0.000     .0005797    .0007912
eth_hispan~t |  -.0010317   .0000536   -19.23   0.000    -.0011368   -.0009266
eth_black_~t |  -.0025273   .0000995   -25.39   0.000    -.0027223   -.0023322
educ_hs_dr~p |  -2.116527   .1440705   -14.69   0.000    -2.398901   -1.834153
educ~us_prop |  -1.820992   .1314586   -13.85   0.000    -2.078647   -1.563337
pov_fam_ch~t |  -.0012909   .0000821   -15.72   0.000    -.0014517     -.00113
inc_medi~_hh |  -1.21e-06   3.73e-08   -32.40   0.000    -1.28e-06   -1.14e-06
       _cons |   1.078872   .0316814    34.05   0.000     1.016778    1.140967
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_acs.ster saved
Standard deviations: total, classes, students, teachers same year
.4654446 .08840514 .45697177 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0071757742   .6946978631          3445  |
  2 |  .0063409202   .6170295848          2240  |
  3 |  .0056062251   .5595532151          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0071757742  |
  2 |  .0063409202  |
  3 |  .0063409202  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =    9576.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0269
                                                Root MSE          =      .4591

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2year_~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye~s |   .9927638   .0101449    97.86   0.000     .9728609    1.012667
       _cons |  -.0011852   .0004174    -2.84   0.005    -.0020041   -.0003664
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_acs.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =     257.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0992
                                                Root MSE          =     .03922

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2y~g_acs | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye~g |   .1461538   .0091099    16.04   0.000     .1282814    .1640263
       _cons |  -.0002107   .0008049    -0.26   0.794    -.0017898    .0013684
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_acs_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(38, 433274)   =    694.96
       Model |  5739.70404        38  151.044843   Prob > F        =    0.0000
    Residual |  94169.1807   433,274  .217343253   R-squared       =    0.0574
-------------+----------------------------------   Adj R-squared   =    0.0574
       Total |  99908.8848   433,312  .230570316   Root MSE        =     .4662

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |  -.0091682   .0028209    -3.25   0.001     -.014697   -.0036393
       2017  |  -.0369478   .0028306   -13.05   0.000    -.0424957   -.0313999
       2018  |   -.012608    .002856    -4.41   0.000    -.0182056   -.0070104
             |
         age |  -.0000733   5.13e-06   -14.28   0.000    -.0000833   -.0000632
             |
        male |
       Male  |   .0221835   .0014492    15.31   0.000     .0193431    .0250238
 1.eth_asian |  -.0110293   .0022673    -4.86   0.000    -.0154731   -.0065855
1.eth_hisp~c |  -.0088319   .0019881    -4.44   0.000    -.0127285   -.0049354
 1.eth_black |  -.0382803   .0040024    -9.56   0.000    -.0461249   -.0304357
 1.eth_other |   .0012966   .0043064     0.30   0.763    -.0071438    .0097371
             |
econ_disad~e |
Economic ..  |  -.0262682   .0016847   -15.59   0.000    -.0295702   -.0229662
             |
limited_en~f |
Limited E..  |  -.0256491   .0038709    -6.63   0.000     -.033236   -.0180622
             |
    disabled |
   Disabled  |   .0302117    .003783     7.99   0.000     .0227971    .0376262
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0587672   .0028474   -20.64   0.000    -.0643481   -.0531864
       2016  |  -.0546605   .0027785   -19.67   0.000    -.0601062   -.0492147
       2017  |  -.0498938   .0029468   -16.93   0.000    -.0556694   -.0441182
       2018  |  -.0249624   .0036703    -6.80   0.000    -.0321561   -.0177687
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0417928   .0015076   -27.72   0.000    -.0447476   -.0388379
       2016  |  -.0405008    .001511   -26.80   0.000    -.0434623   -.0375393
       2017  |  -.0310181   .0015749   -19.70   0.000    -.0341048   -.0279314
       2018  |  -.0320836   .0015709   -20.42   0.000    -.0351626   -.0290046
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0107811   .0006813    15.82   0.000     .0094457    .0121164
       2016  |   .0106225   .0006261    16.97   0.000     .0093954    .0118496
       2017  |   .0081665   .0006221    13.13   0.000     .0069472    .0093858
       2018  |   .0040396   .0010309     3.92   0.000      .002019    .0060602
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0644419   .0028329   -22.75   0.000    -.0699943   -.0588894
       2016  |  -.0645777   .0028813   -22.41   0.000     -.070225   -.0589305
       2017  |  -.0653849   .0030297   -21.58   0.000     -.071323   -.0594468
       2018  |  -.0535092   .0036904   -14.50   0.000    -.0607422   -.0462761
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0295248   .0018911   -15.61   0.000    -.0332313   -.0258183
       2016  |  -.0335673    .001844   -18.20   0.000    -.0371815   -.0299531
       2017  |  -.0265601   .0019413   -13.68   0.000     -.030365   -.0227552
       2018  |  -.0353967   .0015377   -23.02   0.000    -.0384106   -.0323829
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0096388    .000767    12.57   0.000     .0081355    .0111421
       2016  |   .0113375   .0008142    13.92   0.000     .0097417    .0129334
       2017  |   .0091954   .0008178    11.24   0.000     .0075926    .0107982
       2018  |   .0019474   .0010133     1.92   0.055    -.0000387    .0039334
             |
1.has_~2year |   .1014943   .0027967    36.29   0.000      .096013    .1069757
1.has_~4year |  -.0852628   .0030201   -28.23   0.000    -.0911821   -.0793435
       _cons |   .9071638   .0314331    28.86   0.000     .8455559    .9687718
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_sib.ster saved
Standard deviations: total, classes, students, teachers same year
.46620087 .0968756 .45602453 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |   .008833778    .739436961          3445  |
  2 |  .0079856748   .6742992091          2240  |
  3 |  .0071244185   .6215851946          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |   .008833778  |
  2 |  .0079856748  |
  3 |  .0079856748  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =   13781.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0341
                                                Root MSE          =     .45815

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2year_~b | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye~b |   .9884735   .0084201   117.39   0.000     .9719544    1.004993
       _cons |  -.0012233    .000393    -3.11   0.002    -.0019943   -.0004523
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_sib.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =     517.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0030
                                                Root MSE          =     .03159

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2y~g_sib | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye~g |   .0194547   .0008554    22.74   0.000     .0177767    .0211328
       _cons |   -.000022    .000073    -0.30   0.763    -.0001651    .0001212
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_sib_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(45, 433267)   =    664.47
       Model |  6449.94981        45  143.332218   Prob > F        =    0.0000
    Residual |   93458.935   433,267  .215707485   R-squared       =    0.0646
-------------+----------------------------------   Adj R-squared   =    0.0645
       Total |  99908.8848   433,312  .230570316   Root MSE        =    .46444

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |  -.0070702    .002812    -2.51   0.012    -.0125816   -.0015587
       2017  |  -.0343355   .0028275   -12.14   0.000    -.0398772   -.0287937
       2018  |  -.0095491   .0028602    -3.34   0.001     -.015155   -.0039432
             |
         age |  -.0000732   5.12e-06   -14.29   0.000    -.0000832   -.0000631
             |
        male |
       Male  |   .0213554    .001444    14.79   0.000     .0185251    .0241856
 1.eth_asian |  -.0223847   .0025512    -8.77   0.000     -.027385   -.0173844
1.eth_hisp~c |   .0100271    .002203     4.55   0.000     .0057092    .0143449
 1.eth_black |  -.0144426   .0041875    -3.45   0.001    -.0226499   -.0062352
 1.eth_other |  -.0000547   .0043065    -0.01   0.990    -.0084952    .0083859
             |
econ_disad~e |
Economic ..  |  -.0185921   .0017979   -10.34   0.000    -.0221159   -.0150683
             |
limited_en~f |
Limited E..  |  -.0270107   .0038577    -7.00   0.000    -.0345716   -.0194497
             |
    disabled |
   Disabled  |   .0264214   .0037744     7.00   0.000     .0190237    .0338192
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0620657   .0028398   -21.86   0.000    -.0676315   -.0564998
       2016  |  -.0578482   .0027712   -20.87   0.000    -.0632797   -.0524168
       2017  |  -.0523134   .0029399   -17.79   0.000    -.0580754   -.0465513
       2018  |  -.0266553   .0036579    -7.29   0.000    -.0338247    -.019486
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0404578   .0015022   -26.93   0.000    -.0434021   -.0375135
       2016  |  -.0391309   .0015056   -25.99   0.000    -.0420819   -.0361799
       2017  |   -.029453   .0015693   -18.77   0.000    -.0325288   -.0263772
       2018  |  -.0309882   .0015652   -19.80   0.000    -.0340559   -.0279206
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0107681   .0006787    15.86   0.000     .0094377    .0120984
       2016  |   .0106082   .0006238    17.01   0.000     .0093857    .0118307
       2017  |   .0080601   .0006198    13.00   0.000     .0068453    .0092749
       2018  |   .0041865   .0010271     4.08   0.000     .0021735    .0061995
             |
        year#|
          c. |
prior_math~e |
       2015  |   -.063519   .0028226   -22.50   0.000    -.0690513   -.0579867
       2016  |  -.0637329   .0028707   -22.20   0.000    -.0693595   -.0581064
       2017  |  -.0641532   .0030187   -21.25   0.000    -.0700696   -.0582367
       2018  |  -.0552669   .0036778   -15.03   0.000    -.0624753   -.0480585
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0272803   .0018845   -14.48   0.000    -.0309738   -.0235868
       2016  |  -.0317962   .0018374   -17.30   0.000    -.0353975   -.0281949
       2017  |  -.0255454   .0019341   -13.21   0.000    -.0293363   -.0217545
       2018  |   -.034228   .0015326   -22.33   0.000    -.0372318   -.0312242
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090354   .0007642    11.82   0.000     .0075376    .0105333
       2016  |   .0108946   .0008112    13.43   0.000     .0093047    .0124845
       2017  |   .0089439   .0008147    10.98   0.000     .0073471    .0105407
       2018  |   .0023692   .0010097     2.35   0.019     .0003903    .0043481
             |
1.has_~2year |   .0987736    .002787    35.44   0.000     .0933112     .104236
1.has_~4year |  -.0811922   .0030101   -26.97   0.000    -.0870919   -.0752925
eth_asian_~t |   .0006699   .0000538    12.44   0.000     .0005644    .0007754
eth_hispan~t |  -.0010112   .0000535   -18.89   0.000    -.0011162   -.0009063
eth_black_~t |  -.0024909   .0000993   -25.08   0.000    -.0026856   -.0022963
educ_hs_dr~p |  -2.086824   .1437657   -14.52   0.000      -2.3686   -1.805047
educ~us_prop |   -1.75916   .1312026   -13.41   0.000    -2.016313   -1.502007
pov_fam_ch~t |  -.0012668   .0000819   -15.47   0.000    -.0014274   -.0011063
inc_medi~_hh |  -1.18e-06   3.73e-08   -31.53   0.000    -1.25e-06   -1.10e-06
       _cons |   1.070388    .031625    33.85   0.000     1.008404    1.132373
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_both.ster saved
Standard deviations: total, classes, students, teachers same year
.4644432 .08687414 .45624595 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0069181974   .6877463941          3445  |
  2 |  .0060912743    .608843009          2240  |
  3 |  .0053734278   .5515214675          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0069181974  |
  2 |  .0060912743  |
  3 |  .0060912743  |
    +---------------+
-------------------------------------------------------------------------------
note: label truncated to 80 characters

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =    9126.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0260
                                                Root MSE          =     .45834

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2year_~h | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye~h |   .9934111   .0103984    95.53   0.000     .9730108    1.013811
       _cons |  -.0012083   .0004177    -2.89   0.004    -.0020278   -.0003888
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_both.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =     385.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0023
                                                Root MSE          =      .0305

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2~s_both | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye~s |   .0189013   .0009629    19.63   0.000     .0170122    .0207905
       _cons |  -.0000208   .0000696    -0.30   0.766    -.0001574    .0001159
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_sib_acs.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =     256.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0980
                                                Root MSE          =     .03845

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2~b_both | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye~b |    .145408   .0090752    16.02   0.000     .1276037    .1632123
       _cons |  -.0002132   .0007862    -0.27   0.786    -.0017556    .0013292
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_acs_sib.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/o
    > utcome_va/va_enr_2year_sib_acs.dta saved
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(36, 433276)   =   3794.91
       Model |  24124.1901        36  670.116391   Prob > F        =    0.0000
    Residual |  76509.1332   433,276  .176582901   R-squared       =    0.2397
-------------+----------------------------------   Adj R-squared   =    0.2397
       Total |  100633.323   433,312  .232242179   Root MSE        =    .42022

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0170234   .0025425     6.70   0.000     .0120402    .0220066
       2017  |   .0208863   .0025507     8.19   0.000      .015887    .0258856
       2018  |  -.0174632   .0025726    -6.79   0.000    -.0225054    -.012421
             |
         age |  -.0000755   4.62e-06   -16.32   0.000    -.0000845   -.0000664
             |
        male |
       Male  |  -.0896716   .0013062   -68.65   0.000    -.0922318   -.0871114
 1.eth_asian |   .0666746   .0020428    32.64   0.000     .0626708    .0706783
1.eth_hisp~c |  -.0228213   .0017915   -12.74   0.000    -.0263327     -.01931
 1.eth_black |   .0378637   .0036076    10.50   0.000     .0307928    .0449345
 1.eth_other |   -.014251   .0038816    -3.67   0.000    -.0218588   -.0066432
             |
econ_disad~e |
Economic ..  |  -.0430801   .0015183   -28.37   0.000     -.046056   -.0401043
             |
limited_en~f |
Limited E..  |  -.0247897   .0034891    -7.10   0.000    -.0316282   -.0179512
             |
    disabled |
   Disabled  |  -.0475722   .0034097   -13.95   0.000    -.0542552   -.0408893
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1413601   .0025664    55.08   0.000       .13633    .1463901
       2016  |   .1280738   .0025042    51.14   0.000     .1231656     .132982
       2017  |   .1263107   .0026557    47.56   0.000     .1211056    .1315159
       2018  |   .0979171   .0033081    29.60   0.000     .0914332     .104401
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0238147   .0013589    17.53   0.000     .0211513     .026478
       2016  |   .0181988   .0013619    13.36   0.000     .0155295    .0208682
       2017  |   .0192971   .0014195    13.59   0.000      .016515    .0220793
       2018  |   .0189836    .001416    13.41   0.000     .0162083    .0217589
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    -.01151   .0006141   -18.74   0.000    -.0127136   -.0103064
       2016  |  -.0095631   .0005643   -16.95   0.000    -.0106692   -.0084571
       2017  |  -.0102495   .0005607   -18.28   0.000    -.0113485   -.0091505
       2018  |  -.0090058   .0009292    -9.69   0.000     -.010827   -.0071845
             |
        year#|
          c. |
prior_math~e |
       2015  |    .122289   .0025533    47.89   0.000     .1172846    .1272933
       2016  |   .1292095   .0025967    49.76   0.000     .1241201    .1342989
       2017  |   .1251134   .0027305    45.82   0.000     .1197616    .1304652
       2018  |   .1449453   .0033259    43.58   0.000     .1384265     .151464
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0178444   .0017046    10.47   0.000     .0145036    .0211853
       2016  |    .018356   .0016621    11.04   0.000     .0150983    .0216137
       2017  |   .0134031   .0017498     7.66   0.000     .0099735    .0168327
       2018  |   .0332113   .0013859    23.96   0.000     .0304949    .0359277
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0101661   .0006913   -14.70   0.000    -.0115211   -.0088111
       2016  |  -.0108745   .0007339   -14.82   0.000    -.0123129   -.0094361
       2017  |  -.0093004   .0007371   -12.62   0.000     -.010745   -.0078557
       2018  |  -.0092022   .0009133   -10.08   0.000    -.0109923   -.0074121
             |
       _cons |   .8096241   .0283218    28.59   0.000     .7541143    .8651339
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_og.ster saved
Standard deviations: total, classes, students, teachers same year
.42021768 .09076259 .41029874 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0078669166    .768767781          3445  |
  2 |  .0076120441   .7454761302          2240  |
  3 |   .007143041   .7126992407          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0078669166  |
  2 |  .0076120441  |
  3 |  .0076120441  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =   24862.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0392
                                                Root MSE          =     .41195

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4year_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye~g |   1.021422   .0064779   157.68   0.000     1.008713    1.034131
       _cons |   -.000353   .0002432    -1.45   0.147    -.0008301    .0001242
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(43, 433269)   =   3325.80
       Model |  24973.1998        43  580.772089   Prob > F        =    0.0000
    Residual |  75660.1234   433,269   .17462621   R-squared       =    0.2482
-------------+----------------------------------   Adj R-squared   =    0.2481
       Total |  100633.323   433,312  .232242179   Root MSE        =    .41788

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0149258   .0025299     5.90   0.000     .0099672    .0198844
       2017  |   .0178536   .0025433     7.02   0.000     .0128688    .0228384
       2018  |  -.0193957   .0025718    -7.54   0.000    -.0244362   -.0143551
             |
         age |  -.0000803   4.61e-06   -17.43   0.000    -.0000893   -.0000713
             |
        male |
       Male  |  -.0899179   .0012992   -69.21   0.000    -.0924643   -.0873714
 1.eth_asian |   .0701828   .0022946    30.59   0.000     .0656855    .0746801
1.eth_hisp~c |  -.0142452   .0019818    -7.19   0.000    -.0181294   -.0103609
 1.eth_black |    .040555   .0037677    10.76   0.000     .0331704    .0479395
 1.eth_other |  -.0101442   .0038747    -2.62   0.009    -.0177384   -.0025499
             |
econ_disad~e |
Economic ..  |  -.0232543   .0016175   -14.38   0.000    -.0264245    -.020084
             |
limited_en~f |
Limited E..  |  -.0234978   .0034709    -6.77   0.000    -.0303007   -.0166948
             |
    disabled |
   Disabled  |  -.0531847   .0033959   -15.66   0.000    -.0598406   -.0465288
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1390207   .0025549    54.41   0.000     .1340131    .1440283
       2016  |   .1256893   .0024932    50.41   0.000     .1208028    .1305759
       2017  |   .1217657   .0026448    46.04   0.000     .1165821    .1269493
       2018  |    .095655    .003291    29.07   0.000     .0892047    .1021054
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0223432   .0013516    16.53   0.000     .0196941    .0249923
       2016  |   .0167406   .0013547    12.36   0.000     .0140856    .0193957
       2017  |   .0174635   .0014119    12.37   0.000     .0146961    .0202308
       2018  |   .0182829   .0014082    12.98   0.000     .0155228     .021043
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   -.011382   .0006107   -18.64   0.000    -.0125789    -.010185
       2016  |    -.00953   .0005612   -16.98   0.000    -.0106299     -.00843
       2017  |  -.0098965   .0005576   -17.75   0.000    -.0109895   -.0088036
       2018  |  -.0091805   .0009241    -9.93   0.000    -.0109917   -.0073694
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1199194   .0025395    47.22   0.000     .1149421    .1248967
       2016  |   .1269671   .0025825    49.16   0.000     .1219054    .1320288
       2017  |   .1231167   .0027157    45.33   0.000     .1177939    .1284394
       2018  |   .1426921   .0033087    43.13   0.000     .1362072    .1491769
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0158653   .0016955     9.36   0.000     .0125421    .0191885
       2016  |    .016872   .0016532    10.21   0.000     .0136317    .0201122
       2017  |   .0122113   .0017402     7.02   0.000     .0088004    .0156221
       2018  |   .0307021   .0013788    22.27   0.000     .0279996    .0334046
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0098038   .0006876   -14.26   0.000    -.0111514   -.0084561
       2016  |  -.0106222   .0007299   -14.55   0.000    -.0120527   -.0091917
       2017  |  -.0091693    .000733   -12.51   0.000     -.010606   -.0077326
       2018  |  -.0099321   .0009084   -10.93   0.000    -.0117126   -.0081516
             |
eth_asian_~t |  -.0000323   .0000484    -0.67   0.505    -.0001272    .0000627
eth_hispan~t |   .0006721   .0000482    13.95   0.000     .0005777    .0007665
eth_black_~t |   .0013524   .0000894    15.13   0.000     .0011772    .0015275
educ_hs_dr~p |   1.803387   .1293486    13.94   0.000     1.549867    2.056906
educ~us_prop |   2.527065   .1180255    21.41   0.000     2.295739    2.758391
pov_fam_ch~t |   .0007747   .0000737    10.51   0.000     .0006303    .0009192
inc_medi~_hh |   1.69e-06   3.35e-08    50.26   0.000     1.62e-06    1.75e-06
       _cons |   .6262685    .028444    22.02   0.000      .570519    .6820179
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_acs.ster saved
Standard deviations: total, classes, students, teachers same year
.41788301 .08020118 .4101146 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0060588579   .7198245906          3445  |
  2 |  .0058274578   .6911891236          2240  |
  3 |  .0053738965   .6491003845          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0060588579  |
  2 |  .0058274578  |
  3 |  .0058274578  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =   14123.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0294
                                                Root MSE          =     .41174

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4year_~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye~s |   1.029157   .0086597   118.84   0.000     1.012167    1.046146
       _cons |  -.0000806   .0002626    -0.31   0.759    -.0005958    .0004347
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_acs.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =     160.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1013
                                                Root MSE          =     .04198

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4y~g_acs | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye~g |   .1730435   .0136467    12.68   0.000     .1462705    .1998166
       _cons |   -.000055   .0009498    -0.06   0.954    -.0019183    .0018083
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_acs_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(38, 433274)   =   3722.97
       Model |  24770.6875        38  651.860198   Prob > F        =    0.0000
    Residual |  75862.6357   433,274  .175091595   R-squared       =    0.2461
-------------+----------------------------------   Adj R-squared   =    0.2461
       Total |  100633.323   433,312  .232242179   Root MSE        =    .41844

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0167978   .0025319     6.63   0.000     .0118353    .0217602
       2017  |   .0202257   .0025406     7.96   0.000     .0152462    .0252052
       2018  |  -.0174785   .0025634    -6.82   0.000    -.0225026   -.0124543
             |
         age |  -.0000738   4.61e-06   -16.03   0.000    -.0000828   -.0000648
             |
        male |
       Male  |  -.0899025   .0013007   -69.12   0.000    -.0924518   -.0873532
 1.eth_asian |   .0657238    .002035    32.30   0.000     .0617352    .0697123
1.eth_hisp~c |  -.0206885   .0017844   -11.59   0.000    -.0241859   -.0171912
 1.eth_black |   .0380228   .0035924    10.58   0.000     .0309818    .0450637
 1.eth_other |   -.012971   .0038652    -3.36   0.001    -.0205468   -.0053953
             |
econ_disad~e |
Economic ..  |  -.0428262   .0015121   -28.32   0.000    -.0457899   -.0398624
             |
limited_en~f |
Limited E..  |  -.0240449   .0034744    -6.92   0.000    -.0308545   -.0172353
             |
    disabled |
   Disabled  |  -.0470655   .0033954   -13.86   0.000    -.0537204   -.0404105
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1398705   .0025557    54.73   0.000     .1348614    .1448796
       2016  |   .1266532   .0024938    50.79   0.000     .1217653     .131541
       2017  |   .1244796   .0026449    47.06   0.000     .1192957    .1296636
       2018  |   .0960133   .0032943    29.15   0.000     .0895566      .10247
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0235566   .0013531    17.41   0.000     .0209045    .0262088
       2016  |   .0179673   .0013562    13.25   0.000     .0153092    .0206254
       2017  |   .0192593   .0014135    13.62   0.000     .0164888    .0220298
       2018  |   .0188166     .00141    13.35   0.000     .0160531    .0215802
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0113064   .0006115   -18.49   0.000    -.0125049   -.0101079
       2016  |  -.0094142   .0005619   -16.75   0.000    -.0105156   -.0083128
       2017  |  -.0100829   .0005584   -18.06   0.000    -.0111773   -.0089886
       2018  |  -.0086964   .0009253    -9.40   0.000    -.0105099   -.0068828
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1204667   .0025427    47.38   0.000     .1154831    .1254502
       2016  |   .1266712   .0025861    48.98   0.000     .1216024    .1317399
       2017  |   .1227883   .0027193    45.15   0.000     .1174585    .1281181
       2018  |    .141611   .0033123    42.75   0.000      .135119    .1481031
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0177595   .0016974    10.46   0.000     .0144328    .0210863
       2016  |   .0181254   .0016551    10.95   0.000     .0148814    .0213693
       2017  |   .0131921   .0017424     7.57   0.000      .009777    .0166072
       2018  |   .0326959   .0013802    23.69   0.000     .0299908     .035401
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0100357   .0006884   -14.58   0.000     -.011385   -.0086864
       2016  |  -.0106043   .0007308   -14.51   0.000    -.0120367    -.009172
       2017  |  -.0090986    .000734   -12.40   0.000    -.0105372     -.00766
       2018  |  -.0088178   .0009095    -9.70   0.000    -.0106004   -.0070353
             |
1.has_~2year |  -.0821487   .0025102   -32.73   0.000    -.0870685   -.0772289
1.has_~4year |   .1439901   .0027107    53.12   0.000     .1386772     .149303
       _cons |   .7969736   .0282129    28.25   0.000     .7416772      .85227
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_sib.ster saved
Standard deviations: total, classes, students, teachers same year
.41843948 .08861685 .40894822 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |   .007497821   .7617146919          3445  |
  2 |  .0072295401   .7368737765          2240  |
  3 |   .006754941   .7027696277          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |   .007497821  |
  2 |  .0072295401  |
  3 |  .0072295401  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =   22786.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0374
                                                Root MSE          =     .41059

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4year_~b | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye~b |   1.021645    .006768   150.95   0.000     1.008367    1.034923
       _cons |  -.0003298   .0002464    -1.34   0.181    -.0008131    .0001536
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_sib.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =     528.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0029
                                                Root MSE          =     .03857

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4y~g_sib | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye~g |   .0256778   .0011171    22.99   0.000     .0234862    .0278695
       _cons |  -.0000157   .0000879    -0.18   0.858    -.0001882    .0001567
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_sib_og.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   433,313
-------------+----------------------------------   F(45, 433267)   =   3281.02
       Model |  25577.1358        45  568.380795   Prob > F        =    0.0000
    Residual |  75056.1875   433,267  .173233105   R-squared       =    0.2542
-------------+----------------------------------   Adj R-squared   =    0.2541
       Total |  100633.323   433,312  .232242179   Root MSE        =    .41621

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |
       2016  |   .0147627     .00252     5.86   0.000     .0098236    .0197018
       2017  |   .0172755   .0025339     6.82   0.000     .0123092    .0222418
       2018  |   -.019381   .0025632    -7.56   0.000    -.0244047   -.0143572
             |
         age |  -.0000785   4.59e-06   -17.11   0.000    -.0000875   -.0000695
             |
        male |
       Male  |  -.0901442   .0012941   -69.66   0.000    -.0926805   -.0876079
 1.eth_asian |   .0687116   .0022863    30.05   0.000     .0642305    .0731927
1.eth_hisp~c |  -.0121448   .0019742    -6.15   0.000    -.0160142   -.0082754
 1.eth_black |   .0407627   .0037526    10.86   0.000     .0334076    .0481177
 1.eth_other |  -.0090825   .0038593    -2.35   0.019    -.0166465   -.0015184
             |
econ_disad~e |
Economic ..  |  -.0233142   .0016112   -14.47   0.000    -.0264721   -.0201563
             |
limited_en~f |
Limited E..  |  -.0228366   .0034571    -6.61   0.000    -.0296124   -.0160608
             |
    disabled |
   Disabled  |  -.0526477   .0033825   -15.56   0.000    -.0592772   -.0460182
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1375814   .0025449    54.06   0.000     .1325935    .1425692
       2016  |   .1243281   .0024834    50.06   0.000     .1194607    .1291955
       2017  |   .1200595   .0026346    45.57   0.000     .1148958    .1252232
       2018  |    .093844    .003278    28.63   0.000     .0874191    .1002688
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0221342   .0013462    16.44   0.000     .0194957    .0247728
       2016  |   .0165582   .0013493    12.27   0.000     .0139136    .0192027
       2017  |   .0174806   .0014063    12.43   0.000     .0147242     .020237
       2018  |   .0181502   .0014026    12.94   0.000     .0154011    .0208992
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0111868   .0006083   -18.39   0.000     -.012379   -.0099946
       2016  |  -.0093875    .000559   -16.79   0.000    -.0104831   -.0082919
       2017  |  -.0097445   .0005554   -17.54   0.000    -.0108332   -.0086559
       2018  |   -.008875   .0009204    -9.64   0.000     -.010679   -.0070711
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1182077   .0025295    46.73   0.000       .11325    .1231655
       2016  |   .1245517   .0025726    48.41   0.000     .1195094    .1295939
       2017  |   .1209131   .0027052    44.70   0.000      .115611    .1262152
       2018  |   .1394807   .0032959    42.32   0.000     .1330209    .1459406
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0158418   .0016888     9.38   0.000     .0125319    .0191518
       2016  |   .0166923   .0016466    10.14   0.000      .013465    .0199196
       2017  |    .012038   .0017333     6.95   0.000     .0086408    .0154352
       2018  |   .0302593   .0013734    22.03   0.000     .0275674    .0329512
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.009691   .0006848   -14.15   0.000    -.0110333   -.0083487
       2016  |  -.0103686    .000727   -14.26   0.000    -.0117934   -.0089437
       2017  |  -.0089788   .0007301   -12.30   0.000    -.0104097   -.0075478
       2018  |  -.0095443   .0009048   -10.55   0.000    -.0113178   -.0077709
             |
1.has_~2year |  -.0785721   .0024976   -31.46   0.000    -.0834673   -.0736769
1.has_~4year |   .1397799   .0026975    51.82   0.000     .1344929    .1450669
eth_asian_~t |  -8.79e-06   .0000482    -0.18   0.855    -.0001033    .0000858
eth_hispan~t |   .0006485    .000048    13.52   0.000     .0005545    .0007425
eth_black_~t |   .0013075    .000089    14.69   0.000      .001133    .0014819
educ_hs_dr~p |    1.74924   .1288362    13.58   0.000     1.496724    2.001755
educ~us_prop |   2.503256   .1175778    21.29   0.000     2.272807    2.733705
pov_fam_ch~t |     .00075   .0000734    10.22   0.000     .0006061    .0008939
inc_medi~_hh |   1.63e-06   3.34e-08    48.89   0.000     1.57e-06    1.70e-06
       _cons |   .6186015   .0283409    21.83   0.000     .5630542    .6741488
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_both.ster saved
Standard deviations: total, classes, students, teachers same year
.41621281 .07835309 .40877121 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0057800583   .7119900722          3445  |
  2 |  .0055366738   .6816020879          2240  |
  3 |  .0050837808   .6383457158          1077  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0057800583  |
  2 |  .0055366738  |
  3 |  .0055366738  |
    +---------------+
-------------------------------------------------------------------------------
note: label truncated to 80 characters

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =   12999.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0281
                                                Root MSE          =     .41039

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4year_~h | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye~h |   1.029821   .0090324   114.01   0.000     1.012101    1.047542
       _cons |  -.0000499   .0002655    -0.19   0.851    -.0005708    .0004709
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_both.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =     410.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0023
                                                Root MSE          =     .03729

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4~s_both | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye~s |   .0257448   .0012704    20.27   0.000     .0232525    .0282371
       _cons |  -8.75e-06   .0000827    -0.11   0.916     -.000171    .0001535
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_sib_acs.ster saved

Linear regression                               Number of obs     =    432,331
                                                F(1, 1248)        =     159.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1007
                                                Root MSE          =     .04092

                          (Std. err. adjusted for 1,249 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4~b_both | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye~b |   .1728357   .0136747    12.64   0.000     .1460078    .1996636
       _cons |  -.0000522   .0009243    -0.06   0.955    -.0018655    .0017612
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_acs_sib.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/o
    > utcome_va/va_enr_4year_sib_acs.dta saved

. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:     91.97 /        1 =      91.9680

. 
. //change directory back to my own personal directory
. cd $projdir 
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_out.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 22:16:37
-------------------------------------------------------------------------------
