{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Jul 2022, 22:14:25
{txt}
{com}. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative file paths  */
. cd $vaprojdir
{res}/home/research/ca_ed_lab/projects/common_core_va
{txt}
{com}. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh
{txt}
{com}. ********************************************************************************
. /* Macros for common core VA project folder file paths, and relevant datasets to make it possible
> to use Matt's doh files  */
. ********************************************************************************
. ********************************************************************************
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"
{txt}
{com}. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"
{txt}
{com}. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"
{txt}
{com}. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"
{txt}
{com}. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"
{txt}
{com}. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"
{txt}
{com}. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecondary_out_merge"
{txt}
{com}. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"
{txt}
{com}. {txt}
{com}. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. macro list
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.0039002308063216
{p_end}
{txt}{p 0 16}
S_2:{space 12}{res}{res}300
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.0206002574343117
{p_end}
{txt}{p 0 16}
S_1:{space 12}{res}{res}epanechnikov
{p_end}
{txt}{p 0 16}
S_6:{space 12}{res}{res}.7098361624622439
{p_end}
{txt}{p 0 16}
S_5:{space 12}{res}{res}4
{p_end}
{txt}{p 0 16}
ReS_jv2:{space 8}{res}{res}__000006 __000007 __000008 __000009 __00000A __00000B __00000C __00000D __00000E __00000F __00000G __00000H __00000I __00000J __00000K
{p_end}
{txt}{p 0 16}
dropv:{space 10}{res}{res}_cdscode_x
{p_end}
{txt}{p 0 16}
n_offset:{space 7}{res}{res}0
{p_end}
{txt}{p 0 16}
sort:{space 11}{res}{res}0
{p_end}
{txt}{p 0 16}
dots:{space 11}{res}{res}nois _dots 5 0
{p_end}
{txt}{p 0 16}
dotss:{space 10}{res}{res}nois _dots 0, title(Survey results being calculated)
{p_end}
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_both_str:{space 6}{res}{res}Original + Census + Sibling
{p_end}
{txt}{p 0 16}
_sib_str:{space 7}{res}{res}Original + Sibling
{p_end}
{txt}{p 0 16}
_acs_str:{space 7}{res}{res}Original + Census
{p_end}
{txt}{p 0 16}
_og_str:{space 8}{res}{res}Original Specification
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}
{com}. 
. //startomg timer
. timer on 1
{txt}
{com}. 
. 
. ********************************************************************************
. 
. 
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
{txt}
{com}. 
. foreach subject in ela math {c -(}
{txt}  2{com}.   // load the resctricted sample with sibling and acs controls
.   use $vaprojdir/data/va_samples/va_sib_acs_restr_smp.dta if touse_g11_`subject'==1, clear
{txt}  3{com}. 
.   ********************************************************************************
.   /* Primary test score va specification, no tfx, no peer fx, no sibling ctrl, no acs ctrl */
.   ********************************************************************************
.   vam sbac_`subject'_z_score ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_og.ster, replace)
{txt}  4{com}. 
.     // rename the va estimates and the test score residuals
.     rename tv va_`subject'_og
{txt}  5{com}.     rename score_r `subject'_r_og
{txt}  6{com}.     label var va_`subject'_og "``subject'_str' VA OG Specification"
{txt}  7{com}.     label var `subject'_r_og "Score Residual from ``subject'_str' VA OG Specification"
{txt}  8{com}. 
.     *******************
.     // specification test: regress score residuals on va estimates
.     reg `subject'_r_og va_`subject'_og, cluster(school_id)
{txt}  9{com}. 
.     // save spec test estimates
.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_og.ster, replace
{txt} 10{com}. 
. 
. 
.     ********************************************************************************
.     /* Test score VA, no tfx, no peer fx, no sibling ctrl, with acs ctrl */
.     ********************************************************************************
. 
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `census_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_acs.ster, replace)
{txt} 11{com}. 
.     // rename va estimates and score residuals
.     rename tv va_`subject'_acs
{txt} 12{com}.     rename score_r `subject'_r_acs
{txt} 13{com}.     label var va_`subject'_acs "``subject'_str' VA with Census Controls"
{txt} 14{com}.     label var `subject'_r_acs "Score Residual from ``subject'_str' VA with Census Controls"
{txt} 15{com}. 
. 
.     *******************
.     // specification test: regress score residuals on va estimates
.     reg `subject'_r_acs va_`subject'_acs, cluster(school_id)
{txt} 16{com}. 
.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_acs.ster, replace
{txt} 17{com}. 
.     *******************
.     // forecast bias test for ACS leave out vars
. 
.     // difference in score residuals
.     gen `subject'_r_d_og_acs = `subject'_r_og - `subject'_r_acs
{txt} 18{com}.     // fb test
.     reg `subject'_r_d_og_acs va_`subject'_og, cluster(school_id)
{txt} 19{com}.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb_test_`subject'_acs_og.ster, replace
{txt} 20{com}. 
. 
. 
.     ********************************************************************************
.     /* Test score VA, no tfx, no peer fx, with sibling ctrl, no acs ctrl */
.     ********************************************************************************
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `sibling_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_sib.ster, replace)
{txt} 21{com}. 
.     //rename va estimates sand score residuals
.     rename tv va_`subject'_sib
{txt} 22{com}.     rename score_r `subject'_r_sib
{txt} 23{com}.     label var va_`subject'_sib "``subject'_str' VA with Sibling Controls"
{txt} 24{com}.     label var `subject'_r_sib "Score Residual from ``subject'_str' VA with Sibling Controls"
{txt} 25{com}. 
.     *******************
.     // specification test: regress score residuals on va estimates
.     reg `subject'_r_sib va_`subject'_sib, cluster(school_id)
{txt} 26{com}. 
.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_sib.ster, replace
{txt} 27{com}. 
. 
.     *******************
.     // forecast bias test for sibling controls as leave out vars
.     // difference in score residuals
.     gen `subject'_r_d_og_sib = `subject'_r_og - `subject'_r_sib
{txt} 28{com}.     // fb test
.     reg `subject'_r_d_og_sib va_`subject'_og, cluster(school_id)
{txt} 29{com}.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb_test_`subject'_sib_og.ster, replace
{txt} 30{com}. 
. 
. 
. 
.     ********************************************************************************
.     /* Test score VA, no tfx, no peer fx, with sibling ctrl, with acs ctrl */
.     ********************************************************************************
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `sibling_controls' ///
>         `census_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_both.ster, replace)
{txt} 31{com}. 
.       //rename va estimates sand score residuals
.       rename tv va_`subject'_both
{txt} 32{com}.       rename score_r `subject'_r_both
{txt} 33{com}.       label var va_`subject'_both "``subject'_str' VA with Sibling and Census Controls"
{txt} 34{com}.       label var `subject'_r_both "Score Residual from ``subject'_str' VA with Sibling and Census Controls"
{txt} 35{com}. 
.       *******************
.       // specification test: regress score residuals on va estimates
.       reg `subject'_r_both va_`subject'_both, cluster(school_id)
{txt} 36{com}. 
.       estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_both.ster, replace
{txt} 37{com}. 
. 
.       *******************
.       // forecast bias test for sibling controls as leave out vars against specification with only census controls
.       // difference in score residuals with census controls and residuals with both census and sibling controls
.       gen `subject'_r_d_acs_both = `subject'_r_acs - `subject'_r_both
{txt} 38{com}.       // fb test
.       reg `subject'_r_d_acs_both va_`subject'_acs, cluster(school_id)
{txt} 39{com}.       //naming convention: forecast bias test for leave out variables being sibling controls, against VA with only acs controls
.       estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb_test_`subject'_sib_acs.ster, replace
{txt} 40{com}. 
. 
.       *******************
.       // forecast bias test for census controls as leave out vars against specification with only sibling controls
.       // difference in score residuals with census controls and residuals with both census and sibling controls
.       gen `subject'_r_d_sib_both = `subject'_r_sib - `subject'_r_both
{txt} 41{com}.       // fb test
.       reg `subject'_r_d_sib_both va_`subject'_sib, cluster(school_id)
{txt} 42{com}.       estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb_test_`subject'_acs_sib.ster, replace
{txt} 43{com}. 
. 
. 
. 
. 
.       ********* Save VA estimates
.       collapse (firstnm) va_* ///
>         (mean) `subject'* ///
>         (sum) n_g11_`subject' = touse_g11_`subject' ///
>         , by(school_id cdscode grade year)
{txt} 44{com}.       // save to VA project data folder
.       save $vaprojdir/data/sib_acs_restr_smp/test_score_va/va_`subject'_sib_acs.dta, replace
{txt} 45{com}. 
. 
. 
. {c )-}
{txt}(Test Score VA Restrcited Sample with Sibling Controls and Census Controls)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   419,149
{txt}{hline 13}{c +}{hline 34}   F(36, 419112)   = {res} 17608.47
{txt}       Model {c |} {res} 202018.827        36   5611.6341   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 133566.601   419,112  .318689518   {txt}R-squared       ={res}    0.6020
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6020
{txt}       Total {c |} {res} 335585.429   419,148  .800637075   {txt}Root MSE        =   {res} .56453

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0515525{col 26}{space 2} .0035085{col 37}{space 1}   14.69{col 46}{space 3}0.000{col 54}{space 4} .0446758{col 67}{space 3} .0584291
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0678864{col 26}{space 2} .0034891{col 37}{space 1}   19.46{col 46}{space 3}0.000{col 54}{space 4} .0610479{col 67}{space 3} .0747249
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0706394{col 26}{space 2} .0035257{col 37}{space 1}  -20.04{col 46}{space 3}0.000{col 54}{space 4}-.0775496{col 67}{space 3}-.0637291
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2} -.000345{col 26}{space 2} 6.34e-06{col 37}{space 1}  -54.42{col 46}{space 3}0.000{col 54}{space 4}-.0003574{col 67}{space 3}-.0003325
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0894528{col 26}{space 2} .0017839{col 37}{space 1}  -50.14{col 46}{space 3}0.000{col 54}{space 4}-.0929492{col 67}{space 3}-.0859564
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1036124{col 26}{space 2} .0027924{col 37}{space 1}   37.11{col 46}{space 3}0.000{col 54}{space 4} .0981394{col 67}{space 3} .1090854
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0046053{col 26}{space 2} .0024525{col 37}{space 1}   -1.88{col 46}{space 3}0.060{col 54}{space 4}-.0094122{col 67}{space 3} .0002016
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1439177{col 26}{space 2} .0049616{col 37}{space 1}  -29.01{col 46}{space 3}0.000{col 54}{space 4}-.1536422{col 67}{space 3}-.1341933
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0057273{col 26}{space 2} .0053352{col 37}{space 1}    1.07{col 46}{space 3}0.283{col 54}{space 4}-.0047296{col 67}{space 3} .0161841
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0314355{col 26}{space 2} .0020702{col 37}{space 1}  -15.18{col 46}{space 3}0.000{col 54}{space 4} -.035493{col 67}{space 3}-.0273779
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2221998{col 26}{space 2} .0047803{col 37}{space 1}  -46.48{col 46}{space 3}0.000{col 54}{space 4} -.231569{col 67}{space 3}-.2128305
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1889417{col 26}{space 2} .0047312{col 37}{space 1}  -39.94{col 46}{space 3}0.000{col 54}{space 4}-.1982147{col 67}{space 3}-.1796687
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6080455{col 26}{space 2}   .00356{col 37}{space 1}  170.80{col 46}{space 3}0.000{col 54}{space 4} .6010679{col 67}{space 3}  .615023
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5873242{col 26}{space 2} .0034326{col 37}{space 1}  171.10{col 46}{space 3}0.000{col 54}{space 4} .5805963{col 67}{space 3}  .594052
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5751975{col 26}{space 2} .0035894{col 37}{space 1}  160.25{col 46}{space 3}0.000{col 54}{space 4} .5681625{col 67}{space 3} .5822325
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5714068{col 26}{space 2} .0044809{col 37}{space 1}  127.52{col 46}{space 3}0.000{col 54}{space 4} .5626243{col 67}{space 3} .5801893
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0007997{col 26}{space 2} .0019102{col 37}{space 1}    0.42{col 46}{space 3}0.675{col 54}{space 4}-.0029441{col 67}{space 3} .0045435
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0152522{col 26}{space 2} .0018993{col 37}{space 1}   -8.03{col 46}{space 3}0.000{col 54}{space 4}-.0189749{col 67}{space 3}-.0115296
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0116381{col 26}{space 2} .0019105{col 37}{space 1}   -6.09{col 46}{space 3}0.000{col 54}{space 4}-.0153826{col 67}{space 3}-.0078936
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0109029{col 26}{space 2}  .001922{col 37}{space 1}    5.67{col 46}{space 3}0.000{col 54}{space 4} .0071358{col 67}{space 3}   .01467
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275758{col 26}{space 2} .0008616{col 37}{space 1}  -32.01{col 46}{space 3}0.000{col 54}{space 4}-.0292645{col 67}{space 3}-.0258871
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.021703{col 26}{space 2} .0007834{col 37}{space 1}  -27.70{col 46}{space 3}0.000{col 54}{space 4}-.0232385{col 67}{space 3}-.0201675
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0237676{col 26}{space 2} .0007562{col 37}{space 1}  -31.43{col 46}{space 3}0.000{col 54}{space 4}-.0252497{col 67}{space 3}-.0222855
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0291061{col 26}{space 2}  .001261{col 37}{space 1}  -23.08{col 46}{space 3}0.000{col 54}{space 4}-.0315777{col 67}{space 3}-.0266344
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1682358{col 26}{space 2} .0035339{col 37}{space 1}   47.61{col 46}{space 3}0.000{col 54}{space 4} .1613096{col 67}{space 3}  .175162
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1891424{col 26}{space 2} .0035523{col 37}{space 1}   53.25{col 46}{space 3}0.000{col 54}{space 4}   .18218{col 67}{space 3} .1961047
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .193594{col 26}{space 2} .0036901{col 37}{space 1}   52.46{col 46}{space 3}0.000{col 54}{space 4} .1863615{col 67}{space 3} .2008265
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2443822{col 26}{space 2} .0045075{col 37}{space 1}   54.22{col 46}{space 3}0.000{col 54}{space 4} .2355476{col 67}{space 3} .2532168
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0035334{col 26}{space 2} .0023873{col 37}{space 1}   -1.48{col 46}{space 3}0.139{col 54}{space 4}-.0082124{col 67}{space 3} .0011456
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0137091{col 26}{space 2} .0022989{col 37}{space 1}   -5.96{col 46}{space 3}0.000{col 54}{space 4}-.0182149{col 67}{space 3}-.0092033
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0062249{col 26}{space 2} .0023618{col 37}{space 1}   -2.64{col 46}{space 3}0.008{col 54}{space 4}-.0108541{col 67}{space 3}-.0015958
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0042117{col 26}{space 2} .0018843{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4} .0005187{col 67}{space 3} .0079048
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0031544{col 26}{space 2} .0009657{col 37}{space 1}   -3.27{col 46}{space 3}0.001{col 54}{space 4}-.0050472{col 67}{space 3}-.0012617
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0032413{col 26}{space 2} .0010101{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4} -.005221{col 67}{space 3}-.0012616
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0074933{col 26}{space 2} .0009986{col 37}{space 1}   -7.50{col 46}{space 3}0.000{col 54}{space 4}-.0094506{col 67}{space 3} -.005536
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0052972{col 26}{space 2} .0012425{col 37}{space 1}   -4.26{col 46}{space 3}0.000{col 54}{space 4}-.0077325{col 67}{space 3}-.0028619
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  2.28628{col 26}{space 2} .0388193{col 37}{space 1}   58.90{col 46}{space 3}0.000{col 54}{space 4} 2.210195{col 67}{space 3} 2.362365
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_ela_og.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.56452592 .17858803 .53553322 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0185911114   .5400622475          3423{txt}  {c |}
  2 {c |}  {res}.0136391948   .3903378218          2227{txt}  {c |}
  3 {c |}  {res}.0080309411   .2174287391          1066{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0185911114{txt}  {c |}
  2 {c |}  {res}.0136391948{txt}  {c |}
  3 {c |}  {res}.0136391948{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   418,240
                                                {txt}F(1, 1244)        =  {res}  1452.40
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0375
                                                {txt}Root MSE          =    {res} .55365

{txt}{ralign 78:(Std. err. adjusted for {res:1,245} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    ela_r_og{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} 1.001787{col 26}{space 2} .0262865{col 37}{space 1}   38.11{col 46}{space 3}0.000{col 54}{space 4} .9502159{col 67}{space 3} 1.053357
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0006593{col 26}{space 2} .0013913{col 37}{space 1}   -0.47{col 46}{space 3}0.636{col 54}{space 4}-.0033889{col 67}{space 3} .0020702
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_ela_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   419,149
{txt}{hline 13}{c +}{hline 34}   F(43, 419105)   = {res} 14777.72
{txt}       Model {c |} {res} 202214.844        43  4702.67078   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 133370.585   419,105  .318227139   {txt}R-squared       ={res}    0.6026
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6025
{txt}       Total {c |} {res} 335585.429   419,148  .800637075   {txt}Root MSE        =   {res} .56412

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0511089{col 26}{space 2} .0035083{col 37}{space 1}   14.57{col 46}{space 3}0.000{col 54}{space 4} .0442327{col 67}{space 3}  .057985
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0664867{col 26}{space 2} .0034964{col 37}{space 1}   19.02{col 46}{space 3}0.000{col 54}{space 4} .0596339{col 67}{space 3} .0733394
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0717678{col 26}{space 2} .0035424{col 37}{space 1}  -20.26{col 46}{space 3}0.000{col 54}{space 4}-.0787107{col 67}{space 3}-.0648248
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003414{col 26}{space 2} 6.35e-06{col 37}{space 1}  -53.80{col 46}{space 3}0.000{col 54}{space 4}-.0003538{col 67}{space 3}-.0003289
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0895977{col 26}{space 2}  .001783{col 37}{space 1}  -50.25{col 46}{space 3}0.000{col 54}{space 4}-.0930923{col 67}{space 3} -.086103
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0864213{col 26}{space 2} .0031564{col 37}{space 1}   27.38{col 46}{space 3}0.000{col 54}{space 4} .0802347{col 67}{space 3} .0926078
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0111211{col 26}{space 2} .0027246{col 37}{space 1}   -4.08{col 46}{space 3}0.000{col 54}{space 4}-.0164612{col 67}{space 3} -.005781
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1293107{col 26}{space 2} .0052005{col 37}{space 1}  -24.86{col 46}{space 3}0.000{col 54}{space 4}-.1395036{col 67}{space 3}-.1191178
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0039866{col 26}{space 2} .0053515{col 37}{space 1}    0.74{col 46}{space 3}0.456{col 54}{space 4}-.0065021{col 67}{space 3} .0144753
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0265626{col 26}{space 2} .0022155{col 37}{space 1}  -11.99{col 46}{space 3}0.000{col 54}{space 4}-.0309049{col 67}{space 3}-.0222203
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2234309{col 26}{space 2} .0047785{col 37}{space 1}  -46.76{col 46}{space 3}0.000{col 54}{space 4}-.2327967{col 67}{space 3}-.2140651
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1919718{col 26}{space 2} .0047343{col 37}{space 1}  -40.55{col 46}{space 3}0.000{col 54}{space 4} -.201251{col 67}{space 3}-.1826927
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6065912{col 26}{space 2}  .003561{col 37}{space 1}  170.34{col 46}{space 3}0.000{col 54}{space 4} .5996117{col 67}{space 3} .6135708
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5860272{col 26}{space 2} .0034339{col 37}{space 1}  170.66{col 46}{space 3}0.000{col 54}{space 4} .5792969{col 67}{space 3} .5927576
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .573812{col 26}{space 2}  .003592{col 37}{space 1}  159.75{col 46}{space 3}0.000{col 54}{space 4} .5667718{col 67}{space 3} .5808523
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5704669{col 26}{space 2} .0044795{col 37}{space 1}  127.35{col 46}{space 3}0.000{col 54}{space 4} .5616872{col 67}{space 3} .5792466
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0005925{col 26}{space 2} .0019091{col 37}{space 1}    0.31{col 46}{space 3}0.756{col 54}{space 4}-.0031492{col 67}{space 3} .0043343
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0152569{col 26}{space 2} .0018984{col 37}{space 1}   -8.04{col 46}{space 3}0.000{col 54}{space 4}-.0189776{col 67}{space 3}-.0115362
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0117209{col 26}{space 2} .0019096{col 37}{space 1}   -6.14{col 46}{space 3}0.000{col 54}{space 4}-.0154636{col 67}{space 3}-.0079782
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0110284{col 26}{space 2} .0019208{col 37}{space 1}    5.74{col 46}{space 3}0.000{col 54}{space 4} .0072637{col 67}{space 3} .0147931
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275683{col 26}{space 2}  .000861{col 37}{space 1}  -32.02{col 46}{space 3}0.000{col 54}{space 4}-.0292558{col 67}{space 3}-.0258807
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0218069{col 26}{space 2} .0007829{col 37}{space 1}  -27.85{col 46}{space 3}0.000{col 54}{space 4}-.0233413{col 67}{space 3}-.0202724
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0237683{col 26}{space 2} .0007557{col 37}{space 1}  -31.45{col 46}{space 3}0.000{col 54}{space 4}-.0252494{col 67}{space 3}-.0222871
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0291979{col 26}{space 2} .0012602{col 37}{space 1}  -23.17{col 46}{space 3}0.000{col 54}{space 4}-.0316678{col 67}{space 3}-.0267281
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1675593{col 26}{space 2} .0035317{col 37}{space 1}   47.44{col 46}{space 3}0.000{col 54}{space 4} .1606373{col 67}{space 3} .1744813
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1884786{col 26}{space 2}   .00355{col 37}{space 1}   53.09{col 46}{space 3}0.000{col 54}{space 4} .1815207{col 67}{space 3} .1954365
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1924179{col 26}{space 2} .0036879{col 37}{space 1}   52.18{col 46}{space 3}0.000{col 54}{space 4} .1851897{col 67}{space 3}  .199646
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .243525{col 26}{space 2} .0045059{col 37}{space 1}   54.05{col 46}{space 3}0.000{col 54}{space 4} .2346937{col 67}{space 3} .2523564
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0037494{col 26}{space 2} .0023861{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4}-.0084261{col 67}{space 3} .0009273
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0140656{col 26}{space 2} .0022977{col 37}{space 1}   -6.12{col 46}{space 3}0.000{col 54}{space 4} -.018569{col 67}{space 3}-.0095623
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.006624{col 26}{space 2} .0023603{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-.0112502{col 67}{space 3}-.0019979
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0034592{col 26}{space 2} .0018837{col 37}{space 1}    1.84{col 46}{space 3}0.066{col 54}{space 4}-.0002328{col 67}{space 3} .0071511
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0032222{col 26}{space 2} .0009651{col 37}{space 1}   -3.34{col 46}{space 3}0.001{col 54}{space 4}-.0051138{col 67}{space 3}-.0013306
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0032762{col 26}{space 2} .0010094{col 37}{space 1}   -3.25{col 46}{space 3}0.001{col 54}{space 4}-.0052546{col 67}{space 3}-.0012979
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0074601{col 26}{space 2} .0009979{col 37}{space 1}   -7.48{col 46}{space 3}0.000{col 54}{space 4} -.009416{col 67}{space 3}-.0055041
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0056712{col 26}{space 2} .0012418{col 37}{space 1}   -4.57{col 46}{space 3}0.000{col 54}{space 4}-.0081052{col 67}{space 3}-.0032373
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2} .0009568{col 26}{space 2} .0000665{col 37}{space 1}   14.39{col 46}{space 3}0.000{col 54}{space 4} .0008264{col 67}{space 3} .0010871
{txt}eth_hispan~t {c |}{col 14}{res}{space 2} .0006979{col 26}{space 2}  .000066{col 37}{space 1}   10.57{col 46}{space 3}0.000{col 54}{space 4} .0005685{col 67}{space 3} .0008272
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0014348{col 26}{space 2} .0001231{col 37}{space 1}  -11.66{col 46}{space 3}0.000{col 54}{space 4} -.001676{col 67}{space 3}-.0011936
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-.1060921{col 26}{space 2} .1764661{col 37}{space 1}   -0.60{col 46}{space 3}0.548{col 54}{space 4}-.4519604{col 67}{space 3} .2397761
{txt}educ~us_prop {c |}{col 14}{res}{space 2} .5613235{col 26}{space 2} .1661179{col 37}{space 1}    3.38{col 46}{space 3}0.001{col 54}{space 4} .2357374{col 67}{space 3} .8869095
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0000196{col 26}{space 2} .0001012{col 37}{space 1}   -0.19{col 46}{space 3}0.846{col 54}{space 4}-.0002179{col 67}{space 3} .0001787
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 3.38e-07{col 26}{space 2} 4.68e-08{col 37}{space 1}    7.22{col 46}{space 3}0.000{col 54}{space 4} 2.46e-07{col 67}{space 3} 4.29e-07
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.206429{col 26}{space 2} .0391867{col 37}{space 1}   56.31{col 46}{space 3}0.000{col 54}{space 4} 2.129624{col 67}{space 3} 2.283234
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_ela_acs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.56411625 .17702249 .5356213 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0180449027   .5331671737          3423{txt}  {c |}
  2 {c |}  {res}.0131279486    .381492773          2227{txt}  {c |}
  3 {c |}  {res}.0077236438   .2111821808          1066{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0180449027{txt}  {c |}
  2 {c |}  {res}.0131279486{txt}  {c |}
  3 {c |}  {res}.0131279486{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   418,240
                                                {txt}F(1, 1244)        =  {res}  1375.42
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0360
                                                {txt}Root MSE          =    {res} .55366

{txt}{ralign 78:(Std. err. adjusted for {res:1,245} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   ela_r_acs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_ela_acs {c |}{col 14}{res}{space 2}  1.00248{col 26}{space 2} .0270307{col 37}{space 1}   37.09{col 46}{space 3}0.000{col 54}{space 4} .9494493{col 67}{space 3} 1.055511
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0004911{col 26}{space 2}    .0014{col 37}{space 1}   -0.35{col 46}{space 3}0.726{col 54}{space 4}-.0032378{col 67}{space 3} .0022556
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_ela_acs.ster} saved

Linear regression                               Number of obs     = {res}   418,240
                                                {txt}F(1, 1244)        =  {res}    34.08
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0133
                                                {txt}Root MSE          =    {res} .02148

{txt}{ralign 78:(Std. err. adjusted for {res:1,245} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}ela_r_d_og~s{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .0228853{col 26}{space 2} .0039201{col 37}{space 1}    5.84{col 46}{space 3}0.000{col 54}{space 4} .0151946{col 67}{space 3}  .030576
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.37e-06{col 26}{space 2} .0005721{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4}-.0011267{col 67}{space 3}  .001118
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_ela_acs_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   419,149
{txt}{hline 13}{c +}{hline 34}   F(38, 419110)   = {res} 16690.32
{txt}       Model {c |} {res} 202060.724        38  5317.38748   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 133524.705   419,110  .318591073   {txt}R-squared       ={res}    0.6021
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6021
{txt}       Total {c |} {res} 335585.429   419,148  .800637075   {txt}Root MSE        =   {res} .56444

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0514532{col 26}{space 2} .0035082{col 37}{space 1}   14.67{col 46}{space 3}0.000{col 54}{space 4} .0445772{col 67}{space 3} .0583292
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0676508{col 26}{space 2} .0034895{col 37}{space 1}   19.39{col 46}{space 3}0.000{col 54}{space 4} .0608116{col 67}{space 3} .0744901
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0707717{col 26}{space 2} .0035274{col 37}{space 1}  -20.06{col 46}{space 3}0.000{col 54}{space 4}-.0776853{col 67}{space 3}-.0638581
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003444{col 26}{space 2} 6.34e-06{col 37}{space 1}  -54.33{col 46}{space 3}0.000{col 54}{space 4}-.0003568{col 67}{space 3} -.000332
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0895009{col 26}{space 2} .0017836{col 37}{space 1}  -50.18{col 46}{space 3}0.000{col 54}{space 4}-.0929967{col 67}{space 3} -.086005
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1032629{col 26}{space 2} .0027932{col 37}{space 1}   36.97{col 46}{space 3}0.000{col 54}{space 4} .0977883{col 67}{space 3} .1087375
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0040925{col 26}{space 2} .0024527{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-.0088998{col 67}{space 3} .0007147
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1439029{col 26}{space 2} .0049608{col 37}{space 1}  -29.01{col 46}{space 3}0.000{col 54}{space 4}-.1536259{col 67}{space 3}-.1341798
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0060441{col 26}{space 2} .0053345{col 37}{space 1}    1.13{col 46}{space 3}0.257{col 54}{space 4}-.0044114{col 67}{space 3} .0164996
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0314232{col 26}{space 2} .0020702{col 37}{space 1}  -15.18{col 46}{space 3}0.000{col 54}{space 4}-.0354808{col 67}{space 3}-.0273656
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2220109{col 26}{space 2} .0047796{col 37}{space 1}  -46.45{col 46}{space 3}0.000{col 54}{space 4}-.2313788{col 67}{space 3}-.2126431
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1887865{col 26}{space 2} .0047307{col 37}{space 1}  -39.91{col 46}{space 3}0.000{col 54}{space 4}-.1980585{col 67}{space 3}-.1795145
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6076914{col 26}{space 2} .0035597{col 37}{space 1}  170.71{col 46}{space 3}0.000{col 54}{space 4} .6007145{col 67}{space 3} .6146683
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5870117{col 26}{space 2} .0034324{col 37}{space 1}  171.02{col 46}{space 3}0.000{col 54}{space 4} .5802843{col 67}{space 3}  .593739
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5747793{col 26}{space 2} .0035894{col 37}{space 1}  160.13{col 46}{space 3}0.000{col 54}{space 4} .5677443{col 67}{space 3} .5818143
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5709102{col 26}{space 2} .0044805{col 37}{space 1}  127.42{col 46}{space 3}0.000{col 54}{space 4} .5621286{col 67}{space 3} .5796918
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0007584{col 26}{space 2} .0019099{col 37}{space 1}    0.40{col 46}{space 3}0.691{col 54}{space 4} -.002985{col 67}{space 3} .0045017
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0153045{col 26}{space 2} .0018991{col 37}{space 1}   -8.06{col 46}{space 3}0.000{col 54}{space 4}-.0190267{col 67}{space 3}-.0115824
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0116345{col 26}{space 2} .0019103{col 37}{space 1}   -6.09{col 46}{space 3}0.000{col 54}{space 4}-.0153786{col 67}{space 3}-.0078904
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0108675{col 26}{space 2} .0019217{col 37}{space 1}    5.66{col 46}{space 3}0.000{col 54}{space 4}  .007101{col 67}{space 3} .0146341
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275315{col 26}{space 2} .0008615{col 37}{space 1}  -31.96{col 46}{space 3}0.000{col 54}{space 4}  -.02922{col 67}{space 3}-.0258431
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.021671{col 26}{space 2} .0007833{col 37}{space 1}  -27.67{col 46}{space 3}0.000{col 54}{space 4}-.0232063{col 67}{space 3}-.0201357
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0237296{col 26}{space 2} .0007561{col 37}{space 1}  -31.38{col 46}{space 3}0.000{col 54}{space 4}-.0252115{col 67}{space 3}-.0222477
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0290262{col 26}{space 2} .0012609{col 37}{space 1}  -23.02{col 46}{space 3}0.000{col 54}{space 4}-.0314975{col 67}{space 3}-.0265549
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1677507{col 26}{space 2} .0035336{col 37}{space 1}   47.47{col 46}{space 3}0.000{col 54}{space 4}  .160825{col 67}{space 3} .1746764
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1884373{col 26}{space 2} .0035523{col 37}{space 1}   53.05{col 46}{space 3}0.000{col 54}{space 4} .1814749{col 67}{space 3} .1953997
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1929734{col 26}{space 2}   .00369{col 37}{space 1}   52.30{col 46}{space 3}0.000{col 54}{space 4} .1857411{col 67}{space 3} .2002057
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2435415{col 26}{space 2} .0045074{col 37}{space 1}   54.03{col 46}{space 3}0.000{col 54}{space 4} .2347071{col 67}{space 3} .2523759
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0035531{col 26}{space 2} .0023869{col 37}{space 1}   -1.49{col 46}{space 3}0.137{col 54}{space 4}-.0082314{col 67}{space 3} .0011251
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0137485{col 26}{space 2} .0022986{col 37}{space 1}   -5.98{col 46}{space 3}0.000{col 54}{space 4}-.0182536{col 67}{space 3}-.0092434
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0062782{col 26}{space 2} .0023615{col 37}{space 1}   -2.66{col 46}{space 3}0.008{col 54}{space 4}-.0109066{col 67}{space 3}-.0016498
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0040992{col 26}{space 2} .0018841{col 37}{space 1}    2.18{col 46}{space 3}0.030{col 54}{space 4} .0004064{col 67}{space 3}  .007792
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0031203{col 26}{space 2} .0009656{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0050128{col 67}{space 3}-.0012279
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0031683{col 26}{space 2} .0010099{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.0051477{col 67}{space 3}-.0011888
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0074388{col 26}{space 2} .0009985{col 37}{space 1}   -7.45{col 46}{space 3}0.000{col 54}{space 4}-.0093958{col 67}{space 3}-.0054818
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0051951{col 26}{space 2} .0012424{col 37}{space 1}   -4.18{col 46}{space 3}0.000{col 54}{space 4}-.0076301{col 67}{space 3}-.0027601
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0182408{col 26}{space 2} .0034276{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4}-.0249589{col 67}{space 3}-.0115228
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0388366{col 26}{space 2} .0037088{col 37}{space 1}   10.47{col 46}{space 3}0.000{col 54}{space 4} .0315675{col 67}{space 3} .0461057
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.281911{col 26}{space 2} .0388281{col 37}{space 1}   58.77{col 46}{space 3}0.000{col 54}{space 4} 2.205809{col 67}{space 3} 2.358013
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_ela_sib.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.56443872 .17847971 .53547742 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0185571343   .5397430147          3423{txt}  {c |}
  2 {c |}  {res} .013603888   .3897812242          2227{txt}  {c |}
  3 {c |}  {res}.0080055991   .2169599582          1066{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0185571343{txt}  {c |}
  2 {c |}  {res} .013603888{txt}  {c |}
  3 {c |}  {res} .013603888{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   418,240
                                                {txt}F(1, 1244)        =  {res}  1448.77
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0374
                                                {txt}Root MSE          =    {res} .55359

{txt}{ralign 78:(Std. err. adjusted for {res:1,245} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   ela_r_sib{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_ela_sib {c |}{col 14}{res}{space 2} 1.001781{col 26}{space 2} .0263193{col 37}{space 1}   38.06{col 46}{space 3}0.000{col 54}{space 4} .9501455{col 67}{space 3} 1.053416
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0006531{col 26}{space 2} .0013922{col 37}{space 1}   -0.47{col 46}{space 3}0.639{col 54}{space 4}-.0033844{col 67}{space 3} .0020781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_ela_sib.ster} saved

Linear regression                               Number of obs     = {res}   418,240
                                                {txt}F(1, 1244)        =  {res}    14.38
                                                {txt}Prob > F          = {res}    0.0002
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res}    .01

{txt}{ralign 78:(Std. err. adjusted for {res:1,245} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}ela_r_d_og~b{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2}  .001003{col 26}{space 2} .0002645{col 37}{space 1}    3.79{col 46}{space 3}0.000{col 54}{space 4} .0004842{col 67}{space 3} .0015219
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.34e-06{col 26}{space 2} .0000312{col 37}{space 1}   -0.04{col 46}{space 3}0.966{col 54}{space 4}-.0000626{col 67}{space 3} .0000599
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_ela_sib_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   419,149
{txt}{hline 13}{c +}{hline 34}   F(45, 419103)   = {res} 14128.05
{txt}       Model {c |} {res}  202255.76        45  4494.57244   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 133329.669   419,103  .318131029   {txt}R-squared       ={res}    0.6027
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6027
{txt}       Total {c |} {res} 335585.429   419,148  .800637075   {txt}Root MSE        =   {res} .56403

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0510265{col 26}{space 2}  .003508{col 37}{space 1}   14.55{col 46}{space 3}0.000{col 54}{space 4} .0441509{col 67}{space 3}  .057902
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0662705{col 26}{space 2} .0034968{col 37}{space 1}   18.95{col 46}{space 3}0.000{col 54}{space 4} .0594169{col 67}{space 3} .0731241
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0718886{col 26}{space 2} .0035441{col 37}{space 1}  -20.28{col 46}{space 3}0.000{col 54}{space 4}-.0788349{col 67}{space 3}-.0649422
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003408{col 26}{space 2} 6.35e-06{col 37}{space 1}  -53.70{col 46}{space 3}0.000{col 54}{space 4}-.0003532{col 67}{space 3}-.0003283
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0896458{col 26}{space 2} .0017827{col 37}{space 1}  -50.29{col 46}{space 3}0.000{col 54}{space 4}-.0931399{col 67}{space 3}-.0861517
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0859257{col 26}{space 2} .0031572{col 37}{space 1}   27.22{col 46}{space 3}0.000{col 54}{space 4} .0797376{col 67}{space 3} .0921138
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0105959{col 26}{space 2} .0027247{col 37}{space 1}   -3.89{col 46}{space 3}0.000{col 54}{space 4}-.0159362{col 67}{space 3}-.0052557
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1292772{col 26}{space 2} .0051998{col 37}{space 1}  -24.86{col 46}{space 3}0.000{col 54}{space 4}-.1394685{col 67}{space 3}-.1190858
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0042537{col 26}{space 2} .0053507{col 37}{space 1}    0.79{col 46}{space 3}0.427{col 54}{space 4}-.0062336{col 67}{space 3}  .014741
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2} -.026622{col 26}{space 2} .0022154{col 37}{space 1}  -12.02{col 46}{space 3}0.000{col 54}{space 4}-.0309642{col 67}{space 3}-.0222798
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2232602{col 26}{space 2} .0047778{col 37}{space 1}  -46.73{col 46}{space 3}0.000{col 54}{space 4}-.2326246{col 67}{space 3}-.2138958
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1918125{col 26}{space 2} .0047338{col 37}{space 1}  -40.52{col 46}{space 3}0.000{col 54}{space 4}-.2010906{col 67}{space 3}-.1825344
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6062377{col 26}{space 2} .0035607{col 37}{space 1}  170.26{col 46}{space 3}0.000{col 54}{space 4} .5992587{col 67}{space 3} .6132166
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5857192{col 26}{space 2} .0034336{col 37}{space 1}  170.58{col 46}{space 3}0.000{col 54}{space 4} .5789894{col 67}{space 3}  .592449
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5734128{col 26}{space 2}  .003592{col 37}{space 1}  159.64{col 46}{space 3}0.000{col 54}{space 4} .5663726{col 67}{space 3}  .580453
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5699838{col 26}{space 2} .0044791{col 37}{space 1}  127.26{col 46}{space 3}0.000{col 54}{space 4}  .561205{col 67}{space 3} .5787626
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0005605{col 26}{space 2} .0019088{col 37}{space 1}    0.29{col 46}{space 3}0.769{col 54}{space 4}-.0031808{col 67}{space 3} .0043017
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0152984{col 26}{space 2} .0018981{col 37}{space 1}   -8.06{col 46}{space 3}0.000{col 54}{space 4}-.0190186{col 67}{space 3}-.0115782
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0117041{col 26}{space 2} .0019094{col 37}{space 1}   -6.13{col 46}{space 3}0.000{col 54}{space 4}-.0154464{col 67}{space 3}-.0079618
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0110012{col 26}{space 2} .0019205{col 37}{space 1}    5.73{col 46}{space 3}0.000{col 54}{space 4}  .007237{col 67}{space 3} .0147654
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275244{col 26}{space 2} .0008609{col 37}{space 1}  -31.97{col 46}{space 3}0.000{col 54}{space 4}-.0292117{col 67}{space 3}-.0258371
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0217752{col 26}{space 2} .0007828{col 37}{space 1}  -27.82{col 46}{space 3}0.000{col 54}{space 4}-.0233094{col 67}{space 3} -.020241
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.023733{col 26}{space 2} .0007556{col 37}{space 1}  -31.41{col 46}{space 3}0.000{col 54}{space 4} -.025214{col 67}{space 3} -.022252
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0291174{col 26}{space 2}   .00126{col 37}{space 1}  -23.11{col 46}{space 3}0.000{col 54}{space 4}-.0315869{col 67}{space 3}-.0266478
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1670898{col 26}{space 2} .0035314{col 37}{space 1}   47.32{col 46}{space 3}0.000{col 54}{space 4} .1601684{col 67}{space 3} .1740113
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1877908{col 26}{space 2} .0035501{col 37}{space 1}   52.90{col 46}{space 3}0.000{col 54}{space 4} .1808327{col 67}{space 3} .1947488
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1918157{col 26}{space 2} .0036878{col 37}{space 1}   52.01{col 46}{space 3}0.000{col 54}{space 4} .1845878{col 67}{space 3} .1990436
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2426969{col 26}{space 2} .0045058{col 37}{space 1}   53.86{col 46}{space 3}0.000{col 54}{space 4} .2338657{col 67}{space 3} .2515281
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0037548{col 26}{space 2} .0023858{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4}-.0084308{col 67}{space 3} .0009213
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0140941{col 26}{space 2} .0022973{col 37}{space 1}   -6.13{col 46}{space 3}0.000{col 54}{space 4}-.0185969{col 67}{space 3}-.0095914
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0066693{col 26}{space 2}   .00236{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.0112948{col 67}{space 3}-.0020439
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0033607{col 26}{space 2} .0018835{col 37}{space 1}    1.78{col 46}{space 3}0.074{col 54}{space 4} -.000331{col 67}{space 3} .0070524
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0031916{col 26}{space 2}  .000965{col 37}{space 1}   -3.31{col 46}{space 3}0.001{col 54}{space 4}-.0050829{col 67}{space 3}-.0013003
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0032058{col 26}{space 2} .0010093{col 37}{space 1}   -3.18{col 46}{space 3}0.001{col 54}{space 4}-.0051839{col 67}{space 3}-.0012277
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0074075{col 26}{space 2} .0009978{col 37}{space 1}   -7.42{col 46}{space 3}0.000{col 54}{space 4}-.0093631{col 67}{space 3}-.0054518
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0055674{col 26}{space 2} .0012417{col 37}{space 1}   -4.48{col 46}{space 3}0.000{col 54}{space 4} -.008001{col 67}{space 3}-.0031337
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0178358{col 26}{space 2} .0034262{col 37}{space 1}   -5.21{col 46}{space 3}0.000{col 54}{space 4}-.0245511{col 67}{space 3}-.0111206
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0384972{col 26}{space 2} .0037077{col 37}{space 1}   10.38{col 46}{space 3}0.000{col 54}{space 4} .0312302{col 67}{space 3} .0457643
{txt}eth_asian_~t {c |}{col 14}{res}{space 2} .0009633{col 26}{space 2} .0000665{col 37}{space 1}   14.49{col 46}{space 3}0.000{col 54}{space 4} .0008331{col 67}{space 3} .0010936
{txt}eth_hispan~t {c |}{col 14}{res}{space 2} .0006921{col 26}{space 2}  .000066{col 37}{space 1}   10.49{col 46}{space 3}0.000{col 54}{space 4} .0005627{col 67}{space 3} .0008214
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0014465{col 26}{space 2}  .000123{col 37}{space 1}  -11.76{col 46}{space 3}0.000{col 54}{space 4}-.0016877{col 67}{space 3}-.0012053
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-.1212975{col 26}{space 2} .1764461{col 37}{space 1}   -0.69{col 46}{space 3}0.492{col 54}{space 4}-.4671266{col 67}{space 3} .2245316
{txt}educ~us_prop {c |}{col 14}{res}{space 2} .5585126{col 26}{space 2} .1661283{col 37}{space 1}    3.36{col 46}{space 3}0.001{col 54}{space 4} .2329063{col 67}{space 3}  .884119
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0000256{col 26}{space 2} .0001011{col 37}{space 1}   -0.25{col 46}{space 3}0.801{col 54}{space 4}-.0002238{col 67}{space 3} .0001727
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 3.24e-07{col 26}{space 2} 4.68e-08{col 37}{space 1}    6.92{col 46}{space 3}0.000{col 54}{space 4} 2.32e-07{col 67}{space 3} 4.16e-07
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.203305{col 26}{space 2} .0391951{col 37}{space 1}   56.21{col 46}{space 3}0.000{col 54}{space 4} 2.126484{col 67}{space 3} 2.280126
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_ela_both.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.56403105 .17691869 .53556588 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0180117491   .5328362127          3423{txt}  {c |}
  2 {c |}  {res}.0130943582   .3809425305          2227{txt}  {c |}
  3 {c |}  {res}.0077018757   .2107748118          1066{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0180117491{txt}  {c |}
  2 {c |}  {res}.0130943582{txt}  {c |}
  3 {c |}  {res}.0130943582{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   418,240
                                                {txt}F(1, 1244)        =  {res}  1372.11
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0360
                                                {txt}Root MSE          =    {res}  .5536

{txt}{ralign 78:(Std. err. adjusted for {res:1,245} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  ela_r_both{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_ela_both {c |}{col 14}{res}{space 2} 1.002509{col 26}{space 2} .0270641{col 37}{space 1}   37.04{col 46}{space 3}0.000{col 54}{space 4} .9494128{col 67}{space 3} 1.055605
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0004847{col 26}{space 2} .0014008{col 37}{space 1}   -0.35{col 46}{space 3}0.729{col 54}{space 4}-.0032329{col 67}{space 3} .0022635
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_ela_both.ster} saved

Linear regression                               Number of obs     = {res}   418,240
                                                {txt}F(1, 1244)        =  {res}    16.18
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res} .00988

{txt}{ralign 78:(Std. err. adjusted for {res:1,245} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}ela_r_d_ac~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_ela_acs {c |}{col 14}{res}{space 2} .0009972{col 26}{space 2} .0002479{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4} .0005108{col 67}{space 3} .0014835
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.30e-06{col 26}{space 2} .0000293{col 37}{space 1}   -0.04{col 46}{space 3}0.965{col 54}{space 4}-.0000587{col 67}{space 3} .0000561
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_ela_sib_acs.ster} saved

Linear regression                               Number of obs     = {res}   418,240
                                                {txt}F(1, 1244)        =  {res}    34.08
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0133
                                                {txt}Root MSE          =    {res} .02143

{txt}{ralign 78:(Std. err. adjusted for {res:1,245} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}ela_r_d_si~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_ela_sib {c |}{col 14}{res}{space 2} .0228576{col 26}{space 2} .0039157{col 37}{space 1}    5.84{col 46}{space 3}0.000{col 54}{space 4} .0151755{col 67}{space 3} .0305397
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.37e-06{col 26}{space 2} .0005706{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4}-.0011238{col 67}{space 3} .0011151
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_ela_acs_sib.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/test_score_va/va_ela_sib_acs.dta{rm}
saved
{p_end}
(Test Score VA Restrcited Sample with Sibling Controls and Census Controls)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   417,486
{txt}{hline 13}{c +}{hline 34}   F(36, 417449)   = {res} 23369.83
{txt}       Model {c |} {res} 251901.033        36  6997.25091   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 124989.991   417,449  .299413798   {txt}R-squared       ={res}    0.6684
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6683
{txt}       Total {c |} {res} 376891.023   417,485  .902765425   {txt}Root MSE        =   {res} .54719

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0572803{col 26}{space 2}  .003408{col 37}{space 1}   16.81{col 46}{space 3}0.000{col 54}{space 4} .0506008{col 67}{space 3} .0639598
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0677824{col 26}{space 2} .0033908{col 37}{space 1}   19.99{col 46}{space 3}0.000{col 54}{space 4} .0611364{col 67}{space 3} .0744283
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0904965{col 26}{space 2} .0034249{col 37}{space 1}  -26.42{col 46}{space 3}0.000{col 54}{space 4}-.0972092{col 67}{space 3}-.0837837
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003526{col 26}{space 2} 6.16e-06{col 37}{space 1}  -57.28{col 46}{space 3}0.000{col 54}{space 4}-.0003647{col 67}{space 3}-.0003405
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0543913{col 26}{space 2} .0017326{col 37}{space 1}   31.39{col 46}{space 3}0.000{col 54}{space 4} .0509955{col 67}{space 3}  .057787
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1901069{col 26}{space 2} .0027116{col 37}{space 1}   70.11{col 46}{space 3}0.000{col 54}{space 4} .1847924{col 67}{space 3} .1954215
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0713131{col 26}{space 2} .0023826{col 37}{space 1}  -29.93{col 46}{space 3}0.000{col 54}{space 4} -.075983{col 67}{space 3}-.0666432
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1717524{col 26}{space 2} .0048185{col 37}{space 1}  -35.64{col 46}{space 3}0.000{col 54}{space 4}-.1811966{col 67}{space 3}-.1623083
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}  .012823{col 26}{space 2} .0051865{col 37}{space 1}    2.47{col 46}{space 3}0.013{col 54}{space 4} .0026576{col 67}{space 3} .0229883
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2} -.064167{col 26}{space 2}  .002011{col 37}{space 1}  -31.91{col 46}{space 3}0.000{col 54}{space 4}-.0681086{col 67}{space 3}-.0602255
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0877959{col 26}{space 2}  .004646{col 37}{space 1}  -18.90{col 46}{space 3}0.000{col 54}{space 4}-.0969019{col 67}{space 3}  -.07869
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1575772{col 26}{space 2} .0046068{col 37}{space 1}  -34.21{col 46}{space 3}0.000{col 54}{space 4}-.1666064{col 67}{space 3} -.148548
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3460863{col 26}{space 2} .0034591{col 37}{space 1}  100.05{col 46}{space 3}0.000{col 54}{space 4} .3393065{col 67}{space 3} .3528662
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3291477{col 26}{space 2} .0033343{col 37}{space 1}   98.72{col 46}{space 3}0.000{col 54}{space 4} .3226126{col 67}{space 3} .3356829
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2987881{col 26}{space 2} .0034852{col 37}{space 1}   85.73{col 46}{space 3}0.000{col 54}{space 4} .2919572{col 67}{space 3} .3056189
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1858319{col 26}{space 2} .0043494{col 37}{space 1}   42.73{col 46}{space 3}0.000{col 54}{space 4} .1773071{col 67}{space 3} .1943567
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0231196{col 26}{space 2} .0018625{col 37}{space 1}   12.41{col 46}{space 3}0.000{col 54}{space 4} .0194691{col 67}{space 3}   .02677
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0059113{col 26}{space 2} .0018452{col 37}{space 1}    3.20{col 46}{space 3}0.001{col 54}{space 4} .0022947{col 67}{space 3} .0095278
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .019425{col 26}{space 2} .0018558{col 37}{space 1}   10.47{col 46}{space 3}0.000{col 54}{space 4} .0157877{col 67}{space 3} .0230623
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0000348{col 26}{space 2} .0018653{col 37}{space 1}   -0.02{col 46}{space 3}0.985{col 54}{space 4}-.0036908{col 67}{space 3} .0036212
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0159373{col 26}{space 2} .0008383{col 37}{space 1}  -19.01{col 46}{space 3}0.000{col 54}{space 4}-.0175803{col 67}{space 3}-.0142942
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0102204{col 26}{space 2} .0007605{col 37}{space 1}  -13.44{col 46}{space 3}0.000{col 54}{space 4}-.0117109{col 67}{space 3}  -.00873
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0134865{col 26}{space 2} .0007341{col 37}{space 1}  -18.37{col 46}{space 3}0.000{col 54}{space 4}-.0149254{col 67}{space 3}-.0120477
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0060232{col 26}{space 2} .0012227{col 37}{space 1}   -4.93{col 46}{space 3}0.000{col 54}{space 4}-.0084196{col 67}{space 3}-.0036268
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4903138{col 26}{space 2} .0034319{col 37}{space 1}  142.87{col 46}{space 3}0.000{col 54}{space 4} .4835874{col 67}{space 3} .4970402
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5124285{col 26}{space 2} .0034502{col 37}{space 1}  148.52{col 46}{space 3}0.000{col 54}{space 4} .5056661{col 67}{space 3} .5191909
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5382762{col 26}{space 2}  .003584{col 37}{space 1}  150.19{col 46}{space 3}0.000{col 54}{space 4} .5312517{col 67}{space 3} .5453007
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6696836{col 26}{space 2} .0043788{col 37}{space 1}  152.94{col 46}{space 3}0.000{col 54}{space 4} .6611012{col 67}{space 3} .6782661
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0243071{col 26}{space 2} .0023218{col 37}{space 1}   10.47{col 46}{space 3}0.000{col 54}{space 4} .0197564{col 67}{space 3} .0288577
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0019406{col 26}{space 2} .0022313{col 37}{space 1}    0.87{col 46}{space 3}0.384{col 54}{space 4}-.0024326{col 67}{space 3} .0063138
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0014475{col 26}{space 2} .0022952{col 37}{space 1}    0.63{col 46}{space 3}0.528{col 54}{space 4}-.0030509{col 67}{space 3} .0059459
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0787112{col 26}{space 2} .0018314{col 37}{space 1}   42.98{col 46}{space 3}0.000{col 54}{space 4} .0751218{col 67}{space 3} .0823006
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0228218{col 26}{space 2} .0009373{col 37}{space 1}  -24.35{col 46}{space 3}0.000{col 54}{space 4}-.0246589{col 67}{space 3}-.0209846
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0193277{col 26}{space 2} .0009803{col 37}{space 1}  -19.72{col 46}{space 3}0.000{col 54}{space 4} -.021249{col 67}{space 3}-.0174064
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.022374{col 26}{space 2} .0009695{col 37}{space 1}  -23.08{col 46}{space 3}0.000{col 54}{space 4}-.0242742{col 67}{space 3}-.0204737
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0268415{col 26}{space 2} .0012075{col 37}{space 1}  -22.23{col 46}{space 3}0.000{col 54}{space 4}-.0292081{col 67}{space 3} -.024475
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  2.25064{col 26}{space 2} .0376979{col 37}{space 1}   59.70{col 46}{space 3}0.000{col 54}{space 4} 2.176753{col 67}{space 3} 2.324526
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_og.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.54718717 .16245832 .5225142 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0187565705   .6369881249          3414{txt}  {c |}
  2 {c |}  {res}.0147715093   .5053267744          2221{txt}  {c |}
  3 {c |}  {res}.0095871342   .3363071807          1065{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0187565705{txt}  {c |}
  2 {c |}  {res}.0147715093{txt}  {c |}
  3 {c |}  {res}.0147715093{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   416,620
                                                {txt}F(1, 1241)        =  {res}  2895.68
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0454
                                                {txt}Root MSE          =    {res} .53451

{txt}{ralign 78:(Std. err. adjusted for {res:1,242} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   math_r_og{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_math_og {c |}{col 14}{res}{space 2} .9859257{col 26}{space 2} .0183218{col 37}{space 1}   53.81{col 46}{space 3}0.000{col 54}{space 4} .9499805{col 67}{space 3} 1.021871
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.001402{col 26}{space 2} .0009959{col 37}{space 1}   -1.41{col 46}{space 3}0.159{col 54}{space 4}-.0033559{col 67}{space 3} .0005519
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_math_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   417,486
{txt}{hline 13}{c +}{hline 34}   F(43, 417442)   = {res} 19822.80
{txt}       Model {c |} {res} 252991.704        43  5883.52799   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  123899.32   417,442  .296806071   {txt}R-squared       ={res}    0.6713
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6712
{txt}       Total {c |} {res} 376891.023   417,485  .902765425   {txt}Root MSE        =   {res}  .5448

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0552724{col 26}{space 2} .0033953{col 37}{space 1}   16.28{col 46}{space 3}0.000{col 54}{space 4} .0486177{col 67}{space 3} .0619271
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0635511{col 26}{space 2} .0033854{col 37}{space 1}   18.77{col 46}{space 3}0.000{col 54}{space 4} .0569157{col 67}{space 3} .0701864
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0935917{col 26}{space 2} .0034283{col 37}{space 1}  -27.30{col 46}{space 3}0.000{col 54}{space 4}-.1003111{col 67}{space 3}-.0868723
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003568{col 26}{space 2} 6.14e-06{col 37}{space 1}  -58.11{col 46}{space 3}0.000{col 54}{space 4}-.0003688{col 67}{space 3}-.0003447
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0534287{col 26}{space 2} .0017254{col 37}{space 1}   30.97{col 46}{space 3}0.000{col 54}{space 4} .0500471{col 67}{space 3} .0568104
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1658128{col 26}{space 2} .0030534{col 37}{space 1}   54.30{col 46}{space 3}0.000{col 54}{space 4} .1598282{col 67}{space 3} .1717975
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0450394{col 26}{space 2}  .002637{col 37}{space 1}  -17.08{col 46}{space 3}0.000{col 54}{space 4}-.0502078{col 67}{space 3} -.039871
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1354746{col 26}{space 2} .0050325{col 37}{space 1}  -26.92{col 46}{space 3}0.000{col 54}{space 4}-.1453381{col 67}{space 3}-.1256112
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0144946{col 26}{space 2} .0051834{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0043353{col 67}{space 3} .0246539
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0313395{col 26}{space 2} .0021445{col 37}{space 1}  -14.61{col 46}{space 3}0.000{col 54}{space 4}-.0355426{col 67}{space 3}-.0271363
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0896501{col 26}{space 2} .0046274{col 37}{space 1}  -19.37{col 46}{space 3}0.000{col 54}{space 4}-.0987196{col 67}{space 3}-.0805806
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1697749{col 26}{space 2} .0045931{col 37}{space 1}  -36.96{col 46}{space 3}0.000{col 54}{space 4}-.1787773{col 67}{space 3}-.1607725
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3394684{col 26}{space 2} .0034474{col 37}{space 1}   98.47{col 46}{space 3}0.000{col 54}{space 4} .3327115{col 67}{space 3} .3462253
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3228313{col 26}{space 2} .0033234{col 37}{space 1}   97.14{col 46}{space 3}0.000{col 54}{space 4} .3163175{col 67}{space 3} .3293451
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2903166{col 26}{space 2} .0034751{col 37}{space 1}   83.54{col 46}{space 3}0.000{col 54}{space 4} .2835055{col 67}{space 3} .2971276
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1817488{col 26}{space 2} .0043322{col 37}{space 1}   41.95{col 46}{space 3}0.000{col 54}{space 4} .1732577{col 67}{space 3} .1902398
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0220379{col 26}{space 2} .0018547{col 37}{space 1}   11.88{col 46}{space 3}0.000{col 54}{space 4} .0184028{col 67}{space 3}  .025673
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0049546{col 26}{space 2} .0018375{col 37}{space 1}    2.70{col 46}{space 3}0.007{col 54}{space 4} .0013531{col 67}{space 3} .0085561
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0182424{col 26}{space 2} .0018482{col 37}{space 1}    9.87{col 46}{space 3}0.000{col 54}{space 4}   .01462{col 67}{space 3} .0218647
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0000775{col 26}{space 2} .0018574{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}-.0035628{col 67}{space 3} .0037179
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0157808{col 26}{space 2} .0008347{col 37}{space 1}  -18.91{col 46}{space 3}0.000{col 54}{space 4}-.0174167{col 67}{space 3}-.0141449
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0102667{col 26}{space 2} .0007572{col 37}{space 1}  -13.56{col 46}{space 3}0.000{col 54}{space 4}-.0117507{col 67}{space 3}-.0087827
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0131349{col 26}{space 2}  .000731{col 37}{space 1}  -17.97{col 46}{space 3}0.000{col 54}{space 4}-.0145677{col 67}{space 3}-.0117022
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0062574{col 26}{space 2} .0012174{col 37}{space 1}   -5.14{col 46}{space 3}0.000{col 54}{space 4}-.0086434{col 67}{space 3}-.0038714
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}   .48799{col 26}{space 2} .0034173{col 37}{space 1}  142.80{col 46}{space 3}0.000{col 54}{space 4} .4812922{col 67}{space 3} .4946877
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5097761{col 26}{space 2} .0034355{col 37}{space 1}  148.38{col 46}{space 3}0.000{col 54}{space 4} .5030426{col 67}{space 3} .5165097
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5361965{col 26}{space 2} .0035688{col 37}{space 1}  150.25{col 46}{space 3}0.000{col 54}{space 4} .5292017{col 67}{space 3} .5431912
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6647175{col 26}{space 2} .0043613{col 37}{space 1}  152.41{col 46}{space 3}0.000{col 54}{space 4} .6561695{col 67}{space 3} .6732654
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0235072{col 26}{space 2} .0023122{col 37}{space 1}   10.17{col 46}{space 3}0.000{col 54}{space 4} .0189753{col 67}{space 3} .0280391
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012144{col 26}{space 2}  .002222{col 37}{space 1}    0.55{col 46}{space 3}0.585{col 54}{space 4}-.0031407{col 67}{space 3} .0055694
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0006395{col 26}{space 2} .0022853{col 37}{space 1}    0.28{col 46}{space 3}0.780{col 54}{space 4}-.0038397{col 67}{space 3} .0051187
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0759591{col 26}{space 2} .0018241{col 37}{space 1}   41.64{col 46}{space 3}0.000{col 54}{space 4} .0723839{col 67}{space 3} .0795344
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0229657{col 26}{space 2} .0009334{col 37}{space 1}  -24.61{col 46}{space 3}0.000{col 54}{space 4}-.0247951{col 67}{space 3}-.0211364
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0193959{col 26}{space 2} .0009761{col 37}{space 1}  -19.87{col 46}{space 3}0.000{col 54}{space 4}-.0213089{col 67}{space 3}-.0174829
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0224468{col 26}{space 2} .0009653{col 37}{space 1}  -23.25{col 46}{space 3}0.000{col 54}{space 4}-.0243388{col 67}{space 3}-.0205548
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0277409{col 26}{space 2} .0012024{col 37}{space 1}  -23.07{col 46}{space 3}0.000{col 54}{space 4}-.0300975{col 67}{space 3}-.0253843
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2} .0014632{col 26}{space 2} .0000643{col 37}{space 1}   22.75{col 46}{space 3}0.000{col 54}{space 4} .0013371{col 67}{space 3} .0015893
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0000435{col 26}{space 2} .0000639{col 37}{space 1}   -0.68{col 46}{space 3}0.496{col 54}{space 4}-.0001689{col 67}{space 3} .0000818
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0018994{col 26}{space 2} .0001192{col 37}{space 1}  -15.93{col 46}{space 3}0.000{col 54}{space 4} -.002133{col 67}{space 3}-.0016657
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2} 1.048649{col 26}{space 2}   .17072{col 37}{space 1}    6.14{col 46}{space 3}0.000{col 54}{space 4} .7140425{col 67}{space 3} 1.383254
{txt}educ~us_prop {c |}{col 14}{res}{space 2}  2.39462{col 26}{space 2} .1626595{col 37}{space 1}   14.72{col 46}{space 3}0.000{col 54}{space 4} 2.075812{col 67}{space 3} 2.713427
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2} .0008068{col 26}{space 2} .0000979{col 37}{space 1}    8.24{col 46}{space 3}0.000{col 54}{space 4}  .000615{col 67}{space 3} .0009987
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 1.28e-06{col 26}{space 2} 4.53e-08{col 37}{space 1}   28.23{col 46}{space 3}0.000{col 54}{space 4} 1.19e-06{col 67}{space 3} 1.37e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.112028{col 26}{space 2} .0379162{col 37}{space 1}   55.70{col 46}{space 3}0.000{col 54}{space 4} 2.037714{col 67}{space 3} 2.186343
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_acs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.54479911 .15595198 .52200101 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0165920999   .6103443498          3414{txt}  {c |}
  2 {c |}  {res}.0128558473   .4718084344          2221{txt}  {c |}
  3 {c |}  {res}.0084589009   .3093444236          1065{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0165920999{txt}  {c |}
  2 {c |}  {res}.0128558473{txt}  {c |}
  3 {c |}  {res}.0128558473{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   416,620
                                                {txt}F(1, 1241)        =  {res}  2492.27
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0395
                                                {txt}Root MSE          =    {res} .53381

{txt}{ralign 78:(Std. err. adjusted for {res:1,242} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  math_r_acs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_math_acs {c |}{col 14}{res}{space 2} .9979418{col 26}{space 2} .0199897{col 37}{space 1}   49.92{col 46}{space 3}0.000{col 54}{space 4} .9587244{col 67}{space 3} 1.037159
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0010706{col 26}{space 2} .0009949{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4}-.0030225{col 67}{space 3} .0008813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_math_acs.ster} saved

Linear regression                               Number of obs     = {res}   416,620
                                                {txt}F(1, 1241)        =  {res}    57.48
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0413
                                                {txt}Root MSE          =    {res} .05006

{txt}{ralign 78:(Std. err. adjusted for {res:1,242} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}math_r_d_o~s{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_math_og {c |}{col 14}{res}{space 2} .0878644{col 26}{space 2} .0115894{col 37}{space 1}    7.58{col 46}{space 3}0.000{col 54}{space 4} .0651273{col 67}{space 3} .1106014
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001107{col 26}{space 2} .0012026{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-.0024699{col 67}{space 3} .0022486
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_acs_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   417,486
{txt}{hline 13}{c +}{hline 34}   F(38, 417447)   = {res} 22173.83
{txt}       Model {c |} {res} 252029.556        38  6632.35675   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 124861.467   417,447  .299107353   {txt}R-squared       ={res}    0.6687
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6687
{txt}       Total {c |} {res} 376891.023   417,485  .902765425   {txt}Root MSE        =   {res} .54691

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}  .057094{col 26}{space 2} .0034064{col 37}{space 1}   16.76{col 46}{space 3}0.000{col 54}{space 4} .0504175{col 67}{space 3} .0637705
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0673349{col 26}{space 2}   .00339{col 37}{space 1}   19.86{col 46}{space 3}0.000{col 54}{space 4} .0606906{col 67}{space 3} .0739793
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0907959{col 26}{space 2} .0034253{col 37}{space 1}  -26.51{col 46}{space 3}0.000{col 54}{space 4}-.0975094{col 67}{space 3}-.0840824
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003515{col 26}{space 2} 6.15e-06{col 37}{space 1}  -57.12{col 46}{space 3}0.000{col 54}{space 4}-.0003636{col 67}{space 3}-.0003395
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0543142{col 26}{space 2} .0017317{col 37}{space 1}   31.37{col 46}{space 3}0.000{col 54}{space 4} .0509201{col 67}{space 3} .0577082
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1894661{col 26}{space 2} .0027114{col 37}{space 1}   69.88{col 46}{space 3}0.000{col 54}{space 4} .1841519{col 67}{space 3} .1947803
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} -.070432{col 26}{space 2} .0023819{col 37}{space 1}  -29.57{col 46}{space 3}0.000{col 54}{space 4}-.0751006{col 67}{space 3}-.0657635
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1717539{col 26}{space 2}  .004816{col 37}{space 1}  -35.66{col 46}{space 3}0.000{col 54}{space 4}-.1811932{col 67}{space 3}-.1623145
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0133797{col 26}{space 2} .0051839{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} .0032193{col 67}{space 3} .0235401
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0641564{col 26}{space 2} .0020103{col 37}{space 1}  -31.91{col 46}{space 3}0.000{col 54}{space 4}-.0680966{col 67}{space 3}-.0602162
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0874547{col 26}{space 2} .0046436{col 37}{space 1}  -18.83{col 46}{space 3}0.000{col 54}{space 4}-.0965561{col 67}{space 3}-.0783534
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1572572{col 26}{space 2} .0046046{col 37}{space 1}  -34.15{col 46}{space 3}0.000{col 54}{space 4}-.1662821{col 67}{space 3}-.1482322
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3454692{col 26}{space 2} .0034576{col 37}{space 1}   99.92{col 46}{space 3}0.000{col 54}{space 4} .3386925{col 67}{space 3}  .352246
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3285923{col 26}{space 2} .0033329{col 37}{space 1}   98.59{col 46}{space 3}0.000{col 54}{space 4}   .32206{col 67}{space 3} .3351246
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2980741{col 26}{space 2} .0034839{col 37}{space 1}   85.56{col 46}{space 3}0.000{col 54}{space 4} .2912457{col 67}{space 3} .3049025
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1850088{col 26}{space 2} .0043474{col 37}{space 1}   42.56{col 46}{space 3}0.000{col 54}{space 4}  .176488{col 67}{space 3} .1935296
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0230447{col 26}{space 2} .0018616{col 37}{space 1}   12.38{col 46}{space 3}0.000{col 54}{space 4}  .019396{col 67}{space 3} .0266933
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0058165{col 26}{space 2} .0018443{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4} .0022017{col 67}{space 3} .0094313
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .019437{col 26}{space 2} .0018549{col 37}{space 1}   10.48{col 46}{space 3}0.000{col 54}{space 4} .0158015{col 67}{space 3} .0230726
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0000881{col 26}{space 2} .0018644{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-.0037423{col 67}{space 3}  .003566
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0158602{col 26}{space 2} .0008379{col 37}{space 1}  -18.93{col 46}{space 3}0.000{col 54}{space 4}-.0175024{col 67}{space 3} -.014218
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0101625{col 26}{space 2} .0007601{col 37}{space 1}  -13.37{col 46}{space 3}0.000{col 54}{space 4}-.0116522{col 67}{space 3}-.0086728
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.013422{col 26}{space 2} .0007338{col 37}{space 1}  -18.29{col 46}{space 3}0.000{col 54}{space 4}-.0148601{col 67}{space 3}-.0119838
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.005889{col 26}{space 2} .0012221{col 37}{space 1}   -4.82{col 46}{space 3}0.000{col 54}{space 4}-.0082842{col 67}{space 3}-.0034938
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4894781{col 26}{space 2} .0034304{col 37}{space 1}  142.69{col 46}{space 3}0.000{col 54}{space 4} .4827547{col 67}{space 3} .4962016
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5111985{col 26}{space 2} .0034491{col 37}{space 1}  148.21{col 46}{space 3}0.000{col 54}{space 4} .5044385{col 67}{space 3} .5179586
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5371836{col 26}{space 2} .0035826{col 37}{space 1}  149.94{col 46}{space 3}0.000{col 54}{space 4} .5301619{col 67}{space 3} .5442054
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6681732{col 26}{space 2} .0043772{col 37}{space 1}  152.65{col 46}{space 3}0.000{col 54}{space 4}  .659594{col 67}{space 3} .6767524
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0242823{col 26}{space 2} .0023206{col 37}{space 1}   10.46{col 46}{space 3}0.000{col 54}{space 4} .0197339{col 67}{space 3} .0288306
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0018775{col 26}{space 2} .0022302{col 37}{space 1}    0.84{col 46}{space 3}0.400{col 54}{space 4}-.0024936{col 67}{space 3} .0062485
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0013523{col 26}{space 2}  .002294{col 37}{space 1}    0.59{col 46}{space 3}0.556{col 54}{space 4}-.0031439{col 67}{space 3} .0058485
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0785276{col 26}{space 2} .0018306{col 37}{space 1}   42.90{col 46}{space 3}0.000{col 54}{space 4} .0749397{col 67}{space 3} .0821154
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0227634{col 26}{space 2} .0009369{col 37}{space 1}  -24.30{col 46}{space 3}0.000{col 54}{space 4}-.0245996{col 67}{space 3}-.0209271
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0192007{col 26}{space 2} .0009798{col 37}{space 1}  -19.60{col 46}{space 3}0.000{col 54}{space 4}-.0211211{col 67}{space 3}-.0172804
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.022277{col 26}{space 2}  .000969{col 37}{space 1}  -22.99{col 46}{space 3}0.000{col 54}{space 4}-.0241763{col 67}{space 3}-.0203777
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0266564{col 26}{space 2} .0012069{col 37}{space 1}  -22.09{col 46}{space 3}0.000{col 54}{space 4}-.0290218{col 67}{space 3} -.024291
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0307962{col 26}{space 2}  .003327{col 37}{space 1}   -9.26{col 46}{space 3}0.000{col 54}{space 4}-.0373171{col 67}{space 3}-.0242753
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0686885{col 26}{space 2} .0035981{col 37}{space 1}   19.09{col 46}{space 3}0.000{col 54}{space 4} .0616364{col 67}{space 3} .0757407
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.242488{col 26}{space 2} .0376928{col 37}{space 1}   59.49{col 46}{space 3}0.000{col 54}{space 4} 2.168612{col 67}{space 3} 2.316365
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_sib.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.54690708 .16221069 .52229785 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0186836768   .6363194072          3414{txt}  {c |}
  2 {c |}  {res}.0146888766   .5039745289          2221{txt}  {c |}
  3 {c |}  {res} .009504036   .3344669041          1065{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0186836768{txt}  {c |}
  2 {c |}  {res}.0146888766{txt}  {c |}
  3 {c |}  {res}.0146888766{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   416,620
                                                {txt}F(1, 1241)        =  {res}  2884.16
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0452
                                                {txt}Root MSE          =    {res} .53429

{txt}{ralign 78:(Std. err. adjusted for {res:1,242} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  math_r_sib{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_math_sib {c |}{col 14}{res}{space 2}  .985615{col 26}{space 2} .0183526{col 37}{space 1}   53.70{col 46}{space 3}0.000{col 54}{space 4} .9496094{col 67}{space 3} 1.021621
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0013916{col 26}{space 2} .0009977{col 37}{space 1}   -1.39{col 46}{space 3}0.163{col 54}{space 4} -.003349{col 67}{space 3} .0005657
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_math_sib.ster} saved

Linear regression                               Number of obs     = {res}   416,620
                                                {txt}F(1, 1241)        =  {res}    24.90
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0002
                                                {txt}Root MSE          =    {res} .01755

{txt}{ralign 78:(Std. err. adjusted for {res:1,242} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}math_r_d_o~b{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_math_og {c |}{col 14}{res}{space 2} .0020992{col 26}{space 2} .0004206{col 37}{space 1}    4.99{col 46}{space 3}0.000{col 54}{space 4} .0012739{col 67}{space 3} .0029244
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.94e-06{col 26}{space 2} .0000547{col 37}{space 1}   -0.07{col 46}{space 3}0.943{col 54}{space 4}-.0001113{col 67}{space 3} .0001034
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_sib_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   417,486
{txt}{hline 13}{c +}{hline 34}   F(45, 417440)   = {res} 18969.23
{txt}       Model {c |} {res}  253112.48        45  5624.72177   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 123778.544   417,440  .296518167   {txt}R-squared       ={res}    0.6716
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6715
{txt}       Total {c |} {res} 376891.023   417,485  .902765425   {txt}Root MSE        =   {res} .54453

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0551043{col 26}{space 2} .0033939{col 37}{space 1}   16.24{col 46}{space 3}0.000{col 54}{space 4} .0484524{col 67}{space 3} .0617561
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0631148{col 26}{space 2} .0033847{col 37}{space 1}   18.65{col 46}{space 3}0.000{col 54}{space 4} .0564809{col 67}{space 3} .0697487
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0939147{col 26}{space 2} .0034288{col 37}{space 1}  -27.39{col 46}{space 3}0.000{col 54}{space 4}-.1006351{col 67}{space 3}-.0871944
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003556{col 26}{space 2} 6.14e-06{col 37}{space 1}  -57.94{col 46}{space 3}0.000{col 54}{space 4}-.0003676{col 67}{space 3}-.0003436
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0533534{col 26}{space 2} .0017245{col 37}{space 1}   30.94{col 46}{space 3}0.000{col 54}{space 4} .0499734{col 67}{space 3} .0567335
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1648983{col 26}{space 2} .0030532{col 37}{space 1}   54.01{col 46}{space 3}0.000{col 54}{space 4} .1589142{col 67}{space 3} .1708825
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0441568{col 26}{space 2} .0026362{col 37}{space 1}  -16.75{col 46}{space 3}0.000{col 54}{space 4}-.0493236{col 67}{space 3}  -.03899
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1354454{col 26}{space 2}   .00503{col 37}{space 1}  -26.93{col 46}{space 3}0.000{col 54}{space 4}-.1453041{col 67}{space 3}-.1255867
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0149635{col 26}{space 2}  .005181{col 37}{space 1}    2.89{col 46}{space 3}0.004{col 54}{space 4}  .004809{col 67}{space 3} .0251181
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0314604{col 26}{space 2} .0021437{col 37}{space 1}  -14.68{col 46}{space 3}0.000{col 54}{space 4} -.035662{col 67}{space 3}-.0272588
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0893516{col 26}{space 2} .0046251{col 37}{space 1}  -19.32{col 46}{space 3}0.000{col 54}{space 4}-.0984167{col 67}{space 3}-.0802864
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1694428{col 26}{space 2} .0045911{col 37}{space 1}  -36.91{col 46}{space 3}0.000{col 54}{space 4}-.1784411{col 67}{space 3}-.1604445
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3388725{col 26}{space 2}  .003446{col 37}{space 1}   98.34{col 46}{space 3}0.000{col 54}{space 4} .3321185{col 67}{space 3} .3456265
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3223067{col 26}{space 2} .0033221{col 37}{space 1}   97.02{col 46}{space 3}0.000{col 54}{space 4} .3157955{col 67}{space 3} .3288179
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .289668{col 26}{space 2} .0034739{col 37}{space 1}   83.38{col 46}{space 3}0.000{col 54}{space 4} .2828592{col 67}{space 3} .2964767
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1809694{col 26}{space 2} .0043303{col 37}{space 1}   41.79{col 46}{space 3}0.000{col 54}{space 4} .1724821{col 67}{space 3} .1894568
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0219843{col 26}{space 2} .0018538{col 37}{space 1}   11.86{col 46}{space 3}0.000{col 54}{space 4} .0183509{col 67}{space 3} .0256177
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .004885{col 26}{space 2} .0018367{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} .0012852{col 67}{space 3} .0084848
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0182834{col 26}{space 2} .0018473{col 37}{space 1}    9.90{col 46}{space 3}0.000{col 54}{space 4} .0146627{col 67}{space 3} .0219041
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0000418{col 26}{space 2} .0018565{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-.0035968{col 67}{space 3} .0036804
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0157063{col 26}{space 2} .0008343{col 37}{space 1}  -18.83{col 46}{space 3}0.000{col 54}{space 4}-.0173414{col 67}{space 3}-.0140712
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0102119{col 26}{space 2} .0007568{col 37}{space 1}  -13.49{col 46}{space 3}0.000{col 54}{space 4}-.0116952{col 67}{space 3}-.0087286
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0130782{col 26}{space 2} .0007307{col 37}{space 1}  -17.90{col 46}{space 3}0.000{col 54}{space 4}-.0145103{col 67}{space 3}-.0116462
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0061234{col 26}{space 2} .0012168{col 37}{space 1}   -5.03{col 46}{space 3}0.000{col 54}{space 4}-.0085083{col 67}{space 3}-.0037385
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4871912{col 26}{space 2} .0034159{col 37}{space 1}  142.63{col 46}{space 3}0.000{col 54}{space 4} .4804962{col 67}{space 3} .4938862
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5085893{col 26}{space 2} .0034344{col 37}{space 1}  148.08{col 46}{space 3}0.000{col 54}{space 4} .5018578{col 67}{space 3} .5153207
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5351494{col 26}{space 2} .0035675{col 37}{space 1}  150.01{col 46}{space 3}0.000{col 54}{space 4} .5281573{col 67}{space 3} .5421415
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6632555{col 26}{space 2} .0043597{col 37}{space 1}  152.13{col 46}{space 3}0.000{col 54}{space 4} .6547106{col 67}{space 3} .6718005
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0235113{col 26}{space 2} .0023111{col 37}{space 1}   10.17{col 46}{space 3}0.000{col 54}{space 4} .0189815{col 67}{space 3}  .028041
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0011741{col 26}{space 2} .0022209{col 37}{space 1}    0.53{col 46}{space 3}0.597{col 54}{space 4}-.0031789{col 67}{space 3}  .005527
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0005618{col 26}{space 2} .0022842{col 37}{space 1}    0.25{col 46}{space 3}0.806{col 54}{space 4}-.0039152{col 67}{space 3} .0050388
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0758112{col 26}{space 2} .0018234{col 37}{space 1}   41.58{col 46}{space 3}0.000{col 54}{space 4} .0722374{col 67}{space 3}  .079385
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0229147{col 26}{space 2} .0009329{col 37}{space 1}  -24.56{col 46}{space 3}0.000{col 54}{space 4}-.0247432{col 67}{space 3}-.0210863
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0192749{col 26}{space 2} .0009756{col 37}{space 1}  -19.76{col 46}{space 3}0.000{col 54}{space 4}-.0211871{col 67}{space 3}-.0173628
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0223544{col 26}{space 2} .0009649{col 37}{space 1}  -23.17{col 46}{space 3}0.000{col 54}{space 4}-.0242455{col 67}{space 3}-.0204633
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0275547{col 26}{space 2} .0012018{col 37}{space 1}  -22.93{col 46}{space 3}0.000{col 54}{space 4}-.0299103{col 67}{space 3}-.0251992
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0283035{col 26}{space 2} .0033136{col 37}{space 1}   -8.54{col 46}{space 3}0.000{col 54}{space 4} -.034798{col 67}{space 3}-.0218089
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0673296{col 26}{space 2} .0035841{col 37}{space 1}   18.79{col 46}{space 3}0.000{col 54}{space 4} .0603049{col 67}{space 3} .0743543
{txt}eth_asian_~t {c |}{col 14}{res}{space 2} .0014749{col 26}{space 2} .0000643{col 37}{space 1}   22.94{col 46}{space 3}0.000{col 54}{space 4} .0013489{col 67}{space 3} .0016009
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0000535{col 26}{space 2} .0000639{col 37}{space 1}   -0.84{col 46}{space 3}0.403{col 54}{space 4}-.0001787{col 67}{space 3} .0000718
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0019194{col 26}{space 2} .0001192{col 37}{space 1}  -16.11{col 46}{space 3}0.000{col 54}{space 4} -.002153{col 67}{space 3}-.0016859
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2} 1.021699{col 26}{space 2} .1706435{col 37}{space 1}    5.99{col 46}{space 3}0.000{col 54}{space 4} .6872426{col 67}{space 3} 1.356155
{txt}educ~us_prop {c |}{col 14}{res}{space 2} 2.392699{col 26}{space 2} .1626155{col 37}{space 1}   14.71{col 46}{space 3}0.000{col 54}{space 4} 2.073978{col 67}{space 3}  2.71142
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2} .0007971{col 26}{space 2} .0000978{col 37}{space 1}    8.15{col 46}{space 3}0.000{col 54}{space 4} .0006053{col 67}{space 3} .0009888
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 1.26e-06{col 26}{space 2} 4.53e-08{col 37}{space 1}   27.71{col 46}{space 3}0.000{col 54}{space 4} 1.17e-06{col 67}{space 3} 1.34e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.105774{col 26}{space 2} .0379116{col 37}{space 1}   55.54{col 46}{space 3}0.000{col 54}{space 4} 2.031468{col 67}{space 3} 2.180079
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_both.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.54453482 .15573821 .52178902 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0165301758   .6096481124          3414{txt}  {c |}
  2 {c |}  {res}.0127862416   .4704700645          2221{txt}  {c |}
  3 {c |}  {res}.0083927169   .3077101532          1065{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0165301758{txt}  {c |}
  2 {c |}  {res}.0127862416{txt}  {c |}
  3 {c |}  {res}.0127862416{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   416,620
                                                {txt}F(1, 1241)        =  {res}  2488.16
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0394
                                                {txt}Root MSE          =    {res} .53359

{txt}{ralign 78:(Std. err. adjusted for {res:1,242} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} math_r_both{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_math_both {c |}{col 14}{res}{space 2} .9977772{col 26}{space 2}  .020003{col 37}{space 1}   49.88{col 46}{space 3}0.000{col 54}{space 4} .9585338{col 67}{space 3} 1.037021
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0010593{col 26}{space 2} .0009964{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-.0030141{col 67}{space 3} .0008955
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_math_both.ster} saved

Linear regression                               Number of obs     = {res}   416,620
                                                {txt}F(1, 1241)        =  {res}    22.62
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0002
                                                {txt}Root MSE          =    {res} .01701

{txt}{ralign 78:(Std. err. adjusted for {res:1,242} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}math_r_d_a~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_math_acs {c |}{col 14}{res}{space 2}  .002007{col 26}{space 2}  .000422{col 37}{space 1}    4.76{col 46}{space 3}0.000{col 54}{space 4} .0011792{col 67}{space 3} .0028348
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.21e-06{col 26}{space 2} .0000504{col 37}{space 1}   -0.06{col 46}{space 3}0.949{col 54}{space 4}-.0001022{col 67}{space 3} .0000958
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_sib_acs.ster} saved

Linear regression                               Number of obs     = {res}   416,620
                                                {txt}F(1, 1241)        =  {res}    57.23
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0412
                                                {txt}Root MSE          =    {res} .04988

{txt}{ralign 78:(Std. err. adjusted for {res:1,242} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}math_r_d_s~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_math_sib {c |}{col 14}{res}{space 2} .0876624{col 26}{space 2} .0115882{col 37}{space 1}    7.56{col 46}{space 3}0.000{col 54}{space 4} .0649278{col 67}{space 3}  .110397
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001097{col 26}{space 2} .0011986{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-.0024611{col 67}{space 3} .0022417
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_acs_sib.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/test_score_va/va_math_sib_acs.dta{rm}
saved
{p_end}

{com}. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:     40.59 /        1 =      40.5950
{txt}
{com}. 
. //change directory back to my own personal directory
. cd $projdir
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Jul 2022, 22:15:05
{txt}{.-}
{smcl}
{txt}{sf}{ul off}