-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_out_dk.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 22:16:38

. 
.  /* change directory to common_core_va project directory for all value added
>  do files because some called subroutines written by Matt may use relative fi
> le paths  */
.  cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
.  /* file path macros for datasets */
.  include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
.  //run Matt's do helper file to set the local macros for VA project
.  include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;

. local acs_str
>         "Original + Census"
>         ;

. local sib_str
>         "Original + Sibling"
>         ;

. local both_str
>         "Original + Census + Sibling"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
.  macro list
T_gm_fix_span:  0
S_4:            .0039002308063216
S_2:            300
S_3:            .0206002574343117
S_1:            epanechnikov
S_6:            .7098361624622439
S_5:            4
ReS_jv2:        __000006 __000007 __000008 __000009 __00000A __00000B __00000C
                __00000D __00000E __00000F __00000G __00000H __00000I __00000J
                __00000K
dropv:          _cdscode_x
n_offset:       0
sort:           0
dots:           nois _dots 5 0
dotss:          nois _dots 0, title(Survey results being calculated)
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_both_str:      Original + Census + Sibling
_sib_str:       Original + Sibling
_acs_str:       Original + Census
_og_str:        Original Specification
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
.  //startomg timer
.  timer on 1

. 
. 
. 
. 
. *****************************************************************************
> ***
. *start the main code
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)

. 
. // deep knowledge controls for sibling acs restricted sample
. local sib_acs_dk_controls va_ela_og va_math_og

. 
. 
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* Deep Knowledge Outcome VA controlling for ela and math VA, 4 specification
> s  */
. foreach outcome in enr enr_2year enr_4year {
  2.   // load the resctricted sample with sibling and acs controls and test sc
> ore VA
.   use $vaprojdir/data/va_samples/va_sib_acs_out_restr_smp.dta if touse_`outco
> me'_dk==1, clear
  3. 
. 
.   ***************************************************************************
> *****
.   /* Primary outcome DK va specification, no tfx, no peer fx, no sibling ctrl
> , no acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _og_dk.ster, replace)
  4. 
.   // rename the va estimates and the residuals
.   rename tv va_`outcome'_og_dk
  5.   rename score_r `outcome'_r_og_dk
  6.   label var va_`outcome'_og_dk "``outcome'_str' DK VA OG Specification"
  7.   label var `outcome'_r_og_dk "Outcome Residual from ``outcome'_str' DK VA
>  OG Specification"
  8. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_og_dk va_`outcome'_og_dk, cluster(school_id)
  9. 
.   // save spec test estimates
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_og_dk.ster, replace
 10. 
. 
. 
. 
.   ***************************************************************************
> *****
.   /* Outcome DK VA, no tfx, no peer fx, no sibling ctrl, with acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `census_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _acs_dk.ster, replace)
 11. 
.   // rename va estimates and score residuals
.   rename tv va_`outcome'_acs_dk
 12.   rename score_r `outcome'_r_acs_dk
 13.   label var va_`outcome'_acs_dk "``outcome'_str' DK VA with Census Control
> s"
 14.   label var `outcome'_r_acs_dk "Outcome Residual from ``outcome'_str' DK V
> A with Census Controls"
 15. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_acs_dk va_`outcome'_acs_dk, cluster(school_id)
 16. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_acs_dk.ster, replace
 17. 
. 
.   *******************
.   // forecast bias test for ACS leave out vars
. 
.   // difference in outcome residuals
.   gen `outcome'_r_d_og_acs_dk = `outcome'_r_og_dk - `outcome'_r_acs_dk
 18.   // fb test
.   reg `outcome'_r_d_og_acs_dk va_`outcome'_og_dk, cluster(school_id)
 19.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test
> _`outcome'_acs_og_dk.ster, replace
 20. 
. 
. 
.   ***************************************************************************
> *****
.   /* Outcome DK VA, no tfx, no peer fx, with sibling ctrl, no acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `sibling_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _sib_dk.ster, replace)
 21. 
.   //rename va estimates sand score residuals
.   rename tv va_`outcome'_sib_dk
 22.   rename score_r `outcome'_r_sib_dk
 23.   label var va_`outcome'_sib_dk "``outcome'_str' DK VA with Sibling Contro
> ls"
 24.   label var `outcome'_r_sib_dk "Outcome Residual from ``outcome'_str' DK V
> A with Sibling Controls"
 25. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_sib_dk va_`outcome'_sib_dk, cluster(school_id)
 26. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_sib_dk.ster, replace
 27. 
. 
.   *******************
.   // forecast bias test for sibling controls as leave out vars
.   // difference in outcome residuals
.   gen `outcome'_r_d_og_sib_dk = `outcome'_r_og_dk - `outcome'_r_sib_dk
 28.   // fb test
.   reg `outcome'_r_d_og_sib_dk va_`outcome'_og_dk, cluster(school_id)
 29.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test
> _`outcome'_sib_og_dk.ster, replace
 30. 
. 
. 
. 
.   ***************************************************************************
> *****
.   /* Outcome DK VA, no tfx, no peer fx, with sibling ctrl, with acs ctrl */
.   ***************************************************************************
> *****
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `sibling_controls' ///
>       `census_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'
> _both_dk.ster, replace)
 31. 
.   //rename va estimates sand outcome residuals
.   rename tv va_`outcome'_both_dk
 32.   rename score_r `outcome'_r_both_dk
 33.   label var va_`outcome'_both_dk "``outcome'_str' DK VA with Sibling and C
> ensus Controls"
 34.   label var `outcome'_r_both_dk "Outcome Residual from ``outcome'_str' DK 
> VA with Sibling and Census Controls"
 35. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_both_dk va_`outcome'_both_dk, cluster(school_id)
 36. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_
> `outcome'_both_dk.ster, replace
 37. 
. 
.   *******************
.   // forecast bias test for sibling controls as leave out vars against specif
> ication with only census controls
.   // difference in outcome residuals with census controls and residuals with 
> both census and sibling controls
.   gen `outcome'_r_d_acs_both_dk = `outcome'_r_acs_dk - `outcome'_r_both_dk
 38.   // fb test
.   reg `outcome'_r_d_acs_both_dk va_`outcome'_acs_dk, cluster(school_id)
 39.   //naming convention: forecast bias test for leave out variables being si
> bling controls, against VA with only acs controls
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`o
> utcome'_sib_acs_dk.ster, replace
 40. 
.   *******************
.   // forecast bias test for census controls as leave out vars against specifi
> cation with only sibling controls
.   // difference in outcome residuals with census controls and residuals with 
> both census and sibling controls
.   gen `outcome'_r_d_sib_both_dk = `outcome'_r_sib_dk - `outcome'_r_both_dk
 41.   // fb test
.   reg `outcome'_r_d_sib_both_dk va_`outcome'_sib_dk, cluster(school_id)
 42.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test
> _`outcome'_acs_sib_dk.ster, replace
 43. 
. 
. 
. 
.   ********* Save VA estimates
.   collapse (firstnm) va_* ///
>     (mean) `outcome'* ///
>     (sum) n_g11_`outcome'_dk = touse_`outcome'_dk ///
>     , by(school_id cdscode grade year)
 44.   // save to VA project data folder
.   save $vaprojdir/data/sib_acs_restr_smp/outcome_va/va_`outcome'_sib_acs_dk.d
> ta, replace
 45. 
. 
. }
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(38, 431857)   =   1576.65
       Model |  10421.6304        38  274.253431   Prob > F        =    0.0000
    Residual |  75119.9672   431,857  .173946392   R-squared       =    0.1218
-------------+----------------------------------   Adj R-squared   =    0.1218
       Total |  85541.5975   431,895  .198061097   Root MSE        =    .41707

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0421675   .0075196     5.61   0.000     .0274293    .0569056
  va_math_og |   .1773063   .0070343    25.21   0.000     .1635192    .1910934
             |
        year |
       2016  |   .0088266   .0025268     3.49   0.000     .0038742     .013779
       2017  |   -.015962   .0025363    -6.29   0.000    -.0209332   -.0109909
       2018  |  -.0285388   .0025602   -11.15   0.000    -.0335567   -.0235209
             |
         age |  -.0001447   4.60e-06   -31.44   0.000    -.0001537   -.0001357
             |
        male |
       Male  |  -.0681405   .0012986   -52.47   0.000    -.0706857   -.0655954
 1.eth_asian |   .0522408   .0020319    25.71   0.000     .0482585    .0562232
1.eth_hisp~c |  -.0293557   .0017847   -16.45   0.000    -.0328536   -.0258579
 1.eth_black |   .0064122   .0035941     1.78   0.074     -.000632    .0134564
 1.eth_other |  -.0120122   .0038627    -3.11   0.002    -.0195829   -.0044415
             |
econ_disad~e |
Economic ..  |   -.064551   .0015153   -42.60   0.000    -.0675209    -.061581
             |
limited_en~f |
Limited E..  |  -.0488082   .0034714   -14.06   0.000     -.055612   -.0420043
             |
    disabled |
   Disabled  |  -.0210797   .0033953    -6.21   0.000    -.0277344   -.0144249
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0799659    .002552    31.33   0.000      .074964    .0849678
       2016  |   .0689352   .0024882    27.71   0.000     .0640585    .0738119
       2017  |   .0736873   .0026401    27.91   0.000     .0685128    .0788618
       2018  |   .0709839   .0032933    21.55   0.000      .064529    .0774388
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0183522   .0013527   -13.57   0.000    -.0210035   -.0157009
       2016  |  -.0227603   .0013533   -16.82   0.000    -.0254126   -.0201079
       2017  |  -.0122225   .0014136    -8.65   0.000     -.014993    -.009452
       2018  |   -.012827   .0014102    -9.10   0.000    -.0155909   -.0100631
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0005389   .0006107    -0.88   0.378    -.0017358     .000658
       2016  |   .0012886   .0005604     2.30   0.021     .0001902    .0023871
       2017  |  -.0018248    .000558    -3.27   0.001    -.0029186   -.0007311
       2018  |   -.004934   .0009254    -5.33   0.000    -.0067478   -.0031202
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0568535   .0025385    22.40   0.000     .0518781    .0618289
       2016  |    .062707    .002578    24.32   0.000     .0576541    .0677599
       2017  |    .058847   .0027132    21.69   0.000     .0535293    .0641647
       2018  |    .085897   .0033125    25.93   0.000     .0794047    .0923894
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0116976   .0016957    -6.90   0.000    -.0150211   -.0083741
       2016  |  -.0155996   .0016519    -9.44   0.000    -.0188373   -.0123618
       2017  |  -.0130493   .0017414    -7.49   0.000    -.0164624   -.0096362
       2018  |  -.0038737   .0013802    -2.81   0.005    -.0065789   -.0011686
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0005544   .0006872    -0.81   0.420    -.0019013    .0007924
       2016  |   .0005859    .000729     0.80   0.422    -.0008429    .0020148
       2017  |   -.000158    .000733    -0.22   0.829    -.0015946    .0012786
       2018  |  -.0069032   .0009094    -7.59   0.000    -.0086855   -.0051208
             |
       _cons |     1.6926   .0281888    60.05   0.000     1.637351    1.747849
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_og_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41706881 .07563984 .41015242 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0046042934   .5966938365          3402  |
  2 |  .0039815225   .5342492631          2214  |
  3 |  .0032809054   .4555608306          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0046042934  |
  2 |  .0039815225  |
  3 |  .0039815225  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =    3405.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0197
                                                Root MSE          =      .4129

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
 enr_r_og_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   1.044964   .0179061    58.36   0.000     1.009834    1.080094
       _cons |  -.0015768   .0004137    -3.81   0.000    -.0023884   -.0007651
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(45, 431850)   =   1387.07
       Model |  10802.5131        45  240.055846   Prob > F        =    0.0000
    Residual |  74739.0845   431,850  .173067233   R-squared       =    0.1263
-------------+----------------------------------   Adj R-squared   =    0.1262
       Total |  85541.5975   431,895  .198061097   Root MSE        =    .41601

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0772199   .0075892    10.17   0.000     .0623453    .0920946
  va_math_og |   .1185431   .0072265    16.40   0.000     .1043795    .1327068
             |
        year |
       2016  |   .0089216    .002522     3.54   0.000     .0039786    .0138646
       2017  |  -.0159556   .0025366    -6.29   0.000    -.0209273   -.0109839
       2018  |  -.0272658   .0025671   -10.62   0.000    -.0322972   -.0222343
             |
         age |  -.0001499   4.60e-06   -32.59   0.000    -.0001589   -.0001408
             |
        male |
       Male  |  -.0690838   .0012955   -53.32   0.000     -.071623   -.0665445
 1.eth_asian |   .0472705   .0022872    20.67   0.000     .0427876    .0517535
1.eth_hisp~c |  -.0024668   .0019767    -1.25   0.212    -.0063412    .0014075
 1.eth_black |   .0293625   .0037609     7.81   0.000     .0219913    .0367336
 1.eth_other |   -.009261   .0038675    -2.39   0.017    -.0168413   -.0016807
             |
econ_disad~e |
Economic ..  |  -.0398335   .0016142   -24.68   0.000    -.0429973   -.0366696
             |
limited_en~f |
Limited E..  |  -.0489998   .0034639   -14.15   0.000     -.055789   -.0422106
             |
    disabled |
   Disabled  |   -.029038   .0033912    -8.56   0.000    -.0356846   -.0223914
             |
        year#|
          c. |
prior_ela_~e |
       2015  |    .075112   .0025481    29.48   0.000     .0701178    .0801062
       2016  |   .0643676   .0024843    25.91   0.000     .0594984    .0692368
       2017  |   .0675841   .0026369    25.63   0.000     .0624159    .0727523
       2018  |    .067346   .0032863    20.49   0.000     .0609049     .073787
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0182751   .0013495   -13.54   0.000    -.0209202   -.0156301
       2016  |  -.0226306   .0013501   -16.76   0.000    -.0252768   -.0199845
       2017  |  -.0122425   .0014103    -8.68   0.000    -.0150066   -.0094784
       2018  |  -.0124888   .0014067    -8.88   0.000     -.015246   -.0097317
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0004716   .0006092    -0.77   0.439    -.0016656    .0007223
       2016  |   .0012903    .000559     2.31   0.021     .0001946    .0023859
       2017  |  -.0016341   .0005567    -2.94   0.003    -.0027252    -.000543
       2018  |  -.0049341   .0009231    -5.35   0.000    -.0067433   -.0031248
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0556127   .0025325    21.96   0.000      .050649    .0605763
       2016  |   .0615664   .0025718    23.94   0.000     .0565257    .0666071
       2017  |   .0582545   .0027067    21.52   0.000     .0529495    .0635596
       2018  |   .0828859    .003305    25.08   0.000     .0764081    .0893636
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   -.011226   .0016918    -6.64   0.000     -.014542     -.00791
       2016  |  -.0150932   .0016481    -9.16   0.000    -.0183234   -.0118631
       2017  |  -.0130868   .0017371    -7.53   0.000    -.0164915   -.0096821
       2018  |  -.0046436   .0013771    -3.37   0.001    -.0073427   -.0019444
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0007974   .0006855    -1.16   0.245     -.002141    .0005462
       2016  |    .000387   .0007272     0.53   0.595    -.0010383    .0018123
       2017  |  -.0002799   .0007311    -0.38   0.702    -.0017129    .0011531
       2018  |   -.007104   .0009072    -7.83   0.000    -.0088821   -.0053258
             |
eth_asian_~t |   .0005051   .0000486    10.40   0.000       .00041    .0006003
eth_hispan~t |  -.0004511   .0000481    -9.37   0.000    -.0005455   -.0003568
eth_black_~t |  -.0010174   .0000893   -11.39   0.000    -.0011925   -.0008424
educ_hs_dr~p |  -.4241345   .1290271    -3.29   0.001    -.6770237   -.1712454
educ~us_prop |   .5158432   .1180954     4.37   0.000     .2843798    .7473066
pov_fam_ch~t |  -.0005229   .0000736    -7.11   0.000    -.0006671   -.0003787
inc_medi~_hh |   3.85e-07   3.37e-08    11.45   0.000     3.19e-07    4.51e-07
       _cons |   1.694189   .0283937    59.67   0.000     1.638538    1.749839
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_acs_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.4160135 .0726969 .40961249 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0041844174   .5780132151          3402  |
  2 |  .0035277423   .5024745625          2214  |
  3 |  .0029886938   .4360367768          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0041844174  |
  2 |  .0035277423  |
  3 |  .0035277423  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =    2696.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0176
                                                Root MSE          =     .41229

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_acs_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   1.058589   .0203854    51.93   0.000     1.018596    1.098583
       _cons |  -.0012275   .0004123    -2.98   0.003    -.0020363   -.0004186
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_acs_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =     102.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0279
                                                Root MSE          =     .02928

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d_og~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .0884946   .0087384    10.13   0.000     .0713508    .1056383
       _cons |  -.0001375   .0006192    -0.22   0.824    -.0013524    .0010773
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_acs_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(40, 431855)   =   1513.32
       Model |  10516.2212        40  262.905531   Prob > F        =    0.0000
    Residual |  75025.3763   431,855  .173728164   R-squared       =    0.1229
-------------+----------------------------------   Adj R-squared   =    0.1229
       Total |  85541.5975   431,895  .198061097   Root MSE        =    .41681

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0403119   .0075155     5.36   0.000     .0255817     .055042
  va_math_og |   .1781085   .0070312    25.33   0.000     .1643275    .1918895
             |
        year |
       2016  |   .0082649   .0025254     3.27   0.001     .0033153    .0132145
       2017  |  -.0172041   .0025354    -6.79   0.000    -.0221735   -.0122347
       2018  |  -.0302769   .0025603   -11.83   0.000     -.035295   -.0252589
             |
         age |  -.0001426   4.60e-06   -30.99   0.000    -.0001516   -.0001335
             |
        male |
       Male  |  -.0681813   .0012978   -52.54   0.000    -.0707249   -.0656378
 1.eth_asian |   .0509574   .0020315    25.08   0.000     .0469758     .054939
1.eth_hisp~c |  -.0291632   .0017839   -16.35   0.000    -.0326597   -.0256667
 1.eth_black |   .0063435   .0035918     1.77   0.077    -.0006963    .0133833
 1.eth_other |  -.0114007   .0038603    -2.95   0.003    -.0189668   -.0038346
             |
econ_disad~e |
Economic ..  |  -.0649786   .0015146   -42.90   0.000    -.0679471   -.0620101
             |
limited_en~f |
Limited E..  |  -.0487343   .0034692   -14.05   0.000    -.0555339   -.0419347
             |
    disabled |
   Disabled  |  -.0204053   .0033933    -6.01   0.000    -.0270561   -.0137544
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0798947   .0025506    31.32   0.000     .0748956    .0848937
       2016  |   .0690207   .0024868    27.76   0.000     .0641467    .0738948
       2017  |    .073922   .0026388    28.01   0.000       .06875     .079094
       2018  |   .0706508   .0032914    21.46   0.000     .0641996    .0771019
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0182813   .0013519   -13.52   0.000     -.020931   -.0156316
       2016  |  -.0226417   .0013525   -16.74   0.000    -.0252925   -.0199909
       2017  |  -.0120015   .0014127    -8.50   0.000    -.0147704   -.0092326
       2018  |  -.0127817   .0014093    -9.07   0.000    -.0155439   -.0100195
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0005044   .0006103    -0.83   0.409    -.0017006    .0006918
       2016  |   .0012836   .0005601     2.29   0.022     .0001858    .0023813
       2017  |  -.0018497   .0005577    -3.32   0.001    -.0029428   -.0007566
       2018  |  -.0048129   .0009249    -5.20   0.000    -.0066256   -.0030002
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0562125   .0025371    22.16   0.000     .0512399    .0611852
       2016  |   .0617169   .0025769    23.95   0.000     .0566663    .0667674
       2017  |   .0580042   .0027118    21.39   0.000     .0526892    .0633192
       2018  |   .0850498   .0033108    25.69   0.000     .0785607    .0915389
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0115787   .0016946    -6.83   0.000    -.0149002   -.0082573
       2016  |  -.0155342   .0016509    -9.41   0.000      -.01877   -.0122985
       2017  |  -.0130459   .0017403    -7.50   0.000    -.0164569   -.0096349
       2018  |  -.0036977   .0013794    -2.68   0.007    -.0064014    -.000994
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0005275   .0006868    -0.77   0.442    -.0018735    .0008185
       2016  |     .00068   .0007286     0.93   0.351     -.000748     .002108
       2017  |  -.0000802   .0007325    -0.11   0.913    -.0015159    .0013555
       2018  |  -.0067515   .0009088    -7.43   0.000    -.0085328   -.0049702
             |
1.has_~2year |   .0205076   .0025043     8.19   0.000     .0155993     .025416
1.has_~4year |   .0575954   .0027038    21.30   0.000      .052296    .0628947
       _cons |   1.675675    .028182    59.46   0.000     1.620439    1.730911
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_sib_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41680711 .07545261 .40992081 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0045827287   .5963057837          3402  |
  2 |  .0039616362   .5337779609          2214  |
  3 |  .0032570025   .4543373985          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0045827287  |
  2 |  .0039616362  |
  3 |  .0039616362  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =    3409.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0197
                                                Root MSE          =     .41265

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_sib_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   1.044366   .0178854    58.39   0.000     1.009277    1.079455
       _cons |  -.0015464   .0004135    -3.74   0.000    -.0023576   -.0007352
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_sib_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =      10.61
                                                Prob > F          =     0.0012
                                                R-squared         =     0.0001
                                                Root MSE          =      .0148

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d~b_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_og_dk |   .0024698   .0007582     3.26   0.001     .0009823    .0039574
       _cons |  -3.88e-06    .000047    -0.08   0.934    -.0000962    .0000884
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_sib_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(47, 431848)   =   1341.45
       Model |  10897.7052        47  231.866067   Prob > F        =    0.0000
    Residual |  74643.8924   431,848  .172847605   R-squared       =    0.1274
-------------+----------------------------------   Adj R-squared   =    0.1273
       Total |  85541.5975   431,895  .198061097   Root MSE        =    .41575

------------------------------------------------------------------------------
         enr | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0753096   .0075849     9.93   0.000     .0604433    .0901759
  va_math_og |   .1195138   .0072227    16.55   0.000     .1053574    .1336701
             |
        year |
       2016  |   .0083707   .0025205     3.32   0.001     .0034306    .0133109
       2017  |  -.0171957   .0025357    -6.78   0.000    -.0221656   -.0122258
       2018  |  -.0290161   .0025672   -11.30   0.000    -.0340478   -.0239845
             |
         age |  -.0001477   4.60e-06   -32.12   0.000    -.0001567   -.0001387
             |
        male |
       Male  |  -.0691268   .0012947   -53.39   0.000    -.0716645   -.0665892
 1.eth_asian |   .0458222   .0022867    20.04   0.000     .0413404     .050304
1.eth_hisp~c |  -.0022263   .0019759    -1.13   0.260    -.0060989    .0016463
 1.eth_black |   .0293098   .0037585     7.80   0.000     .0219432    .0366763
 1.eth_other |  -.0086969   .0038652    -2.25   0.024    -.0162725   -.0011213
             |
econ_disad~e |
Economic ..  |  -.0403076   .0016134   -24.98   0.000    -.0434698   -.0371454
             |
limited_en~f |
Limited E..  |  -.0489368   .0034618   -14.14   0.000    -.0557218   -.0421519
             |
    disabled |
   Disabled  |  -.0283789   .0033892    -8.37   0.000    -.0350216   -.0217362
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .0750247   .0025466    29.46   0.000     .0700334     .080016
       2016  |   .0644412    .002483    25.95   0.000     .0595747    .0693077
       2017  |    .067823   .0026356    25.73   0.000     .0626573    .0729887
       2018  |   .0670184   .0032844    20.41   0.000     .0605811    .0734556
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0181987   .0013487   -13.49   0.000    -.0208421   -.0155553
       2016  |  -.0225062   .0013493   -16.68   0.000    -.0251507   -.0198616
       2017  |  -.0120124   .0014094    -8.52   0.000    -.0147749     -.00925
       2018  |  -.0124371   .0014059    -8.85   0.000    -.0151926   -.0096817
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0004366   .0006088    -0.72   0.473    -.0016298    .0007566
       2016  |   .0012855   .0005587     2.30   0.021     .0001905    .0023805
       2017  |  -.0016608   .0005563    -2.99   0.003    -.0027512   -.0005705
       2018  |   -.004812   .0009225    -5.22   0.000    -.0066201   -.0030039
             |
        year#|
          c. |
prior_math~e |
       2015  |   .0549789   .0025311    21.72   0.000      .050018    .0599397
       2016  |   .0605807   .0025706    23.57   0.000     .0555424    .0656191
       2017  |   .0574211   .0027053    21.23   0.000     .0521187    .0627234
       2018  |   .0820344   .0033034    24.83   0.000     .0755598    .0885089
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0110969   .0016908    -6.56   0.000    -.0144108    -.007783
       2016  |  -.0150219    .001647    -9.12   0.000    -.0182501   -.0117938
       2017  |  -.0130786    .001736    -7.53   0.000    -.0164812   -.0096761
       2018  |  -.0044607   .0013764    -3.24   0.001    -.0071584   -.0017631
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0007734   .0006851    -1.13   0.259    -.0021161    .0005694
       2016  |   .0004803   .0007268     0.66   0.509    -.0009441    .0019047
       2017  |   -.000203   .0007307    -0.28   0.781    -.0016351    .0012292
       2018  |  -.0069504   .0009067    -7.67   0.000    -.0087275   -.0051733
             |
1.has_~2year |   .0207771   .0024986     8.32   0.000       .01588    .0256742
1.has_~4year |   .0577038   .0026981    21.39   0.000     .0524156    .0629921
eth_asian_~t |   .0005132   .0000485    10.58   0.000     .0004181    .0006083
eth_hispan~t |  -.0004535   .0000481    -9.43   0.000    -.0005477   -.0003592
eth_black_~t |  -.0010265   .0000893   -11.50   0.000    -.0012014   -.0008515
educ_hs_dr~p |  -.4482828   .1289496    -3.48   0.001    -.7010202   -.1955455
educ~us_prop |   .5526275   .1180416     4.68   0.000     .3212696    .7839854
pov_fam_ch~t |   -.000524   .0000735    -7.13   0.000    -.0006681     -.00038
inc_medi~_hh |   3.68e-07   3.37e-08    10.93   0.000     3.02e-07    4.34e-07
       _cons |   1.678151   .0283861    59.12   0.000     1.622515    1.733787
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_both_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41574945 .07244593 .4093888 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0041540851   .5769807246          3402  |
  2 |  .0034993897   .5012133949          2214  |
  3 |  .0029574261    .434027497          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0041540851  |
  2 |  .0034993897  |
  3 |  .0034993897  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =    2679.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0175
                                                Root MSE          =     .41205

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_both~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_bot~k |   1.058216   .0204429    51.76   0.000     1.018109    1.098323
       _cons |  -.0011966   .0004123    -2.90   0.004    -.0020055   -.0003876
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_both_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =      27.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0002
                                                Root MSE          =     .01484

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d_ac~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_acs~k |   .0040198   .0007718     5.21   0.000     .0025056    .0055339
       _cons |  -4.87e-06   .0000453    -0.11   0.914    -.0000937     .000084
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_sib_acs_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =     105.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0287
                                                Root MSE          =     .02929

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_r_d_si~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_sib~k |   .0900392   .0087725    10.26   0.000     .0728285    .1072499
       _cons |  -.0001374    .000618    -0.22   0.824    -.0013497     .001075
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_acs_sib_dk.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/o
    > utcome_va/va_enr_sib_acs_dk.dta saved
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(38, 431857)   =    651.57
       Model |  5400.34152        38   142.11425   Prob > F        =    0.0000
    Residual |  94191.8539   431,857  .218108897   R-squared       =    0.0542
-------------+----------------------------------   Adj R-squared   =    0.0541
       Total |  99592.1954   431,895  .230593536   Root MSE        =    .46702

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .1043496   .0084202    12.39   0.000     .0878463     .120853
  va_math_og |  -.1584727   .0078768   -20.12   0.000    -.1739111   -.1430343
             |
        year |
       2016  |  -.0089954   .0028294    -3.18   0.001     -.014541   -.0034498
       2017  |  -.0360757   .0028401   -12.70   0.000    -.0416422   -.0305091
       2018  |  -.0104904   .0028668    -3.66   0.000    -.0161093   -.0048715
             |
         age |  -.0000733   5.15e-06   -14.22   0.000    -.0000834   -.0000632
             |
        male |
       Male  |   .0222082   .0014541    15.27   0.000     .0193582    .0250582
 1.eth_asian |   -.009358   .0022752    -4.11   0.000    -.0138173   -.0048987
1.eth_hisp~c |  -.0089892   .0019984    -4.50   0.000     -.012906   -.0050723
 1.eth_black |  -.0419422   .0040245   -10.42   0.000    -.0498301   -.0340542
 1.eth_other |   .0022075   .0043253     0.51   0.610    -.0062699    .0106849
             |
econ_disad~e |
Economic ..  |  -.0283363   .0016968   -16.70   0.000    -.0316619   -.0250106
             |
limited_en~f |
Limited E..  |  -.0263005   .0038872    -6.77   0.000    -.0339192   -.0186817
             |
    disabled |
   Disabled  |   .0316473    .003802     8.32   0.000     .0241955    .0390991
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0592603   .0028577   -20.74   0.000    -.0648613   -.0536593
       2016  |   -.054357   .0027862   -19.51   0.000    -.0598178   -.0488962
       2017  |  -.0511084   .0029563   -17.29   0.000    -.0569026   -.0453141
       2018  |  -.0265666   .0036878    -7.20   0.000    -.0337945   -.0193386
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0418503   .0015147   -27.63   0.000    -.0448191   -.0388815
       2016  |  -.0405543   .0015154   -26.76   0.000    -.0435244   -.0375843
       2017  |  -.0309452   .0015829   -19.55   0.000    -.0340476   -.0278429
       2018  |  -.0325351   .0015791   -20.60   0.000    -.0356301   -.0294401
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108913   .0006838    15.93   0.000      .009551    .0122316
       2016  |   .0107145   .0006275    17.07   0.000     .0094845    .0119445
       2017  |   .0082865   .0006249    13.26   0.000     .0070618    .0095113
       2018  |    .004262   .0010363     4.11   0.000      .002231    .0062931
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0662272   .0028425   -23.30   0.000    -.0717985   -.0606559
       2016  |  -.0664952   .0028868   -23.03   0.000    -.0721533   -.0608372
       2017  |  -.0672433   .0030381   -22.13   0.000    -.0731979   -.0612887
       2018  |  -.0549022   .0037092   -14.80   0.000    -.0621721   -.0476322
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0293926   .0018988   -15.48   0.000    -.0331141    -.025671
       2016  |   -.033535   .0018498   -18.13   0.000    -.0371606   -.0299095
       2017  |  -.0263686     .00195   -13.52   0.000    -.0301905   -.0225467
       2018  |   -.035513   .0015455   -22.98   0.000    -.0385422   -.0324839
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0097712   .0007695    12.70   0.000      .008263    .0112793
       2016  |   .0115333   .0008163    14.13   0.000     .0099333    .0131332
       2017  |   .0092076   .0008208    11.22   0.000     .0075989    .0108162
       2018  |   .0024287   .0010183     2.39   0.017     .0004329    .0044246
             |
       _cons |   .9101477    .031565    28.83   0.000     .8482814    .9720141
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_og_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.4670213 .09705512 .45682513 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |   .008762458   .7336057726          3402  |
  2 |  .0079666557   .6742088911          2214  |
  3 |  .0070468579   .6153100282          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |   .008762458  |
  2 |  .0079666557  |
  3 |  .0079666557  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =   12341.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0336
                                                Root MSE          =     .45909

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2year_~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_2ye~k |    .991002   .0089205   111.09   0.000     .9735009    1.008503
       _cons |  -.0012979   .0003987    -3.26   0.001    -.0020801   -.0005157
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(45, 431850)   =    627.59
       Model |  6113.25514        45  135.850114   Prob > F        =    0.0000
    Residual |  93478.9402   431,850  .216461596   R-squared       =    0.0614
-------------+----------------------------------   Adj R-squared   =    0.0613
       Total |  99592.1954   431,895  .230593536   Root MSE        =    .46525

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0888501   .0084875    10.47   0.000     .0722148    .1054854
  va_math_og |  -.1371329   .0080818   -16.97   0.000     -.152973   -.1212927
             |
        year |
       2016  |  -.0069583   .0028205    -2.47   0.014    -.0124864   -.0014303
       2017  |  -.0336546   .0028369   -11.86   0.000    -.0392148   -.0280945
       2018  |  -.0075547    .002871    -2.63   0.009    -.0131818   -.0019277
             |
         age |  -.0000733   5.14e-06   -14.25   0.000    -.0000833   -.0000632
             |
        male |
       Male  |   .0213264   .0014489    14.72   0.000     .0184866    .0241661
 1.eth_asian |   -.022617    .002558    -8.84   0.000    -.0276305   -.0176034
1.eth_hisp~c |   .0113613   .0022107     5.14   0.000     .0070284    .0156942
 1.eth_black |  -.0161098    .004206    -3.83   0.000    -.0243535   -.0078662
 1.eth_other |   .0006996   .0043253     0.16   0.872    -.0077779    .0091771
             |
econ_disad~e |
Economic ..  |  -.0188312   .0018053   -10.43   0.000    -.0223696   -.0152929
             |
limited_en~f |
Limited E..  |  -.0277316    .003874    -7.16   0.000    -.0353245   -.0201388
             |
    disabled |
   Disabled  |   .0269918   .0037926     7.12   0.000     .0195584    .0344251
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0629817   .0028497   -22.10   0.000     -.068567   -.0573964
       2016  |  -.0580095   .0027784   -20.88   0.000    -.0634551    -.052564
       2017  |  -.0540258    .002949   -18.32   0.000    -.0598058   -.0482459
       2018  |  -.0283922   .0036753    -7.73   0.000    -.0355956   -.0211888
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0406011   .0015093   -26.90   0.000    -.0435592    -.037643
       2016  |  -.0392665   .0015099   -26.01   0.000    -.0422259   -.0363072
       2017  |  -.0294708   .0015772   -18.69   0.000    -.0325621   -.0263796
       2018  |  -.0313973   .0015732   -19.96   0.000    -.0344808   -.0283138
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0108956   .0006813    15.99   0.000     .0095603    .0122308
       2016  |   .0107014   .0006252    17.12   0.000     .0094761    .0119268
       2017  |   .0082031   .0006226    13.18   0.000     .0069829    .0094233
       2018  |   .0043919   .0010324     4.25   0.000     .0023685    .0064153
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0653439   .0028322   -23.07   0.000     -.070895   -.0597927
       2016  |  -.0656921   .0028762   -22.84   0.000    -.0713295   -.0600548
       2017  |  -.0659902   .0030271   -21.80   0.000    -.0719232   -.0600571
       2018  |  -.0570123   .0036962   -15.42   0.000    -.0642568   -.0497678
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0272108   .0018921   -14.38   0.000    -.0309192   -.0235023
       2016  |  -.0318387   .0018431   -17.27   0.000    -.0354512   -.0282262
       2017  |  -.0253895   .0019428   -13.07   0.000    -.0291972   -.0215817
       2018  |  -.0345247   .0015401   -22.42   0.000    -.0375433   -.0315061
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0091528   .0007667    11.94   0.000     .0076502    .0106555
       2016  |   .0110833   .0008133    13.63   0.000     .0094893    .0126773
       2017  |   .0089393   .0008177    10.93   0.000     .0073366    .0105419
       2018  |   .0027663   .0010146     2.73   0.006     .0007777    .0047549
             |
eth_asian_~t |   .0007635   .0000543    14.06   0.000      .000657    .0008699
eth_hispan~t |  -.0010294   .0000538   -19.12   0.000     -.001135   -.0009239
eth_black_~t |  -.0025833   .0000999   -25.87   0.000     -.002779   -.0023875
educ_hs_dr~p |   -2.01207   .1442992   -13.94   0.000    -2.294892   -1.729248
educ~us_prop |  -1.622328   .1320736   -12.28   0.000    -1.881189   -1.363468
pov_fam_ch~t |  -.0012283   .0000823   -14.93   0.000    -.0013896   -.0010671
inc_medi~_hh |  -1.13e-06   3.77e-08   -30.08   0.000    -1.21e-06   -1.06e-06
       _cons |   1.067312   .0317544    33.61   0.000     1.005074     1.12955
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_acs_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.46525433 .08727276 .45699569 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0069046443   .6837314477          3402  |
  2 |  .0061216123    .610441169          2214  |
  3 |  .0053454795   .5464483791          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0069046443  |
  2 |  .0061216123  |
  3 |  .0061216123  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =    8151.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0257
                                                Root MSE          =     .45921

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2ye~s_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~s_dk |   .9949964   .0110203    90.29   0.000     .9733758    1.016617
       _cons |  -.0012536   .0004245    -2.95   0.003    -.0020863   -.0004208
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_acs_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =     250.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0934
                                                Root MSE          =     .03868

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr~g_acs_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~g_dk |    .143796    .009077    15.84   0.000      .125988     .161604
       _cons |  -.0001916   .0007915    -0.24   0.809    -.0017444    .0013611
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_acs_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(40, 431855)   =    670.66
       Model |  5824.77167        40  145.619292   Prob > F        =    0.0000
    Residual |  93767.4237   431,855    .2171271   R-squared       =    0.0585
-------------+----------------------------------   Adj R-squared   =    0.0584
       Total |  99592.1954   431,895  .230593536   Root MSE        =    .46597

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .1026789   .0084019    12.22   0.000     .0862114    .1191465
  va_math_og |  -.1526898   .0078606   -19.42   0.000    -.1680963   -.1372834
             |
        year |
       2016  |   -.009298   .0028232    -3.29   0.001    -.0148314   -.0037646
       2017  |  -.0366384   .0028345   -12.93   0.000    -.0421939   -.0310828
       2018  |  -.0121662   .0028623    -4.25   0.000    -.0177761   -.0065562
             |
         age |  -.0000727   5.14e-06   -14.14   0.000    -.0000828   -.0000627
             |
        male |
       Male  |   .0223743   .0014508    15.42   0.000     .0195307    .0252179
 1.eth_asian |    -.00975   .0022711    -4.29   0.000    -.0142012   -.0052988
1.eth_hisp~c |   -.010863   .0019944    -5.45   0.000    -.0147719   -.0069541
 1.eth_black |  -.0419687   .0040155   -10.45   0.000    -.0498389   -.0340986
 1.eth_other |   .0015662   .0043156     0.36   0.717    -.0068924    .0100247
             |
econ_disad~e |
Economic ..  |  -.0288857   .0016932   -17.06   0.000    -.0322043   -.0255671
             |
limited_en~f |
Limited E..  |  -.0268887   .0038784    -6.93   0.000    -.0344903   -.0192871
             |
    disabled |
   Disabled  |   .0317512   .0037936     8.37   0.000     .0243159    .0391865
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0579097   .0028514   -20.31   0.000    -.0634984    -.052321
       2016  |   -.052967   .0027801   -19.05   0.000    -.0584159   -.0475181
       2017  |  -.0491048   .0029501   -16.65   0.000    -.0548869   -.0433227
       2018  |  -.0249779   .0036797    -6.79   0.000    -.0321899   -.0177659
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0415409   .0015113   -27.49   0.000    -.0445031   -.0385787
       2016  |  -.0402167    .001512   -26.60   0.000    -.0431802   -.0372533
       2017  |  -.0307012   .0015794   -19.44   0.000    -.0337967   -.0276058
       2018  |  -.0323039   .0015755   -20.50   0.000    -.0353919   -.0292159
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0107279   .0006823    15.72   0.000     .0093906    .0120652
       2016  |   .0105667   .0006261    16.88   0.000     .0093395     .011794
       2017  |   .0081009   .0006235    12.99   0.000     .0068789    .0093229
       2018  |   .0040668   .0010339     3.93   0.000     .0020403    .0060933
             |
        year#|
          c. |
prior_math~e |
       2015  |   -.065055   .0028364   -22.94   0.000    -.0706142   -.0594959
       2016  |  -.0649656   .0028808   -22.55   0.000    -.0706119   -.0593193
       2017  |  -.0657692   .0030316   -21.69   0.000    -.0717111   -.0598273
       2018  |  -.0525668   .0037013   -14.20   0.000    -.0598213   -.0453123
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0291923   .0018945   -15.41   0.000    -.0329055   -.0254791
       2016  |  -.0332555   .0018456   -18.02   0.000    -.0368729   -.0296381
       2017  |  -.0261631   .0019456   -13.45   0.000    -.0299764   -.0223498
       2018  |  -.0348784   .0015422   -22.62   0.000     -.037901   -.0318558
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0096678   .0007678    12.59   0.000      .008163    .0111726
       2016  |   .0113594   .0008145    13.95   0.000      .009763    .0129558
       2017  |   .0090856   .0008189    11.09   0.000     .0074806    .0106907
       2018  |   .0022009    .001016     2.17   0.030     .0002095    .0041923
             |
1.has_~2year |   .1001286   .0027997    35.76   0.000     .0946414    .1056159
1.has_~4year |  -.0851039   .0030227   -28.15   0.000    -.0910283   -.0791795
       _cons |   .9056998    .031506    28.75   0.000      .843949    .9674505
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_sib_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.46596899 .09534573 .45610996 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0084488726    .727458203          3402  |
  2 |  .0076552349   .6663956527          2214  |
  3 |  .0067559872    .607548319          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0084488726  |
  2 |  .0076552349  |
  3 |  .0076552349  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =   11778.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0324
                                                Root MSE          =     .45834

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2ye~b_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~b_dk |   .9914549   .0091355   108.53   0.000      .973532    1.009378
       _cons |  -.0013271   .0003992    -3.32   0.001    -.0021103   -.0005439
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_sib_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =     484.54
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0026
                                                Root MSE          =     .03131

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr~g_sib_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~g_dk |   .0186709   .0008482    22.01   0.000     .0170069     .020335
       _cons |  -.0000239   .0000718    -0.33   0.739    -.0001649     .000117
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_sib_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(47, 431848)   =    642.66
       Model |  6510.45157        47  138.520246   Prob > F        =    0.0000
    Residual |  93081.7438   431,848  .215542839   R-squared       =    0.0654
-------------+----------------------------------   Adj R-squared   =    0.0653
       Total |  99592.1954   431,895  .230593536   Root MSE        =    .46427

------------------------------------------------------------------------------
   enr_2year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |   .0880829   .0084701    10.40   0.000     .0714818     .104684
  va_math_og |  -.1328303   .0080656   -16.47   0.000    -.1486387   -.1170219
             |
        year |
       2016  |  -.0073154   .0028147    -2.60   0.009     -.012832   -.0017987
       2017  |  -.0342971   .0028316   -12.11   0.000     -.039847   -.0287472
       2018  |  -.0092883   .0028668    -3.24   0.001    -.0149071   -.0036695
             |
         age |  -.0000728   5.13e-06   -14.18   0.000    -.0000829   -.0000627
             |
        male |
       Male  |   .0214901   .0014458    14.86   0.000     .0186563    .0243238
 1.eth_asian |  -.0225783   .0025535    -8.84   0.000    -.0275831   -.0175735
1.eth_hisp~c |   .0095364   .0022064     4.32   0.000     .0052119    .0138609
 1.eth_black |    -.01626   .0041971    -3.87   0.000    -.0244861   -.0080338
 1.eth_other |   .0002321   .0043162     0.05   0.957    -.0082275    .0086918
             |
econ_disad~e |
Economic ..  |   -.019189   .0018017   -10.65   0.000    -.0227202   -.0156579
             |
limited_en~f |
Limited E..  |  -.0282556   .0038657    -7.31   0.000    -.0358324   -.0206789
             |
    disabled |
   Disabled  |   .0270916   .0037847     7.16   0.000     .0196737    .0345094
             |
        year#|
          c. |
prior_ela_~e |
       2015  |  -.0616675   .0028438   -21.68   0.000    -.0672413   -.0560937
       2016  |  -.0566533   .0027727   -20.43   0.000    -.0620877   -.0512189
       2017  |  -.0521045   .0029432   -17.70   0.000     -.057873    -.046336
       2018  |  -.0268758   .0036676    -7.33   0.000    -.0340643   -.0196874
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0403268   .0015061   -26.78   0.000    -.0432787   -.0373749
       2016  |  -.0389635   .0015067   -25.86   0.000    -.0419166   -.0360103
       2017  |  -.0292638   .0015739   -18.59   0.000    -.0323486    -.026179
       2018  |  -.0311943   .0015699   -19.87   0.000    -.0342713   -.0281173
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0107388   .0006798    15.80   0.000     .0094064    .0120712
       2016  |   .0105589   .0006239    16.92   0.000     .0093361    .0117816
       2017  |   .0080272   .0006213    12.92   0.000     .0068096    .0092448
       2018  |   .0042017   .0010302     4.08   0.000     .0021826    .0062209
             |
        year#|
          c. |
prior_math~e |
       2015  |  -.0642655   .0028265   -22.74   0.000    -.0698053   -.0587258
       2016  |  -.0642693   .0028706   -22.39   0.000    -.0698956    -.058643
       2017  |  -.0646191    .003021   -21.39   0.000    -.0705402    -.058698
       2018  |   -.054764   .0036889   -14.85   0.000    -.0619941    -.047534
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0270547   .0018881   -14.33   0.000    -.0307553   -.0233541
       2016  |  -.0315957   .0018392   -17.18   0.000    -.0352006   -.0279909
       2017  |  -.0252121   .0019386   -13.01   0.000    -.0290118   -.0214124
       2018  |  -.0339364    .001537   -22.08   0.000    -.0369489    -.030924
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0090637    .000765    11.85   0.000     .0075643    .0105632
       2016  |   .0109242   .0008116    13.46   0.000     .0093335    .0125148
       2017  |   .0088273   .0008159    10.82   0.000     .0072281    .0104266
       2018  |   .0025394   .0010125     2.51   0.012     .0005549    .0045238
             |
1.has_~2year |   .0977223   .0027901    35.02   0.000     .0922537    .1031909
1.has_~4year |  -.0811908    .003013   -26.95   0.000    -.0870962   -.0752854
eth_asian_~t |   .0007444   .0000542    13.74   0.000     .0006382    .0008506
eth_hispan~t |  -.0010102   .0000537   -18.80   0.000    -.0011155   -.0009049
eth_black_~t |  -.0025443   .0000997   -25.53   0.000    -.0027396    -.002349
educ_hs_dr~p |  -1.985855   .1439976   -13.79   0.000    -2.268085   -1.703624
educ~us_prop |  -1.567482   .1318166   -11.89   0.000    -1.825839   -1.309126
pov_fam_ch~t |  -.0012059   .0000821   -14.69   0.000    -.0013668    -.001045
inc_medi~_hh |  -1.10e-06   3.76e-08   -29.29   0.000    -1.17e-06   -1.03e-06
       _cons |    1.05915   .0316986    33.41   0.000     .9970222    1.121279
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_2year_both_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.46426591 .08580262 .45626829 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |   .006665608   .6771510116          3402  |
  2 |  .0058865708   .6023321105          2214  |
  3 |  .0051293168   .5387706733          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |   .006665608  |
  2 |  .0058865708  |
  3 |  .0058865708  |
    +---------------+
-------------------------------------------------------------------------------
note: label truncated to 80 characters

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =    7790.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0248
                                                Root MSE          =     .45845

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_2ye~h_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~h_dk |   .9955689   .0112792    88.27   0.000     .9734403    1.017697
       _cons |  -.0012747   .0004247    -3.00   0.003     -.002108   -.0004414
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_2year_both_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =     368.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0021
                                                Root MSE          =      .0303

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
en~s_both_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~s_dk |   .0183224   .0009551    19.18   0.000     .0164486    .0201961
       _cons |  -.0000226    .000069    -0.33   0.744    -.0001579    .0001128
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_sib_acs_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =     249.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0925
                                                Root MSE          =     .03796

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
en~b_both_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~b_dk |   .1432402   .0090598    15.81   0.000      .125466    .1610144
       _cons |  -.0001949    .000774    -0.25   0.801    -.0017134    .0013236
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_2year_acs_sib_dk.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/o
    > utcome_va/va_enr_2year_sib_acs_dk.dta saved
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(38, 431857)   =   3692.75
       Model |  24612.3613        38  647.693719   Prob > F        =    0.0000
    Residual |  75746.0618   431,857  .175396165   R-squared       =    0.2452
-------------+----------------------------------   Adj R-squared   =    0.2452
       Total |  100358.423   431,895  .232367643   Root MSE        =     .4188

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |  -.0621822   .0075508    -8.24   0.000    -.0769816   -.0473827
  va_math_og |    .335779   .0070636    47.54   0.000     .3219346    .3496234
             |
        year |
       2016  |    .017822   .0025373     7.02   0.000      .012849     .022795
       2017  |   .0201137   .0025469     7.90   0.000     .0151218    .0251055
       2018  |  -.0180484   .0025708    -7.02   0.000    -.0230872   -.0130097
             |
         age |  -.0000714   4.62e-06   -15.46   0.000    -.0000805   -.0000624
             |
        male |
       Male  |  -.0903488    .001304   -69.29   0.000    -.0929045    -.087793
 1.eth_asian |   .0615988   .0020403    30.19   0.000     .0575999    .0655978
1.eth_hisp~c |  -.0203666   .0017921   -11.36   0.000     -.023879   -.0168542
 1.eth_black |   .0483544    .003609    13.40   0.000     .0412808    .0554279
 1.eth_other |  -.0142197   .0038787    -3.67   0.000    -.0218218   -.0066175
             |
econ_disad~e |
Economic ..  |  -.0362147   .0015216   -23.80   0.000     -.039197   -.0332324
             |
limited_en~f |
Limited E..  |  -.0225077   .0034858    -6.46   0.000    -.0293399   -.0156756
             |
    disabled |
   Disabled  |   -.052727   .0034095   -15.46   0.000    -.0594094   -.0460446
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1392262   .0025626    54.33   0.000     .1342035    .1442489
       2016  |   .1232922   .0024985    49.35   0.000     .1183952    .1281892
       2017  |   .1247956   .0026511    47.07   0.000     .1195996    .1299917
       2018  |   .0975505    .003307    29.50   0.000     .0910688    .1040322
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0234981   .0013583    17.30   0.000     .0208358    .0261604
       2016  |   .0177941   .0013589    13.09   0.000     .0151307    .0204575
       2017  |   .0187227   .0014194    13.19   0.000     .0159406    .0215047
       2018  |   .0197081   .0014161    13.92   0.000     .0169327    .0224835
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0114302   .0006132   -18.64   0.000    -.0126321   -.0102283
       2016  |  -.0094258   .0005628   -16.75   0.000    -.0105288   -.0083229
       2017  |  -.0101114   .0005604   -18.04   0.000    -.0112097   -.0090131
       2018  |  -.0091961   .0009293    -9.90   0.000    -.0110174   -.0073747
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1230807   .0025491    48.28   0.000     .1180847    .1280768
       2016  |   .1292022   .0025888    49.91   0.000     .1241283    .1342762
       2017  |   .1260903   .0027244    46.28   0.000     .1207505    .1314301
       2018  |   .1407992   .0033262    42.33   0.000     .1342799    .1473186
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |    .017695   .0017027    10.39   0.000     .0143577    .0210323
       2016  |   .0179355   .0016588    10.81   0.000     .0146842    .0211867
       2017  |   .0133193   .0017486     7.62   0.000      .009892    .0167466
       2018  |   .0316393   .0013859    22.83   0.000     .0289229    .0343557
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0103256     .00069   -14.96   0.000     -.011678   -.0089731
       2016  |  -.0109473    .000732   -14.95   0.000    -.0123821   -.0095126
       2017  |  -.0093655    .000736   -12.72   0.000    -.0108081   -.0079229
       2018  |  -.0093319   .0009132   -10.22   0.000    -.0111217   -.0075421
             |
       _cons |   .7824524    .028306    27.64   0.000     .7269735    .8379313
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_og_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41880325 .0834953 .41039578 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0060703269   .6798581285          3402  |
  2 |  .0063409092   .7075237819          2214  |
  3 |  .0057211439   .6383855184          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0060703269  |
  2 |  .0063409092  |
  3 |  .0063409092  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =   15823.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0305
                                                Root MSE          =     .41237

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4year_~k | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_4ye~k |   1.022056   .0081251   125.79   0.000     1.006115    1.037996
       _cons |  -5.66e-07   .0002929    -0.00   0.998    -.0005753    .0005741
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(45, 431850)   =   3228.45
       Model |  25263.0701        45  561.401557   Prob > F        =    0.0000
    Residual |   75095.353   431,850  .173892215   R-squared       =    0.2517
-------------+----------------------------------   Adj R-squared   =    0.2517
       Total |  100358.423   431,895  .232367643   Root MSE        =      .417

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |  -.0116302   .0076073    -1.53   0.126    -.0265402    .0032799
  va_math_og |    .255676   .0072437    35.30   0.000     .2414786    .2698734
             |
        year |
       2016  |   .0158799    .002528     6.28   0.000     .0109252    .0208347
       2017  |    .017699   .0025427     6.96   0.000     .0127155    .0226826
       2018  |   -.019711   .0025732    -7.66   0.000    -.0247545   -.0146676
             |
         age |  -.0000766   4.61e-06   -16.61   0.000    -.0000856   -.0000676
             |
        male |
       Male  |  -.0904101   .0012986   -69.62   0.000    -.0929554   -.0878649
 1.eth_asian |   .0698875   .0022927    30.48   0.000     .0653939    .0743811
1.eth_hisp~c |  -.0138281   .0019814    -6.98   0.000    -.0177117   -.0099446
 1.eth_black |   .0454723   .0037698    12.06   0.000     .0380836     .052861
 1.eth_other |  -.0099606   .0038768    -2.57   0.010    -.0175589   -.0023623
             |
econ_disad~e |
Economic ..  |  -.0210022   .0016181   -12.98   0.000    -.0241736   -.0178309
             |
limited_en~f |
Limited E..  |  -.0212682   .0034722    -6.13   0.000    -.0280735   -.0144628
             |
    disabled |
   Disabled  |  -.0560298   .0033993   -16.48   0.000    -.0626922   -.0493673
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1380937   .0025542    54.07   0.000     .1330876    .1430998
       2016  |   .1223772   .0024903    49.14   0.000     .1174963     .127258
       2017  |   .1216099   .0026432    46.01   0.000     .1164294    .1267904
       2018  |   .0957382   .0032941    29.06   0.000     .0892818    .1021945
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |    .022326   .0013528    16.50   0.000     .0196746    .0249773
       2016  |   .0166359   .0013533    12.29   0.000     .0139835    .0192884
       2017  |   .0172284   .0014136    12.19   0.000     .0144577     .019999
       2018  |   .0189085   .0014101    13.41   0.000     .0161447    .0216722
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0113672   .0006106   -18.62   0.000     -.012564   -.0101704
       2016  |  -.0094112   .0005604   -16.79   0.000    -.0105095   -.0083129
       2017  |  -.0098372    .000558   -17.63   0.000    -.0109309   -.0087436
       2018  |   -.009326   .0009253   -10.08   0.000    -.0111395   -.0075124
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1209565   .0025385    47.65   0.000     .1159811    .1259319
       2016  |   .1272586   .0025779    49.36   0.000     .1222059    .1323113
       2017  |   .1242447   .0027132    45.79   0.000      .118927    .1295624
       2018  |   .1398982   .0033129    42.23   0.000      .133405    .1463914
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0159848   .0016959     9.43   0.000     .0126609    .0193086
       2016  |   .0167455    .001652    10.14   0.000     .0135076    .0199834
       2017  |   .0123027   .0017413     7.07   0.000     .0088898    .0157155
       2018  |   .0298811   .0013804    21.65   0.000     .0271756    .0325867
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0099502   .0006872   -14.48   0.000     -.011297   -.0086034
       2016  |  -.0106963   .0007289   -14.67   0.000     -.012125   -.0092676
       2017  |  -.0092191   .0007329   -12.58   0.000    -.0106555   -.0077827
       2018  |  -.0098703   .0009094   -10.85   0.000    -.0116527   -.0080879
             |
eth_asian_~t |  -.0002583   .0000487    -5.31   0.000    -.0003537    -.000163
eth_hispan~t |   .0005783   .0000482    11.99   0.000     .0004838    .0006729
eth_black_~t |   .0015658   .0000895    17.49   0.000     .0013904    .0017413
educ_hs_dr~p |   1.587936   .1293343    12.28   0.000     1.334445    1.841427
educ~us_prop |   2.138172   .1183766    18.06   0.000     1.906157    2.370186
pov_fam_ch~t |   .0007055   .0000737     9.57   0.000     .0005609      .00085
inc_medi~_hh |   1.52e-06   3.38e-08    44.98   0.000     1.45e-06    1.58e-06
       _cons |   .6268768   .0284613    22.03   0.000     .5710936      .68266
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_acs_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41700385 .07515675 .41017518 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0048728112   .6412112129          3402  |
  2 |  .0050467981   .6588990992          2214  |
  3 |  .0044993455   .5864622833          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0048728112  |
  2 |  .0050467981  |
  3 |  .0050467981  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =   10604.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0237
                                                Root MSE          =     .41202

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4ye~s_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~s_dk |   1.025803   .0099615   102.98   0.000      1.00626    1.045347
       _cons |   .0001585   .0003049     0.52   0.603    -.0004396    .0007566
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_acs_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =     148.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0783
                                                Root MSE          =     .03727

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr~g_acs_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~g_dk |   .1518941   .0124526    12.20   0.000     .1274635    .1763247
       _cons |  -2.96e-06   .0008325    -0.00   0.997    -.0016361    .0016302
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_acs_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(40, 431855)   =   3627.27
       Model |  25238.2315        40  630.955786   Prob > F        =    0.0000
    Residual |  75120.1916   431,855  .173947718   R-squared       =    0.2515
-------------+----------------------------------   Adj R-squared   =    0.2514
       Total |  100358.423   431,895  .232367643   Root MSE        =    .41707

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |  -.0623671   .0075202    -8.29   0.000    -.0771065   -.0476276
  va_math_og |   .3307984   .0070357    47.02   0.000     .3170087    .3445881
             |
        year |
       2016  |   .0175629   .0025269     6.95   0.000     .0126101    .0225156
       2017  |   .0194342   .0025371     7.66   0.000     .0144617    .0244068
       2018  |  -.0181107   .0025619    -7.07   0.000     -.023132   -.0130895
             |
         age |  -.0000698   4.60e-06   -15.17   0.000    -.0000788   -.0000608
             |
        male |
       Male  |  -.0905556   .0012986   -69.73   0.000    -.0931008   -.0880104
 1.eth_asian |   .0607075   .0020327    29.86   0.000     .0567234    .0646916
1.eth_hisp~c |  -.0183002   .0017851   -10.25   0.000    -.0217989   -.0148015
 1.eth_black |   .0483123   .0035941    13.44   0.000      .041268    .0553565
 1.eth_other |  -.0129669   .0038628    -3.36   0.001    -.0205378    -.005396
             |
econ_disad~e |
Economic ..  |  -.0360929   .0015155   -23.82   0.000    -.0390633   -.0331225
             |
limited_en~f |
Limited E..  |  -.0218456   .0034714    -6.29   0.000    -.0286495   -.0150417
             |
    disabled |
   Disabled  |  -.0521565   .0033955   -15.36   0.000    -.0588115   -.0455014
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1378044   .0025522    53.99   0.000     .1328022    .1428066
       2016  |   .1219878   .0024884    49.02   0.000     .1171107    .1268649
       2017  |   .1230268   .0026405    46.59   0.000     .1178515    .1282021
       2018  |   .0956287   .0032935    29.04   0.000     .0891735    .1020839
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0232596   .0013527    17.19   0.000     .0206083     .025911
       2016  |    .017575   .0013533    12.99   0.000     .0149226    .0202275
       2017  |   .0186997   .0014136    13.23   0.000     .0159291    .0214704
       2018  |   .0195222   .0014102    13.84   0.000     .0167583    .0222862
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0112323   .0006107   -18.39   0.000    -.0124292   -.0100353
       2016  |  -.0092832   .0005604   -16.56   0.000    -.0103816   -.0081847
       2017  |  -.0099506   .0005581   -17.83   0.000    -.0110443   -.0088568
       2018  |  -.0088797   .0009254    -9.60   0.000    -.0106935   -.0070658
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1212676   .0025387    47.77   0.000     .1162917    .1262434
       2016  |   .1266825   .0025785    49.13   0.000     .1216287    .1317362
       2017  |   .1237734   .0027135    45.61   0.000      .118455    .1290917
       2018  |   .1376166   .0033129    41.54   0.000     .1311234    .1441098
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0176136   .0016957    10.39   0.000     .0142901    .0209372
       2016  |   .0177213    .001652    10.73   0.000     .0144835    .0209591
       2017  |   .0131172   .0017414     7.53   0.000     .0097041    .0165303
       2018  |   .0311807   .0013803    22.59   0.000     .0284753    .0338861
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0101953   .0006872   -14.84   0.000    -.0115422   -.0088484
       2016  |  -.0106794    .000729   -14.65   0.000    -.0121083   -.0092506
       2017  |  -.0091658    .000733   -12.50   0.000    -.0106025   -.0077292
       2018  |  -.0089524   .0009094    -9.84   0.000    -.0107348     -.00717
             |
1.has_~2year |   -.079621   .0025059   -31.77   0.000    -.0845324   -.0747096
1.has_~4year |   .1426993   .0027055    52.74   0.000     .1373966     .148002
       _cons |   .7699755   .0281998    27.30   0.000     .7147048    .8252461
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_sib_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.4170704 .08148155 .40903359 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |   .005773281   .6718272678          3402  |
  2 |  .0060108416   .6975234593          2214  |
  3 |  .0053928443   .6268917245          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |   .005773281  |
  2 |  .0060108416  |
  3 |  .0060108416  |
    +---------------+
-------------------------------------------------------------------------------

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =   14827.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0289
                                                Root MSE          =     .41098

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4ye~b_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~b_dk |   1.023097   .0084021   121.77   0.000     1.006613    1.039581
       _cons |   .0000246   .0002937     0.08   0.933    -.0005517    .0006009
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_sib_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =     478.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0026
                                                Root MSE          =     .03802

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr~g_sib_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~g_dk |   .0273841   .0012522    21.87   0.000     .0249275    .0298408
       _cons |  -1.44e-06   .0000855    -0.02   0.987    -.0001693    .0001664
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_sib_og_dk.ster saved
-------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =   431,896
-------------+----------------------------------   F(47, 431848)   =   3188.33
       Model |  25853.2984        47  550.070178   Prob > F        =    0.0000
    Residual |  74505.1247   431,848   .17252627   R-squared       =    0.2576
-------------+----------------------------------   Adj R-squared   =    0.2575
       Total |  100358.423   431,895  .232367643   Root MSE        =    .41536

------------------------------------------------------------------------------
   enr_4year | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   va_ela_og |  -.0127733   .0075779    -1.69   0.092    -.0276258    .0020791
  va_math_og |   .2523441    .007216    34.97   0.000     .2382009    .2664873
             |
        year |
       2016  |   .0156861   .0025182     6.23   0.000     .0107505    .0206216
       2017  |   .0171014   .0025333     6.75   0.000     .0121361    .0220667
       2018  |  -.0197278   .0025648    -7.69   0.000    -.0247548   -.0147009
             |
         age |  -.0000749   4.59e-06   -16.30   0.000    -.0000839   -.0000659
             |
        male |
       Male  |  -.0906169   .0012935   -70.05   0.000    -.0931522   -.0880816
 1.eth_asian |   .0684005   .0022845    29.94   0.000     .0639229    .0728781
1.eth_hisp~c |  -.0117627    .001974    -5.96   0.000    -.0156317   -.0078937
 1.eth_black |   .0455697    .003755    12.14   0.000     .0382101    .0529294
 1.eth_other |  -.0089291   .0038616    -2.31   0.021    -.0164976   -.0013605
             |
econ_disad~e |
Economic ..  |  -.0211185   .0016119   -13.10   0.000    -.0242778   -.0179593
             |
limited_en~f |
Limited E..  |  -.0206812   .0034585    -5.98   0.000    -.0274598   -.0139025
             |
    disabled |
   Disabled  |  -.0554705    .003386   -16.38   0.000     -.062107    -.048834
             |
        year#|
          c. |
prior_ela_~e |
       2015  |   .1366922   .0025443    53.73   0.000     .1317055    .1416789
       2016  |   .1210945   .0024806    48.82   0.000     .1162325    .1259565
       2017  |   .1199275   .0026331    45.55   0.000     .1147667    .1250884
       2018  |   .0938942   .0032813    28.61   0.000     .0874629    .1003255
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |   .0221281   .0013474    16.42   0.000     .0194872    .0247691
       2016  |   .0164573    .001348    12.21   0.000     .0138152    .0190994
       2017  |   .0172513   .0014081    12.25   0.000     .0144915    .0200112
       2018  |   .0187572   .0014046    13.35   0.000     .0160043    .0215101
             |
        year#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e#|
          c. |
prior_ela_~e |
       2015  |  -.0111754   .0006082   -18.37   0.000    -.0123675   -.0099833
       2016  |  -.0092734   .0005582   -16.61   0.000    -.0103673   -.0081794
       2017  |   -.009688   .0005558   -17.43   0.000    -.0107774   -.0085987
       2018  |  -.0090137   .0009217    -9.78   0.000    -.0108202   -.0072073
             |
        year#|
          c. |
prior_math~e |
       2015  |   .1192444   .0025287    47.16   0.000     .1142881    .1242006
       2016  |   .1248501   .0025682    48.61   0.000     .1198164    .1298837
       2017  |   .1220402   .0027028    45.15   0.000     .1167428    .1273376
       2018  |   .1367984   .0033003    41.45   0.000     .1303299    .1432669
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |   .0159578   .0016892     9.45   0.000      .012647    .0192686
       2016  |   .0165738   .0016455    10.07   0.000     .0133487     .019799
       2017  |   .0121335   .0017344     7.00   0.000      .008734    .0155329
       2018  |   .0294757   .0013751    21.44   0.000     .0267806    .0321708
             |
        year#|
          c. |
prior_math~e#|
          c. |
prior_math~e#|
          c. |
prior_math~e |
       2015  |  -.0098371   .0006845   -14.37   0.000    -.0111786   -.0084956
       2016  |  -.0104439   .0007261   -14.38   0.000     -.011867   -.0090208
       2017  |  -.0090303     .00073   -12.37   0.000    -.0104611   -.0075995
       2018  |  -.0094898   .0009058   -10.48   0.000    -.0112652   -.0077143
             |
1.has_~2year |  -.0769452   .0024962   -30.82   0.000    -.0818377   -.0720526
1.has_~4year |   .1388946   .0026956    51.53   0.000     .1336113     .144178
eth_asian_~t |  -.0002312   .0000485    -4.77   0.000    -.0003262   -.0001362
eth_hispan~t |   .0005567   .0000481    11.58   0.000     .0004625    .0006509
eth_black_~t |   .0015178   .0000892    17.02   0.000      .001343    .0016926
educ_hs_dr~p |   1.537572   .1288297    11.93   0.000     1.285069    1.790074
educ~us_prop |    2.12011   .1179318    17.98   0.000     1.888967    2.351253
pov_fam_ch~t |   .0006819   .0000734     9.28   0.000     .0005379    .0008259
inc_medi~_hh |   1.47e-06   3.36e-08    43.68   0.000     1.40e-06    1.54e-06
       _cons |   .6190008   .0283597    21.83   0.000     .5634167    .6745849
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/vam_enr_4year_both_dk.ster saved
Standard deviations: total, classes, students, teachers same year
.41536282 .07340161 .40882573 .
Covariances (left), correlations (middle), observations (right).  Row i indicat
> es the relation between year t and t+i:
                 1             2             3
    +-------------------------------------------+
  1 |  .0046409262   .6327726104          3402  |
  2 |  .0047877063   .6482615886          2214  |
  3 |  .0042442199   .5746147104          1061  |
    +-------------------------------------------+
Drift limit specified:
2
Covariances used for VA computations:
                 1
    +---------------+
  1 |  .0046409262  |
  2 |  .0047877063  |
  3 |  .0047877063  |
    +---------------+
-------------------------------------------------------------------------------
note: label truncated to 80 characters

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =    9832.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0225
                                                Root MSE          =     .41065

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
enr_4ye~h_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~h_dk |   1.026844   .0103553    99.16   0.000     1.006528     1.04716
       _cons |   .0001899   .0003065     0.62   0.536    -.0004114    .0007912
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/spec_test_enr_4year_both_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =     371.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0021
                                                Root MSE          =     .03693

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
en~s_both_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~s_dk |   .0271233   .0014079    19.27   0.000     .0243612    .0298854
       _cons |   2.78e-06   .0000814     0.03   0.973    -.0001569    .0001625
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_sib_acs_dk.ster saved

Linear regression                               Number of obs     =    431,838
                                                F(1, 1236)        =     147.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0776
                                                Root MSE          =     .03625

                          (Std. err. adjusted for 1,237 clusters in school_id)
------------------------------------------------------------------------------
             |               Robust
en~b_both_dk | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
va_enr_~b_dk |   .1515413   .0124679    12.15   0.000     .1270807    .1760019
       _cons |   6.52e-07   .0008083     0.00   0.999    -.0015851    .0015864
------------------------------------------------------------------------------
file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_s
> mp/outcome_va/fb_test_enr_4year_acs_sib_dk.ster saved
file
    /home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/o
    > utcome_va/va_enr_4year_sib_acs_dk.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:     87.08 /        1 =      87.0790

. 
. set trace off

. 
. //change directory back to my own personal directory
. cd $projdir 
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_out_dk.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 22:18:05
-------------------------------------------------------------------------------
