-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_spec_test_tab.smcl
  log type:  smcl
 opened on:  19 Sep 2022, 15:15:33

. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative fil
> e paths  */
. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk";

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk";

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk";

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;

. local acs_str
>         "Original + Census"
>         ;

. local sib_str
>         "Original + Sibling"
>         ;

. local both_str
>         "Original + Census + Sibling"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. //peer controls
> local peer_controls
>         `peer_ela_score_controls'
>         `peer_math_score_controls'
>         `peer_demographic_controls'
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **********************************************
> *** macros for control var COMBINATIONS for running loops over all samples an
> d specifications
> //base specification controls
> local base_spec_controls
>         `school_controls'
>         `demographic_controls'
>         `ela_score_controls'
>         `math_score_controls'
>         ;
. // leave out prior score controls
> local loscore_spec_controls
>         `base_controls'
>         loscore
>         ;

. // update the local macro name for looping in the creation of all sample VA e
> stimates
> local acs_spec_controls
>         `base_controls'
>         `census_controls'
>         ;

. local sib_spec_controls
>         `base_controls'
>         `sibling_controls'
>         ;

. // control var groups for looping
> local loscore_acs_spec_controls
>         `base_controls'
>         `loscore_controls'
>         `acs_controls'
>         ;

. local loscore_sib_spec_controls
>         `base_controls'
>         `loscore_controls'
>         `sib_controls'
>         ;

. local acs_sib_spec_controls
>         `base_controls'
>         `acs_controls'
>         `sib_controls'
>         ;

. local loscore_acs_sib_spec_controls
>         `base_controls'
>         `loscore_controls'
>         `acs_controls'
>         `sib_controls'
>         ;

. *** macros for STANDALONE control vars for running loops over all samples and
>  specifications
> //base specification controls
> local base_controls
>         `school_controls'
>         `demographic_controls'
>         `ela_score_controls'
>         `math_score_controls'
>         ;
. local loscore_controls
>         loscore
>         ;

. local acs_controls
>         `census_controls'
>         ;

. local sib_controls
>         `sibling_controls'
>         ;

. // control var groups for looping
> local loscore_acs_controls
>         `loscore_controls'
>         `acs_controls'
>         ;

. local loscore_sib_controls
>         `loscore_controls'
>         `sib_controls'
>         ;

. local acs_sib_controls
>         `acs_controls'
>         `sib_controls'
>         ;

. local loscore_acs_sib_controls
>         `loscore_controls'
>         `acs_controls'
>         `sib_controls'
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. macro list
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_loscore_acs_sib_controls:
                loscore eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_acs_sib_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_loscore_sib_controls:
                loscore i.has_older_sibling_enr_2year
                i.has_older_sibling_enr_4year
_loscore_acs_controls:
                loscore eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_sib_controls:  i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_acs_controls:  eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_loscore_controls:
                loscore
_sib_spec_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_acs_spec_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_loscore_spec_controls:
                loscore
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_controls: i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score) peer_age peer_male peer_eth_asian
                peer_eth_hispanic peer_eth_black peer_eth_other
                peer_econ_disadvantage peer_limited_eng_prof peer_disabled
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_both_str:      Original + Census + Sibling
_sib_str:       Original + Sibling
_acs_str:       Original + Census
_og_str:        Original Specification
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. //startomg timer
. timer on 1

. 
. 
. 
. *****************************************************************************
> ***
. *start main code
. 
. ********** test score VA spec test
. foreach subject in ela math {
  2.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_
> og.ster
  3.   eststo
  4.   test _b[va_`subject'_og] = 1
  5.   matrix test_p = r(p)
  6.   matrix rownames test_p = pvalue
  7.   matrix colnames test_p = va_`subject'_og
  8.   estadd matrix test_p = test_p
  9. 
.   // without sibling controls, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_
> acs.ster
 10.   eststo
 11.   test _b[va_`subject'_acs] = 1
 12.   matrix test_p = r(p)
 13.   matrix rownames test_p = pvalue
 14.   matrix colnames test_p = va_`subject'_acs
 15.   estadd matrix test_p = test_p
 16. 
.   // with sibling controls, without acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_
> sib.ster
 17.   eststo
 18.   test _b[va_`subject'_sib] = 1
 19.   matrix test_p = r(p)
 20.   matrix rownames test_p = pvalue
 21.   matrix colnames test_p = va_`subject'_sib
 22.   estadd matrix test_p = test_p
 23. 
.   // with both sibling controls and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_
> both.ster
 24.   eststo
 25.   test _b[va_`subject'_both] = 1
 26.   matrix test_p = r(p)
 27.   matrix rownames test_p = pvalue
 28.   matrix colnames test_p = va_`subject'_both
 29.   estadd matrix test_p = test_p
 30. 
. }
(est1 stored)

 ( 1)  va_ela_og = 1

       F(  1,  1244) =    0.00
            Prob > F =    0.9458

added matrix:
             e(test_p) :  1 x 1
(est2 stored)

 ( 1)  va_ela_acs = 1

       F(  1,  1244) =    0.01
            Prob > F =    0.9269

added matrix:
             e(test_p) :  1 x 1
(est3 stored)

 ( 1)  va_ela_sib = 1

       F(  1,  1244) =    0.00
            Prob > F =    0.9461

added matrix:
             e(test_p) :  1 x 1
(est4 stored)

 ( 1)  va_ela_both = 1

       F(  1,  1244) =    0.01
            Prob > F =    0.9262

added matrix:
             e(test_p) :  1 x 1
(est5 stored)

 ( 1)  va_math_og = 1

       F(  1,  1241) =    0.59
            Prob > F =    0.4425

added matrix:
             e(test_p) :  1 x 1
(est6 stored)

 ( 1)  va_math_acs = 1

       F(  1,  1241) =    0.01
            Prob > F =    0.9180

added matrix:
             e(test_p) :  1 x 1
(est7 stored)

 ( 1)  va_math_sib = 1

       F(  1,  1241) =    0.61
            Prob > F =    0.4333

added matrix:
             e(test_p) :  1 x 1
(est8 stored)

 ( 1)  va_math_both = 1

       F(  1,  1241) =    0.01
            Prob > F =    0.9115

added matrix:
             e(test_p) :  1 x 1

. 
. 
.   esttab using ///
>     $projdir/out/csv/siblingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_
> acs_restr_smp_score.csv ///
>     , replace nonumbers  ///
>     cells(b(fmt(%5.3f) pvalue(test_p) star) se(fmt(%4.3f) par)) ///
>     title("Specification Tests for Test Score VA on Sibling Census Restricted
>  Sample") ///
>     mtitles("Original Specification" "Census Controls" ///
>       "Sibling Controls" "Sibling and Census Controls" ///
>       "Original Specification" "Census Controls" ///
>       "Sibling Controls" "Sibling and Census Controls") ///
>     mgroups("ELA" "Math", pattern(1 0 0 0 1 0 0 0) )
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_acs_restr_smp_score.csv
> )

. 
.   eststo clear

. 
. 
. ********** outcome VA spec test
. foreach outcome in enr enr_2year enr_4year {
  2.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_og.
> ster
  3.   eststo
  4.   test _b[va_`outcome'_og] = 1
  5.   matrix test_p = r(p)
  6.   matrix rownames test_p = pvalue
  7.   matrix colnames test_p = va_`outcome'_og
  8.   estadd matrix test_p = test_p
  9. 
.   // without sibling controls, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_acs
> .ster
 10.   eststo
 11.   test _b[va_`outcome'_acs] = 1
 12.   matrix test_p = r(p)
 13.   matrix rownames test_p = pvalue
 14.   matrix colnames test_p = va_`outcome'_acs
 15.   estadd matrix test_p = test_p
 16. 
.   // with sibling controls, without acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_sib
> .ster
 17.   eststo
 18.   test _b[va_`outcome'_sib] = 1
 19.   matrix test_p = r(p)
 20.   matrix rownames test_p = pvalue
 21.   matrix colnames test_p = va_`outcome'_sib
 22.   estadd matrix test_p = test_p
 23. 
.   // with both sibling controls and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_bot
> h.ster
 24.   eststo
 25.   test _b[va_`outcome'_both] = 1
 26.   matrix test_p = r(p)
 27.   matrix rownames test_p = pvalue
 28.   matrix colnames test_p = va_`outcome'_both
 29.   estadd matrix test_p = test_p
 30. 
. }
(est1 stored)

 ( 1)  va_enr_og = 1

       F(  1,  1248) =   12.63
            Prob > F =    0.0004

added matrix:
             e(test_p) :  1 x 1
(est2 stored)

 ( 1)  va_enr_acs = 1

       F(  1,  1248) =   15.08
            Prob > F =    0.0001

added matrix:
             e(test_p) :  1 x 1
(est3 stored)

 ( 1)  va_enr_sib = 1

       F(  1,  1248) =   12.39
            Prob > F =    0.0004

added matrix:
             e(test_p) :  1 x 1
(est4 stored)

 ( 1)  va_enr_both = 1

       F(  1,  1248) =   14.86
            Prob > F =    0.0001

added matrix:
             e(test_p) :  1 x 1
(est5 stored)

 ( 1)  va_enr_2year_og = 1

       F(  1,  1248) =    2.17
            Prob > F =    0.1410

added matrix:
             e(test_p) :  1 x 1
(est6 stored)

 ( 1)  va_enr_2year_acs = 1

       F(  1,  1248) =    0.51
            Prob > F =    0.4758

added matrix:
             e(test_p) :  1 x 1
(est7 stored)

 ( 1)  va_enr_2year_sib = 1

       F(  1,  1248) =    1.87
            Prob > F =    0.1713

added matrix:
             e(test_p) :  1 x 1
(est8 stored)

 ( 1)  va_enr_2year_both = 1

       F(  1,  1248) =    0.40
            Prob > F =    0.5264

added matrix:
             e(test_p) :  1 x 1
(est9 stored)

 ( 1)  va_enr_4year_og = 1

       F(  1,  1248) =   10.94
            Prob > F =    0.0010

added matrix:
             e(test_p) :  1 x 1
(est10 stored)

 ( 1)  va_enr_4year_acs = 1

       F(  1,  1248) =   11.34
            Prob > F =    0.0008

added matrix:
             e(test_p) :  1 x 1
(est11 stored)

 ( 1)  va_enr_4year_sib = 1

       F(  1,  1248) =   10.23
            Prob > F =    0.0014

added matrix:
             e(test_p) :  1 x 1
(est12 stored)

 ( 1)  va_enr_4year_both = 1

       F(  1,  1248) =   10.90
            Prob > F =    0.0010

added matrix:
             e(test_p) :  1 x 1

. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_ac
> s_restr_smp_outcome.csv ///
>   , replace nonumbers  ///
>   cells(b(fmt(%5.3f) pvalue(test_p) star) se(fmt(%4.3f) par)) ///
>   title("Specification Tests for outcome VA on Sibling Census Restricted Samp
> le") ///
>   mtitles("Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ) ///
>   mgroups("Overall Enrollment" "2 Year Enrollment" "4 Year Enrollment", patte
> rn(1 0 0 0 1 0 0 0 1 0 0 0) )
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_acs_restr_smp_outcome.c
> sv)

. 
. eststo clear

. 
. 
. 
. ********** deep knowledge outcome VA spec test
. foreach outcome in enr enr_2year enr_4year {
  2.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_og_
> dk.ster
  3.   eststo
  4.   test _b[va_`outcome'_og_dk] = 1
  5.   matrix test_p = r(p)
  6.   matrix rownames test_p = pvalue
  7.   matrix colnames test_p = va_`outcome'_og_dk
  8.   estadd matrix test_p = test_p
  9. 
.   // without sibling controls, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_acs
> _dk.ster
 10.   eststo
 11.   test _b[va_`outcome'_acs_dk] = 1
 12.   matrix test_p = r(p)
 13.   matrix rownames test_p = pvalue
 14.   matrix colnames test_p = va_`outcome'_acs_dk
 15.   estadd matrix test_p = test_p
 16. 
.   // with sibling controls, without acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_sib
> _dk.ster
 17.   eststo
 18.   test _b[va_`outcome'_sib_dk] = 1
 19.   matrix test_p = r(p)
 20.   matrix rownames test_p = pvalue
 21.   matrix colnames test_p = va_`outcome'_sib_dk
 22.   estadd matrix test_p = test_p
 23. 
.   // with both sibling controls and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_bot
> h_dk.ster
 24.   eststo
 25.   test _b[va_`outcome'_both_dk] = 1
 26.   matrix test_p = r(p)
 27.   matrix rownames test_p = pvalue
 28.   matrix colnames test_p = va_`outcome'_both_dk
 29.   estadd matrix test_p = test_p
 30. 
. }
(est1 stored)

 ( 1)  va_enr_og_dk = 1

       F(  1,  1236) =    6.31
            Prob > F =    0.0122

added matrix:
             e(test_p) :  1 x 1
(est2 stored)

 ( 1)  va_enr_acs_dk = 1

       F(  1,  1236) =    8.26
            Prob > F =    0.0041

added matrix:
             e(test_p) :  1 x 1
(est3 stored)

 ( 1)  va_enr_sib_dk = 1

       F(  1,  1236) =    6.15
            Prob > F =    0.0132

added matrix:
             e(test_p) :  1 x 1
(est4 stored)

 ( 1)  va_enr_both_dk = 1

       F(  1,  1236) =    8.11
            Prob > F =    0.0045

added matrix:
             e(test_p) :  1 x 1
(est5 stored)

 ( 1)  va_enr_2year_og_dk = 1

       F(  1,  1236) =    1.02
            Prob > F =    0.3133

added matrix:
             e(test_p) :  1 x 1
(est6 stored)

 ( 1)  va_enr_2year_acs_dk = 1

       F(  1,  1236) =    0.21
            Prob > F =    0.6499

added matrix:
             e(test_p) :  1 x 1
(est7 stored)

 ( 1)  va_enr_2year_sib_dk = 1

       F(  1,  1236) =    0.87
            Prob > F =    0.3498

added matrix:
             e(test_p) :  1 x 1
(est8 stored)

 ( 1)  va_enr_2year_both_dk = 1

       F(  1,  1236) =    0.15
            Prob > F =    0.6945

added matrix:
             e(test_p) :  1 x 1
(est9 stored)

 ( 1)  va_enr_4year_og_dk = 1

       F(  1,  1236) =    7.37
            Prob > F =    0.0067

added matrix:
             e(test_p) :  1 x 1
(est10 stored)

 ( 1)  va_enr_4year_acs_dk = 1

       F(  1,  1236) =    6.71
            Prob > F =    0.0097

added matrix:
             e(test_p) :  1 x 1
(est11 stored)

 ( 1)  va_enr_4year_sib_dk = 1

       F(  1,  1236) =    7.56
            Prob > F =    0.0061

added matrix:
             e(test_p) :  1 x 1
(est12 stored)

 ( 1)  va_enr_4year_both_dk = 1

       F(  1,  1236) =    6.72
            Prob > F =    0.0096

added matrix:
             e(test_p) :  1 x 1

. 
. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_ac
> s_restr_smp_outcome_dk.csv ///
>   , replace nonumbers  ///
>   cells(b(fmt(%5.3f) pvalue(test_p) star) se(fmt(%4.3f) par)) ///
>   title("Specification Tests for Deep Knowledge VA on Sibling Census Restrict
> ed Sample") ///
>   mtitles("Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ) ///
>   mgroups("Overall Enrollment" "2 Year Enrollment" "4 Year Enrollment", patte
> rn(1 0 0 0 1 0 0 0 1 0 0 0) )
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_acs_restr_smp_outcome_d
> k.csv)

. 
. eststo clear

. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:      0.72 /        1 =       0.7200

. 
. set trace off

. 
. //change directory back to my own personal directory
. cd $projdir
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_spec_test_tab.smcl
  log type:  smcl
 closed on:  19 Sep 2022, 15:15:34
-------------------------------------------------------------------------------
