{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs_out_dk.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Jul 2022, 22:16:38
{txt}
{com}. 
.  /* change directory to common_core_va project directory for all value added
>  do files because some called subroutines written by Matt may use relative file paths  */
.  cd $vaprojdir
{res}/home/research/ca_ed_lab/projects/common_core_va
{txt}
{com}. 
.  /* file path macros for datasets */
.  include $projdir/do/share/siblingvaregs/vafilemacros.doh
{txt}
{com}. ********************************************************************************
. /* Macros for common core VA project folder file paths, and relevant datasets to make it possible
> to use Matt's doh files  */
. ********************************************************************************
. ********************************************************************************
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"
{txt}
{com}. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"
{txt}
{com}. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"
{txt}
{com}. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"
{txt}
{com}. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"
{txt}
{com}. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"
{txt}
{com}. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecondary_out_merge"
{txt}
{com}. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"
{txt}
{com}. {txt}
{com}. 
.  //run Matt's do helper file to set the local macros for VA project
.  include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
.  macro list
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.0039002308063216
{p_end}
{txt}{p 0 16}
S_2:{space 12}{res}{res}300
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.0206002574343117
{p_end}
{txt}{p 0 16}
S_1:{space 12}{res}{res}epanechnikov
{p_end}
{txt}{p 0 16}
S_6:{space 12}{res}{res}.7098361624622439
{p_end}
{txt}{p 0 16}
S_5:{space 12}{res}{res}4
{p_end}
{txt}{p 0 16}
ReS_jv2:{space 8}{res}{res}__000006 __000007 __000008 __000009 __00000A __00000B __00000C __00000D __00000E __00000F __00000G __00000H __00000I __00000J __00000K
{p_end}
{txt}{p 0 16}
dropv:{space 10}{res}{res}_cdscode_x
{p_end}
{txt}{p 0 16}
n_offset:{space 7}{res}{res}0
{p_end}
{txt}{p 0 16}
sort:{space 11}{res}{res}0
{p_end}
{txt}{p 0 16}
dots:{space 11}{res}{res}nois _dots 5 0
{p_end}
{txt}{p 0 16}
dotss:{space 10}{res}{res}nois _dots 0, title(Survey results being calculated)
{p_end}
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_both_str:{space 6}{res}{res}Original + Census + Sibling
{p_end}
{txt}{p 0 16}
_sib_str:{space 7}{res}{res}Original + Sibling
{p_end}
{txt}{p 0 16}
_acs_str:{space 7}{res}{res}Original + Census
{p_end}
{txt}{p 0 16}
_og_str:{space 8}{res}{res}Original Specification
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}
{com}. 
.  //startomg timer
.  timer on 1
{txt}
{com}. 
. 
. 
. 
. ********************************************************************************
. *start the main code
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
{txt}
{com}. 
. // deep knowledge controls for sibling acs restricted sample
. local sib_acs_dk_controls va_ela_og va_math_og
{txt}
{com}. 
. 
. ********************************************************************************
. ********************************************************************************
. /* Deep Knowledge Outcome VA controlling for ela and math VA, 4 specifications  */
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   // load the resctricted sample with sibling and acs controls and test score VA
.   use $vaprojdir/data/va_samples/va_sib_acs_out_restr_smp.dta if touse_`outcome'_dk==1, clear
{txt}  3{com}. 
. 
.   ********************************************************************************
.   /* Primary outcome DK va specification, no tfx, no peer fx, no sibling ctrl, no acs ctrl */
.   ********************************************************************************
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_og_dk.ster, replace)
{txt}  4{com}. 
.   // rename the va estimates and the residuals
.   rename tv va_`outcome'_og_dk
{txt}  5{com}.   rename score_r `outcome'_r_og_dk
{txt}  6{com}.   label var va_`outcome'_og_dk "``outcome'_str' DK VA OG Specification"
{txt}  7{com}.   label var `outcome'_r_og_dk "Outcome Residual from ``outcome'_str' DK VA OG Specification"
{txt}  8{com}. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_og_dk va_`outcome'_og_dk, cluster(school_id)
{txt}  9{com}. 
.   // save spec test estimates
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_og_dk.ster, replace
{txt} 10{com}. 
. 
. 
. 
.   ********************************************************************************
.   /* Outcome DK VA, no tfx, no peer fx, no sibling ctrl, with acs ctrl */
.   ********************************************************************************
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `census_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_acs_dk.ster, replace)
{txt} 11{com}. 
.   // rename va estimates and score residuals
.   rename tv va_`outcome'_acs_dk
{txt} 12{com}.   rename score_r `outcome'_r_acs_dk
{txt} 13{com}.   label var va_`outcome'_acs_dk "``outcome'_str' DK VA with Census Controls"
{txt} 14{com}.   label var `outcome'_r_acs_dk "Outcome Residual from ``outcome'_str' DK VA with Census Controls"
{txt} 15{com}. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_acs_dk va_`outcome'_acs_dk, cluster(school_id)
{txt} 16{com}. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_acs_dk.ster, replace
{txt} 17{com}. 
. 
.   *******************
.   // forecast bias test for ACS leave out vars
. 
.   // difference in outcome residuals
.   gen `outcome'_r_d_og_acs_dk = `outcome'_r_og_dk - `outcome'_r_acs_dk
{txt} 18{com}.   // fb test
.   reg `outcome'_r_d_og_acs_dk va_`outcome'_og_dk, cluster(school_id)
{txt} 19{com}.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`outcome'_acs_og_dk.ster, replace
{txt} 20{com}. 
. 
. 
.   ********************************************************************************
.   /* Outcome DK VA, no tfx, no peer fx, with sibling ctrl, no acs ctrl */
.   ********************************************************************************
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `sibling_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_sib_dk.ster, replace)
{txt} 21{com}. 
.   //rename va estimates sand score residuals
.   rename tv va_`outcome'_sib_dk
{txt} 22{com}.   rename score_r `outcome'_r_sib_dk
{txt} 23{com}.   label var va_`outcome'_sib_dk "``outcome'_str' DK VA with Sibling Controls"
{txt} 24{com}.   label var `outcome'_r_sib_dk "Outcome Residual from ``outcome'_str' DK VA with Sibling Controls"
{txt} 25{com}. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_sib_dk va_`outcome'_sib_dk, cluster(school_id)
{txt} 26{com}. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_sib_dk.ster, replace
{txt} 27{com}. 
. 
.   *******************
.   // forecast bias test for sibling controls as leave out vars
.   // difference in outcome residuals
.   gen `outcome'_r_d_og_sib_dk = `outcome'_r_og_dk - `outcome'_r_sib_dk
{txt} 28{com}.   // fb test
.   reg `outcome'_r_d_og_sib_dk va_`outcome'_og_dk, cluster(school_id)
{txt} 29{com}.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`outcome'_sib_og_dk.ster, replace
{txt} 30{com}. 
. 
. 
. 
.   ********************************************************************************
.   /* Outcome DK VA, no tfx, no peer fx, with sibling ctrl, with acs ctrl */
.   ********************************************************************************
.   vam `outcome' ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       `sib_acs_dk_controls' ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>       `sibling_controls' ///
>       `census_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_both_dk.ster, replace)
{txt} 31{com}. 
.   //rename va estimates sand outcome residuals
.   rename tv va_`outcome'_both_dk
{txt} 32{com}.   rename score_r `outcome'_r_both_dk
{txt} 33{com}.   label var va_`outcome'_both_dk "``outcome'_str' DK VA with Sibling and Census Controls"
{txt} 34{com}.   label var `outcome'_r_both_dk "Outcome Residual from ``outcome'_str' DK VA with Sibling and Census Controls"
{txt} 35{com}. 
. 
.   *******************
.   // specification test: regress outcome residuals on va estimates
.   reg `outcome'_r_both_dk va_`outcome'_both_dk, cluster(school_id)
{txt} 36{com}. 
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_both_dk.ster, replace
{txt} 37{com}. 
. 
.   *******************
.   // forecast bias test for sibling controls as leave out vars against specification with only census controls
.   // difference in outcome residuals with census controls and residuals with both census and sibling controls
.   gen `outcome'_r_d_acs_both_dk = `outcome'_r_acs_dk - `outcome'_r_both_dk
{txt} 38{com}.   // fb test
.   reg `outcome'_r_d_acs_both_dk va_`outcome'_acs_dk, cluster(school_id)
{txt} 39{com}.   //naming convention: forecast bias test for leave out variables being sibling controls, against VA with only acs controls
.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`outcome'_sib_acs_dk.ster, replace
{txt} 40{com}. 
.   *******************
.   // forecast bias test for census controls as leave out vars against specification with only sibling controls
.   // difference in outcome residuals with census controls and residuals with both census and sibling controls
.   gen `outcome'_r_d_sib_both_dk = `outcome'_r_sib_dk - `outcome'_r_both_dk
{txt} 41{com}.   // fb test
.   reg `outcome'_r_d_sib_both_dk va_`outcome'_sib_dk, cluster(school_id)
{txt} 42{com}.   estimates save $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/fb_test_`outcome'_acs_sib_dk.ster, replace
{txt} 43{com}. 
. 
. 
. 
.   ********* Save VA estimates
.   collapse (firstnm) va_* ///
>     (mean) `outcome'* ///
>     (sum) n_g11_`outcome'_dk = touse_`outcome'_dk ///
>     , by(school_id cdscode grade year)
{txt} 44{com}.   // save to VA project data folder
.   save $vaprojdir/data/sib_acs_restr_smp/outcome_va/va_`outcome'_sib_acs_dk.dta, replace
{txt} 45{com}. 
. 
. {c )-}
{txt}(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(38, 431857)   = {res}  1576.65
{txt}       Model {c |} {res} 10421.6304        38  274.253431   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75119.9672   431,857  .173946392   {txt}R-squared       ={res}    0.1218
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1218
{txt}       Total {c |} {res} 85541.5975   431,895  .198061097   {txt}Root MSE        =   {res} .41707

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .0421675{col 26}{space 2} .0075196{col 37}{space 1}    5.61{col 46}{space 3}0.000{col 54}{space 4} .0274293{col 67}{space 3} .0569056
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2} .1773063{col 26}{space 2} .0070343{col 37}{space 1}   25.21{col 46}{space 3}0.000{col 54}{space 4} .1635192{col 67}{space 3} .1910934
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0088266{col 26}{space 2} .0025268{col 37}{space 1}    3.49{col 46}{space 3}0.000{col 54}{space 4} .0038742{col 67}{space 3}  .013779
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.015962{col 26}{space 2} .0025363{col 37}{space 1}   -6.29{col 46}{space 3}0.000{col 54}{space 4}-.0209332{col 67}{space 3}-.0109909
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0285388{col 26}{space 2} .0025602{col 37}{space 1}  -11.15{col 46}{space 3}0.000{col 54}{space 4}-.0335567{col 67}{space 3}-.0235209
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001447{col 26}{space 2} 4.60e-06{col 37}{space 1}  -31.44{col 46}{space 3}0.000{col 54}{space 4}-.0001537{col 67}{space 3}-.0001357
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0681405{col 26}{space 2} .0012986{col 37}{space 1}  -52.47{col 46}{space 3}0.000{col 54}{space 4}-.0706857{col 67}{space 3}-.0655954
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0522408{col 26}{space 2} .0020319{col 37}{space 1}   25.71{col 46}{space 3}0.000{col 54}{space 4} .0482585{col 67}{space 3} .0562232
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0293557{col 26}{space 2} .0017847{col 37}{space 1}  -16.45{col 46}{space 3}0.000{col 54}{space 4}-.0328536{col 67}{space 3}-.0258579
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0064122{col 26}{space 2} .0035941{col 37}{space 1}    1.78{col 46}{space 3}0.074{col 54}{space 4} -.000632{col 67}{space 3} .0134564
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0120122{col 26}{space 2} .0038627{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-.0195829{col 67}{space 3}-.0044415
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2} -.064551{col 26}{space 2} .0015153{col 37}{space 1}  -42.60{col 46}{space 3}0.000{col 54}{space 4}-.0675209{col 67}{space 3} -.061581
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0488082{col 26}{space 2} .0034714{col 37}{space 1}  -14.06{col 46}{space 3}0.000{col 54}{space 4} -.055612{col 67}{space 3}-.0420043
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0210797{col 26}{space 2} .0033953{col 37}{space 1}   -6.21{col 46}{space 3}0.000{col 54}{space 4}-.0277344{col 67}{space 3}-.0144249
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0799659{col 26}{space 2}  .002552{col 37}{space 1}   31.33{col 46}{space 3}0.000{col 54}{space 4}  .074964{col 67}{space 3} .0849678
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0689352{col 26}{space 2} .0024882{col 37}{space 1}   27.71{col 46}{space 3}0.000{col 54}{space 4} .0640585{col 67}{space 3} .0738119
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0736873{col 26}{space 2} .0026401{col 37}{space 1}   27.91{col 46}{space 3}0.000{col 54}{space 4} .0685128{col 67}{space 3} .0788618
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0709839{col 26}{space 2} .0032933{col 37}{space 1}   21.55{col 46}{space 3}0.000{col 54}{space 4}  .064529{col 67}{space 3} .0774388
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0183522{col 26}{space 2} .0013527{col 37}{space 1}  -13.57{col 46}{space 3}0.000{col 54}{space 4}-.0210035{col 67}{space 3}-.0157009
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0227603{col 26}{space 2} .0013533{col 37}{space 1}  -16.82{col 46}{space 3}0.000{col 54}{space 4}-.0254126{col 67}{space 3}-.0201079
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0122225{col 26}{space 2} .0014136{col 37}{space 1}   -8.65{col 46}{space 3}0.000{col 54}{space 4} -.014993{col 67}{space 3} -.009452
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.012827{col 26}{space 2} .0014102{col 37}{space 1}   -9.10{col 46}{space 3}0.000{col 54}{space 4}-.0155909{col 67}{space 3}-.0100631
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0005389{col 26}{space 2} .0006107{col 37}{space 1}   -0.88{col 46}{space 3}0.378{col 54}{space 4}-.0017358{col 67}{space 3}  .000658
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012886{col 26}{space 2} .0005604{col 37}{space 1}    2.30{col 46}{space 3}0.021{col 54}{space 4} .0001902{col 67}{space 3} .0023871
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0018248{col 26}{space 2}  .000558{col 37}{space 1}   -3.27{col 46}{space 3}0.001{col 54}{space 4}-.0029186{col 67}{space 3}-.0007311
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.004934{col 26}{space 2} .0009254{col 37}{space 1}   -5.33{col 46}{space 3}0.000{col 54}{space 4}-.0067478{col 67}{space 3}-.0031202
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0568535{col 26}{space 2} .0025385{col 37}{space 1}   22.40{col 46}{space 3}0.000{col 54}{space 4} .0518781{col 67}{space 3} .0618289
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .062707{col 26}{space 2}  .002578{col 37}{space 1}   24.32{col 46}{space 3}0.000{col 54}{space 4} .0576541{col 67}{space 3} .0677599
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .058847{col 26}{space 2} .0027132{col 37}{space 1}   21.69{col 46}{space 3}0.000{col 54}{space 4} .0535293{col 67}{space 3} .0641647
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .085897{col 26}{space 2} .0033125{col 37}{space 1}   25.93{col 46}{space 3}0.000{col 54}{space 4} .0794047{col 67}{space 3} .0923894
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0116976{col 26}{space 2} .0016957{col 37}{space 1}   -6.90{col 46}{space 3}0.000{col 54}{space 4}-.0150211{col 67}{space 3}-.0083741
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0155996{col 26}{space 2} .0016519{col 37}{space 1}   -9.44{col 46}{space 3}0.000{col 54}{space 4}-.0188373{col 67}{space 3}-.0123618
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0130493{col 26}{space 2} .0017414{col 37}{space 1}   -7.49{col 46}{space 3}0.000{col 54}{space 4}-.0164624{col 67}{space 3}-.0096362
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0038737{col 26}{space 2} .0013802{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-.0065789{col 67}{space 3}-.0011686
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0005544{col 26}{space 2} .0006872{col 37}{space 1}   -0.81{col 46}{space 3}0.420{col 54}{space 4}-.0019013{col 67}{space 3} .0007924
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0005859{col 26}{space 2}  .000729{col 37}{space 1}    0.80{col 46}{space 3}0.422{col 54}{space 4}-.0008429{col 67}{space 3} .0020148
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.000158{col 26}{space 2}  .000733{col 37}{space 1}   -0.22{col 46}{space 3}0.829{col 54}{space 4}-.0015946{col 67}{space 3} .0012786
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0069032{col 26}{space 2} .0009094{col 37}{space 1}   -7.59{col 46}{space 3}0.000{col 54}{space 4}-.0086855{col 67}{space 3}-.0051208
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}   1.6926{col 26}{space 2} .0281888{col 37}{space 1}   60.05{col 46}{space 3}0.000{col 54}{space 4} 1.637351{col 67}{space 3} 1.747849
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_og_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41706881 .07563984 .41015242 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0046042934   .5966938365          3402{txt}  {c |}
  2 {c |}  {res}.0039815225   .5342492631          2214{txt}  {c |}
  3 {c |}  {res}.0032809054   .4555608306          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0046042934{txt}  {c |}
  2 {c |}  {res}.0039815225{txt}  {c |}
  3 {c |}  {res}.0039815225{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}  3405.67
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0197
                                                {txt}Root MSE          =    {res}  .4129

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} enr_r_og_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_og_dk {c |}{col 14}{res}{space 2} 1.044964{col 26}{space 2} .0179061{col 37}{space 1}   58.36{col 46}{space 3}0.000{col 54}{space 4} 1.009834{col 67}{space 3} 1.080094
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0015768{col 26}{space 2} .0004137{col 37}{space 1}   -3.81{col 46}{space 3}0.000{col 54}{space 4}-.0023884{col 67}{space 3}-.0007651
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_og_dk.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(45, 431850)   = {res}  1387.07
{txt}       Model {c |} {res} 10802.5131        45  240.055846   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 74739.0845   431,850  .173067233   {txt}R-squared       ={res}    0.1263
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1262
{txt}       Total {c |} {res} 85541.5975   431,895  .198061097   {txt}Root MSE        =   {res} .41601

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .0772199{col 26}{space 2} .0075892{col 37}{space 1}   10.17{col 46}{space 3}0.000{col 54}{space 4} .0623453{col 67}{space 3} .0920946
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2} .1185431{col 26}{space 2} .0072265{col 37}{space 1}   16.40{col 46}{space 3}0.000{col 54}{space 4} .1043795{col 67}{space 3} .1327068
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0089216{col 26}{space 2}  .002522{col 37}{space 1}    3.54{col 46}{space 3}0.000{col 54}{space 4} .0039786{col 67}{space 3} .0138646
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0159556{col 26}{space 2} .0025366{col 37}{space 1}   -6.29{col 46}{space 3}0.000{col 54}{space 4}-.0209273{col 67}{space 3}-.0109839
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0272658{col 26}{space 2} .0025671{col 37}{space 1}  -10.62{col 46}{space 3}0.000{col 54}{space 4}-.0322972{col 67}{space 3}-.0222343
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001499{col 26}{space 2} 4.60e-06{col 37}{space 1}  -32.59{col 46}{space 3}0.000{col 54}{space 4}-.0001589{col 67}{space 3}-.0001408
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0690838{col 26}{space 2} .0012955{col 37}{space 1}  -53.32{col 46}{space 3}0.000{col 54}{space 4} -.071623{col 67}{space 3}-.0665445
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0472705{col 26}{space 2} .0022872{col 37}{space 1}   20.67{col 46}{space 3}0.000{col 54}{space 4} .0427876{col 67}{space 3} .0517535
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0024668{col 26}{space 2} .0019767{col 37}{space 1}   -1.25{col 46}{space 3}0.212{col 54}{space 4}-.0063412{col 67}{space 3} .0014075
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0293625{col 26}{space 2} .0037609{col 37}{space 1}    7.81{col 46}{space 3}0.000{col 54}{space 4} .0219913{col 67}{space 3} .0367336
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} -.009261{col 26}{space 2} .0038675{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}-.0168413{col 67}{space 3}-.0016807
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0398335{col 26}{space 2} .0016142{col 37}{space 1}  -24.68{col 46}{space 3}0.000{col 54}{space 4}-.0429973{col 67}{space 3}-.0366696
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0489998{col 26}{space 2} .0034639{col 37}{space 1}  -14.15{col 46}{space 3}0.000{col 54}{space 4} -.055789{col 67}{space 3}-.0422106
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} -.029038{col 26}{space 2} .0033912{col 37}{space 1}   -8.56{col 46}{space 3}0.000{col 54}{space 4}-.0356846{col 67}{space 3}-.0223914
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .075112{col 26}{space 2} .0025481{col 37}{space 1}   29.48{col 46}{space 3}0.000{col 54}{space 4} .0701178{col 67}{space 3} .0801062
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0643676{col 26}{space 2} .0024843{col 37}{space 1}   25.91{col 46}{space 3}0.000{col 54}{space 4} .0594984{col 67}{space 3} .0692368
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0675841{col 26}{space 2} .0026369{col 37}{space 1}   25.63{col 46}{space 3}0.000{col 54}{space 4} .0624159{col 67}{space 3} .0727523
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .067346{col 26}{space 2} .0032863{col 37}{space 1}   20.49{col 46}{space 3}0.000{col 54}{space 4} .0609049{col 67}{space 3}  .073787
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0182751{col 26}{space 2} .0013495{col 37}{space 1}  -13.54{col 46}{space 3}0.000{col 54}{space 4}-.0209202{col 67}{space 3}-.0156301
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0226306{col 26}{space 2} .0013501{col 37}{space 1}  -16.76{col 46}{space 3}0.000{col 54}{space 4}-.0252768{col 67}{space 3}-.0199845
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0122425{col 26}{space 2} .0014103{col 37}{space 1}   -8.68{col 46}{space 3}0.000{col 54}{space 4}-.0150066{col 67}{space 3}-.0094784
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0124888{col 26}{space 2} .0014067{col 37}{space 1}   -8.88{col 46}{space 3}0.000{col 54}{space 4} -.015246{col 67}{space 3}-.0097317
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0004716{col 26}{space 2} .0006092{col 37}{space 1}   -0.77{col 46}{space 3}0.439{col 54}{space 4}-.0016656{col 67}{space 3} .0007223
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012903{col 26}{space 2}  .000559{col 37}{space 1}    2.31{col 46}{space 3}0.021{col 54}{space 4} .0001946{col 67}{space 3} .0023859
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0016341{col 26}{space 2} .0005567{col 37}{space 1}   -2.94{col 46}{space 3}0.003{col 54}{space 4}-.0027252{col 67}{space 3} -.000543
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0049341{col 26}{space 2} .0009231{col 37}{space 1}   -5.35{col 46}{space 3}0.000{col 54}{space 4}-.0067433{col 67}{space 3}-.0031248
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0556127{col 26}{space 2} .0025325{col 37}{space 1}   21.96{col 46}{space 3}0.000{col 54}{space 4}  .050649{col 67}{space 3} .0605763
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0615664{col 26}{space 2} .0025718{col 37}{space 1}   23.94{col 46}{space 3}0.000{col 54}{space 4} .0565257{col 67}{space 3} .0666071
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0582545{col 26}{space 2} .0027067{col 37}{space 1}   21.52{col 46}{space 3}0.000{col 54}{space 4} .0529495{col 67}{space 3} .0635596
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0828859{col 26}{space 2}  .003305{col 37}{space 1}   25.08{col 46}{space 3}0.000{col 54}{space 4} .0764081{col 67}{space 3} .0893636
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.011226{col 26}{space 2} .0016918{col 37}{space 1}   -6.64{col 46}{space 3}0.000{col 54}{space 4} -.014542{col 67}{space 3}  -.00791
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0150932{col 26}{space 2} .0016481{col 37}{space 1}   -9.16{col 46}{space 3}0.000{col 54}{space 4}-.0183234{col 67}{space 3}-.0118631
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0130868{col 26}{space 2} .0017371{col 37}{space 1}   -7.53{col 46}{space 3}0.000{col 54}{space 4}-.0164915{col 67}{space 3}-.0096821
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0046436{col 26}{space 2} .0013771{col 37}{space 1}   -3.37{col 46}{space 3}0.001{col 54}{space 4}-.0073427{col 67}{space 3}-.0019444
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0007974{col 26}{space 2} .0006855{col 37}{space 1}   -1.16{col 46}{space 3}0.245{col 54}{space 4} -.002141{col 67}{space 3} .0005462
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .000387{col 26}{space 2} .0007272{col 37}{space 1}    0.53{col 46}{space 3}0.595{col 54}{space 4}-.0010383{col 67}{space 3} .0018123
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0002799{col 26}{space 2} .0007311{col 37}{space 1}   -0.38{col 46}{space 3}0.702{col 54}{space 4}-.0017129{col 67}{space 3} .0011531
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.007104{col 26}{space 2} .0009072{col 37}{space 1}   -7.83{col 46}{space 3}0.000{col 54}{space 4}-.0088821{col 67}{space 3}-.0053258
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2} .0005051{col 26}{space 2} .0000486{col 37}{space 1}   10.40{col 46}{space 3}0.000{col 54}{space 4}   .00041{col 67}{space 3} .0006003
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0004511{col 26}{space 2} .0000481{col 37}{space 1}   -9.37{col 46}{space 3}0.000{col 54}{space 4}-.0005455{col 67}{space 3}-.0003568
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0010174{col 26}{space 2} .0000893{col 37}{space 1}  -11.39{col 46}{space 3}0.000{col 54}{space 4}-.0011925{col 67}{space 3}-.0008424
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-.4241345{col 26}{space 2} .1290271{col 37}{space 1}   -3.29{col 46}{space 3}0.001{col 54}{space 4}-.6770237{col 67}{space 3}-.1712454
{txt}educ~us_prop {c |}{col 14}{res}{space 2} .5158432{col 26}{space 2} .1180954{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4} .2843798{col 67}{space 3} .7473066
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0005229{col 26}{space 2} .0000736{col 37}{space 1}   -7.11{col 46}{space 3}0.000{col 54}{space 4}-.0006671{col 67}{space 3}-.0003787
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 3.85e-07{col 26}{space 2} 3.37e-08{col 37}{space 1}   11.45{col 46}{space 3}0.000{col 54}{space 4} 3.19e-07{col 67}{space 3} 4.51e-07
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.694189{col 26}{space 2} .0283937{col 37}{space 1}   59.67{col 46}{space 3}0.000{col 54}{space 4} 1.638538{col 67}{space 3} 1.749839
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_acs_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.4160135 .0726969 .40961249 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0041844174   .5780132151          3402{txt}  {c |}
  2 {c |}  {res}.0035277423   .5024745625          2214{txt}  {c |}
  3 {c |}  {res}.0029886938   .4360367768          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0041844174{txt}  {c |}
  2 {c |}  {res}.0035277423{txt}  {c |}
  3 {c |}  {res}.0035277423{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}  2696.61
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0176
                                                {txt}Root MSE          =    {res} .41229

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_acs_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_acs~k {c |}{col 14}{res}{space 2} 1.058589{col 26}{space 2} .0203854{col 37}{space 1}   51.93{col 46}{space 3}0.000{col 54}{space 4} 1.018596{col 67}{space 3} 1.098583
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0012275{col 26}{space 2} .0004123{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4}-.0020363{col 67}{space 3}-.0004186
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_acs_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}   102.56
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0279
                                                {txt}Root MSE          =    {res} .02928

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_d_og~k{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_og_dk {c |}{col 14}{res}{space 2} .0884946{col 26}{space 2} .0087384{col 37}{space 1}   10.13{col 46}{space 3}0.000{col 54}{space 4} .0713508{col 67}{space 3} .1056383
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001375{col 26}{space 2} .0006192{col 37}{space 1}   -0.22{col 46}{space 3}0.824{col 54}{space 4}-.0013524{col 67}{space 3} .0010773
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_acs_og_dk.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(40, 431855)   = {res}  1513.32
{txt}       Model {c |} {res} 10516.2212        40  262.905531   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75025.3763   431,855  .173728164   {txt}R-squared       ={res}    0.1229
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1229
{txt}       Total {c |} {res} 85541.5975   431,895  .198061097   {txt}Root MSE        =   {res} .41681

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .0403119{col 26}{space 2} .0075155{col 37}{space 1}    5.36{col 46}{space 3}0.000{col 54}{space 4} .0255817{col 67}{space 3}  .055042
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2} .1781085{col 26}{space 2} .0070312{col 37}{space 1}   25.33{col 46}{space 3}0.000{col 54}{space 4} .1643275{col 67}{space 3} .1918895
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0082649{col 26}{space 2} .0025254{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4} .0033153{col 67}{space 3} .0132145
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0172041{col 26}{space 2} .0025354{col 37}{space 1}   -6.79{col 46}{space 3}0.000{col 54}{space 4}-.0221735{col 67}{space 3}-.0122347
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0302769{col 26}{space 2} .0025603{col 37}{space 1}  -11.83{col 46}{space 3}0.000{col 54}{space 4} -.035295{col 67}{space 3}-.0252589
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001426{col 26}{space 2} 4.60e-06{col 37}{space 1}  -30.99{col 46}{space 3}0.000{col 54}{space 4}-.0001516{col 67}{space 3}-.0001335
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0681813{col 26}{space 2} .0012978{col 37}{space 1}  -52.54{col 46}{space 3}0.000{col 54}{space 4}-.0707249{col 67}{space 3}-.0656378
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0509574{col 26}{space 2} .0020315{col 37}{space 1}   25.08{col 46}{space 3}0.000{col 54}{space 4} .0469758{col 67}{space 3}  .054939
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0291632{col 26}{space 2} .0017839{col 37}{space 1}  -16.35{col 46}{space 3}0.000{col 54}{space 4}-.0326597{col 67}{space 3}-.0256667
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0063435{col 26}{space 2} .0035918{col 37}{space 1}    1.77{col 46}{space 3}0.077{col 54}{space 4}-.0006963{col 67}{space 3} .0133833
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0114007{col 26}{space 2} .0038603{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-.0189668{col 67}{space 3}-.0038346
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0649786{col 26}{space 2} .0015146{col 37}{space 1}  -42.90{col 46}{space 3}0.000{col 54}{space 4}-.0679471{col 67}{space 3}-.0620101
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0487343{col 26}{space 2} .0034692{col 37}{space 1}  -14.05{col 46}{space 3}0.000{col 54}{space 4}-.0555339{col 67}{space 3}-.0419347
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0204053{col 26}{space 2} .0033933{col 37}{space 1}   -6.01{col 46}{space 3}0.000{col 54}{space 4}-.0270561{col 67}{space 3}-.0137544
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0798947{col 26}{space 2} .0025506{col 37}{space 1}   31.32{col 46}{space 3}0.000{col 54}{space 4} .0748956{col 67}{space 3} .0848937
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0690207{col 26}{space 2} .0024868{col 37}{space 1}   27.76{col 46}{space 3}0.000{col 54}{space 4} .0641467{col 67}{space 3} .0738948
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .073922{col 26}{space 2} .0026388{col 37}{space 1}   28.01{col 46}{space 3}0.000{col 54}{space 4}   .06875{col 67}{space 3}  .079094
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0706508{col 26}{space 2} .0032914{col 37}{space 1}   21.46{col 46}{space 3}0.000{col 54}{space 4} .0641996{col 67}{space 3} .0771019
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0182813{col 26}{space 2} .0013519{col 37}{space 1}  -13.52{col 46}{space 3}0.000{col 54}{space 4} -.020931{col 67}{space 3}-.0156316
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0226417{col 26}{space 2} .0013525{col 37}{space 1}  -16.74{col 46}{space 3}0.000{col 54}{space 4}-.0252925{col 67}{space 3}-.0199909
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0120015{col 26}{space 2} .0014127{col 37}{space 1}   -8.50{col 46}{space 3}0.000{col 54}{space 4}-.0147704{col 67}{space 3}-.0092326
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0127817{col 26}{space 2} .0014093{col 37}{space 1}   -9.07{col 46}{space 3}0.000{col 54}{space 4}-.0155439{col 67}{space 3}-.0100195
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0005044{col 26}{space 2} .0006103{col 37}{space 1}   -0.83{col 46}{space 3}0.409{col 54}{space 4}-.0017006{col 67}{space 3} .0006918
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012836{col 26}{space 2} .0005601{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .0001858{col 67}{space 3} .0023813
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0018497{col 26}{space 2} .0005577{col 37}{space 1}   -3.32{col 46}{space 3}0.001{col 54}{space 4}-.0029428{col 67}{space 3}-.0007566
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0048129{col 26}{space 2} .0009249{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-.0066256{col 67}{space 3}-.0030002
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0562125{col 26}{space 2} .0025371{col 37}{space 1}   22.16{col 46}{space 3}0.000{col 54}{space 4} .0512399{col 67}{space 3} .0611852
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0617169{col 26}{space 2} .0025769{col 37}{space 1}   23.95{col 46}{space 3}0.000{col 54}{space 4} .0566663{col 67}{space 3} .0667674
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0580042{col 26}{space 2} .0027118{col 37}{space 1}   21.39{col 46}{space 3}0.000{col 54}{space 4} .0526892{col 67}{space 3} .0633192
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0850498{col 26}{space 2} .0033108{col 37}{space 1}   25.69{col 46}{space 3}0.000{col 54}{space 4} .0785607{col 67}{space 3} .0915389
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0115787{col 26}{space 2} .0016946{col 37}{space 1}   -6.83{col 46}{space 3}0.000{col 54}{space 4}-.0149002{col 67}{space 3}-.0082573
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0155342{col 26}{space 2} .0016509{col 37}{space 1}   -9.41{col 46}{space 3}0.000{col 54}{space 4}  -.01877{col 67}{space 3}-.0122985
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0130459{col 26}{space 2} .0017403{col 37}{space 1}   -7.50{col 46}{space 3}0.000{col 54}{space 4}-.0164569{col 67}{space 3}-.0096349
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0036977{col 26}{space 2} .0013794{col 37}{space 1}   -2.68{col 46}{space 3}0.007{col 54}{space 4}-.0064014{col 67}{space 3} -.000994
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0005275{col 26}{space 2} .0006868{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-.0018735{col 67}{space 3} .0008185
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}   .00068{col 26}{space 2} .0007286{col 37}{space 1}    0.93{col 46}{space 3}0.351{col 54}{space 4} -.000748{col 67}{space 3}  .002108
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0000802{col 26}{space 2} .0007325{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-.0015159{col 67}{space 3} .0013555
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0067515{col 26}{space 2} .0009088{col 37}{space 1}   -7.43{col 46}{space 3}0.000{col 54}{space 4}-.0085328{col 67}{space 3}-.0049702
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0205076{col 26}{space 2} .0025043{col 37}{space 1}    8.19{col 46}{space 3}0.000{col 54}{space 4} .0155993{col 67}{space 3}  .025416
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0575954{col 26}{space 2} .0027038{col 37}{space 1}   21.30{col 46}{space 3}0.000{col 54}{space 4}  .052296{col 67}{space 3} .0628947
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.675675{col 26}{space 2}  .028182{col 37}{space 1}   59.46{col 46}{space 3}0.000{col 54}{space 4} 1.620439{col 67}{space 3} 1.730911
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_sib_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41680711 .07545261 .40992081 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0045827287   .5963057837          3402{txt}  {c |}
  2 {c |}  {res}.0039616362   .5337779609          2214{txt}  {c |}
  3 {c |}  {res}.0032570025   .4543373985          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0045827287{txt}  {c |}
  2 {c |}  {res}.0039616362{txt}  {c |}
  3 {c |}  {res}.0039616362{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}  3409.66
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0197
                                                {txt}Root MSE          =    {res} .41265

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_sib_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_sib~k {c |}{col 14}{res}{space 2} 1.044366{col 26}{space 2} .0178854{col 37}{space 1}   58.39{col 46}{space 3}0.000{col 54}{space 4} 1.009277{col 67}{space 3} 1.079455
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0015464{col 26}{space 2} .0004135{col 37}{space 1}   -3.74{col 46}{space 3}0.000{col 54}{space 4}-.0023576{col 67}{space 3}-.0007352
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_sib_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}    10.61
                                                {txt}Prob > F          = {res}    0.0012
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res}  .0148

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_d~b_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_og_dk {c |}{col 14}{res}{space 2} .0024698{col 26}{space 2} .0007582{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} .0009823{col 67}{space 3} .0039574
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.88e-06{col 26}{space 2}  .000047{col 37}{space 1}   -0.08{col 46}{space 3}0.934{col 54}{space 4}-.0000962{col 67}{space 3} .0000884
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_sib_og_dk.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(47, 431848)   = {res}  1341.45
{txt}       Model {c |} {res} 10897.7052        47  231.866067   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 74643.8924   431,848  .172847605   {txt}R-squared       ={res}    0.1274
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1273
{txt}       Total {c |} {res} 85541.5975   431,895  .198061097   {txt}Root MSE        =   {res} .41575

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .0753096{col 26}{space 2} .0075849{col 37}{space 1}    9.93{col 46}{space 3}0.000{col 54}{space 4} .0604433{col 67}{space 3} .0901759
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2} .1195138{col 26}{space 2} .0072227{col 37}{space 1}   16.55{col 46}{space 3}0.000{col 54}{space 4} .1053574{col 67}{space 3} .1336701
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0083707{col 26}{space 2} .0025205{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .0034306{col 67}{space 3} .0133109
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0171957{col 26}{space 2} .0025357{col 37}{space 1}   -6.78{col 46}{space 3}0.000{col 54}{space 4}-.0221656{col 67}{space 3}-.0122258
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0290161{col 26}{space 2} .0025672{col 37}{space 1}  -11.30{col 46}{space 3}0.000{col 54}{space 4}-.0340478{col 67}{space 3}-.0239845
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001477{col 26}{space 2} 4.60e-06{col 37}{space 1}  -32.12{col 46}{space 3}0.000{col 54}{space 4}-.0001567{col 67}{space 3}-.0001387
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0691268{col 26}{space 2} .0012947{col 37}{space 1}  -53.39{col 46}{space 3}0.000{col 54}{space 4}-.0716645{col 67}{space 3}-.0665892
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0458222{col 26}{space 2} .0022867{col 37}{space 1}   20.04{col 46}{space 3}0.000{col 54}{space 4} .0413404{col 67}{space 3}  .050304
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0022263{col 26}{space 2} .0019759{col 37}{space 1}   -1.13{col 46}{space 3}0.260{col 54}{space 4}-.0060989{col 67}{space 3} .0016463
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0293098{col 26}{space 2} .0037585{col 37}{space 1}    7.80{col 46}{space 3}0.000{col 54}{space 4} .0219432{col 67}{space 3} .0366763
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0086969{col 26}{space 2} .0038652{col 37}{space 1}   -2.25{col 46}{space 3}0.024{col 54}{space 4}-.0162725{col 67}{space 3}-.0011213
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0403076{col 26}{space 2} .0016134{col 37}{space 1}  -24.98{col 46}{space 3}0.000{col 54}{space 4}-.0434698{col 67}{space 3}-.0371454
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0489368{col 26}{space 2} .0034618{col 37}{space 1}  -14.14{col 46}{space 3}0.000{col 54}{space 4}-.0557218{col 67}{space 3}-.0421519
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0283789{col 26}{space 2} .0033892{col 37}{space 1}   -8.37{col 46}{space 3}0.000{col 54}{space 4}-.0350216{col 67}{space 3}-.0217362
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0750247{col 26}{space 2} .0025466{col 37}{space 1}   29.46{col 46}{space 3}0.000{col 54}{space 4} .0700334{col 67}{space 3}  .080016
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0644412{col 26}{space 2}  .002483{col 37}{space 1}   25.95{col 46}{space 3}0.000{col 54}{space 4} .0595747{col 67}{space 3} .0693077
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .067823{col 26}{space 2} .0026356{col 37}{space 1}   25.73{col 46}{space 3}0.000{col 54}{space 4} .0626573{col 67}{space 3} .0729887
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0670184{col 26}{space 2} .0032844{col 37}{space 1}   20.41{col 46}{space 3}0.000{col 54}{space 4} .0605811{col 67}{space 3} .0734556
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0181987{col 26}{space 2} .0013487{col 37}{space 1}  -13.49{col 46}{space 3}0.000{col 54}{space 4}-.0208421{col 67}{space 3}-.0155553
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0225062{col 26}{space 2} .0013493{col 37}{space 1}  -16.68{col 46}{space 3}0.000{col 54}{space 4}-.0251507{col 67}{space 3}-.0198616
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0120124{col 26}{space 2} .0014094{col 37}{space 1}   -8.52{col 46}{space 3}0.000{col 54}{space 4}-.0147749{col 67}{space 3}  -.00925
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0124371{col 26}{space 2} .0014059{col 37}{space 1}   -8.85{col 46}{space 3}0.000{col 54}{space 4}-.0151926{col 67}{space 3}-.0096817
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0004366{col 26}{space 2} .0006088{col 37}{space 1}   -0.72{col 46}{space 3}0.473{col 54}{space 4}-.0016298{col 67}{space 3} .0007566
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012855{col 26}{space 2} .0005587{col 37}{space 1}    2.30{col 46}{space 3}0.021{col 54}{space 4} .0001905{col 67}{space 3} .0023805
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0016608{col 26}{space 2} .0005563{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4}-.0027512{col 67}{space 3}-.0005705
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.004812{col 26}{space 2} .0009225{col 37}{space 1}   -5.22{col 46}{space 3}0.000{col 54}{space 4}-.0066201{col 67}{space 3}-.0030039
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0549789{col 26}{space 2} .0025311{col 37}{space 1}   21.72{col 46}{space 3}0.000{col 54}{space 4}  .050018{col 67}{space 3} .0599397
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0605807{col 26}{space 2} .0025706{col 37}{space 1}   23.57{col 46}{space 3}0.000{col 54}{space 4} .0555424{col 67}{space 3} .0656191
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0574211{col 26}{space 2} .0027053{col 37}{space 1}   21.23{col 46}{space 3}0.000{col 54}{space 4} .0521187{col 67}{space 3} .0627234
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0820344{col 26}{space 2} .0033034{col 37}{space 1}   24.83{col 46}{space 3}0.000{col 54}{space 4} .0755598{col 67}{space 3} .0885089
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0110969{col 26}{space 2} .0016908{col 37}{space 1}   -6.56{col 46}{space 3}0.000{col 54}{space 4}-.0144108{col 67}{space 3} -.007783
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0150219{col 26}{space 2}  .001647{col 37}{space 1}   -9.12{col 46}{space 3}0.000{col 54}{space 4}-.0182501{col 67}{space 3}-.0117938
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0130786{col 26}{space 2}  .001736{col 37}{space 1}   -7.53{col 46}{space 3}0.000{col 54}{space 4}-.0164812{col 67}{space 3}-.0096761
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0044607{col 26}{space 2} .0013764{col 37}{space 1}   -3.24{col 46}{space 3}0.001{col 54}{space 4}-.0071584{col 67}{space 3}-.0017631
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0007734{col 26}{space 2} .0006851{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-.0021161{col 67}{space 3} .0005694
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0004803{col 26}{space 2} .0007268{col 37}{space 1}    0.66{col 46}{space 3}0.509{col 54}{space 4}-.0009441{col 67}{space 3} .0019047
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.000203{col 26}{space 2} .0007307{col 37}{space 1}   -0.28{col 46}{space 3}0.781{col 54}{space 4}-.0016351{col 67}{space 3} .0012292
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0069504{col 26}{space 2} .0009067{col 37}{space 1}   -7.67{col 46}{space 3}0.000{col 54}{space 4}-.0087275{col 67}{space 3}-.0051733
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0207771{col 26}{space 2} .0024986{col 37}{space 1}    8.32{col 46}{space 3}0.000{col 54}{space 4}   .01588{col 67}{space 3} .0256742
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0577038{col 26}{space 2} .0026981{col 37}{space 1}   21.39{col 46}{space 3}0.000{col 54}{space 4} .0524156{col 67}{space 3} .0629921
{txt}eth_asian_~t {c |}{col 14}{res}{space 2} .0005132{col 26}{space 2} .0000485{col 37}{space 1}   10.58{col 46}{space 3}0.000{col 54}{space 4} .0004181{col 67}{space 3} .0006083
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0004535{col 26}{space 2} .0000481{col 37}{space 1}   -9.43{col 46}{space 3}0.000{col 54}{space 4}-.0005477{col 67}{space 3}-.0003592
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0010265{col 26}{space 2} .0000893{col 37}{space 1}  -11.50{col 46}{space 3}0.000{col 54}{space 4}-.0012014{col 67}{space 3}-.0008515
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-.4482828{col 26}{space 2} .1289496{col 37}{space 1}   -3.48{col 46}{space 3}0.001{col 54}{space 4}-.7010202{col 67}{space 3}-.1955455
{txt}educ~us_prop {c |}{col 14}{res}{space 2} .5526275{col 26}{space 2} .1180416{col 37}{space 1}    4.68{col 46}{space 3}0.000{col 54}{space 4} .3212696{col 67}{space 3} .7839854
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2} -.000524{col 26}{space 2} .0000735{col 37}{space 1}   -7.13{col 46}{space 3}0.000{col 54}{space 4}-.0006681{col 67}{space 3}  -.00038
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 3.68e-07{col 26}{space 2} 3.37e-08{col 37}{space 1}   10.93{col 46}{space 3}0.000{col 54}{space 4} 3.02e-07{col 67}{space 3} 4.34e-07
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.678151{col 26}{space 2} .0283861{col 37}{space 1}   59.12{col 46}{space 3}0.000{col 54}{space 4} 1.622515{col 67}{space 3} 1.733787
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_both_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41574945 .07244593 .4093888 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0041540851   .5769807246          3402{txt}  {c |}
  2 {c |}  {res}.0034993897   .5012133949          2214{txt}  {c |}
  3 {c |}  {res}.0029574261    .434027497          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0041540851{txt}  {c |}
  2 {c |}  {res}.0034993897{txt}  {c |}
  3 {c |}  {res}.0034993897{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}  2679.56
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0175
                                                {txt}Root MSE          =    {res} .41205

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_both~k{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_bot~k {c |}{col 14}{res}{space 2} 1.058216{col 26}{space 2} .0204429{col 37}{space 1}   51.76{col 46}{space 3}0.000{col 54}{space 4} 1.018109{col 67}{space 3} 1.098323
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0011966{col 26}{space 2} .0004123{col 37}{space 1}   -2.90{col 46}{space 3}0.004{col 54}{space 4}-.0020055{col 67}{space 3}-.0003876
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_both_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}    27.13
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0002
                                                {txt}Root MSE          =    {res} .01484

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_d_ac~k{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_acs~k {c |}{col 14}{res}{space 2} .0040198{col 26}{space 2} .0007718{col 37}{space 1}    5.21{col 46}{space 3}0.000{col 54}{space 4} .0025056{col 67}{space 3} .0055339
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.87e-06{col 26}{space 2} .0000453{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-.0000937{col 67}{space 3}  .000084
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_sib_acs_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}   105.34
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0287
                                                {txt}Root MSE          =    {res} .02929

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_r_d_si~k{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_sib~k {c |}{col 14}{res}{space 2} .0900392{col 26}{space 2} .0087725{col 37}{space 1}   10.26{col 46}{space 3}0.000{col 54}{space 4} .0728285{col 67}{space 3} .1072499
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001374{col 26}{space 2}  .000618{col 37}{space 1}   -0.22{col 46}{space 3}0.824{col 54}{space 4}-.0013497{col 67}{space 3}  .001075
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_acs_sib_dk.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/outcome_va/va_enr_sib_acs_dk.dta{rm}
saved
{p_end}
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(38, 431857)   = {res}   651.57
{txt}       Model {c |} {res} 5400.34152        38   142.11425   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 94191.8539   431,857  .218108897   {txt}R-squared       ={res}    0.0542
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0541
{txt}       Total {c |} {res} 99592.1954   431,895  .230593536   {txt}Root MSE        =   {res} .46702

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .1043496{col 26}{space 2} .0084202{col 37}{space 1}   12.39{col 46}{space 3}0.000{col 54}{space 4} .0878463{col 67}{space 3}  .120853
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2}-.1584727{col 26}{space 2} .0078768{col 37}{space 1}  -20.12{col 46}{space 3}0.000{col 54}{space 4}-.1739111{col 67}{space 3}-.1430343
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0089954{col 26}{space 2} .0028294{col 37}{space 1}   -3.18{col 46}{space 3}0.001{col 54}{space 4} -.014541{col 67}{space 3}-.0034498
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0360757{col 26}{space 2} .0028401{col 37}{space 1}  -12.70{col 46}{space 3}0.000{col 54}{space 4}-.0416422{col 67}{space 3}-.0305091
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0104904{col 26}{space 2} .0028668{col 37}{space 1}   -3.66{col 46}{space 3}0.000{col 54}{space 4}-.0161093{col 67}{space 3}-.0048715
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000733{col 26}{space 2} 5.15e-06{col 37}{space 1}  -14.22{col 46}{space 3}0.000{col 54}{space 4}-.0000834{col 67}{space 3}-.0000632
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0222082{col 26}{space 2} .0014541{col 37}{space 1}   15.27{col 46}{space 3}0.000{col 54}{space 4} .0193582{col 67}{space 3} .0250582
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} -.009358{col 26}{space 2} .0022752{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4}-.0138173{col 67}{space 3}-.0048987
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0089892{col 26}{space 2} .0019984{col 37}{space 1}   -4.50{col 46}{space 3}0.000{col 54}{space 4} -.012906{col 67}{space 3}-.0050723
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0419422{col 26}{space 2} .0040245{col 37}{space 1}  -10.42{col 46}{space 3}0.000{col 54}{space 4}-.0498301{col 67}{space 3}-.0340542
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0022075{col 26}{space 2} .0043253{col 37}{space 1}    0.51{col 46}{space 3}0.610{col 54}{space 4}-.0062699{col 67}{space 3} .0106849
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0283363{col 26}{space 2} .0016968{col 37}{space 1}  -16.70{col 46}{space 3}0.000{col 54}{space 4}-.0316619{col 67}{space 3}-.0250106
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0263005{col 26}{space 2} .0038872{col 37}{space 1}   -6.77{col 46}{space 3}0.000{col 54}{space 4}-.0339192{col 67}{space 3}-.0186817
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0316473{col 26}{space 2}  .003802{col 37}{space 1}    8.32{col 46}{space 3}0.000{col 54}{space 4} .0241955{col 67}{space 3} .0390991
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0592603{col 26}{space 2} .0028577{col 37}{space 1}  -20.74{col 46}{space 3}0.000{col 54}{space 4}-.0648613{col 67}{space 3}-.0536593
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.054357{col 26}{space 2} .0027862{col 37}{space 1}  -19.51{col 46}{space 3}0.000{col 54}{space 4}-.0598178{col 67}{space 3}-.0488962
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0511084{col 26}{space 2} .0029563{col 37}{space 1}  -17.29{col 46}{space 3}0.000{col 54}{space 4}-.0569026{col 67}{space 3}-.0453141
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0265666{col 26}{space 2} .0036878{col 37}{space 1}   -7.20{col 46}{space 3}0.000{col 54}{space 4}-.0337945{col 67}{space 3}-.0193386
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0418503{col 26}{space 2} .0015147{col 37}{space 1}  -27.63{col 46}{space 3}0.000{col 54}{space 4}-.0448191{col 67}{space 3}-.0388815
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0405543{col 26}{space 2} .0015154{col 37}{space 1}  -26.76{col 46}{space 3}0.000{col 54}{space 4}-.0435244{col 67}{space 3}-.0375843
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0309452{col 26}{space 2} .0015829{col 37}{space 1}  -19.55{col 46}{space 3}0.000{col 54}{space 4}-.0340476{col 67}{space 3}-.0278429
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0325351{col 26}{space 2} .0015791{col 37}{space 1}  -20.60{col 46}{space 3}0.000{col 54}{space 4}-.0356301{col 67}{space 3}-.0294401
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0108913{col 26}{space 2} .0006838{col 37}{space 1}   15.93{col 46}{space 3}0.000{col 54}{space 4}  .009551{col 67}{space 3} .0122316
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0107145{col 26}{space 2} .0006275{col 37}{space 1}   17.07{col 46}{space 3}0.000{col 54}{space 4} .0094845{col 67}{space 3} .0119445
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0082865{col 26}{space 2} .0006249{col 37}{space 1}   13.26{col 46}{space 3}0.000{col 54}{space 4} .0070618{col 67}{space 3} .0095113
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .004262{col 26}{space 2} .0010363{col 37}{space 1}    4.11{col 46}{space 3}0.000{col 54}{space 4}  .002231{col 67}{space 3} .0062931
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0662272{col 26}{space 2} .0028425{col 37}{space 1}  -23.30{col 46}{space 3}0.000{col 54}{space 4}-.0717985{col 67}{space 3}-.0606559
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0664952{col 26}{space 2} .0028868{col 37}{space 1}  -23.03{col 46}{space 3}0.000{col 54}{space 4}-.0721533{col 67}{space 3}-.0608372
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0672433{col 26}{space 2} .0030381{col 37}{space 1}  -22.13{col 46}{space 3}0.000{col 54}{space 4}-.0731979{col 67}{space 3}-.0612887
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0549022{col 26}{space 2} .0037092{col 37}{space 1}  -14.80{col 46}{space 3}0.000{col 54}{space 4}-.0621721{col 67}{space 3}-.0476322
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0293926{col 26}{space 2} .0018988{col 37}{space 1}  -15.48{col 46}{space 3}0.000{col 54}{space 4}-.0331141{col 67}{space 3} -.025671
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.033535{col 26}{space 2} .0018498{col 37}{space 1}  -18.13{col 46}{space 3}0.000{col 54}{space 4}-.0371606{col 67}{space 3}-.0299095
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0263686{col 26}{space 2}   .00195{col 37}{space 1}  -13.52{col 46}{space 3}0.000{col 54}{space 4}-.0301905{col 67}{space 3}-.0225467
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.035513{col 26}{space 2} .0015455{col 37}{space 1}  -22.98{col 46}{space 3}0.000{col 54}{space 4}-.0385422{col 67}{space 3}-.0324839
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0097712{col 26}{space 2} .0007695{col 37}{space 1}   12.70{col 46}{space 3}0.000{col 54}{space 4}  .008263{col 67}{space 3} .0112793
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0115333{col 26}{space 2} .0008163{col 37}{space 1}   14.13{col 46}{space 3}0.000{col 54}{space 4} .0099333{col 67}{space 3} .0131332
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0092076{col 26}{space 2} .0008208{col 37}{space 1}   11.22{col 46}{space 3}0.000{col 54}{space 4} .0075989{col 67}{space 3} .0108162
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0024287{col 26}{space 2} .0010183{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} .0004329{col 67}{space 3} .0044246
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .9101477{col 26}{space 2}  .031565{col 37}{space 1}   28.83{col 46}{space 3}0.000{col 54}{space 4} .8482814{col 67}{space 3} .9720141
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_2year_og_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.4670213 .09705512 .45682513 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .008762458   .7336057726          3402{txt}  {c |}
  2 {c |}  {res}.0079666557   .6742088911          2214{txt}  {c |}
  3 {c |}  {res}.0070468579   .6153100282          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .008762458{txt}  {c |}
  2 {c |}  {res}.0079666557{txt}  {c |}
  3 {c |}  {res}.0079666557{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res} 12341.50
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0336
                                                {txt}Root MSE          =    {res} .45909

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2year_~k{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_2ye~k {c |}{col 14}{res}{space 2}  .991002{col 26}{space 2} .0089205{col 37}{space 1}  111.09{col 46}{space 3}0.000{col 54}{space 4} .9735009{col 67}{space 3} 1.008503
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0012979{col 26}{space 2} .0003987{col 37}{space 1}   -3.26{col 46}{space 3}0.001{col 54}{space 4}-.0020801{col 67}{space 3}-.0005157
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_2year_og_dk.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(45, 431850)   = {res}   627.59
{txt}       Model {c |} {res} 6113.25514        45  135.850114   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 93478.9402   431,850  .216461596   {txt}R-squared       ={res}    0.0614
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0613
{txt}       Total {c |} {res} 99592.1954   431,895  .230593536   {txt}Root MSE        =   {res} .46525

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .0888501{col 26}{space 2} .0084875{col 37}{space 1}   10.47{col 46}{space 3}0.000{col 54}{space 4} .0722148{col 67}{space 3} .1054854
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2}-.1371329{col 26}{space 2} .0080818{col 37}{space 1}  -16.97{col 46}{space 3}0.000{col 54}{space 4} -.152973{col 67}{space 3}-.1212927
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0069583{col 26}{space 2} .0028205{col 37}{space 1}   -2.47{col 46}{space 3}0.014{col 54}{space 4}-.0124864{col 67}{space 3}-.0014303
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0336546{col 26}{space 2} .0028369{col 37}{space 1}  -11.86{col 46}{space 3}0.000{col 54}{space 4}-.0392148{col 67}{space 3}-.0280945
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0075547{col 26}{space 2}  .002871{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.0131818{col 67}{space 3}-.0019277
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000733{col 26}{space 2} 5.14e-06{col 37}{space 1}  -14.25{col 46}{space 3}0.000{col 54}{space 4}-.0000833{col 67}{space 3}-.0000632
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0213264{col 26}{space 2} .0014489{col 37}{space 1}   14.72{col 46}{space 3}0.000{col 54}{space 4} .0184866{col 67}{space 3} .0241661
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} -.022617{col 26}{space 2}  .002558{col 37}{space 1}   -8.84{col 46}{space 3}0.000{col 54}{space 4}-.0276305{col 67}{space 3}-.0176034
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} .0113613{col 26}{space 2} .0022107{col 37}{space 1}    5.14{col 46}{space 3}0.000{col 54}{space 4} .0070284{col 67}{space 3} .0156942
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0161098{col 26}{space 2}  .004206{col 37}{space 1}   -3.83{col 46}{space 3}0.000{col 54}{space 4}-.0243535{col 67}{space 3}-.0078662
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0006996{col 26}{space 2} .0043253{col 37}{space 1}    0.16{col 46}{space 3}0.872{col 54}{space 4}-.0077779{col 67}{space 3} .0091771
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0188312{col 26}{space 2} .0018053{col 37}{space 1}  -10.43{col 46}{space 3}0.000{col 54}{space 4}-.0223696{col 67}{space 3}-.0152929
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0277316{col 26}{space 2}  .003874{col 37}{space 1}   -7.16{col 46}{space 3}0.000{col 54}{space 4}-.0353245{col 67}{space 3}-.0201388
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0269918{col 26}{space 2} .0037926{col 37}{space 1}    7.12{col 46}{space 3}0.000{col 54}{space 4} .0195584{col 67}{space 3} .0344251
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0629817{col 26}{space 2} .0028497{col 37}{space 1}  -22.10{col 46}{space 3}0.000{col 54}{space 4} -.068567{col 67}{space 3}-.0573964
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0580095{col 26}{space 2} .0027784{col 37}{space 1}  -20.88{col 46}{space 3}0.000{col 54}{space 4}-.0634551{col 67}{space 3} -.052564
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0540258{col 26}{space 2}  .002949{col 37}{space 1}  -18.32{col 46}{space 3}0.000{col 54}{space 4}-.0598058{col 67}{space 3}-.0482459
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0283922{col 26}{space 2} .0036753{col 37}{space 1}   -7.73{col 46}{space 3}0.000{col 54}{space 4}-.0355956{col 67}{space 3}-.0211888
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0406011{col 26}{space 2} .0015093{col 37}{space 1}  -26.90{col 46}{space 3}0.000{col 54}{space 4}-.0435592{col 67}{space 3} -.037643
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0392665{col 26}{space 2} .0015099{col 37}{space 1}  -26.01{col 46}{space 3}0.000{col 54}{space 4}-.0422259{col 67}{space 3}-.0363072
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0294708{col 26}{space 2} .0015772{col 37}{space 1}  -18.69{col 46}{space 3}0.000{col 54}{space 4}-.0325621{col 67}{space 3}-.0263796
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0313973{col 26}{space 2} .0015732{col 37}{space 1}  -19.96{col 46}{space 3}0.000{col 54}{space 4}-.0344808{col 67}{space 3}-.0283138
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0108956{col 26}{space 2} .0006813{col 37}{space 1}   15.99{col 46}{space 3}0.000{col 54}{space 4} .0095603{col 67}{space 3} .0122308
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0107014{col 26}{space 2} .0006252{col 37}{space 1}   17.12{col 46}{space 3}0.000{col 54}{space 4} .0094761{col 67}{space 3} .0119268
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0082031{col 26}{space 2} .0006226{col 37}{space 1}   13.18{col 46}{space 3}0.000{col 54}{space 4} .0069829{col 67}{space 3} .0094233
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0043919{col 26}{space 2} .0010324{col 37}{space 1}    4.25{col 46}{space 3}0.000{col 54}{space 4} .0023685{col 67}{space 3} .0064153
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0653439{col 26}{space 2} .0028322{col 37}{space 1}  -23.07{col 46}{space 3}0.000{col 54}{space 4} -.070895{col 67}{space 3}-.0597927
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0656921{col 26}{space 2} .0028762{col 37}{space 1}  -22.84{col 46}{space 3}0.000{col 54}{space 4}-.0713295{col 67}{space 3}-.0600548
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0659902{col 26}{space 2} .0030271{col 37}{space 1}  -21.80{col 46}{space 3}0.000{col 54}{space 4}-.0719232{col 67}{space 3}-.0600571
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0570123{col 26}{space 2} .0036962{col 37}{space 1}  -15.42{col 46}{space 3}0.000{col 54}{space 4}-.0642568{col 67}{space 3}-.0497678
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0272108{col 26}{space 2} .0018921{col 37}{space 1}  -14.38{col 46}{space 3}0.000{col 54}{space 4}-.0309192{col 67}{space 3}-.0235023
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0318387{col 26}{space 2} .0018431{col 37}{space 1}  -17.27{col 46}{space 3}0.000{col 54}{space 4}-.0354512{col 67}{space 3}-.0282262
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0253895{col 26}{space 2} .0019428{col 37}{space 1}  -13.07{col 46}{space 3}0.000{col 54}{space 4}-.0291972{col 67}{space 3}-.0215817
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0345247{col 26}{space 2} .0015401{col 37}{space 1}  -22.42{col 46}{space 3}0.000{col 54}{space 4}-.0375433{col 67}{space 3}-.0315061
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0091528{col 26}{space 2} .0007667{col 37}{space 1}   11.94{col 46}{space 3}0.000{col 54}{space 4} .0076502{col 67}{space 3} .0106555
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0110833{col 26}{space 2} .0008133{col 37}{space 1}   13.63{col 46}{space 3}0.000{col 54}{space 4} .0094893{col 67}{space 3} .0126773
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0089393{col 26}{space 2} .0008177{col 37}{space 1}   10.93{col 46}{space 3}0.000{col 54}{space 4} .0073366{col 67}{space 3} .0105419
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0027663{col 26}{space 2} .0010146{col 37}{space 1}    2.73{col 46}{space 3}0.006{col 54}{space 4} .0007777{col 67}{space 3} .0047549
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2} .0007635{col 26}{space 2} .0000543{col 37}{space 1}   14.06{col 46}{space 3}0.000{col 54}{space 4}  .000657{col 67}{space 3} .0008699
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0010294{col 26}{space 2} .0000538{col 37}{space 1}  -19.12{col 46}{space 3}0.000{col 54}{space 4} -.001135{col 67}{space 3}-.0009239
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0025833{col 26}{space 2} .0000999{col 37}{space 1}  -25.87{col 46}{space 3}0.000{col 54}{space 4} -.002779{col 67}{space 3}-.0023875
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2} -2.01207{col 26}{space 2} .1442992{col 37}{space 1}  -13.94{col 46}{space 3}0.000{col 54}{space 4}-2.294892{col 67}{space 3}-1.729248
{txt}educ~us_prop {c |}{col 14}{res}{space 2}-1.622328{col 26}{space 2} .1320736{col 37}{space 1}  -12.28{col 46}{space 3}0.000{col 54}{space 4}-1.881189{col 67}{space 3}-1.363468
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0012283{col 26}{space 2} .0000823{col 37}{space 1}  -14.93{col 46}{space 3}0.000{col 54}{space 4}-.0013896{col 67}{space 3}-.0010671
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2}-1.13e-06{col 26}{space 2} 3.77e-08{col 37}{space 1}  -30.08{col 46}{space 3}0.000{col 54}{space 4}-1.21e-06{col 67}{space 3}-1.06e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.067312{col 26}{space 2} .0317544{col 37}{space 1}   33.61{col 46}{space 3}0.000{col 54}{space 4} 1.005074{col 67}{space 3}  1.12955
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_2year_acs_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46525433 .08727276 .45699569 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0069046443   .6837314477          3402{txt}  {c |}
  2 {c |}  {res}.0061216123    .610441169          2214{txt}  {c |}
  3 {c |}  {res}.0053454795   .5464483791          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0069046443{txt}  {c |}
  2 {c |}  {res}.0061216123{txt}  {c |}
  3 {c |}  {res}.0061216123{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}  8151.82
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0257
                                                {txt}Root MSE          =    {res} .45921

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2ye~s_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~s_dk {c |}{col 14}{res}{space 2} .9949964{col 26}{space 2} .0110203{col 37}{space 1}   90.29{col 46}{space 3}0.000{col 54}{space 4} .9733758{col 67}{space 3} 1.016617
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0012536{col 26}{space 2} .0004245{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-.0020863{col 67}{space 3}-.0004208
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_2year_acs_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}   250.96
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0934
                                                {txt}Root MSE          =    {res} .03868

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr~g_acs_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~g_dk {c |}{col 14}{res}{space 2}  .143796{col 26}{space 2}  .009077{col 37}{space 1}   15.84{col 46}{space 3}0.000{col 54}{space 4}  .125988{col 67}{space 3}  .161604
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001916{col 26}{space 2} .0007915{col 37}{space 1}   -0.24{col 46}{space 3}0.809{col 54}{space 4}-.0017444{col 67}{space 3} .0013611
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_2year_acs_og_dk.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(40, 431855)   = {res}   670.66
{txt}       Model {c |} {res} 5824.77167        40  145.619292   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 93767.4237   431,855    .2171271   {txt}R-squared       ={res}    0.0585
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0584
{txt}       Total {c |} {res} 99592.1954   431,895  .230593536   {txt}Root MSE        =   {res} .46597

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .1026789{col 26}{space 2} .0084019{col 37}{space 1}   12.22{col 46}{space 3}0.000{col 54}{space 4} .0862114{col 67}{space 3} .1191465
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2}-.1526898{col 26}{space 2} .0078606{col 37}{space 1}  -19.42{col 46}{space 3}0.000{col 54}{space 4}-.1680963{col 67}{space 3}-.1372834
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} -.009298{col 26}{space 2} .0028232{col 37}{space 1}   -3.29{col 46}{space 3}0.001{col 54}{space 4}-.0148314{col 67}{space 3}-.0037646
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0366384{col 26}{space 2} .0028345{col 37}{space 1}  -12.93{col 46}{space 3}0.000{col 54}{space 4}-.0421939{col 67}{space 3}-.0310828
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0121662{col 26}{space 2} .0028623{col 37}{space 1}   -4.25{col 46}{space 3}0.000{col 54}{space 4}-.0177761{col 67}{space 3}-.0065562
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000727{col 26}{space 2} 5.14e-06{col 37}{space 1}  -14.14{col 46}{space 3}0.000{col 54}{space 4}-.0000828{col 67}{space 3}-.0000627
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0223743{col 26}{space 2} .0014508{col 37}{space 1}   15.42{col 46}{space 3}0.000{col 54}{space 4} .0195307{col 67}{space 3} .0252179
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}  -.00975{col 26}{space 2} .0022711{col 37}{space 1}   -4.29{col 46}{space 3}0.000{col 54}{space 4}-.0142012{col 67}{space 3}-.0052988
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} -.010863{col 26}{space 2} .0019944{col 37}{space 1}   -5.45{col 46}{space 3}0.000{col 54}{space 4}-.0147719{col 67}{space 3}-.0069541
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0419687{col 26}{space 2} .0040155{col 37}{space 1}  -10.45{col 46}{space 3}0.000{col 54}{space 4}-.0498389{col 67}{space 3}-.0340986
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0015662{col 26}{space 2} .0043156{col 37}{space 1}    0.36{col 46}{space 3}0.717{col 54}{space 4}-.0068924{col 67}{space 3} .0100247
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0288857{col 26}{space 2} .0016932{col 37}{space 1}  -17.06{col 46}{space 3}0.000{col 54}{space 4}-.0322043{col 67}{space 3}-.0255671
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0268887{col 26}{space 2} .0038784{col 37}{space 1}   -6.93{col 46}{space 3}0.000{col 54}{space 4}-.0344903{col 67}{space 3}-.0192871
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0317512{col 26}{space 2} .0037936{col 37}{space 1}    8.37{col 46}{space 3}0.000{col 54}{space 4} .0243159{col 67}{space 3} .0391865
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0579097{col 26}{space 2} .0028514{col 37}{space 1}  -20.31{col 46}{space 3}0.000{col 54}{space 4}-.0634984{col 67}{space 3} -.052321
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.052967{col 26}{space 2} .0027801{col 37}{space 1}  -19.05{col 46}{space 3}0.000{col 54}{space 4}-.0584159{col 67}{space 3}-.0475181
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0491048{col 26}{space 2} .0029501{col 37}{space 1}  -16.65{col 46}{space 3}0.000{col 54}{space 4}-.0548869{col 67}{space 3}-.0433227
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0249779{col 26}{space 2} .0036797{col 37}{space 1}   -6.79{col 46}{space 3}0.000{col 54}{space 4}-.0321899{col 67}{space 3}-.0177659
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0415409{col 26}{space 2} .0015113{col 37}{space 1}  -27.49{col 46}{space 3}0.000{col 54}{space 4}-.0445031{col 67}{space 3}-.0385787
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0402167{col 26}{space 2}  .001512{col 37}{space 1}  -26.60{col 46}{space 3}0.000{col 54}{space 4}-.0431802{col 67}{space 3}-.0372533
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0307012{col 26}{space 2} .0015794{col 37}{space 1}  -19.44{col 46}{space 3}0.000{col 54}{space 4}-.0337967{col 67}{space 3}-.0276058
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0323039{col 26}{space 2} .0015755{col 37}{space 1}  -20.50{col 46}{space 3}0.000{col 54}{space 4}-.0353919{col 67}{space 3}-.0292159
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0107279{col 26}{space 2} .0006823{col 37}{space 1}   15.72{col 46}{space 3}0.000{col 54}{space 4} .0093906{col 67}{space 3} .0120652
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0105667{col 26}{space 2} .0006261{col 37}{space 1}   16.88{col 46}{space 3}0.000{col 54}{space 4} .0093395{col 67}{space 3}  .011794
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0081009{col 26}{space 2} .0006235{col 37}{space 1}   12.99{col 46}{space 3}0.000{col 54}{space 4} .0068789{col 67}{space 3} .0093229
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0040668{col 26}{space 2} .0010339{col 37}{space 1}    3.93{col 46}{space 3}0.000{col 54}{space 4} .0020403{col 67}{space 3} .0060933
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.065055{col 26}{space 2} .0028364{col 37}{space 1}  -22.94{col 46}{space 3}0.000{col 54}{space 4}-.0706142{col 67}{space 3}-.0594959
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0649656{col 26}{space 2} .0028808{col 37}{space 1}  -22.55{col 46}{space 3}0.000{col 54}{space 4}-.0706119{col 67}{space 3}-.0593193
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0657692{col 26}{space 2} .0030316{col 37}{space 1}  -21.69{col 46}{space 3}0.000{col 54}{space 4}-.0717111{col 67}{space 3}-.0598273
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0525668{col 26}{space 2} .0037013{col 37}{space 1}  -14.20{col 46}{space 3}0.000{col 54}{space 4}-.0598213{col 67}{space 3}-.0453123
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0291923{col 26}{space 2} .0018945{col 37}{space 1}  -15.41{col 46}{space 3}0.000{col 54}{space 4}-.0329055{col 67}{space 3}-.0254791
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0332555{col 26}{space 2} .0018456{col 37}{space 1}  -18.02{col 46}{space 3}0.000{col 54}{space 4}-.0368729{col 67}{space 3}-.0296381
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0261631{col 26}{space 2} .0019456{col 37}{space 1}  -13.45{col 46}{space 3}0.000{col 54}{space 4}-.0299764{col 67}{space 3}-.0223498
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0348784{col 26}{space 2} .0015422{col 37}{space 1}  -22.62{col 46}{space 3}0.000{col 54}{space 4} -.037901{col 67}{space 3}-.0318558
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0096678{col 26}{space 2} .0007678{col 37}{space 1}   12.59{col 46}{space 3}0.000{col 54}{space 4}  .008163{col 67}{space 3} .0111726
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0113594{col 26}{space 2} .0008145{col 37}{space 1}   13.95{col 46}{space 3}0.000{col 54}{space 4}  .009763{col 67}{space 3} .0129558
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0090856{col 26}{space 2} .0008189{col 37}{space 1}   11.09{col 46}{space 3}0.000{col 54}{space 4} .0074806{col 67}{space 3} .0106907
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0022009{col 26}{space 2}  .001016{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} .0002095{col 67}{space 3} .0041923
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .1001286{col 26}{space 2} .0027997{col 37}{space 1}   35.76{col 46}{space 3}0.000{col 54}{space 4} .0946414{col 67}{space 3} .1056159
{txt}1.has_~4year {c |}{col 14}{res}{space 2}-.0851039{col 26}{space 2} .0030227{col 37}{space 1}  -28.15{col 46}{space 3}0.000{col 54}{space 4}-.0910283{col 67}{space 3}-.0791795
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9056998{col 26}{space 2}  .031506{col 37}{space 1}   28.75{col 46}{space 3}0.000{col 54}{space 4}  .843949{col 67}{space 3} .9674505
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_2year_sib_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46596899 .09534573 .45610996 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0084488726    .727458203          3402{txt}  {c |}
  2 {c |}  {res}.0076552349   .6663956527          2214{txt}  {c |}
  3 {c |}  {res}.0067559872    .607548319          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0084488726{txt}  {c |}
  2 {c |}  {res}.0076552349{txt}  {c |}
  3 {c |}  {res}.0076552349{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res} 11778.24
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0324
                                                {txt}Root MSE          =    {res} .45834

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2ye~b_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~b_dk {c |}{col 14}{res}{space 2} .9914549{col 26}{space 2} .0091355{col 37}{space 1}  108.53{col 46}{space 3}0.000{col 54}{space 4}  .973532{col 67}{space 3} 1.009378
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0013271{col 26}{space 2} .0003992{col 37}{space 1}   -3.32{col 46}{space 3}0.001{col 54}{space 4}-.0021103{col 67}{space 3}-.0005439
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_2year_sib_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}   484.54
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0026
                                                {txt}Root MSE          =    {res} .03131

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr~g_sib_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~g_dk {c |}{col 14}{res}{space 2} .0186709{col 26}{space 2} .0008482{col 37}{space 1}   22.01{col 46}{space 3}0.000{col 54}{space 4} .0170069{col 67}{space 3}  .020335
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000239{col 26}{space 2} .0000718{col 37}{space 1}   -0.33{col 46}{space 3}0.739{col 54}{space 4}-.0001649{col 67}{space 3}  .000117
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_2year_sib_og_dk.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(47, 431848)   = {res}   642.66
{txt}       Model {c |} {res} 6510.45157        47  138.520246   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 93081.7438   431,848  .215542839   {txt}R-squared       ={res}    0.0654
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0653
{txt}       Total {c |} {res} 99592.1954   431,895  .230593536   {txt}Root MSE        =   {res} .46427

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .0880829{col 26}{space 2} .0084701{col 37}{space 1}   10.40{col 46}{space 3}0.000{col 54}{space 4} .0714818{col 67}{space 3}  .104684
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2}-.1328303{col 26}{space 2} .0080656{col 37}{space 1}  -16.47{col 46}{space 3}0.000{col 54}{space 4}-.1486387{col 67}{space 3}-.1170219
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0073154{col 26}{space 2} .0028147{col 37}{space 1}   -2.60{col 46}{space 3}0.009{col 54}{space 4} -.012832{col 67}{space 3}-.0017987
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0342971{col 26}{space 2} .0028316{col 37}{space 1}  -12.11{col 46}{space 3}0.000{col 54}{space 4} -.039847{col 67}{space 3}-.0287472
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0092883{col 26}{space 2} .0028668{col 37}{space 1}   -3.24{col 46}{space 3}0.001{col 54}{space 4}-.0149071{col 67}{space 3}-.0036695
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000728{col 26}{space 2} 5.13e-06{col 37}{space 1}  -14.18{col 46}{space 3}0.000{col 54}{space 4}-.0000829{col 67}{space 3}-.0000627
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0214901{col 26}{space 2} .0014458{col 37}{space 1}   14.86{col 46}{space 3}0.000{col 54}{space 4} .0186563{col 67}{space 3} .0243238
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0225783{col 26}{space 2} .0025535{col 37}{space 1}   -8.84{col 46}{space 3}0.000{col 54}{space 4}-.0275831{col 67}{space 3}-.0175735
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} .0095364{col 26}{space 2} .0022064{col 37}{space 1}    4.32{col 46}{space 3}0.000{col 54}{space 4} .0052119{col 67}{space 3} .0138609
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}  -.01626{col 26}{space 2} .0041971{col 37}{space 1}   -3.87{col 46}{space 3}0.000{col 54}{space 4}-.0244861{col 67}{space 3}-.0080338
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0002321{col 26}{space 2} .0043162{col 37}{space 1}    0.05{col 46}{space 3}0.957{col 54}{space 4}-.0082275{col 67}{space 3} .0086918
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2} -.019189{col 26}{space 2} .0018017{col 37}{space 1}  -10.65{col 46}{space 3}0.000{col 54}{space 4}-.0227202{col 67}{space 3}-.0156579
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0282556{col 26}{space 2} .0038657{col 37}{space 1}   -7.31{col 46}{space 3}0.000{col 54}{space 4}-.0358324{col 67}{space 3}-.0206789
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0270916{col 26}{space 2} .0037847{col 37}{space 1}    7.16{col 46}{space 3}0.000{col 54}{space 4} .0196737{col 67}{space 3} .0345094
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0616675{col 26}{space 2} .0028438{col 37}{space 1}  -21.68{col 46}{space 3}0.000{col 54}{space 4}-.0672413{col 67}{space 3}-.0560937
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0566533{col 26}{space 2} .0027727{col 37}{space 1}  -20.43{col 46}{space 3}0.000{col 54}{space 4}-.0620877{col 67}{space 3}-.0512189
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0521045{col 26}{space 2} .0029432{col 37}{space 1}  -17.70{col 46}{space 3}0.000{col 54}{space 4} -.057873{col 67}{space 3} -.046336
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0268758{col 26}{space 2} .0036676{col 37}{space 1}   -7.33{col 46}{space 3}0.000{col 54}{space 4}-.0340643{col 67}{space 3}-.0196874
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0403268{col 26}{space 2} .0015061{col 37}{space 1}  -26.78{col 46}{space 3}0.000{col 54}{space 4}-.0432787{col 67}{space 3}-.0373749
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0389635{col 26}{space 2} .0015067{col 37}{space 1}  -25.86{col 46}{space 3}0.000{col 54}{space 4}-.0419166{col 67}{space 3}-.0360103
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0292638{col 26}{space 2} .0015739{col 37}{space 1}  -18.59{col 46}{space 3}0.000{col 54}{space 4}-.0323486{col 67}{space 3} -.026179
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0311943{col 26}{space 2} .0015699{col 37}{space 1}  -19.87{col 46}{space 3}0.000{col 54}{space 4}-.0342713{col 67}{space 3}-.0281173
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0107388{col 26}{space 2} .0006798{col 37}{space 1}   15.80{col 46}{space 3}0.000{col 54}{space 4} .0094064{col 67}{space 3} .0120712
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0105589{col 26}{space 2} .0006239{col 37}{space 1}   16.92{col 46}{space 3}0.000{col 54}{space 4} .0093361{col 67}{space 3} .0117816
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0080272{col 26}{space 2} .0006213{col 37}{space 1}   12.92{col 46}{space 3}0.000{col 54}{space 4} .0068096{col 67}{space 3} .0092448
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0042017{col 26}{space 2} .0010302{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} .0021826{col 67}{space 3} .0062209
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0642655{col 26}{space 2} .0028265{col 37}{space 1}  -22.74{col 46}{space 3}0.000{col 54}{space 4}-.0698053{col 67}{space 3}-.0587258
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0642693{col 26}{space 2} .0028706{col 37}{space 1}  -22.39{col 46}{space 3}0.000{col 54}{space 4}-.0698956{col 67}{space 3} -.058643
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0646191{col 26}{space 2}  .003021{col 37}{space 1}  -21.39{col 46}{space 3}0.000{col 54}{space 4}-.0705402{col 67}{space 3} -.058698
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.054764{col 26}{space 2} .0036889{col 37}{space 1}  -14.85{col 46}{space 3}0.000{col 54}{space 4}-.0619941{col 67}{space 3} -.047534
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0270547{col 26}{space 2} .0018881{col 37}{space 1}  -14.33{col 46}{space 3}0.000{col 54}{space 4}-.0307553{col 67}{space 3}-.0233541
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0315957{col 26}{space 2} .0018392{col 37}{space 1}  -17.18{col 46}{space 3}0.000{col 54}{space 4}-.0352006{col 67}{space 3}-.0279909
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0252121{col 26}{space 2} .0019386{col 37}{space 1}  -13.01{col 46}{space 3}0.000{col 54}{space 4}-.0290118{col 67}{space 3}-.0214124
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0339364{col 26}{space 2}  .001537{col 37}{space 1}  -22.08{col 46}{space 3}0.000{col 54}{space 4}-.0369489{col 67}{space 3} -.030924
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0090637{col 26}{space 2}  .000765{col 37}{space 1}   11.85{col 46}{space 3}0.000{col 54}{space 4} .0075643{col 67}{space 3} .0105632
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0109242{col 26}{space 2} .0008116{col 37}{space 1}   13.46{col 46}{space 3}0.000{col 54}{space 4} .0093335{col 67}{space 3} .0125148
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0088273{col 26}{space 2} .0008159{col 37}{space 1}   10.82{col 46}{space 3}0.000{col 54}{space 4} .0072281{col 67}{space 3} .0104266
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0025394{col 26}{space 2} .0010125{col 37}{space 1}    2.51{col 46}{space 3}0.012{col 54}{space 4} .0005549{col 67}{space 3} .0045238
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0977223{col 26}{space 2} .0027901{col 37}{space 1}   35.02{col 46}{space 3}0.000{col 54}{space 4} .0922537{col 67}{space 3} .1031909
{txt}1.has_~4year {c |}{col 14}{res}{space 2}-.0811908{col 26}{space 2}  .003013{col 37}{space 1}  -26.95{col 46}{space 3}0.000{col 54}{space 4}-.0870962{col 67}{space 3}-.0752854
{txt}eth_asian_~t {c |}{col 14}{res}{space 2} .0007444{col 26}{space 2} .0000542{col 37}{space 1}   13.74{col 46}{space 3}0.000{col 54}{space 4} .0006382{col 67}{space 3} .0008506
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0010102{col 26}{space 2} .0000537{col 37}{space 1}  -18.80{col 46}{space 3}0.000{col 54}{space 4}-.0011155{col 67}{space 3}-.0009049
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0025443{col 26}{space 2} .0000997{col 37}{space 1}  -25.53{col 46}{space 3}0.000{col 54}{space 4}-.0027396{col 67}{space 3} -.002349
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-1.985855{col 26}{space 2} .1439976{col 37}{space 1}  -13.79{col 46}{space 3}0.000{col 54}{space 4}-2.268085{col 67}{space 3}-1.703624
{txt}educ~us_prop {c |}{col 14}{res}{space 2}-1.567482{col 26}{space 2} .1318166{col 37}{space 1}  -11.89{col 46}{space 3}0.000{col 54}{space 4}-1.825839{col 67}{space 3}-1.309126
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0012059{col 26}{space 2} .0000821{col 37}{space 1}  -14.69{col 46}{space 3}0.000{col 54}{space 4}-.0013668{col 67}{space 3} -.001045
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2}-1.10e-06{col 26}{space 2} 3.76e-08{col 37}{space 1}  -29.29{col 46}{space 3}0.000{col 54}{space 4}-1.17e-06{col 67}{space 3}-1.03e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.05915{col 26}{space 2} .0316986{col 37}{space 1}   33.41{col 46}{space 3}0.000{col 54}{space 4} .9970222{col 67}{space 3} 1.121279
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_2year_both_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46426591 .08580262 .45626829 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .006665608   .6771510116          3402{txt}  {c |}
  2 {c |}  {res}.0058865708   .6023321105          2214{txt}  {c |}
  3 {c |}  {res}.0051293168   .5387706733          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .006665608{txt}  {c |}
  2 {c |}  {res}.0058865708{txt}  {c |}
  3 {c |}  {res}.0058865708{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}note: label truncated to 80 characters

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}  7790.83
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0248
                                                {txt}Root MSE          =    {res} .45845

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_2ye~h_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~h_dk {c |}{col 14}{res}{space 2} .9955689{col 26}{space 2} .0112792{col 37}{space 1}   88.27{col 46}{space 3}0.000{col 54}{space 4} .9734403{col 67}{space 3} 1.017697
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0012747{col 26}{space 2} .0004247{col 37}{space 1}   -3.00{col 46}{space 3}0.003{col 54}{space 4} -.002108{col 67}{space 3}-.0004414
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_2year_both_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}   368.04
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0021
                                                {txt}Root MSE          =    {res}  .0303

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}en~s_both_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~s_dk {c |}{col 14}{res}{space 2} .0183224{col 26}{space 2} .0009551{col 37}{space 1}   19.18{col 46}{space 3}0.000{col 54}{space 4} .0164486{col 67}{space 3} .0201961
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000226{col 26}{space 2}  .000069{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}-.0001579{col 67}{space 3} .0001128
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_2year_sib_acs_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}   249.98
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0925
                                                {txt}Root MSE          =    {res} .03796

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}en~b_both_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~b_dk {c |}{col 14}{res}{space 2} .1432402{col 26}{space 2} .0090598{col 37}{space 1}   15.81{col 46}{space 3}0.000{col 54}{space 4}  .125466{col 67}{space 3} .1610144
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001949{col 26}{space 2}  .000774{col 37}{space 1}   -0.25{col 46}{space 3}0.801{col 54}{space 4}-.0017134{col 67}{space 3} .0013236
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_2year_acs_sib_dk.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/outcome_va/va_enr_2year_sib_acs_dk.dta{rm}
saved
{p_end}
(Outcome VA Restrcited Sample with Sibling Controls and Census Controls)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(38, 431857)   = {res}  3692.75
{txt}       Model {c |} {res} 24612.3613        38  647.693719   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75746.0618   431,857  .175396165   {txt}R-squared       ={res}    0.2452
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2452
{txt}       Total {c |} {res} 100358.423   431,895  .232367643   {txt}Root MSE        =   {res}  .4188

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2}-.0621822{col 26}{space 2} .0075508{col 37}{space 1}   -8.24{col 46}{space 3}0.000{col 54}{space 4}-.0769816{col 67}{space 3}-.0473827
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2}  .335779{col 26}{space 2} .0070636{col 37}{space 1}   47.54{col 46}{space 3}0.000{col 54}{space 4} .3219346{col 67}{space 3} .3496234
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}  .017822{col 26}{space 2} .0025373{col 37}{space 1}    7.02{col 46}{space 3}0.000{col 54}{space 4}  .012849{col 67}{space 3}  .022795
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0201137{col 26}{space 2} .0025469{col 37}{space 1}    7.90{col 46}{space 3}0.000{col 54}{space 4} .0151218{col 67}{space 3} .0251055
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0180484{col 26}{space 2} .0025708{col 37}{space 1}   -7.02{col 46}{space 3}0.000{col 54}{space 4}-.0230872{col 67}{space 3}-.0130097
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000714{col 26}{space 2} 4.62e-06{col 37}{space 1}  -15.46{col 46}{space 3}0.000{col 54}{space 4}-.0000805{col 67}{space 3}-.0000624
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0903488{col 26}{space 2}  .001304{col 37}{space 1}  -69.29{col 46}{space 3}0.000{col 54}{space 4}-.0929045{col 67}{space 3} -.087793
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0615988{col 26}{space 2} .0020403{col 37}{space 1}   30.19{col 46}{space 3}0.000{col 54}{space 4} .0575999{col 67}{space 3} .0655978
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0203666{col 26}{space 2} .0017921{col 37}{space 1}  -11.36{col 46}{space 3}0.000{col 54}{space 4} -.023879{col 67}{space 3}-.0168542
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0483544{col 26}{space 2}  .003609{col 37}{space 1}   13.40{col 46}{space 3}0.000{col 54}{space 4} .0412808{col 67}{space 3} .0554279
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0142197{col 26}{space 2} .0038787{col 37}{space 1}   -3.67{col 46}{space 3}0.000{col 54}{space 4}-.0218218{col 67}{space 3}-.0066175
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0362147{col 26}{space 2} .0015216{col 37}{space 1}  -23.80{col 46}{space 3}0.000{col 54}{space 4} -.039197{col 67}{space 3}-.0332324
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0225077{col 26}{space 2} .0034858{col 37}{space 1}   -6.46{col 46}{space 3}0.000{col 54}{space 4}-.0293399{col 67}{space 3}-.0156756
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} -.052727{col 26}{space 2} .0034095{col 37}{space 1}  -15.46{col 46}{space 3}0.000{col 54}{space 4}-.0594094{col 67}{space 3}-.0460446
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1392262{col 26}{space 2} .0025626{col 37}{space 1}   54.33{col 46}{space 3}0.000{col 54}{space 4} .1342035{col 67}{space 3} .1442489
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1232922{col 26}{space 2} .0024985{col 37}{space 1}   49.35{col 46}{space 3}0.000{col 54}{space 4} .1183952{col 67}{space 3} .1281892
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1247956{col 26}{space 2} .0026511{col 37}{space 1}   47.07{col 46}{space 3}0.000{col 54}{space 4} .1195996{col 67}{space 3} .1299917
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0975505{col 26}{space 2}  .003307{col 37}{space 1}   29.50{col 46}{space 3}0.000{col 54}{space 4} .0910688{col 67}{space 3} .1040322
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0234981{col 26}{space 2} .0013583{col 37}{space 1}   17.30{col 46}{space 3}0.000{col 54}{space 4} .0208358{col 67}{space 3} .0261604
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0177941{col 26}{space 2} .0013589{col 37}{space 1}   13.09{col 46}{space 3}0.000{col 54}{space 4} .0151307{col 67}{space 3} .0204575
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0187227{col 26}{space 2} .0014194{col 37}{space 1}   13.19{col 46}{space 3}0.000{col 54}{space 4} .0159406{col 67}{space 3} .0215047
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0197081{col 26}{space 2} .0014161{col 37}{space 1}   13.92{col 46}{space 3}0.000{col 54}{space 4} .0169327{col 67}{space 3} .0224835
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0114302{col 26}{space 2} .0006132{col 37}{space 1}  -18.64{col 46}{space 3}0.000{col 54}{space 4}-.0126321{col 67}{space 3}-.0102283
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0094258{col 26}{space 2} .0005628{col 37}{space 1}  -16.75{col 46}{space 3}0.000{col 54}{space 4}-.0105288{col 67}{space 3}-.0083229
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0101114{col 26}{space 2} .0005604{col 37}{space 1}  -18.04{col 46}{space 3}0.000{col 54}{space 4}-.0112097{col 67}{space 3}-.0090131
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0091961{col 26}{space 2} .0009293{col 37}{space 1}   -9.90{col 46}{space 3}0.000{col 54}{space 4}-.0110174{col 67}{space 3}-.0073747
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1230807{col 26}{space 2} .0025491{col 37}{space 1}   48.28{col 46}{space 3}0.000{col 54}{space 4} .1180847{col 67}{space 3} .1280768
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1292022{col 26}{space 2} .0025888{col 37}{space 1}   49.91{col 46}{space 3}0.000{col 54}{space 4} .1241283{col 67}{space 3} .1342762
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1260903{col 26}{space 2} .0027244{col 37}{space 1}   46.28{col 46}{space 3}0.000{col 54}{space 4} .1207505{col 67}{space 3} .1314301
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1407992{col 26}{space 2} .0033262{col 37}{space 1}   42.33{col 46}{space 3}0.000{col 54}{space 4} .1342799{col 67}{space 3} .1473186
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .017695{col 26}{space 2} .0017027{col 37}{space 1}   10.39{col 46}{space 3}0.000{col 54}{space 4} .0143577{col 67}{space 3} .0210323
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0179355{col 26}{space 2} .0016588{col 37}{space 1}   10.81{col 46}{space 3}0.000{col 54}{space 4} .0146842{col 67}{space 3} .0211867
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0133193{col 26}{space 2} .0017486{col 37}{space 1}    7.62{col 46}{space 3}0.000{col 54}{space 4}  .009892{col 67}{space 3} .0167466
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0316393{col 26}{space 2} .0013859{col 37}{space 1}   22.83{col 46}{space 3}0.000{col 54}{space 4} .0289229{col 67}{space 3} .0343557
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0103256{col 26}{space 2}   .00069{col 37}{space 1}  -14.96{col 46}{space 3}0.000{col 54}{space 4} -.011678{col 67}{space 3}-.0089731
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0109473{col 26}{space 2}  .000732{col 37}{space 1}  -14.95{col 46}{space 3}0.000{col 54}{space 4}-.0123821{col 67}{space 3}-.0095126
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0093655{col 26}{space 2}  .000736{col 37}{space 1}  -12.72{col 46}{space 3}0.000{col 54}{space 4}-.0108081{col 67}{space 3}-.0079229
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0093319{col 26}{space 2} .0009132{col 37}{space 1}  -10.22{col 46}{space 3}0.000{col 54}{space 4}-.0111217{col 67}{space 3}-.0075421
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7824524{col 26}{space 2}  .028306{col 37}{space 1}   27.64{col 46}{space 3}0.000{col 54}{space 4} .7269735{col 67}{space 3} .8379313
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_4year_og_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41880325 .0834953 .41039578 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0060703269   .6798581285          3402{txt}  {c |}
  2 {c |}  {res}.0063409092   .7075237819          2214{txt}  {c |}
  3 {c |}  {res}.0057211439   .6383855184          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0060703269{txt}  {c |}
  2 {c |}  {res}.0063409092{txt}  {c |}
  3 {c |}  {res}.0063409092{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res} 15823.27
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0305
                                                {txt}Root MSE          =    {res} .41237

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4year_~k{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_4ye~k {c |}{col 14}{res}{space 2} 1.022056{col 26}{space 2} .0081251{col 37}{space 1}  125.79{col 46}{space 3}0.000{col 54}{space 4} 1.006115{col 67}{space 3} 1.037996
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.66e-07{col 26}{space 2} .0002929{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-.0005753{col 67}{space 3} .0005741
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_4year_og_dk.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(45, 431850)   = {res}  3228.45
{txt}       Model {c |} {res} 25263.0701        45  561.401557   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  75095.353   431,850  .173892215   {txt}R-squared       ={res}    0.2517
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2517
{txt}       Total {c |} {res} 100358.423   431,895  .232367643   {txt}Root MSE        =   {res}   .417

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2}-.0116302{col 26}{space 2} .0076073{col 37}{space 1}   -1.53{col 46}{space 3}0.126{col 54}{space 4}-.0265402{col 67}{space 3} .0032799
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2}  .255676{col 26}{space 2} .0072437{col 37}{space 1}   35.30{col 46}{space 3}0.000{col 54}{space 4} .2414786{col 67}{space 3} .2698734
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0158799{col 26}{space 2}  .002528{col 37}{space 1}    6.28{col 46}{space 3}0.000{col 54}{space 4} .0109252{col 67}{space 3} .0208347
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .017699{col 26}{space 2} .0025427{col 37}{space 1}    6.96{col 46}{space 3}0.000{col 54}{space 4} .0127155{col 67}{space 3} .0226826
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.019711{col 26}{space 2} .0025732{col 37}{space 1}   -7.66{col 46}{space 3}0.000{col 54}{space 4}-.0247545{col 67}{space 3}-.0146676
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000766{col 26}{space 2} 4.61e-06{col 37}{space 1}  -16.61{col 46}{space 3}0.000{col 54}{space 4}-.0000856{col 67}{space 3}-.0000676
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0904101{col 26}{space 2} .0012986{col 37}{space 1}  -69.62{col 46}{space 3}0.000{col 54}{space 4}-.0929554{col 67}{space 3}-.0878649
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0698875{col 26}{space 2} .0022927{col 37}{space 1}   30.48{col 46}{space 3}0.000{col 54}{space 4} .0653939{col 67}{space 3} .0743811
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0138281{col 26}{space 2} .0019814{col 37}{space 1}   -6.98{col 46}{space 3}0.000{col 54}{space 4}-.0177117{col 67}{space 3}-.0099446
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0454723{col 26}{space 2} .0037698{col 37}{space 1}   12.06{col 46}{space 3}0.000{col 54}{space 4} .0380836{col 67}{space 3}  .052861
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0099606{col 26}{space 2} .0038768{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-.0175589{col 67}{space 3}-.0023623
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0210022{col 26}{space 2} .0016181{col 37}{space 1}  -12.98{col 46}{space 3}0.000{col 54}{space 4}-.0241736{col 67}{space 3}-.0178309
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0212682{col 26}{space 2} .0034722{col 37}{space 1}   -6.13{col 46}{space 3}0.000{col 54}{space 4}-.0280735{col 67}{space 3}-.0144628
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0560298{col 26}{space 2} .0033993{col 37}{space 1}  -16.48{col 46}{space 3}0.000{col 54}{space 4}-.0626922{col 67}{space 3}-.0493673
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1380937{col 26}{space 2} .0025542{col 37}{space 1}   54.07{col 46}{space 3}0.000{col 54}{space 4} .1330876{col 67}{space 3} .1430998
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1223772{col 26}{space 2} .0024903{col 37}{space 1}   49.14{col 46}{space 3}0.000{col 54}{space 4} .1174963{col 67}{space 3}  .127258
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1216099{col 26}{space 2} .0026432{col 37}{space 1}   46.01{col 46}{space 3}0.000{col 54}{space 4} .1164294{col 67}{space 3} .1267904
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0957382{col 26}{space 2} .0032941{col 37}{space 1}   29.06{col 46}{space 3}0.000{col 54}{space 4} .0892818{col 67}{space 3} .1021945
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .022326{col 26}{space 2} .0013528{col 37}{space 1}   16.50{col 46}{space 3}0.000{col 54}{space 4} .0196746{col 67}{space 3} .0249773
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0166359{col 26}{space 2} .0013533{col 37}{space 1}   12.29{col 46}{space 3}0.000{col 54}{space 4} .0139835{col 67}{space 3} .0192884
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0172284{col 26}{space 2} .0014136{col 37}{space 1}   12.19{col 46}{space 3}0.000{col 54}{space 4} .0144577{col 67}{space 3}  .019999
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0189085{col 26}{space 2} .0014101{col 37}{space 1}   13.41{col 46}{space 3}0.000{col 54}{space 4} .0161447{col 67}{space 3} .0216722
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0113672{col 26}{space 2} .0006106{col 37}{space 1}  -18.62{col 46}{space 3}0.000{col 54}{space 4} -.012564{col 67}{space 3}-.0101704
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0094112{col 26}{space 2} .0005604{col 37}{space 1}  -16.79{col 46}{space 3}0.000{col 54}{space 4}-.0105095{col 67}{space 3}-.0083129
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0098372{col 26}{space 2}  .000558{col 37}{space 1}  -17.63{col 46}{space 3}0.000{col 54}{space 4}-.0109309{col 67}{space 3}-.0087436
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.009326{col 26}{space 2} .0009253{col 37}{space 1}  -10.08{col 46}{space 3}0.000{col 54}{space 4}-.0111395{col 67}{space 3}-.0075124
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1209565{col 26}{space 2} .0025385{col 37}{space 1}   47.65{col 46}{space 3}0.000{col 54}{space 4} .1159811{col 67}{space 3} .1259319
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1272586{col 26}{space 2} .0025779{col 37}{space 1}   49.36{col 46}{space 3}0.000{col 54}{space 4} .1222059{col 67}{space 3} .1323113
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1242447{col 26}{space 2} .0027132{col 37}{space 1}   45.79{col 46}{space 3}0.000{col 54}{space 4}  .118927{col 67}{space 3} .1295624
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1398982{col 26}{space 2} .0033129{col 37}{space 1}   42.23{col 46}{space 3}0.000{col 54}{space 4}  .133405{col 67}{space 3} .1463914
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0159848{col 26}{space 2} .0016959{col 37}{space 1}    9.43{col 46}{space 3}0.000{col 54}{space 4} .0126609{col 67}{space 3} .0193086
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0167455{col 26}{space 2}  .001652{col 37}{space 1}   10.14{col 46}{space 3}0.000{col 54}{space 4} .0135076{col 67}{space 3} .0199834
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0123027{col 26}{space 2} .0017413{col 37}{space 1}    7.07{col 46}{space 3}0.000{col 54}{space 4} .0088898{col 67}{space 3} .0157155
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0298811{col 26}{space 2} .0013804{col 37}{space 1}   21.65{col 46}{space 3}0.000{col 54}{space 4} .0271756{col 67}{space 3} .0325867
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0099502{col 26}{space 2} .0006872{col 37}{space 1}  -14.48{col 46}{space 3}0.000{col 54}{space 4} -.011297{col 67}{space 3}-.0086034
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106963{col 26}{space 2} .0007289{col 37}{space 1}  -14.67{col 46}{space 3}0.000{col 54}{space 4} -.012125{col 67}{space 3}-.0092676
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0092191{col 26}{space 2} .0007329{col 37}{space 1}  -12.58{col 46}{space 3}0.000{col 54}{space 4}-.0106555{col 67}{space 3}-.0077827
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0098703{col 26}{space 2} .0009094{col 37}{space 1}  -10.85{col 46}{space 3}0.000{col 54}{space 4}-.0116527{col 67}{space 3}-.0080879
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2}-.0002583{col 26}{space 2} .0000487{col 37}{space 1}   -5.31{col 46}{space 3}0.000{col 54}{space 4}-.0003537{col 67}{space 3} -.000163
{txt}eth_hispan~t {c |}{col 14}{res}{space 2} .0005783{col 26}{space 2} .0000482{col 37}{space 1}   11.99{col 46}{space 3}0.000{col 54}{space 4} .0004838{col 67}{space 3} .0006729
{txt}eth_black_~t {c |}{col 14}{res}{space 2} .0015658{col 26}{space 2} .0000895{col 37}{space 1}   17.49{col 46}{space 3}0.000{col 54}{space 4} .0013904{col 67}{space 3} .0017413
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2} 1.587936{col 26}{space 2} .1293343{col 37}{space 1}   12.28{col 46}{space 3}0.000{col 54}{space 4} 1.334445{col 67}{space 3} 1.841427
{txt}educ~us_prop {c |}{col 14}{res}{space 2} 2.138172{col 26}{space 2} .1183766{col 37}{space 1}   18.06{col 46}{space 3}0.000{col 54}{space 4} 1.906157{col 67}{space 3} 2.370186
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2} .0007055{col 26}{space 2} .0000737{col 37}{space 1}    9.57{col 46}{space 3}0.000{col 54}{space 4} .0005609{col 67}{space 3}   .00085
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 1.52e-06{col 26}{space 2} 3.38e-08{col 37}{space 1}   44.98{col 46}{space 3}0.000{col 54}{space 4} 1.45e-06{col 67}{space 3} 1.58e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6268768{col 26}{space 2} .0284613{col 37}{space 1}   22.03{col 46}{space 3}0.000{col 54}{space 4} .5710936{col 67}{space 3}   .68266
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_4year_acs_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41700385 .07515675 .41017518 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0048728112   .6412112129          3402{txt}  {c |}
  2 {c |}  {res}.0050467981   .6588990992          2214{txt}  {c |}
  3 {c |}  {res}.0044993455   .5864622833          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0048728112{txt}  {c |}
  2 {c |}  {res}.0050467981{txt}  {c |}
  3 {c |}  {res}.0050467981{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res} 10604.12
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0237
                                                {txt}Root MSE          =    {res} .41202

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4ye~s_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~s_dk {c |}{col 14}{res}{space 2} 1.025803{col 26}{space 2} .0099615{col 37}{space 1}  102.98{col 46}{space 3}0.000{col 54}{space 4}  1.00626{col 67}{space 3} 1.045347
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0001585{col 26}{space 2} .0003049{col 37}{space 1}    0.52{col 46}{space 3}0.603{col 54}{space 4}-.0004396{col 67}{space 3} .0007566
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_4year_acs_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}   148.79
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0783
                                                {txt}Root MSE          =    {res} .03727

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr~g_acs_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~g_dk {c |}{col 14}{res}{space 2} .1518941{col 26}{space 2} .0124526{col 37}{space 1}   12.20{col 46}{space 3}0.000{col 54}{space 4} .1274635{col 67}{space 3} .1763247
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.96e-06{col 26}{space 2} .0008325{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-.0016361{col 67}{space 3} .0016302
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_4year_acs_og_dk.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(40, 431855)   = {res}  3627.27
{txt}       Model {c |} {res} 25238.2315        40  630.955786   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 75120.1916   431,855  .173947718   {txt}R-squared       ={res}    0.2515
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2514
{txt}       Total {c |} {res} 100358.423   431,895  .232367643   {txt}Root MSE        =   {res} .41707

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2}-.0623671{col 26}{space 2} .0075202{col 37}{space 1}   -8.29{col 46}{space 3}0.000{col 54}{space 4}-.0771065{col 67}{space 3}-.0476276
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2} .3307984{col 26}{space 2} .0070357{col 37}{space 1}   47.02{col 46}{space 3}0.000{col 54}{space 4} .3170087{col 67}{space 3} .3445881
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0175629{col 26}{space 2} .0025269{col 37}{space 1}    6.95{col 46}{space 3}0.000{col 54}{space 4} .0126101{col 67}{space 3} .0225156
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0194342{col 26}{space 2} .0025371{col 37}{space 1}    7.66{col 46}{space 3}0.000{col 54}{space 4} .0144617{col 67}{space 3} .0244068
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0181107{col 26}{space 2} .0025619{col 37}{space 1}   -7.07{col 46}{space 3}0.000{col 54}{space 4} -.023132{col 67}{space 3}-.0130895
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000698{col 26}{space 2} 4.60e-06{col 37}{space 1}  -15.17{col 46}{space 3}0.000{col 54}{space 4}-.0000788{col 67}{space 3}-.0000608
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0905556{col 26}{space 2} .0012986{col 37}{space 1}  -69.73{col 46}{space 3}0.000{col 54}{space 4}-.0931008{col 67}{space 3}-.0880104
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0607075{col 26}{space 2} .0020327{col 37}{space 1}   29.86{col 46}{space 3}0.000{col 54}{space 4} .0567234{col 67}{space 3} .0646916
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0183002{col 26}{space 2} .0017851{col 37}{space 1}  -10.25{col 46}{space 3}0.000{col 54}{space 4}-.0217989{col 67}{space 3}-.0148015
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0483123{col 26}{space 2} .0035941{col 37}{space 1}   13.44{col 46}{space 3}0.000{col 54}{space 4}  .041268{col 67}{space 3} .0553565
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0129669{col 26}{space 2} .0038628{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-.0205378{col 67}{space 3} -.005396
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0360929{col 26}{space 2} .0015155{col 37}{space 1}  -23.82{col 46}{space 3}0.000{col 54}{space 4}-.0390633{col 67}{space 3}-.0331225
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0218456{col 26}{space 2} .0034714{col 37}{space 1}   -6.29{col 46}{space 3}0.000{col 54}{space 4}-.0286495{col 67}{space 3}-.0150417
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0521565{col 26}{space 2} .0033955{col 37}{space 1}  -15.36{col 46}{space 3}0.000{col 54}{space 4}-.0588115{col 67}{space 3}-.0455014
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1378044{col 26}{space 2} .0025522{col 37}{space 1}   53.99{col 46}{space 3}0.000{col 54}{space 4} .1328022{col 67}{space 3} .1428066
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1219878{col 26}{space 2} .0024884{col 37}{space 1}   49.02{col 46}{space 3}0.000{col 54}{space 4} .1171107{col 67}{space 3} .1268649
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1230268{col 26}{space 2} .0026405{col 37}{space 1}   46.59{col 46}{space 3}0.000{col 54}{space 4} .1178515{col 67}{space 3} .1282021
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0956287{col 26}{space 2} .0032935{col 37}{space 1}   29.04{col 46}{space 3}0.000{col 54}{space 4} .0891735{col 67}{space 3} .1020839
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0232596{col 26}{space 2} .0013527{col 37}{space 1}   17.19{col 46}{space 3}0.000{col 54}{space 4} .0206083{col 67}{space 3}  .025911
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .017575{col 26}{space 2} .0013533{col 37}{space 1}   12.99{col 46}{space 3}0.000{col 54}{space 4} .0149226{col 67}{space 3} .0202275
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0186997{col 26}{space 2} .0014136{col 37}{space 1}   13.23{col 46}{space 3}0.000{col 54}{space 4} .0159291{col 67}{space 3} .0214704
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0195222{col 26}{space 2} .0014102{col 37}{space 1}   13.84{col 46}{space 3}0.000{col 54}{space 4} .0167583{col 67}{space 3} .0222862
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0112323{col 26}{space 2} .0006107{col 37}{space 1}  -18.39{col 46}{space 3}0.000{col 54}{space 4}-.0124292{col 67}{space 3}-.0100353
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0092832{col 26}{space 2} .0005604{col 37}{space 1}  -16.56{col 46}{space 3}0.000{col 54}{space 4}-.0103816{col 67}{space 3}-.0081847
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0099506{col 26}{space 2} .0005581{col 37}{space 1}  -17.83{col 46}{space 3}0.000{col 54}{space 4}-.0110443{col 67}{space 3}-.0088568
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0088797{col 26}{space 2} .0009254{col 37}{space 1}   -9.60{col 46}{space 3}0.000{col 54}{space 4}-.0106935{col 67}{space 3}-.0070658
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1212676{col 26}{space 2} .0025387{col 37}{space 1}   47.77{col 46}{space 3}0.000{col 54}{space 4} .1162917{col 67}{space 3} .1262434
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1266825{col 26}{space 2} .0025785{col 37}{space 1}   49.13{col 46}{space 3}0.000{col 54}{space 4} .1216287{col 67}{space 3} .1317362
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1237734{col 26}{space 2} .0027135{col 37}{space 1}   45.61{col 46}{space 3}0.000{col 54}{space 4}  .118455{col 67}{space 3} .1290917
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1376166{col 26}{space 2} .0033129{col 37}{space 1}   41.54{col 46}{space 3}0.000{col 54}{space 4} .1311234{col 67}{space 3} .1441098
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0176136{col 26}{space 2} .0016957{col 37}{space 1}   10.39{col 46}{space 3}0.000{col 54}{space 4} .0142901{col 67}{space 3} .0209372
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0177213{col 26}{space 2}  .001652{col 37}{space 1}   10.73{col 46}{space 3}0.000{col 54}{space 4} .0144835{col 67}{space 3} .0209591
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0131172{col 26}{space 2} .0017414{col 37}{space 1}    7.53{col 46}{space 3}0.000{col 54}{space 4} .0097041{col 67}{space 3} .0165303
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0311807{col 26}{space 2} .0013803{col 37}{space 1}   22.59{col 46}{space 3}0.000{col 54}{space 4} .0284753{col 67}{space 3} .0338861
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0101953{col 26}{space 2} .0006872{col 37}{space 1}  -14.84{col 46}{space 3}0.000{col 54}{space 4}-.0115422{col 67}{space 3}-.0088484
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106794{col 26}{space 2}  .000729{col 37}{space 1}  -14.65{col 46}{space 3}0.000{col 54}{space 4}-.0121083{col 67}{space 3}-.0092506
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0091658{col 26}{space 2}  .000733{col 37}{space 1}  -12.50{col 46}{space 3}0.000{col 54}{space 4}-.0106025{col 67}{space 3}-.0077292
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0089524{col 26}{space 2} .0009094{col 37}{space 1}   -9.84{col 46}{space 3}0.000{col 54}{space 4}-.0107348{col 67}{space 3}  -.00717
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} -.079621{col 26}{space 2} .0025059{col 37}{space 1}  -31.77{col 46}{space 3}0.000{col 54}{space 4}-.0845324{col 67}{space 3}-.0747096
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .1426993{col 26}{space 2} .0027055{col 37}{space 1}   52.74{col 46}{space 3}0.000{col 54}{space 4} .1373966{col 67}{space 3}  .148002
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7699755{col 26}{space 2} .0281998{col 37}{space 1}   27.30{col 46}{space 3}0.000{col 54}{space 4} .7147048{col 67}{space 3} .8252461
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_4year_sib_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.4170704 .08148155 .40903359 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .005773281   .6718272678          3402{txt}  {c |}
  2 {c |}  {res}.0060108416   .6975234593          2214{txt}  {c |}
  3 {c |}  {res}.0053928443   .6268917245          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .005773281{txt}  {c |}
  2 {c |}  {res}.0060108416{txt}  {c |}
  3 {c |}  {res}.0060108416{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res} 14827.31
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0289
                                                {txt}Root MSE          =    {res} .41098

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4ye~b_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~b_dk {c |}{col 14}{res}{space 2} 1.023097{col 26}{space 2} .0084021{col 37}{space 1}  121.77{col 46}{space 3}0.000{col 54}{space 4} 1.006613{col 67}{space 3} 1.039581
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0000246{col 26}{space 2} .0002937{col 37}{space 1}    0.08{col 46}{space 3}0.933{col 54}{space 4}-.0005517{col 67}{space 3} .0006009
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_4year_sib_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}   478.24
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0026
                                                {txt}Root MSE          =    {res} .03802

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr~g_sib_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~g_dk {c |}{col 14}{res}{space 2} .0273841{col 26}{space 2} .0012522{col 37}{space 1}   21.87{col 46}{space 3}0.000{col 54}{space 4} .0249275{col 67}{space 3} .0298408
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.44e-06{col 26}{space 2} .0000855{col 37}{space 1}   -0.02{col 46}{space 3}0.987{col 54}{space 4}-.0001693{col 67}{space 3} .0001664
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_4year_sib_og_dk.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   431,896
{txt}{hline 13}{c +}{hline 34}   F(47, 431848)   = {res}  3188.33
{txt}       Model {c |} {res} 25853.2984        47  550.070178   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 74505.1247   431,848   .17252627   {txt}R-squared       ={res}    0.2576
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2575
{txt}       Total {c |} {res} 100358.423   431,895  .232367643   {txt}Root MSE        =   {res} .41536

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2}-.0127733{col 26}{space 2} .0075779{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-.0276258{col 67}{space 3} .0020791
{txt}{space 2}va_math_og {c |}{col 14}{res}{space 2} .2523441{col 26}{space 2}  .007216{col 37}{space 1}   34.97{col 46}{space 3}0.000{col 54}{space 4} .2382009{col 67}{space 3} .2664873
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0156861{col 26}{space 2} .0025182{col 37}{space 1}    6.23{col 46}{space 3}0.000{col 54}{space 4} .0107505{col 67}{space 3} .0206216
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0171014{col 26}{space 2} .0025333{col 37}{space 1}    6.75{col 46}{space 3}0.000{col 54}{space 4} .0121361{col 67}{space 3} .0220667
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0197278{col 26}{space 2} .0025648{col 37}{space 1}   -7.69{col 46}{space 3}0.000{col 54}{space 4}-.0247548{col 67}{space 3}-.0147009
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000749{col 26}{space 2} 4.59e-06{col 37}{space 1}  -16.30{col 46}{space 3}0.000{col 54}{space 4}-.0000839{col 67}{space 3}-.0000659
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0906169{col 26}{space 2} .0012935{col 37}{space 1}  -70.05{col 46}{space 3}0.000{col 54}{space 4}-.0931522{col 67}{space 3}-.0880816
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0684005{col 26}{space 2} .0022845{col 37}{space 1}   29.94{col 46}{space 3}0.000{col 54}{space 4} .0639229{col 67}{space 3} .0728781
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0117627{col 26}{space 2}  .001974{col 37}{space 1}   -5.96{col 46}{space 3}0.000{col 54}{space 4}-.0156317{col 67}{space 3}-.0078937
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0455697{col 26}{space 2}  .003755{col 37}{space 1}   12.14{col 46}{space 3}0.000{col 54}{space 4} .0382101{col 67}{space 3} .0529294
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0089291{col 26}{space 2} .0038616{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.0164976{col 67}{space 3}-.0013605
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0211185{col 26}{space 2} .0016119{col 37}{space 1}  -13.10{col 46}{space 3}0.000{col 54}{space 4}-.0242778{col 67}{space 3}-.0179593
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0206812{col 26}{space 2} .0034585{col 37}{space 1}   -5.98{col 46}{space 3}0.000{col 54}{space 4}-.0274598{col 67}{space 3}-.0139025
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0554705{col 26}{space 2}  .003386{col 37}{space 1}  -16.38{col 46}{space 3}0.000{col 54}{space 4} -.062107{col 67}{space 3} -.048834
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1366922{col 26}{space 2} .0025443{col 37}{space 1}   53.73{col 46}{space 3}0.000{col 54}{space 4} .1317055{col 67}{space 3} .1416789
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1210945{col 26}{space 2} .0024806{col 37}{space 1}   48.82{col 46}{space 3}0.000{col 54}{space 4} .1162325{col 67}{space 3} .1259565
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1199275{col 26}{space 2} .0026331{col 37}{space 1}   45.55{col 46}{space 3}0.000{col 54}{space 4} .1147667{col 67}{space 3} .1250884
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0938942{col 26}{space 2} .0032813{col 37}{space 1}   28.61{col 46}{space 3}0.000{col 54}{space 4} .0874629{col 67}{space 3} .1003255
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0221281{col 26}{space 2} .0013474{col 37}{space 1}   16.42{col 46}{space 3}0.000{col 54}{space 4} .0194872{col 67}{space 3} .0247691
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0164573{col 26}{space 2}  .001348{col 37}{space 1}   12.21{col 46}{space 3}0.000{col 54}{space 4} .0138152{col 67}{space 3} .0190994
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0172513{col 26}{space 2} .0014081{col 37}{space 1}   12.25{col 46}{space 3}0.000{col 54}{space 4} .0144915{col 67}{space 3} .0200112
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0187572{col 26}{space 2} .0014046{col 37}{space 1}   13.35{col 46}{space 3}0.000{col 54}{space 4} .0160043{col 67}{space 3} .0215101
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0111754{col 26}{space 2} .0006082{col 37}{space 1}  -18.37{col 46}{space 3}0.000{col 54}{space 4}-.0123675{col 67}{space 3}-.0099833
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0092734{col 26}{space 2} .0005582{col 37}{space 1}  -16.61{col 46}{space 3}0.000{col 54}{space 4}-.0103673{col 67}{space 3}-.0081794
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.009688{col 26}{space 2} .0005558{col 37}{space 1}  -17.43{col 46}{space 3}0.000{col 54}{space 4}-.0107774{col 67}{space 3}-.0085987
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0090137{col 26}{space 2} .0009217{col 37}{space 1}   -9.78{col 46}{space 3}0.000{col 54}{space 4}-.0108202{col 67}{space 3}-.0072073
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1192444{col 26}{space 2} .0025287{col 37}{space 1}   47.16{col 46}{space 3}0.000{col 54}{space 4} .1142881{col 67}{space 3} .1242006
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1248501{col 26}{space 2} .0025682{col 37}{space 1}   48.61{col 46}{space 3}0.000{col 54}{space 4} .1198164{col 67}{space 3} .1298837
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1220402{col 26}{space 2} .0027028{col 37}{space 1}   45.15{col 46}{space 3}0.000{col 54}{space 4} .1167428{col 67}{space 3} .1273376
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1367984{col 26}{space 2} .0033003{col 37}{space 1}   41.45{col 46}{space 3}0.000{col 54}{space 4} .1303299{col 67}{space 3} .1432669
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0159578{col 26}{space 2} .0016892{col 37}{space 1}    9.45{col 46}{space 3}0.000{col 54}{space 4}  .012647{col 67}{space 3} .0192686
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0165738{col 26}{space 2} .0016455{col 37}{space 1}   10.07{col 46}{space 3}0.000{col 54}{space 4} .0133487{col 67}{space 3}  .019799
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0121335{col 26}{space 2} .0017344{col 37}{space 1}    7.00{col 46}{space 3}0.000{col 54}{space 4}  .008734{col 67}{space 3} .0155329
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0294757{col 26}{space 2} .0013751{col 37}{space 1}   21.44{col 46}{space 3}0.000{col 54}{space 4} .0267806{col 67}{space 3} .0321708
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0098371{col 26}{space 2} .0006845{col 37}{space 1}  -14.37{col 46}{space 3}0.000{col 54}{space 4}-.0111786{col 67}{space 3}-.0084956
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0104439{col 26}{space 2} .0007261{col 37}{space 1}  -14.38{col 46}{space 3}0.000{col 54}{space 4} -.011867{col 67}{space 3}-.0090208
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0090303{col 26}{space 2}   .00073{col 37}{space 1}  -12.37{col 46}{space 3}0.000{col 54}{space 4}-.0104611{col 67}{space 3}-.0075995
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0094898{col 26}{space 2} .0009058{col 37}{space 1}  -10.48{col 46}{space 3}0.000{col 54}{space 4}-.0112652{col 67}{space 3}-.0077143
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0769452{col 26}{space 2} .0024962{col 37}{space 1}  -30.82{col 46}{space 3}0.000{col 54}{space 4}-.0818377{col 67}{space 3}-.0720526
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .1388946{col 26}{space 2} .0026956{col 37}{space 1}   51.53{col 46}{space 3}0.000{col 54}{space 4} .1336113{col 67}{space 3}  .144178
{txt}eth_asian_~t {c |}{col 14}{res}{space 2}-.0002312{col 26}{space 2} .0000485{col 37}{space 1}   -4.77{col 46}{space 3}0.000{col 54}{space 4}-.0003262{col 67}{space 3}-.0001362
{txt}eth_hispan~t {c |}{col 14}{res}{space 2} .0005567{col 26}{space 2} .0000481{col 37}{space 1}   11.58{col 46}{space 3}0.000{col 54}{space 4} .0004625{col 67}{space 3} .0006509
{txt}eth_black_~t {c |}{col 14}{res}{space 2} .0015178{col 26}{space 2} .0000892{col 37}{space 1}   17.02{col 46}{space 3}0.000{col 54}{space 4}  .001343{col 67}{space 3} .0016926
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2} 1.537572{col 26}{space 2} .1288297{col 37}{space 1}   11.93{col 46}{space 3}0.000{col 54}{space 4} 1.285069{col 67}{space 3} 1.790074
{txt}educ~us_prop {c |}{col 14}{res}{space 2}  2.12011{col 26}{space 2} .1179318{col 37}{space 1}   17.98{col 46}{space 3}0.000{col 54}{space 4} 1.888967{col 67}{space 3} 2.351253
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2} .0006819{col 26}{space 2} .0000734{col 37}{space 1}    9.28{col 46}{space 3}0.000{col 54}{space 4} .0005379{col 67}{space 3} .0008259
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 1.47e-06{col 26}{space 2} 3.36e-08{col 37}{space 1}   43.68{col 46}{space 3}0.000{col 54}{space 4} 1.40e-06{col 67}{space 3} 1.54e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6190008{col 26}{space 2} .0283597{col 37}{space 1}   21.83{col 46}{space 3}0.000{col 54}{space 4} .5634167{col 67}{space 3} .6745849
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/vam_enr_4year_both_dk.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41536282 .07340161 .40882573 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0046409262   .6327726104          3402{txt}  {c |}
  2 {c |}  {res}.0047877063   .6482615886          2214{txt}  {c |}
  3 {c |}  {res}.0042442199   .5746147104          1061{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0046409262{txt}  {c |}
  2 {c |}  {res}.0047877063{txt}  {c |}
  3 {c |}  {res}.0047877063{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}note: label truncated to 80 characters

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}  9832.94
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0225
                                                {txt}Root MSE          =    {res} .41065

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}enr_4ye~h_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~h_dk {c |}{col 14}{res}{space 2} 1.026844{col 26}{space 2} .0103553{col 37}{space 1}   99.16{col 46}{space 3}0.000{col 54}{space 4} 1.006528{col 67}{space 3}  1.04716
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0001899{col 26}{space 2} .0003065{col 37}{space 1}    0.62{col 46}{space 3}0.536{col 54}{space 4}-.0004114{col 67}{space 3} .0007912
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/spec_test_enr_4year_both_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}   371.16
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0021
                                                {txt}Root MSE          =    {res} .03693

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}en~s_both_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~s_dk {c |}{col 14}{res}{space 2} .0271233{col 26}{space 2} .0014079{col 37}{space 1}   19.27{col 46}{space 3}0.000{col 54}{space 4} .0243612{col 67}{space 3} .0298854
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.78e-06{col 26}{space 2} .0000814{col 37}{space 1}    0.03{col 46}{space 3}0.973{col 54}{space 4}-.0001569{col 67}{space 3} .0001625
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_4year_sib_acs_dk.ster} saved

Linear regression                               Number of obs     = {res}   431,838
                                                {txt}F(1, 1236)        =  {res}   147.73
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0776
                                                {txt}Root MSE          =    {res} .03625

{txt}{ralign 78:(Std. err. adjusted for {res:1,237} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}en~b_both_dk{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_enr_~b_dk {c |}{col 14}{res}{space 2} .1515413{col 26}{space 2} .0124679{col 37}{space 1}   12.15{col 46}{space 3}0.000{col 54}{space 4} .1270807{col 67}{space 3} .1760019
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.52e-07{col 26}{space 2} .0008083{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.0015851{col 67}{space 3} .0015864
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/outcome_va/fb_test_enr_4year_acs_sib_dk.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/outcome_va/va_enr_4year_sib_acs_dk.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:     87.08 /        1 =      87.0790
{txt}
{com}. 
. set trace off
{txt}
{com}. 
. //change directory back to my own personal directory
. cd $projdir 
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs_out_dk.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Jul 2022, 22:18:05
{txt}{.-}
{smcl}
{txt}{sf}{ul off}