-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling_out_est_sumstats.smcl
  log type:  smcl
 opened on:   3 May 2022, 22:32:37

. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. #delimit ;
delimiter now ;
. #delimit cr
delimiter now cr
. macro list
T_gm_fix_span:  0
S_4:            .003900032715465
S_2:            300
S_3:            .020595561559967
S_1:            epanechnikov
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. 
. timer on 1

. 
. 
. //this does not include the code necessary for deep knowledge sum stats
. foreach outcome in enr enr_2year enr_4year {
  2.   use $projdir/dta/common_core_va/outcome_va/va_g11_`outcome'_sibling.dta,
>  clear
  3.   sort school_id year
  4.         xtset school_id year
  5. 
. 
.   * Normalize to have mean zero
.   foreach v of varlist va_* {
  6.     sum `v', meanonly
  7.     replace `v' = `v' - r(mean)
  8.   }
  9.   sum va_cfr_g11_`outcome'
 10.   local mean_`outcome' = 0
 11.   local sd_`outcome' : di %4.3f = r(sd)
 12. /*
>   sum va_cfr_g11_`outcome'_peer
>   local mean_`outcome'_peer = 0
>   local sd_`outcome'_peer : di %4.3f = r(sd)
>  */
. 
. 
.   tempfile va_`outcome'
 13.   save `va_`outcome''
 14. }
(Enrollment Outcome Grade 11 VA Sample)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2018, but with gaps
         Delta: 1 year
(4,869 real changes made)
(4,869 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~r |      4,869    3.60e-10    .0774787  -.3547636   .2218038
file /home/tmp/St16505.000001 saved as .dta format
(Enrollment Outcome Grade 11 VA Sample)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2018, but with gaps
         Delta: 1 year
(4,869 real changes made)
(4,869 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~r |      4,869    4.59e-10    .0911288  -.2611847   .3558423
file /home/tmp/St16505.000002 saved as .dta format
(Enrollment Outcome Grade 11 VA Sample)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2018, but with gaps
         Delta: 1 year
(4,869 real changes made)
(4,869 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~r |      4,869   -9.38e-10    .0908704  -.2317269    .378627
file /home/tmp/St16505.000003 saved as .dta format

. 
. 
. use `va_enr'
(Enrollment Outcome Grade 11 VA Sample)

. merge 1:1 cdscode year using `va_enr_2year', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             4,966  
    -----------------------------------------

. merge 1:1 cdscode year using `va_enr_4year', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             4,966  
    -----------------------------------------

. 
. 
. tempfile va_enr_merged_sibling

. save `va_enr_merged_sibling'
file /home/tmp/St16505.000004 saved as .dta format

. 
. 
. *************** two way scatter plot of VA with and without sibling controls
. 
. foreach outcome in enr enr_2year enr_4year {
  2.   //get correlation of VA estimates with and without sibling controls and 
> store in macro
.   corr va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl
  3.   local corr_coef_`outcome'_sibling : di %5.3f r(rho)
  4. 
.   twoway ///
>   (scatter va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl) ///
>   (lfit va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl) ///
>   (function y = x), ///
>   ytitle("``outcome'_str' VA with Sibling Control") ///
>   xtitle("``outcome'_str' VA without Sibling Control") ///
>   title("Scatter Plot of ``outcome'_str' VA with and without Sibling Control"
> ) ///
>   legend(label(1 "``outcome'_str' VA") label(3 "45 degree line") ) ///
>   note("Correlation Coefficient = `corr_coef_`outcome'_sibling' ")
  5. 
.   graph export $projdir/out/graph/siblingvaregs/outcome_va/scatter_va_cfr_g11
> _`outcome'_sibling.pdf, replace
  6. 
. 
. }
(obs=4,869)

             | va_cf~nr va_cfr..
-------------+------------------
va_cfr_g1~nr |   1.0000
va_cfr_g11.. |   0.9998   1.0000

file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /outcome_va/scatter_va_cfr_g11_enr_sibling.pdf saved as PDF format
(obs=4,869)

             | va~2year va_cfr..
-------------+------------------
va_cfr~2year |   1.0000
va_cfr_g11.. |   0.9997   1.0000

file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /outcome_va/scatter_va_cfr_g11_enr_2year_sibling.pdf saved as PDF
    format
(obs=4,869)

             | va~4year va_cfr..
-------------+------------------
va_cfr~4year |   1.0000
va_cfr_g11.. |   0.9996   1.0000

file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /outcome_va/scatter_va_cfr_g11_enr_4year_sibling.pdf saved as PDF
    format

. 
. 
. 
. 
. 
. *************** correlation with original VA estimates
. //load orignal VA dataset and merge the different outcomes
. foreach outcome in enr enr_2year enr_4year {
  2.         use data/sbac/va_g11_`outcome'.dta, clear
  3.         sort school_id year
  4. 
.         tempfile va_`outcome'_original
  5.         save `va_`outcome'_original'
  6. }
(CST/SBAC Student Test Score Samples)
file /home/tmp/St16505.000005 saved as .dta format
(CST/SBAC Student Test Score Samples)
file /home/tmp/St16505.000006 saved as .dta format
(CST/SBAC Student Test Score Samples)
file /home/tmp/St16505.000007 saved as .dta format

. 
. 
. use `va_enr_original', clear
(CST/SBAC Student Test Score Samples)

. merge 1:1 cdscode year using `va_enr_2year_original', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             4,993  
    -----------------------------------------

. merge 1:1 cdscode year using `va_enr_4year_original', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             4,993  
    -----------------------------------------

. 
. keep cdscode year va_cfr_g11_*

. //drop the peer and subject VA's to avoid too long var name causing trouble
. drop va*peer va*ela va*math

. rename va* va*_original

. 
. //merge on the VA estimates with sibling controls
. merge 1:1 cdscode year using `va_enr_merged_sibling', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                            27
        from master                        27  
        from using                          0  

    Matched                             4,966  
    -----------------------------------------

. 
. //two way scatter plot of VA with sibling control and original VA
. foreach outcome in enr enr_2year enr_4year {
  2.   //get correlation of VA estimates with and without sibling controls and 
> store in macro
.   corr va_cfr_g11_`outcome' va_cfr_g11_`outcome'_original
  3.   local corr_coef_`outcome'_original : di %5.3f r(rho)
  4. 
.   twoway ///
>   (scatter va_cfr_g11_`outcome' va_cfr_g11_`outcome'_original) ///
>   (lfit va_cfr_g11_`outcome' va_cfr_g11_`outcome'_original) ///
>   (function y = x), ///
>   ytitle("``outcome'_str' VA with Sibling Control") ///
>   xtitle("Original ``outcome'_str' VA") ///
>   title("Scatter Plot of ``outcome'_str' VA and Original") ///
>   legend(label(1 "``outcome'_str' VA") label(3 "45 degree line") ) ///
>   note("Correlation Coefficient = `corr_coef_`outcome'_original' ")
  5. 
.   graph export $projdir/out/graph/siblingvaregs/outcome_va/scatter_va_cfr_g11
> _`outcome'_original.pdf, replace
  6. 
. }
(obs=4,869)

             | va_cf~nr va_cfr..
-------------+------------------
va_cfr_g1~nr |   1.0000
~nr_original |   0.9422   1.0000

file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /outcome_va/scatter_va_cfr_g11_enr_original.pdf saved as PDF format
(obs=4,869)

             | va~2year va_cfr..
-------------+------------------
va_cfr~2year |   1.0000
va_cfr_g11.. |   0.9508   1.0000

file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /outcome_va/scatter_va_cfr_g11_enr_2year_original.pdf saved as PDF
    format
(obs=4,869)

             | va~4year va_cfr..
-------------+------------------
va_cfr~4year |   1.0000
va_cfr_g11.. |   0.9589   1.0000

file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /outcome_va/scatter_va_cfr_g11_enr_4year_original.pdf saved as PDF
    format

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. **************** Kernel Density
. ******** Overall Value Added
. **** No Peer Controls
. twoway ///
>         (kdensity va_cfr_g11_enr) ///
>         (kdensity va_cfr_g11_enr_2year) ///
>         (kdensity va_cfr_g11_enr_4year) ///
>         , ytitle("Density") xtitle("Value Added") ///
>   title("Postsecondary Overall Value Added with Sibling Controls") ///
>         legend(label(1 "Enroll Any") label(2 "Enroll 2-Year") label(3 "Enroll
>  4-Year")) ///
>         note("Enroll Any Mean (Standard Deviation) = `mean_enr' (`sd_enr')" /
> //
>         "Enroll 2-Year Mean (Standard Deviation) = `mean_enr_2year' (`sd_enr_
> 2year')" ///
>         "Enroll 4-Year Mean (Standard Deviation) = `mean_enr_4year' (`sd_enr_
> 4year')")

.   graph export $projdir/out/graph/siblingvaregs/outcome_va/kdensity_va_cfr_g1
> 1_enrollment_sibling.pdf, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /outcome_va/kdensity_va_cfr_g11_enrollment_sibling.pdf saved as PDF
    format

. 
. 
. /*
>   **** Peer Controls
>   twoway ///
>         (kdensity va_cfr_g11_enr_peer) ///
>         (kdensity va_cfr_g11_enr_2year_peer) ///
>         (kdensity va_cfr_g11_enr_4year_peer) ///
>         , ytitle("Density") xtitle("Value Added") ///
>     title("Postsecondary Overall Value Added with Sibling Controls") ///
>         legend(label(1 "Enroll Any") label(2 "Enroll 2-Year") label(3 "Enroll
>  4-Year")) ///
>         note("Enroll Any Mean (Standard Deviation) = `mean_enr_peer' (`sd_enr
> _peer')" ///
>         "Enroll 2-Year Mean (Standard Deviation) = `mean_enr_2year_peer' (`sd
> _enr_2year_peer')" ///
>         "Enroll 4-Year Mean (Standard Deviation) = `mean_enr_4year_peer' (`sd
> _enr_4year_peer')")
>     graph export $projdir/out/graph/siblingvaregs/outcome_va/kdensity_va_cfr_
> g11_enrollment_peer_sibling.pdf, replace
> 
>  */
. 
. //note: skipped the kdensity plots for each individual outcome VA
. 
. 
. 
. 
. 
. foreach outcome in enr enr_2year enr_4year {
  2.   ******** Specification Test
.   **** No Peer Controls
.   estimates use $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`o
> utcome'_sibling.ster
  3.   eststo spec_g11_`outcome'
  4.   test _b[va_cfr_g11_`outcome'] = 1
  5.   matrix test_p = r(p)
  6.   matrix rownames test_p = pvalue
  7.   matrix colnames test_p = va_cfr_g11_`outcome'
  8.   estadd matrix test_p = test_p
  9. 
.   local slope : di %5.3f _b[va_cfr_g11_`outcome']
 10.   local std_err : di %4.3f _se[va_cfr_g11_`outcome']
 11.   binscatter g11_`outcome'_r va_cfr_g11_`outcome' ///
>     [aw = n_g11_`outcome'] ///
>     , ytitle("``outcome'_str'") xtitle("Value Added") ///
>     title("``outcome'_str' Specification Test") ///
>     yline(0) xline(0) ///
>     yscale(range(-.3 .3)) xscale(range(-.3 .3)) ylabel(-.3 (0.1) .3) xlabel(-
> .3 (0.1) .3) ///
>     note("Slope (Standard Error) = `slope' (`std_err')")
 12.   graph export $projdir/out/graph/siblingvaregs/outcome_va/spec_test_va_cf
> r_g11_`outcome'_sibling.pdf, replace
 13. 
. /* 
>   **** Peer Controls
>   estimates use $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`o
> utcome'_peer_sibling.ster
>   eststo spec_g11_`outcome'_peer
>   test _b[va_cfr_g11_`outcome'_peer] = 1
>   matrix test_p = r(p)
>   matrix rownames test_p = pvalue
>   matrix colnames test_p = va_cfr_g11_`outcome'_peer
>   estadd matrix test_p = test_p
> 
>   local slope : di %5.3f _b[va_cfr_g11_`outcome'_peer]
>   local std_err : di %4.3f _se[va_cfr_g11_`outcome'_peer]
>   binscatter g11_`outcome'_r_peer va_cfr_g11_`outcome'_peer ///
>     [aw = n_g11_`outcome'] ///
>     , ytitle("``outcome'_str'") xtitle("Value Added") title("``outcome'_str' 
> Specification Test") ///
>     yline(0) xline(0) ///
>     yscale(range(-.3 .3)) xscale(range(-.3 .3)) ylabel(-.3 (0.1) .3) xlabel(-
> .3 (0.1) .3) ///
>     note("Slope (Standard Error) = `slope' (`std_err')")
>   graph export $projdir/out/graph/siblingvaregs/outcome_va/spec_test_va_cfr_g
> 11_`outcome'_peer_sibling.pdf, replace
>  */
. 
. }

 ( 1)  va_cfr_g11_enr = 1

       F(  1,  1277) =   23.15
            Prob > F =    0.0000

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /outcome_va/spec_test_va_cfr_g11_enr_sibling.pdf saved as PDF format

 ( 1)  va_cfr_g11_enr_2year = 1

       F(  1,  1277) =    0.58
            Prob > F =    0.4459

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /outcome_va/spec_test_va_cfr_g11_enr_2year_sibling.pdf saved as PDF
    format

 ( 1)  va_cfr_g11_enr_4year = 1

       F(  1,  1277) =    9.53
            Prob > F =    0.0021

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /outcome_va/spec_test_va_cfr_g11_enr_4year_sibling.pdf saved as PDF
    format

. 
. 
. 
. 
. cd $projdir
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. 
. 
. 
. timer off 1

. timer list
   1:      4.64 /        1 =       4.6360

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sibling_out_est_sumstats.smcl
  log type:  smcl
 closed on:   3 May 2022, 22:32:41
-------------------------------------------------------------------------------
