{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling_est_sumstats.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Nov 2021, 21:06:23
{txt}
{com}. 
. //include macros
. include do_files/sbac/macros_va.doh
{txt}
{com}. #delimit ;
{txt}delimiter now ;
{com}. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2019
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. #delimit ;
{txt}delimiter now ;
{com}. #delimit cr
{txt}delimiter now cr
{com}. macro list
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.0033960539142934
{p_end}
{txt}{p 0 16}
S_2:{space 12}{res}{res}300
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.0156449653054182
{p_end}
{txt}{p 0 16}
S_1:{space 12}{res}{res}epanechnikov
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/msnaven/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/msnaven/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/msnaven/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/msnaven/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_ca_ed_lab:{space 5}{res}{res}/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_common_core_va:{break}
{res}/home/research/ca_ed_lab/msnaven/common_core_va
{p_end}
{txt}{p 0 16}
_mattdofiles:{space 3}{res}{res}/home/research/ca_ed_lab/msnaven/common_core_va/do_files/sbac
{p_end}
{txt}{p 0 16}
_matthomedir:{space 3}{res}{res}/home/research/ca_ed_lab/msnaven/common_core_va
{p_end}
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. 
. // 11th Grade (8th Grade ELA Controls, 6th Grade Math Controls)
. **************** Two Way Kernel Density for ELA and Math
. foreach subject in ela math {c -(}
{txt}  2{com}. 
.     use $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibling.dta, clear
{txt}  3{com}.     sort school_id year
{txt}  4{com}.         xtset school_id year
{txt}  5{com}. 
.     * Normalize to have mean zero
.         foreach v of varlist va_* {c -(}
{txt}  6{com}.                 sum `v', meanonly
{txt}  7{com}.                 replace `v' = `v' - r(mean)
{txt}  8{com}.         {c )-}
{txt}  9{com}. 
.     sum va_cfr_g11_`subject'
{txt} 10{com}.     local mean_`subject' = 0
{txt} 11{com}.     local sd_`subject' : di %4.3f = r(sd)
{txt} 12{com}. 
.     sum va_cfr_g11_`subject'_peer
{txt} 13{com}.     local mean_`subject'_peer = 0
{txt} 14{com}.     local sd_`subject'_peer : di %4.3f = r(sd)
{txt} 15{com}. 
.     tempfile va_`subject'
{txt} 16{com}.     save `va_`subject''
{txt} 17{com}. 
. {c )-}
{txt}(CST/SBAC Student Test Score Samples)
{res}
{col 1}{txt:Panel variable: }{res:school_id}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2015}}{txt: to }{res:{bind:2019}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 year
{txt}(5,902 real changes made)
(5,902 real changes made)
(5,902 real changes made)
(5,902 real changes made)
(5,902 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~a {c |}{res}      5,902    8.27e-10    .1253454  -.5622436   .4907941

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~r {c |}{res}      5,902   -1.11e-09     .109526  -.4662307    .442244
{txt}{p 0 4 2}
file {bf}
/home/tmp/St198982.000001{rm}
saved
as .dta format
{p_end}
(CST/SBAC Student Test Score Samples)
{res}
{col 1}{txt:Panel variable: }{res:school_id}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2015}}{txt: to }{res:{bind:2019}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 year
{txt}(5,895 real changes made)
(5,895 real changes made)
(5,895 real changes made)
(5,895 real changes made)
(5,895 real changes made)

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~h {c |}{res}      5,895   -4.18e-10    .1273509  -.5449818   .6124499

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
va_cfr_g11~r {c |}{res}      5,895   -1.68e-11    .1078995  -.4461001   .5691642
{txt}{p 0 4 2}
file {bf}
/home/tmp/St198982.000002{rm}
saved
as .dta format
{p_end}

{com}. 
. 
.   use `va_ela', clear
{txt}(CST/SBAC Student Test Score Samples)

{com}.   merge 1:1 cdscode year using `va_math', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}              15
{txt}{col 9}from master{col 30}{res}              12{txt}  
{col 9}from using{col 30}{res}               3{txt}  

{col 5}Matched{col 30}{res}           5,976{txt}  
{col 5}{hline 41}

{com}. 
.   corr va_cfr_g11_ela va_cfr_g11_ela_nosiblingcontrol
{txt}(obs=5,902)

             {c |} va_cfr~a va_cfr..
{hline 13}{c +}{hline 18}
va_cfr_g11~a {c |}{res}   1.0000
{txt}va_cfr_g11.. {c |}{res}   1.0000   1.0000

{txt}
{com}.   local corr_coef_ela_sibling : di %5.3f r(rho)
{res}{txt}
{com}. 
.   corr va_cfr_g11_math va_cfr_g11_math_nosiblingcontrol
{txt}(obs=5,895)

             {c |} va_cfr~h va_cfr..
{hline 13}{c +}{hline 18}
va_cfr_g11~h {c |}{res}   1.0000
{txt}va_cfr_g11.. {c |}{res}   0.9999   1.0000

{txt}
{com}.   local corr_coef_math_sibling : di %5.3f r(rho)
{res}{txt}
{com}. 
.   tempfile va_ela_math_sibling
{txt}
{com}.   save `va_ela_math_sibling'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St198982.000003{rm}
saved
as .dta format
{p_end}

{com}. 
. 
.   *************** two way scatter plot of VA with and without sibling controls
.   ***ELA
.   twoway ///
>   (scatter va_cfr_g11_ela va_cfr_g11_ela_nosiblingcontrol) ///
>   (lfit va_cfr_g11_ela va_cfr_g11_ela_nosiblingcontrol) ///
>   (function y = x), ///
>   ytitle("ELA VA with Sibling Control") ///
>   xtitle("ELA VA without Sibling Control") ///
>   title("Scatter Plot of ELA VA with and without Sibling Control") ///
>   legend(label(1 "ELA VA") label(3 "45 degree line") ) ///
>   note("Correlation Coefficient = `corr_coef_ela_sibling' ")
{res}{txt}
{com}. 
.   graph export $projdir/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_g11_ela_sibling.pdf, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_g11_ela_sibling.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. 
.   ***math
.   twoway ///
>   (scatter va_cfr_g11_math va_cfr_g11_math_nosiblingcontrol) ///
>   (lfit va_cfr_g11_math va_cfr_g11_math_nosiblingcontrol) ///
>   (function y = x), ///
>   ytitle("Math VA with Sibling Control") ///
>   xtitle("Math VA without Sibling Control") ///
>   title("Scatter Plot of Math VA with and without Sibling Control") ///
>   legend(label(1 "Math VA") label(3 "45 degree line") ) ///
>   note("Correlation Coefficient = `corr_coef_math_sibling' ")
{res}{txt}
{com}. 
.   graph export $projdir/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_g11_math_sibling.pdf, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_g11_math_sibling.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
.   **** No Peer Controls
.   twoway ///
>         (kdensity va_cfr_g11_ela) ///
>         (kdensity va_cfr_g11_math) ///
>     , ytitle("Density") xtitle("Value Added") ///
>     title("11th Grade Test Score VA") ///
>         legend(label(1 "ELA") label(2 "Math")) ///
>     note("Mean (Standard Deviation) = `mean_ela' (`sd_ela')" ///
>         "Mean (Standard Deviation) = `mean_math' (`sd_math')")
{res}{txt}
{com}.     graph export $projdir/out/graph/siblingvaregs/test_score_va/kdensity_va_cfr_g11_sibling.pdf, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_score_va/kdensity_va_cfr_g11_sibling.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. 
.   ****  Peer Controls
.   twoway ///
>         (kdensity va_cfr_g11_ela_peer) ///
>         (kdensity va_cfr_g11_math_peer) ///
>     , ytitle("Density") xtitle("Value Added") ///
>     title("11th Grade Test Score VA") ///
>         legend(label(1 "ELA") label(2 "Math")) ///
>     note("Mean (Standard Deviation) = `mean_ela_peer' (`sd_ela_peer')" ///
>         "Mean (Standard Deviation) = `mean_math_peer' (`sd_math_peer')")
{res}{txt}
{com}.     graph export $projdir/out/graph/siblingvaregs/test_score_va/kdensity_va_cfr_g11_peer_sibling.pdf, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_score_va/kdensity_va_cfr_g11_peer_sibling.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. 
. 
. 
. *************** correlation with original VA estimates
. //load orignal VA dataset and merge ELA with math
. foreach subject in ela math {c -(}
{txt}  2{com}.         use data/sbac/va_g11_`subject'.dta, clear
{txt}  3{com}.   sort school_id year
{txt}  4{com}. 
.         tempfile va_`subject'_original
{txt}  5{com}.         save `va_`subject'_original'
{txt}  6{com}. {c )-}
{txt}(CST/SBAC Student Test Score Samples)
{p 0 4 2}
file {bf}
/home/tmp/St198982.000004{rm}
saved
as .dta format
{p_end}
(CST/SBAC Student Test Score Samples)
{p 0 4 2}
file {bf}
/home/tmp/St198982.000005{rm}
saved
as .dta format
{p_end}

{com}. 
. use `va_ela_original'
{txt}(CST/SBAC Student Test Score Samples)

{com}. merge 1:1 cdscode year using `va_math_original', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}              12
{txt}{col 9}from master{col 30}{res}               9{txt}  
{col 9}from using{col 30}{res}               3{txt}  

{col 5}Matched{col 30}{res}           6,163{txt}  
{col 5}{hline 41}

{com}. 
. keep cdscode year va_cfr_g11_*
{txt}
{com}. rename va* va*_original
{res}{txt}
{com}. 
. merge 1:1 cdscode year using `va_ela_math_sibling', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             184
{txt}{col 9}from master{col 30}{res}             184{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}           5,991{txt}  
{col 5}{hline 41}

{com}. 
. corr va_cfr_g11_ela va_cfr_g11_ela_original
{txt}(obs=5,902)

             {c |} va_cfr~a va_cfr..
{hline 13}{c +}{hline 18}
va_cfr_g11~a {c |}{res}   1.0000
{txt}v~a_original {c |}{res}   0.9274   1.0000

{txt}
{com}. local corr_coef_ela_original : di %5.3f r(rho)
{res}{txt}
{com}. 
. corr va_cfr_g11_math va_cfr_g11_math_original
{txt}(obs=5,895)

             {c |} va_cfr~h va_cfr..
{hline 13}{c +}{hline 18}
va_cfr_g11~h {c |}{res}   1.0000
{txt}v~h_original {c |}{res}   0.9214   1.0000

{txt}
{com}. local corr_coef_math_original : di %5.3f r(rho)
{res}{txt}
{com}. 
. 
. *************** two way scatter plot of VA with sibling control and original VA
. ***ELA
. twoway ///
> (scatter va_cfr_g11_ela va_cfr_g11_ela_original) ///
> (lfit va_cfr_g11_ela va_cfr_g11_ela_original) ///
> (function y = x), ///
> ytitle("ELA VA with Sibling Control") ///
> xtitle("Original ELA VA") ///
> title("Scatter Plot of ELA VA with Sibling Control and Original") ///
> legend(label(1 "ELA VA") label(3 "45 degree line") ) ///
> note("Correlation Coefficient = `corr_coef_ela_original' ")
{res}{txt}
{com}. 
. graph export $projdir/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_g11_ela_original.pdf, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_g11_ela_original.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. 
. ***math
. twoway ///
> (scatter va_cfr_g11_math va_cfr_g11_math_original) ///
> (lfit va_cfr_g11_math va_cfr_g11_math_original) ///
> (function y = x), ///
> ytitle("Math VA with Sibling Control") ///
> xtitle("Original Math VA") ///
>   title("Scatter Plot of Math VA with Sibling Control and Original") ///
> legend(label(1 "Math VA") label(3 "45 degree line") ) ///
> note("Correlation Coefficient = `corr_coef_math_original' ")
{res}{txt}
{com}. 
. graph export $projdir/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_g11_math_original.pdf, replace
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_score_va/scatter_va_cfr_g11_math_original.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. **************************************************
. //specification tests
. *****No peer controls
. foreach subject in ela math {c -(}
{txt}  2{com}. 
.     estimates use $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster,
{txt}  3{com}. 
.     test _b[va_cfr_g11_`subject'] = 1
{txt}  4{com}.     matrix test_p = r(p)
{txt}  5{com}.         matrix rownames test_p = pvalue
{txt}  6{com}.         matrix colnames test_p = va_cfr_g11_`subject'
{txt}  7{com}.         estadd matrix test_p = test_p
{txt}  8{com}. 
.     local slope : di %5.3f _b[va_cfr_g11_`subject']
{txt}  9{com}.         local std_err : di %4.3f _se[va_cfr_g11_`subject']
{txt} 10{com}.         binscatter sbac_g11_`subject'_r va_cfr_g11_`subject' ///
>                 [aw = n_g11_`subject'] ///
>                 , ytitle("11th Grade Score") xtitle("Value Added") ///
>       title("11th Grade ``subject'_str' Specification Test") ///
>                 yline(0) xline(0) ///
>                 yscale(range(-.3 .3)) xscale(range(-.3 .3)) ylabel(-.3 (0.1) .3) xlabel(-.3 (0.1) .3) ///
>                 note("Slope (Standard Error) = `slope' (`std_err')")
{txt} 11{com}.         graph export $projdir/out/graph/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.pdf, replace
{txt} 12{com}. 
. 
. ******* with peer controls
.     estimates use $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_peer_sibling.ster,
{txt} 13{com}. 
.     test _b[va_cfr_g11_`subject'_peer] = 1
{txt} 14{com}.     matrix test_p = r(p)
{txt} 15{com}.         matrix rownames test_p = pvalue
{txt} 16{com}.         matrix colnames test_p = va_cfr_g11_`subject'_peer
{txt} 17{com}.         estadd matrix test_p = test_p
{txt} 18{com}. 
.         local slope : di %5.3f _b[va_cfr_g11_`subject'_peer]
{txt} 19{com}.         local std_err : di %4.3f _se[va_cfr_g11_`subject'_peer]
{txt} 20{com}.         binscatter sbac_g11_`subject'_r_peer va_cfr_g11_`subject'_peer ///
>                 [aw = n_g11_`subject'] ///
>                 , ytitle("11th Grade Score") xtitle("Value Added") ///
>       title("11th Grade ``subject'_str' Specification Test") ///
>                 yline(0) xline(0) ///
>                 yscale(range(-.3 .3)) xscale(range(-.3 .3)) ylabel(-.3 (0.1) .3) xlabel(-.3 (0.1) .3) ///
>                 note("Slope (Standard Error) = `slope' (`std_err')")
{txt} 21{com}.     graph export $projdir/out/graph/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_peer_sibling.pdf, replace
{txt} 22{com}. 
. 
. {c )-}
{res}
{p 0 7}{space 1}{text:( 1)}{space 1} va_cfr_g11_ela = 1{p_end}

{txt}       F(  1,  1288) ={res}    0.76
{txt}{col 13}Prob > F ={res}    0.3835

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling.pdf{rm}
saved as
PDF
format
{p_end}
{res}
{p 0 7}{space 1}{text:( 1)}{space 1} va_cfr_g11_ela_peer = 1{p_end}

{txt}       F(  1,  1288) ={res}    0.45
{txt}{col 13}Prob > F ={res}    0.5030

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_peer_sibling.pdf{rm}
saved as
PDF
format
{p_end}
{res}
{p 0 7}{space 1}{text:( 1)}{space 1} va_cfr_g11_math = 1{p_end}

{txt}       F(  1,  1287) ={res}    0.14
{txt}{col 13}Prob > F ={res}    0.7113

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling.pdf{rm}
saved as
PDF
format
{p_end}
{res}
{p 0 7}{space 1}{text:( 1)}{space 1} va_cfr_g11_math_peer = 1{p_end}

{txt}       F(  1,  1287) ={res}    1.66
{txt}{col 13}Prob > F ={res}    0.1983

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_peer_sibling.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling_est_sumstats.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Nov 2021, 21:06:27
{txt}{.-}
{smcl}
{txt}{sf}{ul off}