{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling_out.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Jul 2022, 21:47:49
{txt}
{com}. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. #delimit ;
{txt}delimiter now ;
{com}. #delimit cr
{txt}delimiter now cr
{com}. macro list
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.0039002308063216
{p_end}
{txt}{p 0 16}
S_2:{space 12}{res}{res}300
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.0206002574343117
{p_end}
{txt}{p 0 16}
S_1:{space 12}{res}{res}epanechnikov
{p_end}
{txt}{p 0 16}
S_6:{space 12}{res}{res}.7098361624622439
{p_end}
{txt}{p 0 16}
S_5:{space 12}{res}{res}4
{p_end}
{txt}{p 0 16}
ReS_jv2:{space 8}{res}{res}__000006 __000007 __000008 __000009 __00000A __00000B __00000C __00000D __00000E __00000F __00000G __00000H __00000I __00000J __00000K
{p_end}
{txt}{p 0 16}
dropv:{space 10}{res}{res}_cdscode_x
{p_end}
{txt}{p 0 16}
n_offset:{space 7}{res}{res}0
{p_end}
{txt}{p 0 16}
sort:{space 11}{res}{res}0
{p_end}
{txt}{p 0 16}
dots:{space 11}{res}{res}nois _dots 5 0
{p_end}
{txt}{p 0 16}
dotss:{space 10}{res}{res}nois _dots 0, title(Survey results being calculated)
{p_end}
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_both_str:{space 6}{res}{res}Original + Census + Sibling
{p_end}
{txt}{p 0 16}
_sib_str:{space 7}{res}{res}Original + Sibling
{p_end}
{txt}{p 0 16}
_acs_str:{space 7}{res}{res}Original + Census
{p_end}
{txt}{p 0 16}
_og_str:{space 8}{res}{res}Original Specification
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}{p 0 16}
_setlimit:{space 6}{res}{res}0
{p_end}
{txt}{p 0 16}
_1:{space 13}{res}{res}0
{p_end}
{txt}{p 0 16}
_0:{space 13}{res}{res}0
{p_end}
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. 
. 
. //load the VA grade 11 college outcomes sample
. use `va_g11_out_dataset', clear
{txt}(Enrollment Outcome Grade 11 VA Sample)

{com}. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk', nogen keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         884,312
{txt}{col 9}from master{col 30}{res}         884,312{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}         900,133{txt}  
{col 5}{hline 41}

{com}. 
. drop if mi(has_older_sibling_enr_2year)
{txt}(884,312 observations deleted)

{com}. drop if mi(has_older_sibling_enr_4year)
{txt}(0 observations deleted)

{com}. 
. compress
  {txt}variable {bf}{res}age{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}major{sf}{txt} was {bf}{res}long{sf}{txt} now {bf}{res}int{sf}
{txt}  (3,600,532 bytes saved)

{com}. tempfile va_g11_out_sibling_dataset
{txt}
{com}. save `va_g11_out_sibling_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St35924.000001{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. ********************************************************************************
. *********** VA estimates for VA samples matched to siblings sample
. ********************************************************************************
. if `setlimit' == 0 {c -(}
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
. {c )-}
{txt}
{com}. else {c -(}
.   local drift_limit = `setlimit'
. {c )-}
{txt}
{com}. 
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   use `va_g11_out_sibling_dataset' if touse_g11_`outcome'==1 & sibling_out_sample == 1, clear
{txt}  3{com}. 
.   ***********************Overall value added
.   **** No Peer Controls
.   ** No TFX
.     ***without sibling college going controls
.     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_cfr_g11_`outcome'_nosibctrl.ster, replace)
{txt}  4{com}. 
.     //rename the first time to make sure indep var names for spec test are all the same
.     rename tv va_cfr_g11_`outcome'
{txt}  5{com}.     rename score_r g11_`outcome'_r
{txt}  6{com}. 
.     **************** Specification Test
.     *************** No Peer Controls
.     ****** sibling sample without sibling controls
.     reg g11_`outcome'_r va_cfr_g11_`outcome', cluster(school_id)
{txt}  7{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`outcome'_sibling_nocontrol.ster, replace
{txt}  8{com}.     //save to va project folder
.     estimates save $vaprojdir/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_`outcome'_sibling_nocontrol.ster, replace
{txt}  9{com}. 
.     //rename again to distinguish between nocontrol and with control va estimates
.     rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl
{txt} 10{com}.     rename g11_`outcome'_r g11_`outcome'_r_nosibctrl
{txt} 11{com}. 
. 
.     *** with sibling controls
.     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_cfr_g11_`outcome'.ster, replace)
{txt} 12{com}.     rename tv va_cfr_g11_`outcome'
{txt} 13{com}.     rename score_r g11_`outcome'_r
{txt} 14{com}. 
.     **************** Specification Test
.     *************** No Peer Controls
.     ****** sibling sample with sibling controls
.     reg g11_`outcome'_r va_cfr_g11_`outcome', cluster(school_id)
{txt} 15{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`outcome'_sibling.ster, replace
{txt} 16{com}.     //save to va project folder
.     estimates save $vaprojdir/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_`outcome'_sibling.ster, replace
{txt} 17{com}. 
. 
. 
. 
. 
. 
. /*
> 
>   ** TFX
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 tfx_resid(school_id) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_tfx_g11_`outcome'
>         drop score_r
> 
>   corr va_cfr_g11_`outcome' va_tfx_g11_`outcome'
> 
>  */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
.   **** Peer Controls
.         ** No TFX
. 
.     /* ***without sibling college going controls
>     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv
>     rename score_r
> 
>     //with sibling controls
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                         `peer_demographic_controls' ///
>                         `peer_ela_score_controls' ///
>                         `peer_math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_cfr_g11_`outcome'_peer
>         rename score_r g11_`outcome'_r_peer
> 
>         ** TFX
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                         `peer_demographic_controls' ///
>                         `peer_ela_score_controls' ///
>                         `peer_math_score_controls' ///
>                 ) ///
>                 tfx_resid(school_id) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_tfx_g11_`outcome'_peer
>         drop score_r
> 
>         corr va_cfr_g11_`outcome'_peer va_tfx_g11_`outcome'_peer
>  */
. 
. 
. 
. ********************************************************************************
.   **************** Specification Test
. 
.   /* **** Peer Controls
>   reg g11_`outcome'_r_peer va_cfr_g11_`outcome'_peer, cluster(school_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`outcome'_peer_sibling.ster, replace
> 
>  */
. 
. 
.   *** no peer controls
. 
.   /* *** with peer controls
>   reg g11_`outcome'_r_nosibctrl_peer va_cfr_g11_`outcome'_nosibctrl_peer, cluster(school_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`outcome'_peer_sibling_nocontrol.ster, replace */
. 
.   **************Do we need deep knowledge VA with sibling controls?? No.
. 
. 
. 
. 
.   ******************************************************************************
.   /* CFR Forecast Bias Test */
.   ***** leave out variable is sibling controls
. 
. 
.   **no peer controls
.   gen g11_`outcome'_r_d = g11_`outcome'_r_nosibctrl - g11_`outcome'_r
{txt} 18{com}. 
.   //var rename gymnastics to make sure the indep var names are all the same when making tables later
.   rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_temp
{txt} 19{com}.   rename va_cfr_g11_`outcome'_nosibctrl va_cfr_g11_`outcome'
{txt} 20{com}. 
.   reg g11_`outcome'_r_d va_cfr_g11_`outcome', cluster(school_id)
{txt} 21{com}.   //save to my personal folder
.   estimates save $projdir/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_`outcome'_sibling.ster, replace
{txt} 22{com}.   //save to va project folder
.   estimates save $vaprojdir/estimates/sibling_va/outcome_va/fb_test_va_cfr_g11_`outcome'_sibling.ster, replace
{txt} 23{com}. 
.   //roll back the rename gymnastics to restore original var names
.   rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl
{txt} 24{com}.   rename va_cfr_g11_`outcome'_temp va_cfr_g11_`outcome'
{txt} 25{com}. 
. 
.   /* ** with peer controls
>   gen g11_`outcome'_r_d_peer = g11_`outcome'_r_nosibctrl_peer - g11_`outcome'_r_peer
>   reg g11_`outcome'_r_d_peer va_cfr_g11_`outcome'_nosibctrl_peer, cluster(school_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_`outcome'_sibling_peer.ster, replace
>  */
. 
. 
. 
.   **************** Save Value Added Estimates
.   collapse (firstnm) va_* ///
>     (mean) g11_`outcome'* ///
>     (sum) n_g11_`outcome' = touse_g11_`outcome' ///
>     , by(school_id cdscode grade year)
{txt} 26{com}.   //save to my personal folder
.   save $projdir/dta/common_core_va/outcome_va/va_g11_`outcome'_sibling.dta, replace
{txt} 27{com}.   //save to VA project folder
.   save $vaprojdir/data/sibling_va/outcome_va/va_g11_`outcome'_sibling.dta, replace
{txt} 28{com}. 
. 
. {c )-}
{txt}(Enrollment Outcome Grade 11 VA Sample)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,398
{txt}{hline 13}{c +}{hline 34}   F(36, 700361)   = {res}  2552.73
{txt}       Model {c |} {res} 16446.4038        36   456.84455   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 125338.933   700,361  .178963324   {txt}R-squared       ={res}    0.1160
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1159
{txt}       Total {c |} {res} 141785.336   700,397  .202435671   {txt}Root MSE        =   {res} .42304

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0125059{col 26}{space 2} .0019937{col 37}{space 1}    6.27{col 46}{space 3}0.000{col 54}{space 4} .0085982{col 67}{space 3} .0164135
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0114683{col 26}{space 2}  .002003{col 37}{space 1}   -5.73{col 46}{space 3}0.000{col 54}{space 4}-.0153942{col 67}{space 3}-.0075424
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0279555{col 26}{space 2}  .002004{col 37}{space 1}  -13.95{col 46}{space 3}0.000{col 54}{space 4}-.0318833{col 67}{space 3}-.0240276
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001742{col 26}{space 2} 3.51e-06{col 37}{space 1}  -49.67{col 46}{space 3}0.000{col 54}{space 4}-.0001811{col 67}{space 3}-.0001673
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0695989{col 26}{space 2} .0010335{col 37}{space 1}  -67.34{col 46}{space 3}0.000{col 54}{space 4}-.0716246{col 67}{space 3}-.0675732
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0634443{col 26}{space 2}   .00166{col 37}{space 1}   38.22{col 46}{space 3}0.000{col 54}{space 4} .0601907{col 67}{space 3} .0666978
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0159828{col 26}{space 2} .0014112{col 37}{space 1}  -11.33{col 46}{space 3}0.000{col 54}{space 4}-.0187488{col 67}{space 3}-.0132169
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0090516{col 26}{space 2} .0027647{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4}  .003633{col 67}{space 3} .0144703
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0105803{col 26}{space 2} .0030645{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4}-.0165867{col 67}{space 3} -.004574
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0674784{col 26}{space 2} .0012008{col 37}{space 1}  -56.19{col 46}{space 3}0.000{col 54}{space 4} -.069832{col 67}{space 3}-.0651248
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0442232{col 26}{space 2} .0026865{col 37}{space 1}  -16.46{col 46}{space 3}0.000{col 54}{space 4}-.0494887{col 67}{space 3}-.0389577
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0173869{col 26}{space 2} .0026817{col 37}{space 1}   -6.48{col 46}{space 3}0.000{col 54}{space 4}-.0226429{col 67}{space 3}-.0121309
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0831014{col 26}{space 2} .0020207{col 37}{space 1}   41.13{col 46}{space 3}0.000{col 54}{space 4}  .079141{col 67}{space 3} .0870618
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .072925{col 26}{space 2} .0019904{col 37}{space 1}   36.64{col 46}{space 3}0.000{col 54}{space 4} .0690238{col 67}{space 3} .0768261
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0708344{col 26}{space 2} .0021245{col 37}{space 1}   33.34{col 46}{space 3}0.000{col 54}{space 4} .0666705{col 67}{space 3} .0749984
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0716667{col 26}{space 2} .0025843{col 37}{space 1}   27.73{col 46}{space 3}0.000{col 54}{space 4} .0666015{col 67}{space 3} .0767319
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.016063{col 26}{space 2} .0010458{col 37}{space 1}  -15.36{col 46}{space 3}0.000{col 54}{space 4}-.0181127{col 67}{space 3}-.0140132
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0204097{col 26}{space 2} .0010679{col 37}{space 1}  -19.11{col 46}{space 3}0.000{col 54}{space 4}-.0225028{col 67}{space 3}-.0183167
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0120708{col 26}{space 2} .0011156{col 37}{space 1}  -10.82{col 46}{space 3}0.000{col 54}{space 4}-.0142573{col 67}{space 3}-.0098843
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0119936{col 26}{space 2} .0011129{col 37}{space 1}  -10.78{col 46}{space 3}0.000{col 54}{space 4}-.0141748{col 67}{space 3}-.0098123
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0013374{col 26}{space 2} .0004869{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0022918{col 67}{space 3} -.000383
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0007652{col 26}{space 2} .0004504{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4}-.0001176{col 67}{space 3} .0016479
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.001685{col 26}{space 2} .0004506{col 37}{space 1}   -3.74{col 46}{space 3}0.000{col 54}{space 4}-.0025683{col 67}{space 3}-.0008018
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0049773{col 26}{space 2} .0007306{col 37}{space 1}   -6.81{col 46}{space 3}0.000{col 54}{space 4}-.0064093{col 67}{space 3}-.0035454
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0586889{col 26}{space 2} .0020117{col 37}{space 1}   29.17{col 46}{space 3}0.000{col 54}{space 4} .0547461{col 67}{space 3} .0626317
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0621699{col 26}{space 2} .0020683{col 37}{space 1}   30.06{col 46}{space 3}0.000{col 54}{space 4}  .058116{col 67}{space 3} .0662238
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0614841{col 26}{space 2} .0021862{col 37}{space 1}   28.12{col 46}{space 3}0.000{col 54}{space 4} .0571992{col 67}{space 3} .0657689
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0896567{col 26}{space 2} .0026129{col 37}{space 1}   34.31{col 46}{space 3}0.000{col 54}{space 4} .0845355{col 67}{space 3}  .094778
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0147048{col 26}{space 2} .0013197{col 37}{space 1}  -11.14{col 46}{space 3}0.000{col 54}{space 4}-.0172914{col 67}{space 3}-.0121182
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0165649{col 26}{space 2} .0013018{col 37}{space 1}  -12.73{col 46}{space 3}0.000{col 54}{space 4}-.0191163{col 67}{space 3}-.0140135
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0116747{col 26}{space 2} .0013689{col 37}{space 1}   -8.53{col 46}{space 3}0.000{col 54}{space 4}-.0143577{col 67}{space 3}-.0089917
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0009424{col 26}{space 2} .0010813{col 37}{space 1}   -0.87{col 46}{space 3}0.383{col 54}{space 4}-.0030616{col 67}{space 3} .0011769
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0005795{col 26}{space 2} .0005458{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-.0004904{col 67}{space 3} .0016493
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0011826{col 26}{space 2} .0005851{col 37}{space 1}    2.02{col 46}{space 3}0.043{col 54}{space 4} .0000358{col 67}{space 3} .0023295
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0004824{col 26}{space 2} .0005892{col 37}{space 1}   -0.82{col 46}{space 3}0.413{col 54}{space 4}-.0016372{col 67}{space 3} .0006724
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.007588{col 26}{space 2} .0007223{col 37}{space 1}  -10.51{col 46}{space 3}0.000{col 54}{space 4}-.0090037{col 67}{space 3}-.0061723
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.858684{col 26}{space 2} .0214889{col 37}{space 1}   86.49{col 46}{space 3}0.000{col 54}{space 4} 1.816566{col 67}{space 3} 1.900801
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr_nosibctrl.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.42304057 .08267799 .41488272 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .005874217   .7563132727          3571{txt}  {c |}
  2 {c |}  {res} .004992483   .6817276703          2319{txt}  {c |}
  3 {c |}  {res}.0042665172   .6199087965          1117{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}         1
    {c TLC}{hline 14}{c TRC}
  1 {c |}  {res}.005874217{txt}  {c |}
  2 {c |}  {res}.004992483{txt}  {c |}
  3 {c |}  {res}.004992483{txt}  {c |}
    {c BLC}{hline 14}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,536
                                                {txt}F(1, 1276)        =  {res}  8278.26
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0282
                                                {txt}Root MSE          =    {res} .41681

{txt}{ralign 78:(Std. err. adjusted for {res:1,277} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   g11_enr_r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.053127{col 26}{space 2} .0115747{col 37}{space 1}   90.98{col 46}{space 3}0.000{col 54}{space 4}  1.03042{col 67}{space 3} 1.075835
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0015751{col 26}{space 2}  .000285{col 37}{space 1}   -5.53{col 46}{space 3}0.000{col 54}{space 4}-.0021342{col 67}{space 3} -.001016
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.ster} saved
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,398
{txt}{hline 13}{c +}{hline 34}   F(38, 700359)   = {res}  2447.97
{txt}       Model {c |} {res} 16624.1504        38  437.477643   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 125161.186   700,359  .178710042   {txt}R-squared       ={res}    0.1172
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1172
{txt}       Total {c |} {res} 141785.336   700,397  .202435671   {txt}Root MSE        =   {res} .42274

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0118341{col 26}{space 2} .0019925{col 37}{space 1}    5.94{col 46}{space 3}0.000{col 54}{space 4}  .007929{col 67}{space 3} .0157393
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0128821{col 26}{space 2} .0020023{col 37}{space 1}   -6.43{col 46}{space 3}0.000{col 54}{space 4}-.0168065{col 67}{space 3}-.0089577
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0299256{col 26}{space 2} .0020041{col 37}{space 1}  -14.93{col 46}{space 3}0.000{col 54}{space 4}-.0338535{col 67}{space 3}-.0259976
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0216657{col 26}{space 2} .0019881{col 37}{space 1}   10.90{col 46}{space 3}0.000{col 54}{space 4} .0177692{col 67}{space 3} .0255623
{txt}1.has_~4year {c |}{col 14}{res}{space 2}  .062914{col 26}{space 2} .0021802{col 37}{space 1}   28.86{col 46}{space 3}0.000{col 54}{space 4} .0586408{col 67}{space 3} .0671871
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0001715{col 26}{space 2} 3.51e-06{col 37}{space 1}  -48.91{col 46}{space 3}0.000{col 54}{space 4}-.0001784{col 67}{space 3}-.0001646
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0696291{col 26}{space 2} .0010328{col 37}{space 1}  -67.42{col 46}{space 3}0.000{col 54}{space 4}-.0716533{col 67}{space 3}-.0676048
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0618054{col 26}{space 2} .0016597{col 37}{space 1}   37.24{col 46}{space 3}0.000{col 54}{space 4} .0585524{col 67}{space 3} .0650584
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0157639{col 26}{space 2} .0014106{col 37}{space 1}  -11.18{col 46}{space 3}0.000{col 54}{space 4}-.0185286{col 67}{space 3}-.0129991
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0091413{col 26}{space 2} .0027627{col 37}{space 1}    3.31{col 46}{space 3}0.001{col 54}{space 4} .0037265{col 67}{space 3} .0145561
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0099587{col 26}{space 2} .0030624{col 37}{space 1}   -3.25{col 46}{space 3}0.001{col 54}{space 4} -.015961{col 67}{space 3}-.0039565
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0680535{col 26}{space 2} .0012002{col 37}{space 1}  -56.70{col 46}{space 3}0.000{col 54}{space 4}-.0704059{col 67}{space 3}-.0657012
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2} -.044291{col 26}{space 2} .0026846{col 37}{space 1}  -16.50{col 46}{space 3}0.000{col 54}{space 4}-.0495528{col 67}{space 3}-.0390292
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0167822{col 26}{space 2} .0026799{col 37}{space 1}   -6.26{col 46}{space 3}0.000{col 54}{space 4}-.0220346{col 67}{space 3}-.0115297
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0830585{col 26}{space 2} .0020193{col 37}{space 1}   41.13{col 46}{space 3}0.000{col 54}{space 4} .0791007{col 67}{space 3} .0870163
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0730329{col 26}{space 2} .0019892{col 37}{space 1}   36.72{col 46}{space 3}0.000{col 54}{space 4} .0691342{col 67}{space 3} .0769316
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0711126{col 26}{space 2} .0021233{col 37}{space 1}   33.49{col 46}{space 3}0.000{col 54}{space 4}  .066951{col 67}{space 3} .0752741
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0713808{col 26}{space 2} .0025826{col 37}{space 1}   27.64{col 46}{space 3}0.000{col 54}{space 4} .0663189{col 67}{space 3} .0764426
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0159419{col 26}{space 2} .0010451{col 37}{space 1}  -15.25{col 46}{space 3}0.000{col 54}{space 4}-.0179903{col 67}{space 3}-.0138936
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.020241{col 26}{space 2} .0010672{col 37}{space 1}  -18.97{col 46}{space 3}0.000{col 54}{space 4}-.0223326{col 67}{space 3}-.0181493
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0118729{col 26}{space 2} .0011148{col 37}{space 1}  -10.65{col 46}{space 3}0.000{col 54}{space 4}-.0140579{col 67}{space 3}-.0096879
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0118483{col 26}{space 2} .0011121{col 37}{space 1}  -10.65{col 46}{space 3}0.000{col 54}{space 4}-.0140281{col 67}{space 3}-.0096686
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0013171{col 26}{space 2} .0004866{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-.0022708{col 67}{space 3}-.0003633
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0007566{col 26}{space 2} .0004501{col 37}{space 1}    1.68{col 46}{space 3}0.093{col 54}{space 4}-.0001255{col 67}{space 3} .0016387
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0017029{col 26}{space 2} .0004503{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}-.0025855{col 67}{space 3}-.0008203
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0048651{col 26}{space 2} .0007301{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4} -.006296{col 67}{space 3}-.0034341
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0579346{col 26}{space 2} .0020104{col 37}{space 1}   28.82{col 46}{space 3}0.000{col 54}{space 4} .0539942{col 67}{space 3}  .061875
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0611853{col 26}{space 2} .0020672{col 37}{space 1}   29.60{col 46}{space 3}0.000{col 54}{space 4} .0571337{col 67}{space 3} .0652369
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0605455{col 26}{space 2} .0021849{col 37}{space 1}   27.71{col 46}{space 3}0.000{col 54}{space 4} .0562632{col 67}{space 3} .0648279
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0887088{col 26}{space 2} .0026114{col 37}{space 1}   33.97{col 46}{space 3}0.000{col 54}{space 4} .0835906{col 67}{space 3} .0938271
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0146061{col 26}{space 2} .0013188{col 37}{space 1}  -11.08{col 46}{space 3}0.000{col 54}{space 4}-.0171909{col 67}{space 3}-.0120213
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0165061{col 26}{space 2} .0013009{col 37}{space 1}  -12.69{col 46}{space 3}0.000{col 54}{space 4}-.0190557{col 67}{space 3}-.0139564
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0115881{col 26}{space 2} .0013679{col 37}{space 1}   -8.47{col 46}{space 3}0.000{col 54}{space 4}-.0142692{col 67}{space 3} -.008907
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0007845{col 26}{space 2} .0010806{col 37}{space 1}   -0.73{col 46}{space 3}0.468{col 54}{space 4}-.0029024{col 67}{space 3} .0013334
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0006308{col 26}{space 2} .0005455{col 37}{space 1}    1.16{col 46}{space 3}0.247{col 54}{space 4}-.0004383{col 67}{space 3} .0016999
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012667{col 26}{space 2} .0005847{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} .0001206{col 67}{space 3} .0024127
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0004222{col 26}{space 2} .0005888{col 37}{space 1}   -0.72{col 46}{space 3}0.473{col 54}{space 4}-.0015762{col 67}{space 3} .0007318
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0074158{col 26}{space 2} .0007218{col 37}{space 1}  -10.27{col 46}{space 3}0.000{col 54}{space 4}-.0088305{col 67}{space 3}-.0060011
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.838208{col 26}{space 2} .0214851{col 37}{space 1}   85.56{col 46}{space 3}0.000{col 54}{space 4} 1.796098{col 67}{space 3} 1.880318
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.4227411 .08242408 .41462792 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}  .00583675   .7554594714          3571{txt}  {c |}
  2 {c |}  {res}.0049612938    .680815299          2319{txt}  {c |}
  3 {c |}  {res} .004234727   .6184978003          1117{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}  .00583675{txt}  {c |}
  2 {c |}  {res}.0049612938{txt}  {c |}
  3 {c |}  {res}.0049612938{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,536
                                                {txt}F(1, 1276)        =  {res}  8258.89
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0281
                                                {txt}Root MSE          =    {res} .41655

{txt}{ralign 78:(Std. err. adjusted for {res:1,277} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   g11_enr_r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.052731{col 26}{space 2}  .011584{col 37}{space 1}   90.88{col 46}{space 3}0.000{col 54}{space 4} 1.030006{col 67}{space 3} 1.075457
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0015497{col 26}{space 2}  .000285{col 37}{space 1}   -5.44{col 46}{space 3}0.000{col 54}{space 4}-.0021088{col 67}{space 3}-.0009907
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_sibling.ster} saved
{res}
{txt}Linear regression                               Number of obs     = {res}   698,536
                                                {txt}F(1, 1276)        =  {res}    26.15
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0002
                                                {txt}Root MSE          =    {res} .01593

{txt}{ralign 78:(Std. err. adjusted for {res:1,277} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} g11_enr_r_d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} .0034699{col 26}{space 2} .0006785{col 37}{space 1}    5.11{col 46}{space 3}0.000{col 54}{space 4} .0021388{col 67}{space 3} .0048009
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.15e-06{col 26}{space 2} .0000481{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-.0000996{col 67}{space 3} .0000893
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_enr_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/fb_test_va_cfr_g11_enr_sibling.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outcome_va/va_g11_enr_sibling.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_va/va_g11_enr_sibling.dta{rm}
saved
{p_end}
(Enrollment Outcome Grade 11 VA Sample)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,398
{txt}{hline 13}{c +}{hline 34}   F(36, 700361)   = {res}  1032.34
{txt}       Model {c |} {res} 8181.89797        36  227.274944   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 154187.582   700,361  .220154437   {txt}R-squared       ={res}    0.0504
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0503
{txt}       Total {c |} {res}  162369.48   700,397  .231824922   {txt}Root MSE        =   {res} .46921

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} -.005689{col 26}{space 2} .0022113{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4} -.010023{col 67}{space 3}-.0013549
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0316629{col 26}{space 2} .0022216{col 37}{space 1}  -14.25{col 46}{space 3}0.000{col 54}{space 4}-.0360172{col 67}{space 3}-.0273085
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0086862{col 26}{space 2} .0022227{col 37}{space 1}   -3.91{col 46}{space 3}0.000{col 54}{space 4}-.0130427{col 67}{space 3}-.0043297
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000933{col 26}{space 2} 3.89e-06{col 37}{space 1}  -24.00{col 46}{space 3}0.000{col 54}{space 4} -.000101{col 67}{space 3}-.0000857
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0191837{col 26}{space 2} .0011463{col 37}{space 1}   16.74{col 46}{space 3}0.000{col 54}{space 4}  .016937{col 67}{space 3} .0214305
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0140261{col 26}{space 2} .0018411{col 37}{space 1}   -7.62{col 46}{space 3}0.000{col 54}{space 4}-.0176347{col 67}{space 3}-.0104175
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} .0017761{col 26}{space 2} .0015652{col 37}{space 1}    1.13{col 46}{space 3}0.256{col 54}{space 4}-.0012917{col 67}{space 3} .0048439
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0359011{col 26}{space 2} .0030664{col 37}{space 1}  -11.71{col 46}{space 3}0.000{col 54}{space 4}-.0419111{col 67}{space 3}-.0298911
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0021605{col 26}{space 2} .0033989{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-.0045014{col 67}{space 3} .0088223
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0241276{col 26}{space 2} .0013319{col 37}{space 1}  -18.12{col 46}{space 3}0.000{col 54}{space 4} -.026738{col 67}{space 3}-.0215172
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0234462{col 26}{space 2} .0029797{col 37}{space 1}   -7.87{col 46}{space 3}0.000{col 54}{space 4}-.0292863{col 67}{space 3}-.0176061
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0270978{col 26}{space 2} .0029743{col 37}{space 1}    9.11{col 46}{space 3}0.000{col 54}{space 4} .0212682{col 67}{space 3} .0329274
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0573769{col 26}{space 2} .0022412{col 37}{space 1}  -25.60{col 46}{space 3}0.000{col 54}{space 4}-.0617695{col 67}{space 3}-.0529843
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0534688{col 26}{space 2} .0022076{col 37}{space 1}  -24.22{col 46}{space 3}0.000{col 54}{space 4}-.0577956{col 67}{space 3}-.0491419
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0546342{col 26}{space 2} .0023563{col 37}{space 1}  -23.19{col 46}{space 3}0.000{col 54}{space 4}-.0592526{col 67}{space 3}-.0500159
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0280082{col 26}{space 2} .0028663{col 37}{space 1}   -9.77{col 46}{space 3}0.000{col 54}{space 4}-.0336262{col 67}{space 3}-.0223903
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0399888{col 26}{space 2} .0011599{col 37}{space 1}  -34.48{col 46}{space 3}0.000{col 54}{space 4}-.0422622{col 67}{space 3}-.0377154
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0378814{col 26}{space 2} .0011844{col 37}{space 1}  -31.98{col 46}{space 3}0.000{col 54}{space 4}-.0402028{col 67}{space 3}-.0355599
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0310776{col 26}{space 2} .0012373{col 37}{space 1}  -25.12{col 46}{space 3}0.000{col 54}{space 4}-.0335027{col 67}{space 3}-.0286525
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0309297{col 26}{space 2} .0012344{col 37}{space 1}  -25.06{col 46}{space 3}0.000{col 54}{space 4} -.033349{col 67}{space 3}-.0285104
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0100909{col 26}{space 2} .0005401{col 37}{space 1}   18.68{col 46}{space 3}0.000{col 54}{space 4} .0090324{col 67}{space 3} .0111495
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0097951{col 26}{space 2} .0004995{col 37}{space 1}   19.61{col 46}{space 3}0.000{col 54}{space 4}  .008816{col 67}{space 3} .0107741
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0083838{col 26}{space 2} .0004998{col 37}{space 1}   16.77{col 46}{space 3}0.000{col 54}{space 4} .0074042{col 67}{space 3} .0093634
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0037116{col 26}{space 2} .0008103{col 37}{space 1}    4.58{col 46}{space 3}0.000{col 54}{space 4} .0021233{col 67}{space 3} .0052998
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0640321{col 26}{space 2} .0022312{col 37}{space 1}  -28.70{col 46}{space 3}0.000{col 54}{space 4}-.0684052{col 67}{space 3} -.059659
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0665134{col 26}{space 2} .0022941{col 37}{space 1}  -28.99{col 46}{space 3}0.000{col 54}{space 4}-.0710097{col 67}{space 3}-.0620171
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0617518{col 26}{space 2} .0024248{col 37}{space 1}  -25.47{col 46}{space 3}0.000{col 54}{space 4}-.0665042{col 67}{space 3}-.0569993
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0513113{col 26}{space 2} .0028981{col 37}{space 1}  -17.71{col 46}{space 3}0.000{col 54}{space 4}-.0569914{col 67}{space 3}-.0456312
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0335671{col 26}{space 2} .0014637{col 37}{space 1}  -22.93{col 46}{space 3}0.000{col 54}{space 4}-.0364359{col 67}{space 3}-.0306983
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0354717{col 26}{space 2} .0014438{col 37}{space 1}  -24.57{col 46}{space 3}0.000{col 54}{space 4}-.0383015{col 67}{space 3}-.0326419
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0254956{col 26}{space 2} .0015183{col 37}{space 1}  -16.79{col 46}{space 3}0.000{col 54}{space 4}-.0284714{col 67}{space 3}-.0225198
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0344037{col 26}{space 2} .0011993{col 37}{space 1}  -28.69{col 46}{space 3}0.000{col 54}{space 4}-.0367542{col 67}{space 3}-.0320532
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0110098{col 26}{space 2} .0006054{col 37}{space 1}   18.19{col 46}{space 3}0.000{col 54}{space 4} .0098232{col 67}{space 3} .0121964
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0120303{col 26}{space 2}  .000649{col 37}{space 1}   18.54{col 46}{space 3}0.000{col 54}{space 4} .0107583{col 67}{space 3} .0133023
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0084638{col 26}{space 2} .0006535{col 37}{space 1}   12.95{col 46}{space 3}0.000{col 54}{space 4}  .007183{col 67}{space 3} .0097446
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0010413{col 26}{space 2} .0008011{col 37}{space 1}    1.30{col 46}{space 3}0.194{col 54}{space 4}-.0005288{col 67}{space 3} .0026115
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.025151{col 26}{space 2}  .023834{col 37}{space 1}   43.01{col 46}{space 3}0.000{col 54}{space 4} .9784376{col 67}{space 3} 1.071865
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr_2year_nosibctrl.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46920618 .09832406 .45878842 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0090359214   .8131155134          3571{txt}  {c |}
  2 {c |}  {res}.0083692914   .7646063866          2319{txt}  {c |}
  3 {c |}  {res}.0076539234   .7182533446          1117{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0090359214{txt}  {c |}
  2 {c |}  {res}.0083692914{txt}  {c |}
  3 {c |}  {res}.0083692914{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,536
                                                {txt}F(1, 1276)        =  {res} 33821.16
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0366
                                                {txt}Root MSE          =    {res} .46054

{txt}{ralign 78:(Std. err. adjusted for {res:1,277} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_2y~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.003268{col 26}{space 2} .0054554{col 37}{space 1}  183.91{col 46}{space 3}0.000{col 54}{space 4} .9925655{col 67}{space 3}  1.01397
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0011242{col 26}{space 2}   .00027{col 37}{space 1}   -4.16{col 46}{space 3}0.000{col 54}{space 4} -.001654{col 67}{space 3}-.0005945
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster} saved
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,398
{txt}{hline 13}{c +}{hline 34}   F(38, 700359)   = {res}  1061.45
{txt}       Model {c |} {res} 8841.94286        38  232.682707   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 153527.537   700,359  .219212628   {txt}R-squared       ={res}    0.0545
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0544
{txt}       Total {c |} {res}  162369.48   700,397  .231824922   {txt}Root MSE        =   {res}  .4682

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0060655{col 26}{space 2} .0022067{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0103906{col 67}{space 3}-.0017403
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0322535{col 26}{space 2} .0022176{col 37}{space 1}  -14.54{col 46}{space 3}0.000{col 54}{space 4}-.0365999{col 67}{space 3}-.0279071
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.010237{col 26}{space 2} .0022196{col 37}{space 1}   -4.61{col 46}{space 3}0.000{col 54}{space 4}-.0145873{col 67}{space 3}-.0058866
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0977161{col 26}{space 2} .0022019{col 37}{space 1}   44.38{col 46}{space 3}0.000{col 54}{space 4} .0934005{col 67}{space 3} .1020317
{txt}1.has_~4year {c |}{col 14}{res}{space 2}-.0844635{col 26}{space 2} .0024147{col 37}{space 1}  -34.98{col 46}{space 3}0.000{col 54}{space 4}-.0891962{col 67}{space 3}-.0797308
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0000927{col 26}{space 2} 3.88e-06{col 37}{space 1}  -23.89{col 46}{space 3}0.000{col 54}{space 4}-.0001004{col 67}{space 3}-.0000851
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0192626{col 26}{space 2} .0011439{col 37}{space 1}   16.84{col 46}{space 3}0.000{col 54}{space 4} .0170207{col 67}{space 3} .0215045
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0141909{col 26}{space 2} .0018382{col 37}{space 1}   -7.72{col 46}{space 3}0.000{col 54}{space 4}-.0177937{col 67}{space 3}-.0105881
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0002279{col 26}{space 2} .0015623{col 37}{space 1}   -0.15{col 46}{space 3}0.884{col 54}{space 4}  -.00329{col 67}{space 3} .0028341
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0359563{col 26}{space 2} .0030598{col 37}{space 1}  -11.75{col 46}{space 3}0.000{col 54}{space 4}-.0419534{col 67}{space 3}-.0299592
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}  .001529{col 26}{space 2} .0033917{col 37}{space 1}    0.45{col 46}{space 3}0.652{col 54}{space 4}-.0051187{col 67}{space 3} .0081767
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0247724{col 26}{space 2} .0013293{col 37}{space 1}  -18.64{col 46}{space 3}0.000{col 54}{space 4}-.0273778{col 67}{space 3}-.0221671
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0239961{col 26}{space 2} .0029733{col 37}{space 1}   -8.07{col 46}{space 3}0.000{col 54}{space 4}-.0298237{col 67}{space 3}-.0181684
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}  .027357{col 26}{space 2} .0029681{col 37}{space 1}    9.22{col 46}{space 3}0.000{col 54}{space 4} .0215397{col 67}{space 3} .0331743
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0560808{col 26}{space 2} .0022365{col 37}{space 1}  -25.08{col 46}{space 3}0.000{col 54}{space 4}-.0604642{col 67}{space 3}-.0516973
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0520111{col 26}{space 2} .0022031{col 37}{space 1}  -23.61{col 46}{space 3}0.000{col 54}{space 4}-.0563291{col 67}{space 3}-.0476932
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0528285{col 26}{space 2} .0023516{col 37}{space 1}  -22.46{col 46}{space 3}0.000{col 54}{space 4}-.0574375{col 67}{space 3}-.0482194
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0264511{col 26}{space 2} .0028603{col 37}{space 1}   -9.25{col 46}{space 3}0.000{col 54}{space 4}-.0320573{col 67}{space 3} -.020845
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0396963{col 26}{space 2} .0011575{col 37}{space 1}  -34.30{col 46}{space 3}0.000{col 54}{space 4} -.041965{col 67}{space 3}-.0374277
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0375631{col 26}{space 2} .0011819{col 37}{space 1}  -31.78{col 46}{space 3}0.000{col 54}{space 4}-.0398797{col 67}{space 3}-.0352465
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0308677{col 26}{space 2} .0012347{col 37}{space 1}  -25.00{col 46}{space 3}0.000{col 54}{space 4}-.0332877{col 67}{space 3}-.0284478
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0308318{col 26}{space 2} .0012317{col 37}{space 1}  -25.03{col 46}{space 3}0.000{col 54}{space 4}-.0332459{col 67}{space 3}-.0284176
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0099324{col 26}{space 2} .0005389{col 37}{space 1}   18.43{col 46}{space 3}0.000{col 54}{space 4} .0088761{col 67}{space 3} .0109887
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0096348{col 26}{space 2} .0004985{col 37}{space 1}   19.33{col 46}{space 3}0.000{col 54}{space 4} .0086579{col 67}{space 3} .0106118
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0082242{col 26}{space 2} .0004987{col 37}{space 1}   16.49{col 46}{space 3}0.000{col 54}{space 4} .0072467{col 67}{space 3} .0092017
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .003547{col 26}{space 2} .0008086{col 37}{space 1}    4.39{col 46}{space 3}0.000{col 54}{space 4} .0019622{col 67}{space 3} .0051319
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0628007{col 26}{space 2} .0022266{col 37}{space 1}  -28.20{col 46}{space 3}0.000{col 54}{space 4}-.0671649{col 67}{space 3}-.0584365
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0650504{col 26}{space 2} .0022895{col 37}{space 1}  -28.41{col 46}{space 3}0.000{col 54}{space 4}-.0695377{col 67}{space 3} -.060563
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0601655{col 26}{space 2} .0024199{col 37}{space 1}  -24.86{col 46}{space 3}0.000{col 54}{space 4}-.0649084{col 67}{space 3}-.0554226
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0491914{col 26}{space 2} .0028922{col 37}{space 1}  -17.01{col 46}{space 3}0.000{col 54}{space 4}-.0548601{col 67}{space 3}-.0435228
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0333052{col 26}{space 2} .0014606{col 37}{space 1}  -22.80{col 46}{space 3}0.000{col 54}{space 4}-.0361679{col 67}{space 3}-.0304424
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0351463{col 26}{space 2} .0014407{col 37}{space 1}  -24.39{col 46}{space 3}0.000{col 54}{space 4}-.0379701{col 67}{space 3}-.0323225
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0252764{col 26}{space 2}  .001515{col 37}{space 1}  -16.68{col 46}{space 3}0.000{col 54}{space 4}-.0282458{col 67}{space 3} -.022307
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0337687{col 26}{space 2} .0011968{col 37}{space 1}  -28.22{col 46}{space 3}0.000{col 54}{space 4}-.0361143{col 67}{space 3} -.031423
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0108704{col 26}{space 2} .0006041{col 37}{space 1}   17.99{col 46}{space 3}0.000{col 54}{space 4} .0096864{col 67}{space 3} .0120545
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0118702{col 26}{space 2} .0006476{col 37}{space 1}   18.33{col 46}{space 3}0.000{col 54}{space 4}  .010601{col 67}{space 3} .0131395
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0083405{col 26}{space 2} .0006521{col 37}{space 1}   12.79{col 46}{space 3}0.000{col 54}{space 4} .0070624{col 67}{space 3} .0096186
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .000866{col 26}{space 2} .0007994{col 37}{space 1}    1.08{col 46}{space 3}0.279{col 54}{space 4}-.0007008{col 67}{space 3} .0024329
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.020533{col 26}{space 2} .0237956{col 37}{space 1}   42.89{col 46}{space 3}0.000{col 54}{space 4} .9738944{col 67}{space 3} 1.067172
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr_2year.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46820148 .09666669 .45811372 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0087166298   .8082492216          3571{txt}  {c |}
  2 {c |}  {res}.0080523485   .7582762279          2319{txt}  {c |}
  3 {c |}  {res}.0073546703   .7120875084          1117{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0087166298{txt}  {c |}
  2 {c |}  {res}.0080523485{txt}  {c |}
  3 {c |}  {res}.0080523485{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,536
                                                {txt}F(1, 1276)        =  {res} 32134.76
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0353
                                                {txt}Root MSE          =    {res} .45985

{txt}{ralign 78:(Std. err. adjusted for {res:1,277} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_2y~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.003964{col 26}{space 2} .0056006{col 37}{space 1}  179.26{col 46}{space 3}0.000{col 54}{space 4} .9929771{col 67}{space 3} 1.014952
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0011436{col 26}{space 2} .0002712{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.0016756{col 67}{space 3}-.0006115
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling.ster} saved
{res}
{txt}Linear regression                               Number of obs     = {res}   698,536
                                                {txt}F(1, 1276)        =  {res}   659.93
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0028
                                                {txt}Root MSE          =    {res} .03066

{txt}{ralign 78:(Std. err. adjusted for {res:1,277} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_2y~d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} .0182879{col 26}{space 2} .0007119{col 37}{space 1}   25.69{col 46}{space 3}0.000{col 54}{space 4} .0168913{col 67}{space 3} .0196845
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.000021{col 26}{space 2} .0000591{col 37}{space 1}   -0.36{col 46}{space 3}0.722{col 54}{space 4}-.0001371{col 67}{space 3}  .000095
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_enr_2year_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/fb_test_va_cfr_g11_enr_2year_sibling.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outcome_va/va_g11_enr_2year_sibling.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_va/va_g11_enr_2year_sibling.dta{rm}
saved
{p_end}
(Enrollment Outcome Grade 11 VA Sample)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,398
{txt}{hline 13}{c +}{hline 34}   F(36, 700361)   = {res}  6092.31
{txt}       Model {c |} {res} 38143.3552        36  1059.53765   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 121802.571   700,361  .173913984   {txt}R-squared       ={res}    0.2385
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2384
{txt}       Total {c |} {res} 159945.927   700,397  .228364666   {txt}Root MSE        =   {res} .41703

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0181949{col 26}{space 2} .0019654{col 37}{space 1}    9.26{col 46}{space 3}0.000{col 54}{space 4} .0143427{col 67}{space 3}  .022047
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0201945{col 26}{space 2} .0019746{col 37}{space 1}   10.23{col 46}{space 3}0.000{col 54}{space 4} .0163244{col 67}{space 3} .0240647
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0192693{col 26}{space 2} .0019756{col 37}{space 1}   -9.75{col 46}{space 3}0.000{col 54}{space 4}-.0231414{col 67}{space 3}-.0153972
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000808{col 26}{space 2} 3.46e-06{col 37}{space 1}  -23.38{col 46}{space 3}0.000{col 54}{space 4}-.0000876{col 67}{space 3}-.0000741
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0887826{col 26}{space 2} .0010188{col 37}{space 1}  -87.14{col 46}{space 3}0.000{col 54}{space 4}-.0907796{col 67}{space 3}-.0867857
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0774704{col 26}{space 2} .0016364{col 37}{space 1}   47.34{col 46}{space 3}0.000{col 54}{space 4} .0742631{col 67}{space 3} .0806777
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0177589{col 26}{space 2} .0013912{col 37}{space 1}  -12.77{col 46}{space 3}0.000{col 54}{space 4}-.0204856{col 67}{space 3}-.0150323
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0449527{col 26}{space 2} .0027254{col 37}{space 1}   16.49{col 46}{space 3}0.000{col 54}{space 4} .0396111{col 67}{space 3} .0502944
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0127408{col 26}{space 2}  .003021{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.0186618{col 67}{space 3}-.0068198
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0433508{col 26}{space 2} .0011838{col 37}{space 1}  -36.62{col 46}{space 3}0.000{col 54}{space 4}-.0456709{col 67}{space 3}-.0410307
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2} -.020777{col 26}{space 2} .0026484{col 37}{space 1}   -7.85{col 46}{space 3}0.000{col 54}{space 4}-.0259677{col 67}{space 3}-.0155863
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0444847{col 26}{space 2} .0026436{col 37}{space 1}  -16.83{col 46}{space 3}0.000{col 54}{space 4} -.049666{col 67}{space 3}-.0393033
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1404783{col 26}{space 2} .0019919{col 37}{space 1}   70.52{col 46}{space 3}0.000{col 54}{space 4} .1365742{col 67}{space 3} .1443825
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1263937{col 26}{space 2} .0019621{col 37}{space 1}   64.42{col 46}{space 3}0.000{col 54}{space 4}  .122548{col 67}{space 3} .1302394
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1254687{col 26}{space 2} .0020943{col 37}{space 1}   59.91{col 46}{space 3}0.000{col 54}{space 4} .1213639{col 67}{space 3} .1295734
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0996749{col 26}{space 2} .0025476{col 37}{space 1}   39.12{col 46}{space 3}0.000{col 54}{space 4} .0946817{col 67}{space 3} .1046681
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0239258{col 26}{space 2} .0010309{col 37}{space 1}   23.21{col 46}{space 3}0.000{col 54}{space 4} .0219052{col 67}{space 3} .0259465
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0174717{col 26}{space 2} .0010527{col 37}{space 1}   16.60{col 46}{space 3}0.000{col 54}{space 4} .0154084{col 67}{space 3}  .019535
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0190068{col 26}{space 2} .0010997{col 37}{space 1}   17.28{col 46}{space 3}0.000{col 54}{space 4} .0168514{col 67}{space 3} .0211622
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0189361{col 26}{space 2} .0010971{col 37}{space 1}   17.26{col 46}{space 3}0.000{col 54}{space 4} .0167859{col 67}{space 3} .0210864
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0114283{col 26}{space 2}   .00048{col 37}{space 1}  -23.81{col 46}{space 3}0.000{col 54}{space 4}-.0123691{col 67}{space 3}-.0104874
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0090299{col 26}{space 2}  .000444{col 37}{space 1}  -20.34{col 46}{space 3}0.000{col 54}{space 4}-.0099001{col 67}{space 3}-.0081597
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0100688{col 26}{space 2} .0004442{col 37}{space 1}  -22.67{col 46}{space 3}0.000{col 54}{space 4}-.0109395{col 67}{space 3}-.0091981
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0086889{col 26}{space 2} .0007202{col 37}{space 1}  -12.06{col 46}{space 3}0.000{col 54}{space 4}-.0101005{col 67}{space 3}-.0072773
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .122721{col 26}{space 2} .0019831{col 37}{space 1}   61.88{col 46}{space 3}0.000{col 54}{space 4} .1188342{col 67}{space 3} .1266078
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1286833{col 26}{space 2}  .002039{col 37}{space 1}   63.11{col 46}{space 3}0.000{col 54}{space 4}  .124687{col 67}{space 3} .1326796
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1232358{col 26}{space 2} .0021551{col 37}{space 1}   57.18{col 46}{space 3}0.000{col 54}{space 4} .1190118{col 67}{space 3} .1274598
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1409681{col 26}{space 2} .0025758{col 37}{space 1}   54.73{col 46}{space 3}0.000{col 54}{space 4} .1359196{col 67}{space 3} .1460165
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0188623{col 26}{space 2} .0013009{col 37}{space 1}   14.50{col 46}{space 3}0.000{col 54}{space 4} .0163125{col 67}{space 3} .0214121
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0189068{col 26}{space 2} .0012833{col 37}{space 1}   14.73{col 46}{space 3}0.000{col 54}{space 4} .0163917{col 67}{space 3}  .021422
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0138209{col 26}{space 2} .0013494{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0111761{col 67}{space 3} .0164658
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0334613{col 26}{space 2} .0010659{col 37}{space 1}   31.39{col 46}{space 3}0.000{col 54}{space 4} .0313722{col 67}{space 3} .0355505
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0104303{col 26}{space 2} .0005381{col 37}{space 1}  -19.38{col 46}{space 3}0.000{col 54}{space 4} -.011485{col 67}{space 3}-.0093757
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0108477{col 26}{space 2} .0005768{col 37}{space 1}  -18.81{col 46}{space 3}0.000{col 54}{space 4}-.0119782{col 67}{space 3}-.0097171
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0089462{col 26}{space 2} .0005808{col 37}{space 1}  -15.40{col 46}{space 3}0.000{col 54}{space 4}-.0100846{col 67}{space 3}-.0078078
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0086293{col 26}{space 2}  .000712{col 37}{space 1}  -12.12{col 46}{space 3}0.000{col 54}{space 4}-.0100249{col 67}{space 3}-.0072337
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .8335325{col 26}{space 2} .0211836{col 37}{space 1}   39.35{col 46}{space 3}0.000{col 54}{space 4} .7920133{col 67}{space 3} .8750517
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr_4year_nosibctrl.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41702996 .08807319 .40762372 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0073188689   .8201082302          3571{txt}  {c |}
  2 {c |}  {res}.0070452477   .8049253272          2319{txt}  {c |}
  3 {c |}  {res} .006544451   .7734469672          1117{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0073188689{txt}  {c |}
  2 {c |}  {res}.0070452477{txt}  {c |}
  3 {c |}  {res}.0070452477{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,536
                                                {txt}F(1, 1276)        =  {res} 36172.37
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0377
                                                {txt}Root MSE          =    {res} .40916

{txt}{ralign 78:(Std. err. adjusted for {res:1,277} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_4y~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.015877{col 26}{space 2} .0053414{col 37}{space 1}  190.19{col 46}{space 3}0.000{col 54}{space 4} 1.005398{col 67}{space 3} 1.026356
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.000188{col 26}{space 2} .0001867{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-.0005542{col 67}{space 3} .0001783
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster} saved
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,398
{txt}{hline 13}{c +}{hline 34}   F(38, 700359)   = {res}  5976.92
{txt}       Model {c |} {res} 39167.7741        38   1030.7309   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 120778.153   700,359  .172451775   {txt}R-squared       ={res}    0.2449
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2448
{txt}       Total {c |} {res} 159945.927   700,397  .228364666   {txt}Root MSE        =   {res} .41527

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0178996{col 26}{space 2} .0019573{col 37}{space 1}    9.15{col 46}{space 3}0.000{col 54}{space 4} .0140634{col 67}{space 3} .0217358
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0193714{col 26}{space 2} .0019669{col 37}{space 1}    9.85{col 46}{space 3}0.000{col 54}{space 4} .0155164{col 67}{space 3} .0232264
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0196886{col 26}{space 2} .0019687{col 37}{space 1}  -10.00{col 46}{space 3}0.000{col 54}{space 4}-.0235472{col 67}{space 3}-.0158301
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0760504{col 26}{space 2}  .001953{col 37}{space 1}  -38.94{col 46}{space 3}0.000{col 54}{space 4}-.0798781{col 67}{space 3}-.0722227
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .1473775{col 26}{space 2} .0021417{col 37}{space 1}   68.81{col 46}{space 3}0.000{col 54}{space 4} .1431798{col 67}{space 3} .1515751
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0000787{col 26}{space 2} 3.44e-06{col 37}{space 1}  -22.86{col 46}{space 3}0.000{col 54}{space 4}-.0000855{col 67}{space 3} -.000072
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0888917{col 26}{space 2} .0010146{col 37}{space 1}  -87.62{col 46}{space 3}0.000{col 54}{space 4}-.0908802{col 67}{space 3}-.0869032
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0759963{col 26}{space 2} .0016304{col 37}{space 1}   46.61{col 46}{space 3}0.000{col 54}{space 4} .0728007{col 67}{space 3} .0791918
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0155359{col 26}{space 2} .0013857{col 37}{space 1}  -11.21{col 46}{space 3}0.000{col 54}{space 4}-.0182518{col 67}{space 3}  -.01282
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0450976{col 26}{space 2} .0027139{col 37}{space 1}   16.62{col 46}{space 3}0.000{col 54}{space 4} .0397784{col 67}{space 3} .0504167
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0114877{col 26}{space 2} .0030083{col 37}{space 1}   -3.82{col 46}{space 3}0.000{col 54}{space 4}-.0173839{col 67}{space 3}-.0055915
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0432811{col 26}{space 2}  .001179{col 37}{space 1}  -36.71{col 46}{space 3}0.000{col 54}{space 4}-.0455919{col 67}{space 3}-.0409703
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0202949{col 26}{space 2} .0026372{col 37}{space 1}   -7.70{col 46}{space 3}0.000{col 54}{space 4}-.0254638{col 67}{space 3}-.0151261
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0441392{col 26}{space 2} .0026325{col 37}{space 1}  -16.77{col 46}{space 3}0.000{col 54}{space 4}-.0492989{col 67}{space 3}-.0389795
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1391393{col 26}{space 2} .0019837{col 37}{space 1}   70.14{col 46}{space 3}0.000{col 54}{space 4} .1352514{col 67}{space 3} .1430272
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .125044{col 26}{space 2}  .001954{col 37}{space 1}   63.99{col 46}{space 3}0.000{col 54}{space 4} .1212142{col 67}{space 3} .1288739
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .123941{col 26}{space 2} .0020858{col 37}{space 1}   59.42{col 46}{space 3}0.000{col 54}{space 4}  .119853{col 67}{space 3} .1280291
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0978319{col 26}{space 2}  .002537{col 37}{space 1}   38.56{col 46}{space 3}0.000{col 54}{space 4} .0928595{col 67}{space 3} .1028043
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0237544{col 26}{space 2} .0010266{col 37}{space 1}   23.14{col 46}{space 3}0.000{col 54}{space 4} .0217423{col 67}{space 3} .0257666
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0173222{col 26}{space 2} .0010483{col 37}{space 1}   16.52{col 46}{space 3}0.000{col 54}{space 4} .0152675{col 67}{space 3} .0193768
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0189949{col 26}{space 2} .0010951{col 37}{space 1}   17.35{col 46}{space 3}0.000{col 54}{space 4} .0168485{col 67}{space 3} .0211413
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0189834{col 26}{space 2} .0010925{col 37}{space 1}   17.38{col 46}{space 3}0.000{col 54}{space 4} .0168422{col 67}{space 3} .0211247
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0112495{col 26}{space 2}  .000478{col 37}{space 1}  -23.53{col 46}{space 3}0.000{col 54}{space 4}-.0121864{col 67}{space 3}-.0103126
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0088782{col 26}{space 2} .0004421{col 37}{space 1}  -20.08{col 46}{space 3}0.000{col 54}{space 4}-.0097448{col 67}{space 3}-.0080117
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0099271{col 26}{space 2} .0004424{col 37}{space 1}  -22.44{col 46}{space 3}0.000{col 54}{space 4}-.0107941{col 67}{space 3}  -.00906
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0084121{col 26}{space 2} .0007172{col 37}{space 1}  -11.73{col 46}{space 3}0.000{col 54}{space 4}-.0098178{col 67}{space 3}-.0070064
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1207353{col 26}{space 2} .0019749{col 37}{space 1}   61.13{col 46}{space 3}0.000{col 54}{space 4} .1168645{col 67}{space 3} .1246061
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1262357{col 26}{space 2} .0020307{col 37}{space 1}   62.16{col 46}{space 3}0.000{col 54}{space 4} .1222556{col 67}{space 3} .1302157
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1207111{col 26}{space 2} .0021463{col 37}{space 1}   56.24{col 46}{space 3}0.000{col 54}{space 4} .1165043{col 67}{space 3} .1249178
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1379003{col 26}{space 2} .0025653{col 37}{space 1}   53.76{col 46}{space 3}0.000{col 54}{space 4} .1328724{col 67}{space 3} .1429281
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0186991{col 26}{space 2} .0012955{col 37}{space 1}   14.43{col 46}{space 3}0.000{col 54}{space 4}   .01616{col 67}{space 3} .0212382
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0186402{col 26}{space 2} .0012779{col 37}{space 1}   14.59{col 46}{space 3}0.000{col 54}{space 4} .0161356{col 67}{space 3} .0211448
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0136883{col 26}{space 2} .0013438{col 37}{space 1}   10.19{col 46}{space 3}0.000{col 54}{space 4} .0110546{col 67}{space 3} .0163221
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0329842{col 26}{space 2} .0010615{col 37}{space 1}   31.07{col 46}{space 3}0.000{col 54}{space 4} .0309037{col 67}{space 3} .0350647
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0102396{col 26}{space 2} .0005358{col 37}{space 1}  -19.11{col 46}{space 3}0.000{col 54}{space 4}-.0112898{col 67}{space 3}-.0091894
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106036{col 26}{space 2} .0005744{col 37}{space 1}  -18.46{col 46}{space 3}0.000{col 54}{space 4}-.0117294{col 67}{space 3}-.0094778
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0087627{col 26}{space 2} .0005784{col 37}{space 1}  -15.15{col 46}{space 3}0.000{col 54}{space 4}-.0098963{col 67}{space 3}-.0076291
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0082819{col 26}{space 2} .0007091{col 37}{space 1}  -11.68{col 46}{space 3}0.000{col 54}{space 4}-.0096716{col 67}{space 3}-.0068921
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .8176753{col 26}{space 2} .0211056{col 37}{space 1}   38.74{col 46}{space 3}0.000{col 54}{space 4} .7763091{col 67}{space 3} .8590415
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr_4year.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41527313 .08609161 .40625117 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .006985064   .8147183159          3571{txt}  {c |}
  2 {c |}  {res}.0067035401    .798030138          2319{txt}  {c |}
  3 {c |}  {res}.0061998612   .7651471305          1117{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .006985064{txt}  {c |}
  2 {c |}  {res}.0067035401{txt}  {c |}
  3 {c |}  {res}.0067035401{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,536
                                                {txt}F(1, 1276)        =  {res} 33553.28
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0361
                                                {txt}Root MSE          =    {res} .40777

{txt}{ralign 78:(Std. err. adjusted for {res:1,277} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_4y~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.016357{col 26}{space 2} .0055485{col 37}{space 1}  183.18{col 46}{space 3}0.000{col 54}{space 4} 1.005472{col 67}{space 3} 1.027243
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001714{col 26}{space 2} .0001888{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4}-.0005418{col 67}{space 3} .0001991
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling.ster} saved
{res}
{txt}Linear regression                               Number of obs     = {res}   698,536
                                                {txt}F(1, 1276)        =  {res}   630.28
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0026
                                                {txt}Root MSE          =    {res}  .0382

{txt}{ralign 78:(Std. err. adjusted for {res:1,277} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_4y~d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} .0245096{col 26}{space 2} .0009763{col 37}{space 1}   25.11{col 46}{space 3}0.000{col 54}{space 4} .0225943{col 67}{space 3} .0264249
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000107{col 26}{space 2} .0000777{col 37}{space 1}   -0.14{col 46}{space 3}0.890{col 54}{space 4}-.0001631{col 67}{space 3} .0001416
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_enr_4year_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/fb_test_va_cfr_g11_enr_4year_sibling.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outcome_va/va_g11_enr_4year_sibling.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_va/va_g11_enr_4year_sibling.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:     56.21 /        1 =      56.2090
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling_out.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Jul 2022, 21:48:45
{txt}{.-}
{smcl}
{txt}{sf}{ul off}