-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_est_sumstats.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 22:33:52

. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative fil
> e paths  */
. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;

. local acs_str
>         "Original + Census"
>         ;

. local sib_str
>         "Original + Sibling"
>         ;

. local both_str
>         "Original + Census + Sibling"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. macro list
T_gm_fix_span:  0
S_4:            .0020413479904597
S_2:            300
S_3:            .0136102212476191
S_1:            epanechnikov
S_6:            .7098361624622439
S_5:            4
ReS_jv2:        __000006 __000007 __000008 __000009 __00000A __00000B __00000C
                __00000D __00000E __00000F __00000G __00000H __00000I __00000J
                __00000K
dropv:          _cdscode_x
n_offset:       0
sort:           0
dots:           nois _dots 5 0
dotss:          nois _dots 0, title(Survey results being calculated)
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_both_str:      Original + Census + Sibling
_sib_str:       Original + Sibling
_acs_str:       Original + Census
_og_str:        Original Specification
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. //startomg timer
. timer on 1

. 
. 
. *****************************************************************************
> ***
. * begin main code
. 
. 
. // merge original sample VA estimates with restricted sample VA estimates
. 
. foreach subject in ela math {
  2.   use $vaprojdir/data/sbac/va_g11_`subject'.dta, clear
  3.   sort school_id year
  4. 
.   tempfile va_`subject'_original
  5.   save `va_`subject'_original'
  6. }
(CST/SBAC Student Test Score Samples)
file /home/tmp/St35924.000001 saved as .dta format
(CST/SBAC Student Test Score Samples)
file /home/tmp/St35924.000002 saved as .dta format

. 
. // merge the original ELA and Math VA estimates
. use `va_ela_original'
(CST/SBAC Student Test Score Samples)

. merge 1:1 cdscode year using `va_math_original', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                            14
        from master                         9  
        from using                          5  

    Matched                             4,954  
    -----------------------------------------

. 
. keep cdscode year va_cfr_g11_*

. 
. 
. // merge on the sibling census restricted sample VA estimates
. foreach subject in ela math {
  2.   merge 1:1 cdscode year using ///
>    $vaprojdir/data/sib_acs_restr_smp/test_score_va/va_`subject'_sib_acs.dta /
> //
>    , nogen
  3. 
.   keep cdscode year va*
  4. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                           166
        from master                       166  
        from using                          0  

    Matched                             4,802  
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                           177
        from master                       177  
        from using                          0  

    Matched                             4,791  
    -----------------------------------------

. 
. // create local macros for correlation coefficients
. foreach subject in ela math {
  2.   corr va_cfr_g11_`subject' va_`subject'_og
  3.   // naming convention: correlation between original sample and restricted
>  sample with og controls
.   local corr_`subject'_original_restr_og : di %5.3f r(rho)
  4. 
.   corr va_cfr_g11_`subject' va_`subject'_both
  5.   local corr_`subject'_original_restr_both : di %5.3f r(rho)
  6. 
.   corr va_`subject'_og va_`subject'_both
  7.   local corr_`subject'_restr_og_both : di %5.3f r(rho)
  8. }
(obs=4,701)

             | va_cfr~a va_ela~g
-------------+------------------
va_cfr_g11~a |   1.0000
   va_ela_og |   0.9207   1.0000

(obs=4,701)

             | va_cfr~a va_ela~h
-------------+------------------
va_cfr_g11~a |   1.0000
 va_ela_both |   0.9181   1.0000

(obs=4,701)

             | va_ela~g va_ela~h
-------------+------------------
   va_ela_og |   1.0000
 va_ela_both |   0.9965   1.0000

(obs=4,690)

             | va_cfr~h va_mat~g
-------------+------------------
va_cfr_g11~h |   1.0000
  va_math_og |   0.9013   1.0000

(obs=4,690)

             | va_cfr~h va_mat~h
-------------+------------------
va_cfr_g11~h |   1.0000
va_math_both |   0.8871   1.0000

(obs=4,690)

             | va_mat~g va_mat~h
-------------+------------------
  va_math_og |   1.0000
va_math_both |   0.9867   1.0000


. 
. 
. ********** 1) Original sample, og controls vs. Restricted sample, og controls
. 
. foreach subject in ela math {
  2.   ***** correlation plot
.   twoway ///
>     (scatter va_cfr_g11_`subject' va_`subject'_og) ///
>     (lfit va_cfr_g11_`subject' va_`subject'_og ) ///
>     (function y = x, range(va_cfr_g11_`subject')) ///
>     , ytitle("``subject'_str' VA from Original Sample", size(small)) ///
>     xtitle("``subject'_str' VA from Restricted Sample with `og_str' Controls"
> , size(small)) ///
>     title("Comparison Scatter Plot of ``subject'_str' VA", size(small)) ///
>     legend(label(1 "``subject'_str' VA") label(3 "45 degree line") ) ///
>     note("Correlation Coefficient = `corr_`subject'_original_restr_og' ")
  3. 
.   graph export $vaprojdir/figures/va_sib_acs/va_compare_sib_acs_restr_smp/cor
> r_va_`subject'_original_restr_og.pdf, replace
  4.   graph export $projdir/out/graph/siblingvaregs/test_score_va/va_compare_s
> ib_acs_restr_smp/corr_va_`subject'_original_restr_og.pdf, replace
  5. 
.   ***** difference density plot
.   gen va_`subject'_original_restr_og_diff = va_`subject'_og - va_cfr_g11_`sub
> ject'
  6. 
.   twoway ///
>     (hist va_`subject'_original_restr_og_diff, frequency color(navy)) ///
>     , ytitle("Frequency") xtitle("Difference") ///
>     title("``subject'_str' VA Difference between Original Sample and Restrict
> ed Sample with `og_str' Controls", size(vsmall))
  7. 
.   graph export $vaprojdir/figures/va_sib_acs/va_compare_sib_acs_restr_smp/his
> t_diff_va_`subject'_original_restr_og.pdf, replace
  8.   graph export $projdir/out/graph/siblingvaregs/test_score_va/va_compare_s
> ib_acs_restr_smp/hist_diff_va_`subject'_original_restr_og.pdf, replace
  9. }
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/corr_va_ela_original_restr_og.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/corr_va_ela_original_restr_
    > og.pdf saved as PDF format
(267 missing values generated)
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/hist_diff_va_ela_original_restr_og.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/hist_diff_va_ela_original_r
    > estr_og.pdf saved as PDF format
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/corr_va_math_original_restr_og.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/corr_va_math_original_restr
    > _og.pdf saved as PDF format
(278 missing values generated)
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/hist_diff_va_math_original_restr_og.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/hist_diff_va_math_original_
    > restr_og.pdf saved as PDF format

. 
. 
. ********** 2) Original sample, og controls vs. Restricted sample, both sib an
> d census controls
. 
. foreach subject in ela math {
  2.   ***** correlation plot
.   twoway ///
>     (scatter va_cfr_g11_`subject' va_`subject'_both) ///
>     (lfit va_cfr_g11_`subject' va_`subject'_both ) ///
>     (function y = x, range(va_cfr_g11_`subject')) ///
>     , ytitle("``subject'_str' VA from Original Sample", size(small)) ///
>     xtitle("``subject'_str' VA from Restricted Sample with `both_str' Control
> s", size(small)) ///
>     title("Comparison Scatter Plot of ``subject'_str' VA", size(small)) ///
>     legend(label(1 "``subject'_str' VA") label(3 "45 degree line") ) ///
>     note("Correlation Coefficient = `corr_`subject'_original_restr_both' ")
  3. 
.   graph export $vaprojdir/figures/va_sib_acs/va_compare_sib_acs_restr_smp/cor
> r_va_`subject'_original_restr_both.pdf, replace
  4.   graph export $projdir/out/graph/siblingvaregs/test_score_va/va_compare_s
> ib_acs_restr_smp/corr_va_`subject'_original_restr_both.pdf, replace
  5. 
.   ***** difference density plot
.   gen va_`subject'_original_restr_both_diff = va_`subject'_both - va_cfr_g11_
> `subject'
  6. 
.   twoway ///
>     (hist va_`subject'_original_restr_both_diff, frequency color(navy)) ///
>     , ytitle("Frequency") xtitle("Difference") ///
>     title("``subject'_str' VA Difference between Original Sample and Restrict
> ed Sample with `both_str' Controls", size(vsmall))
  7. 
.   graph export $vaprojdir/figures/va_sib_acs/va_compare_sib_acs_restr_smp/his
> t_diff_va_`subject'_original_restr_both.pdf, replace
  8.   graph export $projdir/out/graph/siblingvaregs/test_score_va/va_compare_s
> ib_acs_restr_smp/hist_diff_va_`subject'_original_restr_both.pdf, replace
  9. }
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/corr_va_ela_original_restr_both.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/corr_va_ela_original_restr_
    > both.pdf saved as PDF format
(267 missing values generated)
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/hist_diff_va_ela_original_restr_both.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/hist_diff_va_ela_original_r
    > estr_both.pdf saved as PDF format
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/corr_va_math_original_restr_both.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/corr_va_math_original_restr
    > _both.pdf saved as PDF format
(278 missing values generated)
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/hist_diff_va_math_original_restr_both.pdf saved
    as PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/hist_diff_va_math_original_
    > restr_both.pdf saved as PDF format

. 
. 
. 
. 
. ********** 3) Restricted sample, og controls vs. Restricted sample, both sib 
> and census controls
. foreach subject in ela math {
  2.   ***** correlation plot
.   twoway ///
>     (scatter va_`subject'_og va_`subject'_both) ///
>     (lfit va_`subject'_og va_`subject'_both ) ///
>     (function y = x, range(va_`subject'_og)) ///
>     , ytitle("``subject'_str' VA from Restricted Sample with `og_str' Control
> s", size(small)) ///
>     xtitle("``subject'_str' VA from Restricted Sample with `both_str' Control
> s", size(small)) ///
>     title("Comparison Scatter Plot of ``subject'_str' VA", size(small)) ///
>     legend(label(1 "``subject'_str' VA") label(3 "45 degree line") ) ///
>     note("Correlation Coefficient = `corr_`subject'_restr_og_both' ")
  3. 
.   graph export $vaprojdir/figures/va_sib_acs/va_compare_sib_acs_restr_smp/cor
> r_va_`subject'_restr_og_both.pdf, replace
  4.   graph export $projdir/out/graph/siblingvaregs/test_score_va/va_compare_s
> ib_acs_restr_smp/corr_va_`subject'_restr_og_both.pdf, replace
  5. 
.   ***** difference density plot
.   gen va_`subject'_restr_og_both_diff = va_`subject'_both - va_`subject'_og
  6. 
.   twoway ///
>     (hist va_`subject'_restr_og_both_diff, frequency color(navy)) ///
>     , ytitle("Frequency") xtitle("Difference") ///
>     title("``subject'_str' VA Difference between Restricted Sample with `og_s
> tr' Controls and with `both_str' Controls", size(vsmall))
  7. 
.   graph export $vaprojdir/figures/va_sib_acs/va_compare_sib_acs_restr_smp/his
> t_diff_va_`subject'_restr_og_both.pdf, replace
  8.   graph export $projdir/out/graph/siblingvaregs/test_score_va/va_compare_s
> ib_acs_restr_smp/hist_diff_va_`subject'_restr_og_both.pdf, replace
  9. }
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/corr_va_ela_restr_og_both.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/corr_va_ela_restr_og_both.p
    > df saved as PDF format
(267 missing values generated)
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/hist_diff_va_ela_restr_og_both.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/hist_diff_va_ela_restr_og_b
    > oth.pdf saved as PDF format
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/corr_va_math_restr_og_both.pdf saved as PDF
    format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/corr_va_math_restr_og_both.
    > pdf saved as PDF format
(278 missing values generated)
file
    /home/research/ca_ed_lab/projects/common_core_va/figures/va_sib_acs/va_co
    > mpare_sib_acs_restr_smp/hist_diff_va_math_restr_og_both.pdf saved as
    PDF format
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/siblingvaregs
    > /test_score_va/va_compare_sib_acs_restr_smp/hist_diff_va_math_restr_og_
    > both.pdf saved as PDF format

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. timer list
   1:      6.13 /        1 =       6.1340

. 
. set trace off

. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_est_sumstats.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 22:33:58
-------------------------------------------------------------------------------
