{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs_vam_tab.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 May 2022, 22:32:36
{txt}
{com}. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative file paths  */
. cd $vaprojdir
{res}/home/research/ca_ed_lab/projects/common_core_va
{txt}
{com}. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh
{txt}
{com}. ********************************************************************************
. /* Macros for common core VA project folder file paths, and relevant datasets to make it possible
> to use Matt's doh files  */
. ********************************************************************************
. ********************************************************************************
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"
{txt}
{com}. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"
{txt}
{com}. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"
{txt}
{com}. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"
{txt}
{com}. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"
{txt}
{com}. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"
{txt}
{com}. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecondary_out_merge"
{txt}
{com}. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"
{txt}
{com}. {txt}
{com}. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. macro list
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.003900032715465
{p_end}
{txt}{p 0 16}
S_2:{space 12}{res}{res}300
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.020595561559967
{p_end}
{txt}{p 0 16}
S_1:{space 12}{res}{res}epanechnikov
{p_end}
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}
{com}. 
. //startomg timer
. timer on 1
{txt}
{com}. 
. 
. ********************************************************************************
. * begin main code
. 
. ********** test score VA coefficients table
. foreach subject in ela math {c -(}
{txt}  2{com}.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_og.ster
{txt}  3{com}.   eststo
{txt}  4{com}. 
.   // primary specification without sibling control, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_acs.ster
{txt}  5{com}.   eststo
{txt}  6{com}. 
.   // primary specification with sibling controls, withohut acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_sib.ster
{txt}  7{com}.   eststo
{txt}  8{com}. 
.   // primary specification with sibling and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_both.ster
{txt}  9{com}.   eststo
{txt} 10{com}. {c )-}
{res}{txt}({res}est1{txt} stored)
{res}{txt}({res}est2{txt} stored)
{res}{txt}({res}est3{txt} stored)
{res}{txt}({res}est4{txt} stored)
{res}{txt}({res}est5{txt} stored)
{res}{txt}({res}est6{txt} stored)
{res}{txt}({res}est7{txt} stored)
{res}{txt}({res}est8{txt} stored)

{com}. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/vam/sib_acs_restr_smp/test_score_sib_acs_restr_smp_vam.csv ///
>   , replace nonumbers se(%4.3f) b(%5.3f) ///
>   title("VAM Output for Test Score VA on Sibling Census Restricted Sample") ///
>   mtitles("Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls") ///
>   mgroups("ELA" "Math", pattern(1 0 0 0 1 0 0 0) )
{res}{txt}(output written to {browse  `"/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/siblingvaregs/vam/sib_acs_restr_smp/test_score_sib_acs_restr_smp_vam.csv"'})

{com}. 
. 
.  eststo clear
{txt}
{com}. 
. 
. 
. ********** outcome VA coefficients table
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_og.ster
{txt}  3{com}.   eststo
{txt}  4{com}. 
.   // primary specification without sibling control, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_acs.ster
{txt}  5{com}.   eststo
{txt}  6{com}. 
.   // primary specification with sibling controls, withohut acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_sib.ster
{txt}  7{com}.   eststo
{txt}  8{com}. 
.   // primary specification with sibling and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_both.ster
{txt}  9{com}.   eststo
{txt} 10{com}. {c )-}
{res}{txt}({res}est1{txt} stored)
{res}{txt}({res}est2{txt} stored)
{res}{txt}({res}est3{txt} stored)
{res}{txt}({res}est4{txt} stored)
{res}{txt}({res}est5{txt} stored)
{res}{txt}({res}est6{txt} stored)
{res}{txt}({res}est7{txt} stored)
{res}{txt}({res}est8{txt} stored)
{res}{txt}({res}est9{txt} stored)
{res}{txt}({res}est10{txt} stored)
{res}{txt}({res}est11{txt} stored)
{res}{txt}({res}est12{txt} stored)

{com}. 
. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/vam/sib_acs_restr_smp/outcome_sib_acs_restr_smp_vam.csv ///
>   , replace nonumbers se(%4.3f) b(%5.3f) ///
>   title("VAM Output for Outcome VA on Sibling Census Restricted Sample") ///
>   mtitles("Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ) ///
>   mgroups("Overall Enrollment" "2 Year Enrollment" "4 Year Enrollment", pattern(1 0 0 0 1 0 0 0 1 0 0 0) )
{res}{txt}(output written to {browse  `"/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/siblingvaregs/vam/sib_acs_restr_smp/outcome_sib_acs_restr_smp_vam.csv"'})

{com}. 
. eststo clear
{txt}
{com}. 
. 
. 
. ********** outcome deep knowledge VA coefficients
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_og_dk.ster
{txt}  3{com}.   eststo
{txt}  4{com}. 
.   // primary specification without sibling control, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_acs_dk.ster
{txt}  5{com}.   eststo
{txt}  6{com}. 
.   // primary specification with sibling controls, withohut acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_sib_dk.ster
{txt}  7{com}.   eststo
{txt}  8{com}. 
.   // primary specification with sibling and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_both_dk.ster
{txt}  9{com}.   eststo
{txt} 10{com}. {c )-}
{res}{txt}({res}est1{txt} stored)
{res}{txt}({res}est2{txt} stored)
{res}{txt}({res}est3{txt} stored)
{res}{txt}({res}est4{txt} stored)
{res}{txt}({res}est5{txt} stored)
{res}{txt}({res}est6{txt} stored)
{res}{txt}({res}est7{txt} stored)
{res}{txt}({res}est8{txt} stored)
{res}{txt}({res}est9{txt} stored)
{res}{txt}({res}est10{txt} stored)
{res}{txt}({res}est11{txt} stored)
{res}{txt}({res}est12{txt} stored)

{com}. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/vam/sib_acs_restr_smp/outcome_dk_sib_acs_restr_smp_vam.csv ///
>   , replace nonumbers se(%4.3f) b(%5.3f) ///
>   title("VAM Output for Deep Knowledge Outcome VA on Sibling Census Restricted Sample") ///
>   mtitles("Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ) ///
>   mgroups("Overall Enrollment" "2 Year Enrollment" "4 Year Enrollment", pattern(1 0 0 0 1 0 0 0 1 0 0 0) )
{res}{txt}(output written to {browse  `"/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/siblingvaregs/vam/sib_acs_restr_smp/outcome_dk_sib_acs_restr_smp_vam.csv"'})

{com}. 
. eststo clear
{txt}
{com}. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:      1.03 /        1 =       1.0320
{txt}
{com}. 
. set trace off
{txt}
{com}. 
. //change directory back to my own personal directory
. cd $projdir 
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs_vam_tab.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 May 2022, 22:32:37
{txt}{.-}
{smcl}
{txt}{sf}{ul off}