{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling_out.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 May 2022, 22:03:12
{txt}
{com}. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. #delimit ;
{txt}delimiter now ;
{com}. #delimit cr
{txt}delimiter now cr
{com}. macro list
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.003900032715465
{p_end}
{txt}{p 0 16}
S_2:{space 12}{res}{res}300
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.020595561559967
{p_end}
{txt}{p 0 16}
S_1:{space 12}{res}{res}epanechnikov
{p_end}
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}{p 0 16}
_setlimit:{space 6}{res}{res}0
{p_end}
{txt}{p 0 16}
_1:{space 13}{res}{res}0
{p_end}
{txt}{p 0 16}
_0:{space 13}{res}{res}0
{p_end}
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. 
. 
. //load the VA grade 11 college outcomes sample
. use `va_g11_out_dataset', clear
{txt}(Enrollment Outcome Grade 11 VA Sample)

{com}. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk', nogen keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         884,570
{txt}{col 9}from master{col 30}{res}         884,570{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}         900,294{txt}  
{col 5}{hline 41}

{com}. 
. drop if mi(has_older_sibling_enr_2year)
{txt}(884,570 observations deleted)

{com}. drop if mi(has_older_sibling_enr_4year)
{txt}(0 observations deleted)

{com}. 
. compress
  {txt}variable {bf}{res}age{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}major{sf}{txt} was {bf}{res}long{sf}{txt} now {bf}{res}int{sf}
{txt}  (3,601,176 bytes saved)

{com}. tempfile va_g11_out_sibling_dataset
{txt}
{com}. save `va_g11_out_sibling_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St16505.000001{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. ********************************************************************************
. *********** VA estimates for VA samples matched to siblings sample
. ********************************************************************************
. if `setlimit' == 0 {c -(}
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
. {c )-}
{txt}
{com}. else {c -(}
.   local drift_limit = `setlimit'
. {c )-}
{txt}
{com}. 
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   use `va_g11_out_sibling_dataset' if touse_g11_`outcome'==1 & sibling_out_sample == 1, clear
{txt}  3{com}. 
.   ***********************Overall value added
.   **** No Peer Controls
.   ** No TFX
.     ***without sibling college going controls
.     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_cfr_g11_`outcome'_nosibctrl.ster, replace)
{txt}  4{com}. 
.     //rename the first time to make sure indep var names for spec test are all the same
.     rename tv va_cfr_g11_`outcome'
{txt}  5{com}.     rename score_r g11_`outcome'_r
{txt}  6{com}. 
.     **************** Specification Test
.     *************** No Peer Controls
.     ****** sibling sample without sibling controls
.     reg g11_`outcome'_r va_cfr_g11_`outcome', cluster(school_id)
{txt}  7{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`outcome'_sibling_nocontrol.ster, replace
{txt}  8{com}.     //save to va project folder
.     estimates save $vaprojdir/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_`outcome'_sibling_nocontrol.ster, replace
{txt}  9{com}. 
.     //rename again to distinguish between nocontrol and with control va estimates
.     rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl
{txt} 10{com}.     rename g11_`outcome'_r g11_`outcome'_r_nosibctrl
{txt} 11{com}. 
. 
.     *** with sibling controls
.     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/outcome_va/vam_cfr_g11_`outcome'.ster, replace)
{txt} 12{com}.     rename tv va_cfr_g11_`outcome'
{txt} 13{com}.     rename score_r g11_`outcome'_r
{txt} 14{com}. 
.     **************** Specification Test
.     *************** No Peer Controls
.     ****** sibling sample with sibling controls
.     reg g11_`outcome'_r va_cfr_g11_`outcome', cluster(school_id)
{txt} 15{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`outcome'_sibling.ster, replace
{txt} 16{com}.     //save to va project folder
.     estimates save $vaprojdir/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_`outcome'_sibling.ster, replace
{txt} 17{com}. 
. 
. 
. 
. 
. 
. /*
> 
>   ** TFX
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 tfx_resid(school_id) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_tfx_g11_`outcome'
>         drop score_r
> 
>   corr va_cfr_g11_`outcome' va_tfx_g11_`outcome'
> 
>  */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
.   **** Peer Controls
.         ** No TFX
. 
.     /* ***without sibling college going controls
>     vam `outcome' ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv
>     rename score_r
> 
>     //with sibling controls
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                         `peer_demographic_controls' ///
>                         `peer_ela_score_controls' ///
>                         `peer_math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_cfr_g11_`outcome'_peer
>         rename score_r g11_`outcome'_r_peer
> 
>         ** TFX
>         vam `outcome' ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>       i.has_older_sibling_enr_2year ///
>       i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                         `peer_demographic_controls' ///
>                         `peer_ela_score_controls' ///
>                         `peer_math_score_controls' ///
>                 ) ///
>                 tfx_resid(school_id) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
>         rename tv va_tfx_g11_`outcome'_peer
>         drop score_r
> 
>         corr va_cfr_g11_`outcome'_peer va_tfx_g11_`outcome'_peer
>  */
. 
. 
. 
. ********************************************************************************
.   **************** Specification Test
. 
.   /* **** Peer Controls
>   reg g11_`outcome'_r_peer va_cfr_g11_`outcome'_peer, cluster(school_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`outcome'_peer_sibling.ster, replace
> 
>  */
. 
. 
.   *** no peer controls
. 
.   /* *** with peer controls
>   reg g11_`outcome'_r_nosibctrl_peer va_cfr_g11_`outcome'_nosibctrl_peer, cluster(school_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_`outcome'_peer_sibling_nocontrol.ster, replace */
. 
.   **************Do we need deep knowledge VA with sibling controls?? No.
. 
. 
. 
. 
.   ******************************************************************************
.   /* CFR Forecast Bias Test */
.   ***** leave out variable is sibling controls
. 
. 
.   **no peer controls
.   gen g11_`outcome'_r_d = g11_`outcome'_r_nosibctrl - g11_`outcome'_r
{txt} 18{com}. 
.   //var rename gymnastics to make sure the indep var names are all the same when making tables later
.   rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_temp
{txt} 19{com}.   rename va_cfr_g11_`outcome'_nosibctrl va_cfr_g11_`outcome'
{txt} 20{com}. 
.   reg g11_`outcome'_r_d va_cfr_g11_`outcome', cluster(school_id)
{txt} 21{com}.   //save to my personal folder
.   estimates save $projdir/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_`outcome'_sibling.ster, replace
{txt} 22{com}.   //save to va project folder
.   estimates save $vaprojdir/estimates/sibling_va/outcome_va/fb_test_va_cfr_g11_`outcome'_sibling.ster, replace
{txt} 23{com}. 
.   //roll back the rename gymnastics to restore original var names
.   rename va_cfr_g11_`outcome' va_cfr_g11_`outcome'_nosibctrl
{txt} 24{com}.   rename va_cfr_g11_`outcome'_temp va_cfr_g11_`outcome'
{txt} 25{com}. 
. 
.   /* ** with peer controls
>   gen g11_`outcome'_r_d_peer = g11_`outcome'_r_nosibctrl_peer - g11_`outcome'_r_peer
>   reg g11_`outcome'_r_d_peer va_cfr_g11_`outcome'_nosibctrl_peer, cluster(school_id)
>   estimates save $projdir/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_`outcome'_sibling_peer.ster, replace
>  */
. 
. 
. 
.   **************** Save Value Added Estimates
.   collapse (firstnm) va_* ///
>     (mean) g11_`outcome'* ///
>     (sum) n_g11_`outcome' = touse_g11_`outcome' ///
>     , by(school_id cdscode grade year)
{txt} 26{com}.   //save to my personal folder
.   save $projdir/dta/common_core_va/outcome_va/va_g11_`outcome'_sibling.dta, replace
{txt} 27{com}.   //save to VA project folder
.   save $vaprojdir/data/sibling_va/outcome_va/va_g11_`outcome'_sibling.dta, replace
{txt} 28{com}. 
. 
. {c )-}
{txt}(Enrollment Outcome Grade 11 VA Sample)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,442
{txt}{hline 13}{c +}{hline 34}   F(36, 700405)   = {res}  2553.20
{txt}       Model {c |} {res} 16450.0479        36  456.945776   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 125351.434   700,405  .178969931   {txt}R-squared       ={res}    0.1160
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1160
{txt}       Total {c |} {res} 141801.482   700,441  .202446005   {txt}Root MSE        =   {res} .42305

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}  .012467{col 26}{space 2} .0019937{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .0085593{col 67}{space 3} .0163747
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0116016{col 26}{space 2} .0020029{col 37}{space 1}   -5.79{col 46}{space 3}0.000{col 54}{space 4}-.0155271{col 67}{space 3}-.0076761
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0280129{col 26}{space 2} .0020041{col 37}{space 1}  -13.98{col 46}{space 3}0.000{col 54}{space 4}-.0319408{col 67}{space 3}-.0240851
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0001742{col 26}{space 2} 3.51e-06{col 37}{space 1}  -49.67{col 46}{space 3}0.000{col 54}{space 4}-.0001811{col 67}{space 3}-.0001673
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0695852{col 26}{space 2} .0010335{col 37}{space 1}  -67.33{col 46}{space 3}0.000{col 54}{space 4}-.0716108{col 67}{space 3}-.0675595
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0634695{col 26}{space 2}   .00166{col 37}{space 1}   38.23{col 46}{space 3}0.000{col 54}{space 4}  .060216{col 67}{space 3}  .066723
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0159565{col 26}{space 2} .0014112{col 37}{space 1}  -11.31{col 46}{space 3}0.000{col 54}{space 4}-.0187224{col 67}{space 3}-.0131906
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0090534{col 26}{space 2} .0027646{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4} .0036348{col 67}{space 3} .0144719
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0106233{col 26}{space 2} .0030642{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-.0166289{col 67}{space 3}-.0046176
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0674867{col 26}{space 2} .0012008{col 37}{space 1}  -56.20{col 46}{space 3}0.000{col 54}{space 4}-.0698403{col 67}{space 3}-.0651332
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0442539{col 26}{space 2} .0026864{col 37}{space 1}  -16.47{col 46}{space 3}0.000{col 54}{space 4}-.0495192{col 67}{space 3}-.0389886
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0175178{col 26}{space 2} .0026815{col 37}{space 1}   -6.53{col 46}{space 3}0.000{col 54}{space 4}-.0227734{col 67}{space 3}-.0122622
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0830871{col 26}{space 2} .0020208{col 37}{space 1}   41.12{col 46}{space 3}0.000{col 54}{space 4} .0791265{col 67}{space 3} .0870478
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0729283{col 26}{space 2} .0019904{col 37}{space 1}   36.64{col 46}{space 3}0.000{col 54}{space 4} .0690271{col 67}{space 3} .0768295
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0708123{col 26}{space 2} .0021244{col 37}{space 1}   33.33{col 46}{space 3}0.000{col 54}{space 4} .0666485{col 67}{space 3}  .074976
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .071648{col 26}{space 2} .0025843{col 37}{space 1}   27.72{col 46}{space 3}0.000{col 54}{space 4} .0665828{col 67}{space 3} .0767132
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.016037{col 26}{space 2} .0010459{col 37}{space 1}  -15.33{col 46}{space 3}0.000{col 54}{space 4}-.0180869{col 67}{space 3}-.0139871
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0204089{col 26}{space 2} .0010679{col 37}{space 1}  -19.11{col 46}{space 3}0.000{col 54}{space 4} -.022502{col 67}{space 3}-.0183158
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0120672{col 26}{space 2} .0011154{col 37}{space 1}  -10.82{col 46}{space 3}0.000{col 54}{space 4}-.0142533{col 67}{space 3}-.0098812
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0119936{col 26}{space 2} .0011129{col 37}{space 1}  -10.78{col 46}{space 3}0.000{col 54}{space 4}-.0141749{col 67}{space 3}-.0098123
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0013423{col 26}{space 2}  .000487{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4}-.0022968{col 67}{space 3}-.0003879
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0007646{col 26}{space 2} .0004504{col 37}{space 1}    1.70{col 46}{space 3}0.090{col 54}{space 4}-.0001181{col 67}{space 3} .0016473
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0016797{col 26}{space 2} .0004506{col 37}{space 1}   -3.73{col 46}{space 3}0.000{col 54}{space 4}-.0025628{col 67}{space 3}-.0007966
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0049769{col 26}{space 2} .0007306{col 37}{space 1}   -6.81{col 46}{space 3}0.000{col 54}{space 4}-.0064088{col 67}{space 3}-.0035449
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0586995{col 26}{space 2} .0020118{col 37}{space 1}   29.18{col 46}{space 3}0.000{col 54}{space 4} .0547564{col 67}{space 3} .0626426
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0621623{col 26}{space 2} .0020684{col 37}{space 1}   30.05{col 46}{space 3}0.000{col 54}{space 4} .0581083{col 67}{space 3} .0662163
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0614896{col 26}{space 2} .0021861{col 37}{space 1}   28.13{col 46}{space 3}0.000{col 54}{space 4} .0572049{col 67}{space 3} .0657742
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0896876{col 26}{space 2} .0026129{col 37}{space 1}   34.32{col 46}{space 3}0.000{col 54}{space 4} .0845663{col 67}{space 3} .0948089
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0147932{col 26}{space 2} .0013199{col 37}{space 1}  -11.21{col 46}{space 3}0.000{col 54}{space 4}-.0173801{col 67}{space 3}-.0122063
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0165704{col 26}{space 2} .0013018{col 37}{space 1}  -12.73{col 46}{space 3}0.000{col 54}{space 4}-.0191219{col 67}{space 3}-.0140189
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0116852{col 26}{space 2} .0013684{col 37}{space 1}   -8.54{col 46}{space 3}0.000{col 54}{space 4}-.0143672{col 67}{space 3}-.0090031
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0009304{col 26}{space 2} .0010813{col 37}{space 1}   -0.86{col 46}{space 3}0.390{col 54}{space 4}-.0030496{col 67}{space 3} .0011889
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0006068{col 26}{space 2} .0005459{col 37}{space 1}    1.11{col 46}{space 3}0.266{col 54}{space 4}-.0004631{col 67}{space 3} .0016768
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0011851{col 26}{space 2} .0005851{col 37}{space 1}    2.03{col 46}{space 3}0.043{col 54}{space 4} .0000383{col 67}{space 3} .0023319
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0004774{col 26}{space 2} .0005891{col 37}{space 1}   -0.81{col 46}{space 3}0.418{col 54}{space 4} -.001632{col 67}{space 3} .0006771
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0075972{col 26}{space 2} .0007223{col 37}{space 1}  -10.52{col 46}{space 3}0.000{col 54}{space 4}-.0090129{col 67}{space 3}-.0061815
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.858858{col 26}{space 2} .0214888{col 37}{space 1}   86.50{col 46}{space 3}0.000{col 54}{space 4} 1.816741{col 67}{space 3} 1.900976
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr_nosibctrl.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.42304838 .08273089 .41488014 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0058747058   .7563312282          3572{txt}  {c |}
  2 {c |}  {res}.0050065539    .682301683          2320{txt}  {c |}
  3 {c |}  {res}.0042677877   .6200350016          1118{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0058747058{txt}  {c |}
  2 {c |}  {res}.0050065539{txt}  {c |}
  3 {c |}  {res}.0050065539{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,620
                                                {txt}F(1, 1277)        =  {res}  8447.80
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0283
                                                {txt}Root MSE          =    {res} .41681

{txt}{ralign 78:(Std. err. adjusted for {res:1,278} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   g11_enr_r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2}  1.05573{col 26}{space 2} .0114863{col 37}{space 1}   91.91{col 46}{space 3}0.000{col 54}{space 4} 1.033196{col 67}{space 3} 1.078265
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0016024{col 26}{space 2} .0002828{col 37}{space 1}   -5.67{col 46}{space 3}0.000{col 54}{space 4}-.0021571{col 67}{space 3}-.0010477
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_sibling_nocontrol.ster} saved
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,442
{txt}{hline 13}{c +}{hline 34}   F(38, 700403)   = {res}  2448.10
{txt}       Model {c |} {res} 16625.8859        38  437.523313   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 125175.596   700,403  .178719389   {txt}R-squared       ={res}    0.1172
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1172
{txt}       Total {c |} {res} 141801.482   700,441  .202446005   {txt}Root MSE        =   {res} .42275

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         enr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0118041{col 26}{space 2} .0019925{col 37}{space 1}    5.92{col 46}{space 3}0.000{col 54}{space 4} .0078989{col 67}{space 3} .0157093
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0130101{col 26}{space 2} .0020021{col 37}{space 1}   -6.50{col 46}{space 3}0.000{col 54}{space 4}-.0169341{col 67}{space 3}-.0090861
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0299744{col 26}{space 2} .0020041{col 37}{space 1}  -14.96{col 46}{space 3}0.000{col 54}{space 4}-.0339024{col 67}{space 3}-.0260464
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0219229{col 26}{space 2} .0019872{col 37}{space 1}   11.03{col 46}{space 3}0.000{col 54}{space 4} .0180281{col 67}{space 3} .0258177
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0624166{col 26}{space 2} .0021809{col 37}{space 1}   28.62{col 46}{space 3}0.000{col 54}{space 4} .0581421{col 67}{space 3} .0666912
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0001715{col 26}{space 2} 3.51e-06{col 37}{space 1}  -48.92{col 46}{space 3}0.000{col 54}{space 4}-.0001784{col 67}{space 3}-.0001646
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0696185{col 26}{space 2} .0010328{col 37}{space 1}  -67.41{col 46}{space 3}0.000{col 54}{space 4}-.0716427{col 67}{space 3}-.0675943
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0618399{col 26}{space 2} .0016597{col 37}{space 1}   37.26{col 46}{space 3}0.000{col 54}{space 4} .0585869{col 67}{space 3} .0650929
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0157446{col 26}{space 2} .0014106{col 37}{space 1}  -11.16{col 46}{space 3}0.000{col 54}{space 4}-.0185094{col 67}{space 3}-.0129799
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0091485{col 26}{space 2} .0027627{col 37}{space 1}    3.31{col 46}{space 3}0.001{col 54}{space 4} .0037337{col 67}{space 3} .0145632
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0099914{col 26}{space 2} .0030621{col 37}{space 1}   -3.26{col 46}{space 3}0.001{col 54}{space 4}-.0159931{col 67}{space 3}-.0039898
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0680558{col 26}{space 2} .0012002{col 37}{space 1}  -56.70{col 46}{space 3}0.000{col 54}{space 4}-.0704081{col 67}{space 3}-.0657034
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0443229{col 26}{space 2} .0026845{col 37}{space 1}  -16.51{col 46}{space 3}0.000{col 54}{space 4}-.0495846{col 67}{space 3}-.0390613
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0169079{col 26}{space 2} .0026797{col 37}{space 1}   -6.31{col 46}{space 3}0.000{col 54}{space 4}-.0221599{col 67}{space 3}-.0116558
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0830383{col 26}{space 2} .0020195{col 37}{space 1}   41.12{col 46}{space 3}0.000{col 54}{space 4} .0790801{col 67}{space 3} .0869964
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0730321{col 26}{space 2} .0019892{col 37}{space 1}   36.71{col 46}{space 3}0.000{col 54}{space 4} .0691333{col 67}{space 3} .0769309
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .071069{col 26}{space 2} .0021232{col 37}{space 1}   33.47{col 46}{space 3}0.000{col 54}{space 4} .0669076{col 67}{space 3} .0752304
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0713433{col 26}{space 2} .0025826{col 37}{space 1}   27.62{col 46}{space 3}0.000{col 54}{space 4} .0662814{col 67}{space 3} .0764052
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0159045{col 26}{space 2} .0010452{col 37}{space 1}  -15.22{col 46}{space 3}0.000{col 54}{space 4} -.017953{col 67}{space 3}-.0138559
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0202272{col 26}{space 2} .0010672{col 37}{space 1}  -18.95{col 46}{space 3}0.000{col 54}{space 4}-.0223189{col 67}{space 3}-.0181356
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0118744{col 26}{space 2} .0011146{col 37}{space 1}  -10.65{col 46}{space 3}0.000{col 54}{space 4} -.014059{col 67}{space 3}-.0096898
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0118375{col 26}{space 2} .0011121{col 37}{space 1}  -10.64{col 46}{space 3}0.000{col 54}{space 4}-.0140173{col 67}{space 3}-.0096577
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0013198{col 26}{space 2} .0004866{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-.0022736{col 67}{space 3} -.000366
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0007592{col 26}{space 2} .0004501{col 37}{space 1}    1.69{col 46}{space 3}0.092{col 54}{space 4}-.0001229{col 67}{space 3} .0016413
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0016976{col 26}{space 2} .0004503{col 37}{space 1}   -3.77{col 46}{space 3}0.000{col 54}{space 4}-.0025802{col 67}{space 3}-.0008151
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0048609{col 26}{space 2} .0007301{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-.0062919{col 67}{space 3}-.0034299
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0579581{col 26}{space 2} .0020106{col 37}{space 1}   28.83{col 46}{space 3}0.000{col 54}{space 4} .0540174{col 67}{space 3} .0618988
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0611877{col 26}{space 2} .0020672{col 37}{space 1}   29.60{col 46}{space 3}0.000{col 54}{space 4}  .057136{col 67}{space 3} .0652394
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0605698{col 26}{space 2} .0021848{col 37}{space 1}   27.72{col 46}{space 3}0.000{col 54}{space 4} .0562876{col 67}{space 3}  .064852
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0887844{col 26}{space 2} .0026114{col 37}{space 1}   34.00{col 46}{space 3}0.000{col 54}{space 4} .0836662{col 67}{space 3} .0939027
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0146941{col 26}{space 2}  .001319{col 37}{space 1}  -11.14{col 46}{space 3}0.000{col 54}{space 4}-.0172792{col 67}{space 3} -.012109
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0165188{col 26}{space 2} .0013009{col 37}{space 1}  -12.70{col 46}{space 3}0.000{col 54}{space 4}-.0190685{col 67}{space 3} -.013969
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.011595{col 26}{space 2} .0013675{col 37}{space 1}   -8.48{col 46}{space 3}0.000{col 54}{space 4}-.0142752{col 67}{space 3}-.0089148
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0007821{col 26}{space 2} .0010806{col 37}{space 1}   -0.72{col 46}{space 3}0.469{col 54}{space 4}-.0029001{col 67}{space 3} .0013358
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0006532{col 26}{space 2} .0005455{col 37}{space 1}    1.20{col 46}{space 3}0.231{col 54}{space 4} -.000416{col 67}{space 3} .0017224
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0012674{col 26}{space 2} .0005847{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} .0001214{col 67}{space 3} .0024135
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0004159{col 26}{space 2} .0005887{col 37}{space 1}   -0.71{col 46}{space 3}0.480{col 54}{space 4}-.0015697{col 67}{space 3} .0007378
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0074343{col 26}{space 2} .0007218{col 37}{space 1}  -10.30{col 46}{space 3}0.000{col 54}{space 4}-.0088491{col 67}{space 3}-.0060196
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  1.83833{col 26}{space 2} .0214853{col 37}{space 1}   85.56{col 46}{space 3}0.000{col 54}{space 4}  1.79622{col 67}{space 3}  1.88044
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.42275216 .08247168 .41462973 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0058370252   .7555375498          3572{txt}  {c |}
  2 {c |}  {res}.0049746836   .6813900485          2320{txt}  {c |}
  3 {c |}  {res}.0042355451   .6185915207          1118{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0058370252{txt}  {c |}
  2 {c |}  {res}.0049746836{txt}  {c |}
  3 {c |}  {res}.0049746836{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,620
                                                {txt}F(1, 1277)        =  {res}  8427.42
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0282
                                                {txt}Root MSE          =    {res} .41655

{txt}{ralign 78:(Std. err. adjusted for {res:1,278} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   g11_enr_r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.055314{col 26}{space 2} .0114957{col 37}{space 1}   91.80{col 46}{space 3}0.000{col 54}{space 4} 1.032762{col 67}{space 3} 1.077867
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.001577{col 26}{space 2} .0002827{col 37}{space 1}   -5.58{col 46}{space 3}0.000{col 54}{space 4}-.0021316{col 67}{space 3}-.0010224
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_sibling.ster} saved
{res}
{txt}Linear regression                               Number of obs     = {res}   698,620
                                                {txt}F(1, 1277)        =  {res}    26.74
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0002
                                                {txt}Root MSE          =    {res} .01585

{txt}{ralign 78:(Std. err. adjusted for {res:1,278} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} g11_enr_r_d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} .0035064{col 26}{space 2} .0006781{col 37}{space 1}    5.17{col 46}{space 3}0.000{col 54}{space 4} .0021761{col 67}{space 3} .0048368
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.25e-06{col 26}{space 2} .0000479{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-.0000993{col 67}{space 3} .0000888
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_enr_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/fb_test_va_cfr_g11_enr_sibling.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outcome_va/va_g11_enr_sibling.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_va/va_g11_enr_sibling.dta{rm}
saved
{p_end}
(Enrollment Outcome Grade 11 VA Sample)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,442
{txt}{hline 13}{c +}{hline 34}   F(36, 700405)   = {res}  1032.40
{txt}       Model {c |} {res} 8182.30491        36  227.286247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 154196.278   700,405  .220153023   {txt}R-squared       ={res}    0.0504
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0503
{txt}       Total {c |} {res} 162378.583   700,441  .231823356   {txt}Root MSE        =   {res}  .4692

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0057079{col 26}{space 2} .0022113{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 54}{space 4}-.0100419{col 67}{space 3}-.0013739
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0317189{col 26}{space 2} .0022214{col 37}{space 1}  -14.28{col 46}{space 3}0.000{col 54}{space 4}-.0360727{col 67}{space 3}-.0273651
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.008716{col 26}{space 2} .0022227{col 37}{space 1}   -3.92{col 46}{space 3}0.000{col 54}{space 4}-.0130725{col 67}{space 3}-.0043596
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000934{col 26}{space 2} 3.89e-06{col 37}{space 1}  -24.01{col 46}{space 3}0.000{col 54}{space 4} -.000101{col 67}{space 3}-.0000858
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}  .019175{col 26}{space 2} .0011463{col 37}{space 1}   16.73{col 46}{space 3}0.000{col 54}{space 4} .0169284{col 67}{space 3} .0214217
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0140303{col 26}{space 2} .0018411{col 37}{space 1}   -7.62{col 46}{space 3}0.000{col 54}{space 4}-.0176388{col 67}{space 3}-.0104218
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} .0017775{col 26}{space 2} .0015652{col 37}{space 1}    1.14{col 46}{space 3}0.256{col 54}{space 4}-.0012902{col 67}{space 3} .0048452
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0359235{col 26}{space 2} .0030662{col 37}{space 1}  -11.72{col 46}{space 3}0.000{col 54}{space 4}-.0419332{col 67}{space 3}-.0299137
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0021036{col 26}{space 2} .0033985{col 37}{space 1}    0.62{col 46}{space 3}0.536{col 54}{space 4}-.0045574{col 67}{space 3} .0087645
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0241404{col 26}{space 2} .0013318{col 37}{space 1}  -18.13{col 46}{space 3}0.000{col 54}{space 4}-.0267507{col 67}{space 3}-.0215301
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0234545{col 26}{space 2} .0029795{col 37}{space 1}   -7.87{col 46}{space 3}0.000{col 54}{space 4}-.0292942{col 67}{space 3}-.0176147
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0270389{col 26}{space 2}  .002974{col 37}{space 1}    9.09{col 46}{space 3}0.000{col 54}{space 4} .0212099{col 67}{space 3} .0328679
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.057379{col 26}{space 2} .0022413{col 37}{space 1}  -25.60{col 46}{space 3}0.000{col 54}{space 4}-.0617718{col 67}{space 3}-.0529862
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0534823{col 26}{space 2} .0022076{col 37}{space 1}  -24.23{col 46}{space 3}0.000{col 54}{space 4}-.0578092{col 67}{space 3}-.0491554
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0545911{col 26}{space 2} .0023562{col 37}{space 1}  -23.17{col 46}{space 3}0.000{col 54}{space 4}-.0592091{col 67}{space 3} -.049973
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0280084{col 26}{space 2} .0028663{col 37}{space 1}   -9.77{col 46}{space 3}0.000{col 54}{space 4}-.0336262{col 67}{space 3}-.0223906
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0399667{col 26}{space 2}   .00116{col 37}{space 1}  -34.45{col 46}{space 3}0.000{col 54}{space 4}-.0422403{col 67}{space 3}-.0376932
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0378828{col 26}{space 2} .0011844{col 37}{space 1}  -31.98{col 46}{space 3}0.000{col 54}{space 4}-.0402042{col 67}{space 3}-.0355613
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0310743{col 26}{space 2} .0012371{col 37}{space 1}  -25.12{col 46}{space 3}0.000{col 54}{space 4}-.0334989{col 67}{space 3}-.0286497
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0309319{col 26}{space 2} .0012343{col 37}{space 1}  -25.06{col 46}{space 3}0.000{col 54}{space 4}-.0333511{col 67}{space 3}-.0285126
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0100843{col 26}{space 2} .0005401{col 37}{space 1}   18.67{col 46}{space 3}0.000{col 54}{space 4} .0090257{col 67}{space 3} .0111428
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .009796{col 26}{space 2} .0004995{col 37}{space 1}   19.61{col 46}{space 3}0.000{col 54}{space 4}  .008817{col 67}{space 3}  .010775
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0083851{col 26}{space 2} .0004997{col 37}{space 1}   16.78{col 46}{space 3}0.000{col 54}{space 4} .0074056{col 67}{space 3} .0093646
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0037104{col 26}{space 2} .0008103{col 37}{space 1}    4.58{col 46}{space 3}0.000{col 54}{space 4} .0021222{col 67}{space 3} .0052986
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0640513{col 26}{space 2} .0022313{col 37}{space 1}  -28.71{col 46}{space 3}0.000{col 54}{space 4}-.0684246{col 67}{space 3} -.059678
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0664907{col 26}{space 2}  .002294{col 37}{space 1}  -28.98{col 46}{space 3}0.000{col 54}{space 4}-.0709869{col 67}{space 3}-.0619944
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0617382{col 26}{space 2} .0024246{col 37}{space 1}  -25.46{col 46}{space 3}0.000{col 54}{space 4}-.0664904{col 67}{space 3}-.0569861
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0512916{col 26}{space 2}  .002898{col 37}{space 1}  -17.70{col 46}{space 3}0.000{col 54}{space 4}-.0569716{col 67}{space 3}-.0456116
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  -.03361{col 26}{space 2} .0014639{col 37}{space 1}  -22.96{col 46}{space 3}0.000{col 54}{space 4}-.0364791{col 67}{space 3}-.0307408
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0354713{col 26}{space 2} .0014438{col 37}{space 1}  -24.57{col 46}{space 3}0.000{col 54}{space 4}-.0383012{col 67}{space 3}-.0326415
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0255018{col 26}{space 2} .0015177{col 37}{space 1}  -16.80{col 46}{space 3}0.000{col 54}{space 4}-.0284765{col 67}{space 3}-.0225271
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0343984{col 26}{space 2} .0011993{col 37}{space 1}  -28.68{col 46}{space 3}0.000{col 54}{space 4}-.0367489{col 67}{space 3}-.0320479
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0110251{col 26}{space 2} .0006055{col 37}{space 1}   18.21{col 46}{space 3}0.000{col 54}{space 4} .0098384{col 67}{space 3} .0122118
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0120268{col 26}{space 2}  .000649{col 37}{space 1}   18.53{col 46}{space 3}0.000{col 54}{space 4} .0107548{col 67}{space 3} .0132987
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0084558{col 26}{space 2} .0006533{col 37}{space 1}   12.94{col 46}{space 3}0.000{col 54}{space 4} .0071753{col 67}{space 3} .0097364
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0010349{col 26}{space 2} .0008011{col 37}{space 1}    1.29{col 46}{space 3}0.196{col 54}{space 4}-.0005352{col 67}{space 3} .0026051
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.025411{col 26}{space 2} .0238333{col 37}{space 1}   43.02{col 46}{space 3}0.000{col 54}{space 4} .9786989{col 67}{space 3} 1.072124
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr_2year_nosibctrl.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46920467 .0983212 .45878749 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0090347898   .8130653737          3572{txt}  {c |}
  2 {c |}  {res}.0083694284   .7646196403          2320{txt}  {c |}
  3 {c |}  {res}.0076544728   .7183210464          1118{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0090347898{txt}  {c |}
  2 {c |}  {res}.0083694284{txt}  {c |}
  3 {c |}  {res}.0083694284{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,620
                                                {txt}F(1, 1277)        =  {res} 33966.59
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0366
                                                {txt}Root MSE          =    {res} .46054

{txt}{ralign 78:(Std. err. adjusted for {res:1,278} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_2y~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.003413{col 26}{space 2} .0054444{col 37}{space 1}  184.30{col 46}{space 3}0.000{col 54}{space 4} .9927322{col 67}{space 3} 1.014094
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0011327{col 26}{space 2} .0002698{col 37}{space 1}   -4.20{col 46}{space 3}0.000{col 54}{space 4}-.0016619{col 67}{space 3}-.0006034
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling_nocontrol.ster} saved
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,442
{txt}{hline 13}{c +}{hline 34}   F(38, 700403)   = {res}  1061.80
{txt}       Model {c |} {res} 8844.67412        38  232.754582   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 153533.909   700,403  .219207955   {txt}R-squared       ={res}    0.0545
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0544
{txt}       Total {c |} {res} 162378.583   700,441  .231823356   {txt}Root MSE        =   {res}  .4682

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_2year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0060639{col 26}{space 2} .0022067{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0103889{col 67}{space 3}-.0017389
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0322395{col 26}{space 2} .0022173{col 37}{space 1}  -14.54{col 46}{space 3}0.000{col 54}{space 4}-.0365853{col 67}{space 3}-.0278937
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0102691{col 26}{space 2} .0022196{col 37}{space 1}   -4.63{col 46}{space 3}0.000{col 54}{space 4}-.0146194{col 67}{space 3}-.0059189
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2} .0976404{col 26}{space 2} .0022008{col 37}{space 1}   44.37{col 46}{space 3}0.000{col 54}{space 4} .0933269{col 67}{space 3} .1019539
{txt}1.has_~4year {c |}{col 14}{res}{space 2}-.0849081{col 26}{space 2} .0024154{col 37}{space 1}  -35.15{col 46}{space 3}0.000{col 54}{space 4}-.0896422{col 67}{space 3}-.0801741
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0000928{col 26}{space 2} 3.88e-06{col 37}{space 1}  -23.90{col 46}{space 3}0.000{col 54}{space 4}-.0001004{col 67}{space 3}-.0000852
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0192479{col 26}{space 2} .0011438{col 37}{space 1}   16.83{col 46}{space 3}0.000{col 54}{space 4} .0170061{col 67}{space 3} .0214897
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}-.0141756{col 26}{space 2} .0018381{col 37}{space 1}   -7.71{col 46}{space 3}0.000{col 54}{space 4}-.0177783{col 67}{space 3}-.0105729
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0002227{col 26}{space 2} .0015622{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-.0032846{col 67}{space 3} .0028392
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.0360147{col 26}{space 2} .0030597{col 37}{space 1}  -11.77{col 46}{space 3}0.000{col 54}{space 4}-.0420115{col 67}{space 3}-.0300178
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0014552{col 26}{space 2} .0033913{col 37}{space 1}    0.43{col 46}{space 3}0.668{col 54}{space 4}-.0051916{col 67}{space 3}  .008102
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0248149{col 26}{space 2} .0013292{col 37}{space 1}  -18.67{col 46}{space 3}0.000{col 54}{space 4}-.0274201{col 67}{space 3}-.0222097
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0240119{col 26}{space 2} .0029731{col 37}{space 1}   -8.08{col 46}{space 3}0.000{col 54}{space 4}-.0298391{col 67}{space 3}-.0181847
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} .0273359{col 26}{space 2} .0029677{col 37}{space 1}    9.21{col 46}{space 3}0.000{col 54}{space 4} .0215192{col 67}{space 3} .0331526
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0560593{col 26}{space 2} .0022366{col 37}{space 1}  -25.06{col 46}{space 3}0.000{col 54}{space 4}-.0604429{col 67}{space 3}-.0516757
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0520335{col 26}{space 2} .0022031{col 37}{space 1}  -23.62{col 46}{space 3}0.000{col 54}{space 4}-.0563514{col 67}{space 3}-.0477156
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0527665{col 26}{space 2} .0023514{col 37}{space 1}  -22.44{col 46}{space 3}0.000{col 54}{space 4}-.0573753{col 67}{space 3}-.0481578
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0264235{col 26}{space 2} .0028603{col 37}{space 1}   -9.24{col 46}{space 3}0.000{col 54}{space 4}-.0320296{col 67}{space 3}-.0208175
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0396864{col 26}{space 2} .0011576{col 37}{space 1}  -34.28{col 46}{space 3}0.000{col 54}{space 4}-.0419551{col 67}{space 3}-.0374176
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0375817{col 26}{space 2} .0011819{col 37}{space 1}  -31.80{col 46}{space 3}0.000{col 54}{space 4}-.0398982{col 67}{space 3}-.0352652
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0308544{col 26}{space 2} .0012344{col 37}{space 1}  -24.99{col 46}{space 3}0.000{col 54}{space 4}-.0332738{col 67}{space 3} -.028435
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0308216{col 26}{space 2} .0012317{col 37}{space 1}  -25.02{col 46}{space 3}0.000{col 54}{space 4}-.0332357{col 67}{space 3}-.0284075
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0099212{col 26}{space 2}  .000539{col 37}{space 1}   18.41{col 46}{space 3}0.000{col 54}{space 4} .0088649{col 67}{space 3} .0109776
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .009633{col 26}{space 2} .0004985{col 37}{space 1}   19.33{col 46}{space 3}0.000{col 54}{space 4} .0086561{col 67}{space 3}   .01061
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0082271{col 26}{space 2} .0004987{col 37}{space 1}   16.50{col 46}{space 3}0.000{col 54}{space 4} .0072497{col 67}{space 3} .0092045
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0035325{col 26}{space 2} .0008086{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4} .0019477{col 67}{space 3} .0051173
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0628278{col 26}{space 2} .0022267{col 37}{space 1}  -28.22{col 46}{space 3}0.000{col 54}{space 4}-.0671921{col 67}{space 3}-.0584635
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0650255{col 26}{space 2} .0022894{col 37}{space 1}  -28.40{col 46}{space 3}0.000{col 54}{space 4}-.0695127{col 67}{space 3}-.0605383
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0601761{col 26}{space 2} .0024197{col 37}{space 1}  -24.87{col 46}{space 3}0.000{col 54}{space 4}-.0649186{col 67}{space 3}-.0554336
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0492162{col 26}{space 2} .0028921{col 37}{space 1}  -17.02{col 46}{space 3}0.000{col 54}{space 4}-.0548846{col 67}{space 3}-.0435477
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0333199{col 26}{space 2} .0014607{col 37}{space 1}  -22.81{col 46}{space 3}0.000{col 54}{space 4}-.0361829{col 67}{space 3}-.0304569
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.035134{col 26}{space 2} .0014407{col 37}{space 1}  -24.39{col 46}{space 3}0.000{col 54}{space 4}-.0379577{col 67}{space 3}-.0323102
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0253146{col 26}{space 2} .0015145{col 37}{space 1}  -16.72{col 46}{space 3}0.000{col 54}{space 4}-.0282829{col 67}{space 3}-.0223463
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0337616{col 26}{space 2} .0011968{col 37}{space 1}  -28.21{col 46}{space 3}0.000{col 54}{space 4}-.0361072{col 67}{space 3} -.031416
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0108811{col 26}{space 2} .0006042{col 37}{space 1}   18.01{col 46}{space 3}0.000{col 54}{space 4} .0096969{col 67}{space 3} .0120652
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0118663{col 26}{space 2} .0006476{col 37}{space 1}   18.32{col 46}{space 3}0.000{col 54}{space 4} .0105971{col 67}{space 3} .0131355
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0083386{col 26}{space 2} .0006519{col 37}{space 1}   12.79{col 46}{space 3}0.000{col 54}{space 4} .0070608{col 67}{space 3} .0096163
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .000872{col 26}{space 2} .0007994{col 37}{space 1}    1.09{col 46}{space 3}0.275{col 54}{space 4}-.0006948{col 67}{space 3} .0024389
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.020809{col 26}{space 2} .0237949{col 37}{space 1}   42.90{col 46}{space 3}0.000{col 54}{space 4} .9741716{col 67}{space 3} 1.067446
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr_2year.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.46819649 .09666344 .4581093 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0087133422   .8080585607          3572{txt}  {c |}
  2 {c |}  {res} .008051389   .7582383502          2320{txt}  {c |}
  3 {c |}  {res} .007355188   .7121376364          1118{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0087133422{txt}  {c |}
  2 {c |}  {res} .008051389{txt}  {c |}
  3 {c |}  {res} .008051389{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,620
                                                {txt}F(1, 1277)        =  {res} 32366.13
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0353
                                                {txt}Root MSE          =    {res} .45985

{txt}{ralign 78:(Std. err. adjusted for {res:1,278} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_2y~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.004256{col 26}{space 2} .0055821{col 37}{space 1}  179.91{col 46}{space 3}0.000{col 54}{space 4}  .993305{col 67}{space 3} 1.015207
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0011533{col 26}{space 2} .0002709{col 37}{space 1}   -4.26{col 46}{space 3}0.000{col 54}{space 4}-.0016847{col 67}{space 3}-.0006219
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_2year_sibling.ster} saved
{res}
{txt}Linear regression                               Number of obs     = {res}   698,620
                                                {txt}F(1, 1277)        =  {res}   668.36
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0029
                                                {txt}Root MSE          =    {res} .03071

{txt}{ralign 78:(Std. err. adjusted for {res:1,278} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_2y~d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} .0183776{col 26}{space 2} .0007109{col 37}{space 1}   25.85{col 46}{space 3}0.000{col 54}{space 4}  .016983{col 67}{space 3} .0197722
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000215{col 26}{space 2} .0000593{col 37}{space 1}   -0.36{col 46}{space 3}0.717{col 54}{space 4}-.0001378{col 67}{space 3} .0000948
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_enr_2year_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/fb_test_va_cfr_g11_enr_2year_sibling.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outcome_va/va_g11_enr_2year_sibling.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_va/va_g11_enr_2year_sibling.dta{rm}
saved
{p_end}
(Enrollment Outcome Grade 11 VA Sample)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,442
{txt}{hline 13}{c +}{hline 34}   F(36, 700405)   = {res}  6092.81
{txt}       Model {c |} {res} 38145.4281        36  1059.59523   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 121806.861   700,405  .173909182   {txt}R-squared       ={res}    0.2385
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2384
{txt}       Total {c |} {res} 159952.289   700,441  .228359403   {txt}Root MSE        =   {res} .41702

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0181749{col 26}{space 2} .0019654{col 37}{space 1}    9.25{col 46}{space 3}0.000{col 54}{space 4} .0143229{col 67}{space 3} .0220269
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0201173{col 26}{space 2} .0019743{col 37}{space 1}   10.19{col 46}{space 3}0.000{col 54}{space 4} .0162477{col 67}{space 3} .0239869
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0192969{col 26}{space 2} .0019755{col 37}{space 1}   -9.77{col 46}{space 3}0.000{col 54}{space 4}-.0231689{col 67}{space 3} -.015425
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0000808{col 26}{space 2} 3.46e-06{col 37}{space 1}  -23.38{col 46}{space 3}0.000{col 54}{space 4}-.0000876{col 67}{space 3}-.0000741
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0887602{col 26}{space 2} .0010188{col 37}{space 1}  -87.12{col 46}{space 3}0.000{col 54}{space 4} -.090757{col 67}{space 3}-.0867634
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0774998{col 26}{space 2} .0016363{col 37}{space 1}   47.36{col 46}{space 3}0.000{col 54}{space 4} .0742926{col 67}{space 3} .0807069
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} -.017734{col 26}{space 2} .0013911{col 37}{space 1}  -12.75{col 46}{space 3}0.000{col 54}{space 4}-.0204605{col 67}{space 3}-.0150075
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0449768{col 26}{space 2} .0027252{col 37}{space 1}   16.50{col 46}{space 3}0.000{col 54}{space 4} .0396355{col 67}{space 3} .0503182
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0127268{col 26}{space 2} .0030205{col 37}{space 1}   -4.21{col 46}{space 3}0.000{col 54}{space 4} -.018647{col 67}{space 3}-.0068067
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0433464{col 26}{space 2} .0011837{col 37}{space 1}  -36.62{col 46}{space 3}0.000{col 54}{space 4}-.0456664{col 67}{space 3}-.0410264
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0207994{col 26}{space 2} .0026481{col 37}{space 1}   -7.85{col 46}{space 3}0.000{col 54}{space 4}-.0259897{col 67}{space 3}-.0156092
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0445567{col 26}{space 2} .0026433{col 37}{space 1}  -16.86{col 46}{space 3}0.000{col 54}{space 4}-.0497375{col 67}{space 3} -.039376
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1404662{col 26}{space 2}  .001992{col 37}{space 1}   70.51{col 46}{space 3}0.000{col 54}{space 4} .1365619{col 67}{space 3} .1443704
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1264106{col 26}{space 2} .0019621{col 37}{space 1}   64.43{col 46}{space 3}0.000{col 54}{space 4} .1225649{col 67}{space 3} .1302563
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1254033{col 26}{space 2} .0020941{col 37}{space 1}   59.88{col 46}{space 3}0.000{col 54}{space 4} .1212989{col 67}{space 3} .1295078
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0996564{col 26}{space 2} .0025475{col 37}{space 1}   39.12{col 46}{space 3}0.000{col 54}{space 4} .0946633{col 67}{space 3} .1046495
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0239297{col 26}{space 2}  .001031{col 37}{space 1}   23.21{col 46}{space 3}0.000{col 54}{space 4}  .021909{col 67}{space 3} .0259505
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0174739{col 26}{space 2} .0010527{col 37}{space 1}   16.60{col 46}{space 3}0.000{col 54}{space 4} .0154106{col 67}{space 3} .0195371
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .019007{col 26}{space 2} .0010995{col 37}{space 1}   17.29{col 46}{space 3}0.000{col 54}{space 4} .0168521{col 67}{space 3}  .021162
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0189383{col 26}{space 2} .0010971{col 37}{space 1}   17.26{col 46}{space 3}0.000{col 54}{space 4} .0167881{col 67}{space 3} .0210885
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0114266{col 26}{space 2}   .00048{col 37}{space 1}  -23.80{col 46}{space 3}0.000{col 54}{space 4}-.0123674{col 67}{space 3}-.0104857
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0090314{col 26}{space 2}  .000444{col 37}{space 1}  -20.34{col 46}{space 3}0.000{col 54}{space 4}-.0099016{col 67}{space 3}-.0081612
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0100648{col 26}{space 2} .0004442{col 37}{space 1}  -22.66{col 46}{space 3}0.000{col 54}{space 4}-.0109353{col 67}{space 3}-.0091942
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0086873{col 26}{space 2} .0007202{col 37}{space 1}  -12.06{col 46}{space 3}0.000{col 54}{space 4}-.0100989{col 67}{space 3}-.0072757
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1227508{col 26}{space 2} .0019832{col 37}{space 1}   61.90{col 46}{space 3}0.000{col 54}{space 4} .1188639{col 67}{space 3} .1266378
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .128653{col 26}{space 2} .0020389{col 37}{space 1}   63.10{col 46}{space 3}0.000{col 54}{space 4} .1246567{col 67}{space 3} .1326492
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1232278{col 26}{space 2}  .002155{col 37}{space 1}   57.18{col 46}{space 3}0.000{col 54}{space 4} .1190042{col 67}{space 3} .1274515
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1409792{col 26}{space 2} .0025757{col 37}{space 1}   54.73{col 46}{space 3}0.000{col 54}{space 4} .1359308{col 67}{space 3} .1460275
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0188168{col 26}{space 2} .0013011{col 37}{space 1}   14.46{col 46}{space 3}0.000{col 54}{space 4} .0162667{col 67}{space 3} .0213669
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0189009{col 26}{space 2} .0012833{col 37}{space 1}   14.73{col 46}{space 3}0.000{col 54}{space 4} .0163858{col 67}{space 3} .0214161
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0138166{col 26}{space 2} .0013489{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0111728{col 67}{space 3} .0164605
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .033468{col 26}{space 2} .0010659{col 37}{space 1}   31.40{col 46}{space 3}0.000{col 54}{space 4} .0313789{col 67}{space 3} .0355571
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0104183{col 26}{space 2} .0005381{col 37}{space 1}  -19.36{col 46}{space 3}0.000{col 54}{space 4} -.011473{col 67}{space 3}-.0093636
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0108417{col 26}{space 2} .0005768{col 37}{space 1}  -18.80{col 46}{space 3}0.000{col 54}{space 4}-.0119721{col 67}{space 3}-.0097112
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0089333{col 26}{space 2} .0005807{col 37}{space 1}  -15.38{col 46}{space 3}0.000{col 54}{space 4}-.0100714{col 67}{space 3}-.0077952
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0086321{col 26}{space 2}  .000712{col 37}{space 1}  -12.12{col 46}{space 3}0.000{col 54}{space 4}-.0100276{col 67}{space 3}-.0072366
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .8334471{col 26}{space 2} .0211828{col 37}{space 1}   39.35{col 46}{space 3}0.000{col 54}{space 4} .7919296{col 67}{space 3} .8749646
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr_4year_nosibctrl.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.4170242 .08808345 .40761561 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0073186514   .8200522755          3572{txt}  {c |}
  2 {c |}  {res}.0070501571    .805034112          2320{txt}  {c |}
  3 {c |}  {res}.0065426283     .77346797          1118{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0073186514{txt}  {c |}
  2 {c |}  {res}.0070501571{txt}  {c |}
  3 {c |}  {res}.0070501571{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,620
                                                {txt}F(1, 1277)        =  {res} 36588.49
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0378
                                                {txt}Root MSE          =    {res} .40914

{txt}{ralign 78:(Std. err. adjusted for {res:1,278} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_4y~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.016409{col 26}{space 2} .0053137{col 37}{space 1}  191.28{col 46}{space 3}0.000{col 54}{space 4} 1.005985{col 67}{space 3} 1.026834
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001996{col 26}{space 2} .0001857{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4} -.000564{col 67}{space 3} .0001648
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling_nocontrol.ster} saved
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   700,442
{txt}{hline 13}{c +}{hline 34}   F(38, 700403)   = {res}  5976.85
{txt}       Model {c |} {res} 39167.1238        38  1030.71378   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 120785.165   700,403  .172450953   {txt}R-squared       ={res}    0.2449
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2448
{txt}       Total {c |} {res} 159952.289   700,441  .228359403   {txt}Root MSE        =   {res} .41527

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   enr_4year{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}  .017868{col 26}{space 2} .0019572{col 37}{space 1}    9.13{col 46}{space 3}0.000{col 54}{space 4} .0140319{col 67}{space 3} .0217041
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0192294{col 26}{space 2} .0019666{col 37}{space 1}    9.78{col 46}{space 3}0.000{col 54}{space 4} .0153748{col 67}{space 3} .0230839
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0197053{col 26}{space 2} .0019687{col 37}{space 1}  -10.01{col 46}{space 3}0.000{col 54}{space 4}-.0235638{col 67}{space 3}-.0158468
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0757175{col 26}{space 2}  .001952{col 37}{space 1}  -38.79{col 46}{space 3}0.000{col 54}{space 4}-.0795434{col 67}{space 3}-.0718916
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .1473247{col 26}{space 2} .0021423{col 37}{space 1}   68.77{col 46}{space 3}0.000{col 54}{space 4} .1431258{col 67}{space 3} .1515237
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0000787{col 26}{space 2} 3.44e-06{col 37}{space 1}  -22.86{col 46}{space 3}0.000{col 54}{space 4}-.0000855{col 67}{space 3} -.000072
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0888664{col 26}{space 2} .0010145{col 37}{space 1}  -87.59{col 46}{space 3}0.000{col 54}{space 4}-.0908548{col 67}{space 3} -.086878
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0760155{col 26}{space 2} .0016304{col 37}{space 1}   46.63{col 46}{space 3}0.000{col 54}{space 4}   .07282{col 67}{space 3} .0792109
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0155219{col 26}{space 2} .0013856{col 37}{space 1}  -11.20{col 46}{space 3}0.000{col 54}{space 4}-.0182377{col 67}{space 3}-.0128061
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} .0451631{col 26}{space 2} .0027138{col 37}{space 1}   16.64{col 46}{space 3}0.000{col 54}{space 4} .0398442{col 67}{space 3} .0504821
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}-.0114467{col 26}{space 2} .0030079{col 37}{space 1}   -3.81{col 46}{space 3}0.000{col 54}{space 4}-.0173421{col 67}{space 3}-.0055512
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0432409{col 26}{space 2}  .001179{col 37}{space 1}  -36.68{col 46}{space 3}0.000{col 54}{space 4}-.0455516{col 67}{space 3}-.0409302
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0203111{col 26}{space 2}  .002637{col 37}{space 1}   -7.70{col 46}{space 3}0.000{col 54}{space 4}-.0254796{col 67}{space 3}-.0151425
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.0442438{col 26}{space 2} .0026323{col 37}{space 1}  -16.81{col 46}{space 3}0.000{col 54}{space 4}-.0494029{col 67}{space 3}-.0390846
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1390976{col 26}{space 2} .0019838{col 37}{space 1}   70.12{col 46}{space 3}0.000{col 54}{space 4} .1352095{col 67}{space 3} .1429857
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1250656{col 26}{space 2}  .001954{col 37}{space 1}   64.00{col 46}{space 3}0.000{col 54}{space 4} .1212358{col 67}{space 3} .1288955
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1238356{col 26}{space 2} .0020856{col 37}{space 1}   59.38{col 46}{space 3}0.000{col 54}{space 4} .1197478{col 67}{space 3} .1279233
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0977669{col 26}{space 2} .0025369{col 37}{space 1}   38.54{col 46}{space 3}0.000{col 54}{space 4} .0927945{col 67}{space 3} .1027392
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0237819{col 26}{space 2} .0010267{col 37}{space 1}   23.16{col 46}{space 3}0.000{col 54}{space 4} .0217696{col 67}{space 3} .0257942
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0173544{col 26}{space 2} .0010483{col 37}{space 1}   16.55{col 46}{space 3}0.000{col 54}{space 4} .0152998{col 67}{space 3} .0194091
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}   .01898{col 26}{space 2} .0010949{col 37}{space 1}   17.34{col 46}{space 3}0.000{col 54}{space 4}  .016834{col 67}{space 3} .0211259
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0189841{col 26}{space 2} .0010925{col 37}{space 1}   17.38{col 46}{space 3}0.000{col 54}{space 4} .0168429{col 67}{space 3} .0211253
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.011241{col 26}{space 2}  .000478{col 37}{space 1}  -23.52{col 46}{space 3}0.000{col 54}{space 4} -.012178{col 67}{space 3}-.0103041
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0088738{col 26}{space 2} .0004421{col 37}{space 1}  -20.07{col 46}{space 3}0.000{col 54}{space 4}-.0097403{col 67}{space 3}-.0080073
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0099247{col 26}{space 2} .0004423{col 37}{space 1}  -22.44{col 46}{space 3}0.000{col 54}{space 4}-.0107916{col 67}{space 3}-.0090578
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0083934{col 26}{space 2} .0007172{col 37}{space 1}  -11.70{col 46}{space 3}0.000{col 54}{space 4}-.0097991{col 67}{space 3}-.0069877
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1207859{col 26}{space 2}  .001975{col 37}{space 1}   61.16{col 46}{space 3}0.000{col 54}{space 4} .1169149{col 67}{space 3} .1246569
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1262132{col 26}{space 2} .0020307{col 37}{space 1}   62.15{col 46}{space 3}0.000{col 54}{space 4} .1222332{col 67}{space 3} .1301932
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1207459{col 26}{space 2} .0021462{col 37}{space 1}   56.26{col 46}{space 3}0.000{col 54}{space 4} .1165395{col 67}{space 3} .1249524
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1380006{col 26}{space 2} .0025652{col 37}{space 1}   53.80{col 46}{space 3}0.000{col 54}{space 4} .1329729{col 67}{space 3} .1430283
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0186258{col 26}{space 2} .0012956{col 37}{space 1}   14.38{col 46}{space 3}0.000{col 54}{space 4} .0160864{col 67}{space 3} .0211652
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0186152{col 26}{space 2} .0012779{col 37}{space 1}   14.57{col 46}{space 3}0.000{col 54}{space 4} .0161106{col 67}{space 3} .0211198
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0137195{col 26}{space 2} .0013433{col 37}{space 1}   10.21{col 46}{space 3}0.000{col 54}{space 4} .0110868{col 67}{space 3} .0163523
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0329795{col 26}{space 2} .0010615{col 37}{space 1}   31.07{col 46}{space 3}0.000{col 54}{space 4}  .030899{col 67}{space 3}   .03506
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0102278{col 26}{space 2} .0005359{col 37}{space 1}  -19.09{col 46}{space 3}0.000{col 54}{space 4}-.0112781{col 67}{space 3}-.0091776
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0105989{col 26}{space 2} .0005744{col 37}{space 1}  -18.45{col 46}{space 3}0.000{col 54}{space 4}-.0117246{col 67}{space 3}-.0094731
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0087545{col 26}{space 2} .0005782{col 37}{space 1}  -15.14{col 46}{space 3}0.000{col 54}{space 4}-.0098878{col 67}{space 3}-.0076212
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0083064{col 26}{space 2} .0007091{col 37}{space 1}  -11.71{col 46}{space 3}0.000{col 54}{space 4}-.0096961{col 67}{space 3}-.0069166
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .8175212{col 26}{space 2} .0211051{col 37}{space 1}   38.74{col 46}{space 3}0.000{col 54}{space 4} .7761558{col 67}{space 3} .8588865
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/vam_cfr_g11_enr_4year.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.41527214 .08609014 .40625047 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0069825016   .8145867474          3572{txt}  {c |}
  2 {c |}  {res}.0067065046   .7981198795          2320{txt}  {c |}
  3 {c |}  {res}.0061989979   .7653936154          1118{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0069825016{txt}  {c |}
  2 {c |}  {res}.0067065046{txt}  {c |}
  3 {c |}  {res}.0067065046{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   698,620
                                                {txt}F(1, 1277)        =  {res} 33999.96
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0362
                                                {txt}Root MSE          =    {res} .40776

{txt}{ralign 78:(Std. err. adjusted for {res:1,278} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_4y~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.017027{col 26}{space 2} .0055156{col 37}{space 1}  184.39{col 46}{space 3}0.000{col 54}{space 4} 1.006207{col 67}{space 3} 1.027848
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001824{col 26}{space 2} .0001878{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-.0005508{col 67}{space 3} .0001861
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/spec_test_va_cfr_g11_enr_4year_sibling.ster} saved
{res}
{txt}Linear regression                               Number of obs     = {res}   698,620
                                                {txt}F(1, 1277)        =  {res}   649.10
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0026
                                                {txt}Root MSE          =    {res} .03815

{txt}{ralign 78:(Std. err. adjusted for {res:1,278} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}g11_enr_4y~d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2}  .024641{col 26}{space 2} .0009672{col 37}{space 1}   25.48{col 46}{space 3}0.000{col 54}{space 4} .0227436{col 67}{space 3} .0265384
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0000104{col 26}{space 2} .0000773{col 37}{space 1}   -0.14{col 46}{space 3}0.892{col 54}{space 4} -.000162{col 67}{space 3} .0001411
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/outcome_va/fb_test_va_cfr_g11_enr_4year_sibling.ster} saved
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/outcome_va/fb_test_va_cfr_g11_enr_4year_sibling.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/outcome_va/va_g11_enr_4year_sibling.dta{rm}
saved
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/outcome_va/va_g11_enr_4year_sibling.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:     54.55 /        1 =      54.5550
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling_out.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 May 2022, 22:04:06
{txt}{.-}
{smcl}
{txt}{sf}{ul off}