{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 Oct 2021, 13:22:49
{txt}
{com}. 
. //include macros
. include do_files/sbac/macros_va.doh
{txt}
{com}. #delimit ;
{txt}delimiter now ;
{com}. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2019
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. #delimit ;
{txt}delimiter now ;
{com}. #delimit cr
{txt}delimiter now cr
{com}. macro list
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/msnaven/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/msnaven/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/msnaven/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/msnaven/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_ca_ed_lab:{space 5}{res}{res}/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_common_core_va:{break}
{res}/home/research/ca_ed_lab/msnaven/common_core_va
{p_end}
{txt}{p 0 16}
_mattdofiles:{space 3}{res}{res}/home/research/ca_ed_lab/msnaven/common_core_va/do_files/sbac
{p_end}
{txt}{p 0 16}
_matthomedir:{space 3}{res}{res}/home/research/ca_ed_lab/msnaven/common_core_va
{p_end}
{txt}{p 0 16}
_setlimit:{space 6}{res}{res}0
{p_end}
{txt}{p 0 16}
_1:{space 13}{res}{res}0
{p_end}
{txt}{p 0 16}
_0:{space 13}{res}{res}0
{p_end}
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. 
. ********************************************************************************
. /* Add family fixed effects as an additional demographic control in SBAC
> VA estimation */
. 
. //load the VA grade 11 sample
. use `va_g11_dataset', clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. 
. //merge on to ufamilyxwalk in order to use unique family ID for FE
. merge m:1 state_student_id using `sibling_out_xwalk'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       4,360,629
{txt}{col 9}from master{col 30}{res}       1,252,476{txt}  (_merge==1)
{col 9}from using{col 30}{res}       3,108,153{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,169,409{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. /*
> Result                      Number of obs
>     -----------------------------------------
>     Not matched                     4,360,629
>         from master                 1,252,476  (_merge==1)
>         from using                  3,108,153  (_merge==2)
> 
>     Matched                         1,169,409  (_merge==3)
>     -----------------------------------------
> 
>  */
. 
. compress
{txt}  (0 bytes saved)

{com}. tempfile va_g11_sibling_dataset
{txt}
{com}. save `va_g11_sibling_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St107855.000001{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. ********************************************************************************
. *********** VA estimates for VA samples matched to siblings sample
. ********************************************************************************
. 
. /*
> error: driftlimit(3) was specified, which is greater than the number of lags (2
> > ) in the data.
>  */
. 
. if `setlimit' == 0 {c -(}
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
. {c )-}
{txt}
{com}. else {c -(}
.   local drift_limit = `setlimit'
. {c )-}
{txt}
{com}. 
. foreach subject in ela math {c -(}
{txt}  2{com}. 
.   /* use each of the dummies for older sibling enrlllment as an additional
>   demographic control  */
.   foreach enrvar in enr enr_2year enr_4year {c -(}
{txt}  3{com}.     /* load the VA g11 subject sample with siblings outcome sample
>      (those who have at least one older sibling matched to the postsecondary
>    outcomes) */
.     use `va_g11_sibling_dataset' if touse_g11_`subject'==1 & sibling_out_sample == 1, clear
{txt}  4{com}. 
.     ******************************************************************************
.     ************ Value added estimation with no peer controls ********************
.     ****** No TFX (teacher fixed effects)
.     vam sbac_`subject'_z_score ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_`enrvar' ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit')
{txt}  5{com}.         rename tv va_cfr_g11_`subject'
{txt}  6{com}.         rename score_r sbac_g11_`subject'_r
{txt}  7{com}.     label var va_cfr_g11_`subject' "`subject' VA with family FE without TFX"
{txt}  8{com}.     label var sbac_g11_`subject'_r "`subject' score residual with family FE without TFX"
{txt}  9{com}. 
. 
.     ****** With TFX, and TFX is added back in the the VA estimates
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_`enrvar' ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
{txt} 10{com}.     rename tv va_tfx_g11_`subject'
{txt} 11{com}.     drop score_r
{txt} 12{com}.     label var va_tfx_g11_`subject' "`subject' VA with family FE with TFX"
{txt} 13{com}. 
. 
. 
. 
. 
. 
. 
. 
.     ******************************************************************************
.     ************ Value added estimation with peer controls ********************
.     ****** No TFX (teacher fixed effects)
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_`enrvar' ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
{txt} 14{com}.     rename tv va_cfr_g11_`subject'_peer
{txt} 15{com}.     rename score_r sbac_g11_`subject'_r_peer
{txt} 16{com}.     label var va_cfr_g11_`subject'_peer "`subject' VA with family FE with TFX"
{txt} 17{com}.     label var sbac_g11_`subject'_r_peer "`subject' score residual with family FE with TFX"
{txt} 18{com}. 
. 
.     ****** With TFX
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_`enrvar' ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
{txt} 19{com}.     rename tv va_tfx_g11_`subject'_peer
{txt} 20{com}.     drop score_r
{txt} 21{com}. 
. 
.     ******************************************************************************
.     ************ specification test: regressing score residuals on VA estimates
.     ******* No peer controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
{txt} 22{com}.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_`enrvar'.ster, replace
{txt} 23{com}. 
. 
.     ******* With peer controls
.     reg sbac_g11_`subject'_r_peer va_cfr_g11_`subject'_peer, cluster(school_id)
{txt} 24{com}.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_peer_sibling_`enrvar'.ster, replace
{txt} 25{com}. 
. 
. 
.     **************** Save Value Added Estimates
.     collapse (firstnm) va_* ///
>                 (mean) sbac_*_r* ///
>                 (sum) n_g11_`subject' = touse_g11_`subject' ///
>       if sibling_full_sample == 1 & sibling_out_sample == 1 ///
>                 , by(school_id cdscode grade year)
{txt} 26{com}.         save $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibling_`enrvar'.dta, replace
{txt} 27{com}.   {c )-}
{txt} 28{com}. 
. 
. {c )-}
{txt}(CST/SBAC Student Test Score Samples)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   452,964
{txt}{hline 13}{c +}{hline 34}   F(44, 452919)   = {res} 15040.12
{txt}       Model {c |} {res}     219109        44     4979.75   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 149960.493   452,919  .331097819   {txt}R-squared       ={res}    0.5937
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5936
{txt}       Total {c |} {res} 369069.493   452,963  .814789493   {txt}Root MSE        =   {res} .57541

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0300733{col 26}{space 2}   .00334{col 37}{space 1}   -9.00{col 46}{space 3}0.000{col 54}{space 4}-.0366195{col 67}{space 3} -.023527
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0697336{col 26}{space 2} .0036648{col 37}{space 1}   19.03{col 46}{space 3}0.000{col 54}{space 4} .0625508{col 67}{space 3} .0769165
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0693675{col 26}{space 2} .0035909{col 37}{space 1}  -19.32{col 46}{space 3}0.000{col 54}{space 4}-.0764056{col 67}{space 3}-.0623293
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0616061{col 26}{space 2} .0037778{col 37}{space 1}  -16.31{col 46}{space 3}0.000{col 54}{space 4}-.0690105{col 67}{space 3}-.0542017
{txt}{space 12} {c |}
1.has_old~nr {c |}{col 14}{res}{space 2} .0095147{col 26}{space 2} .0028319{col 37}{space 1}    3.36{col 46}{space 3}0.001{col 54}{space 4} .0039643{col 67}{space 3}  .015065
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003436{col 26}{space 2} 5.97e-06{col 37}{space 1}  -57.57{col 46}{space 3}0.000{col 54}{space 4}-.0003553{col 67}{space 3}-.0003319
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0876544{col 26}{space 2}  .001749{col 37}{space 1}  -50.12{col 46}{space 3}0.000{col 54}{space 4}-.0910825{col 67}{space 3}-.0842264
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1012322{col 26}{space 2}  .002906{col 37}{space 1}   34.84{col 46}{space 3}0.000{col 54}{space 4} .0955366{col 67}{space 3} .1069279
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0023428{col 26}{space 2} .0023893{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-.0070257{col 67}{space 3} .0023401
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1429862{col 26}{space 2} .0047273{col 37}{space 1}  -30.25{col 46}{space 3}0.000{col 54}{space 4}-.1522516{col 67}{space 3}-.1337208
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0090726{col 26}{space 2} .0052143{col 37}{space 1}    1.74{col 46}{space 3}0.082{col 54}{space 4}-.0011472{col 67}{space 3} .0192924
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0314683{col 26}{space 2} .0020172{col 37}{space 1}  -15.60{col 46}{space 3}0.000{col 54}{space 4} -.035422{col 67}{space 3}-.0275146
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2087587{col 26}{space 2} .0043965{col 37}{space 1}  -47.48{col 46}{space 3}0.000{col 54}{space 4}-.2173758{col 67}{space 3}-.2001416
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1773358{col 26}{space 2} .0043446{col 37}{space 1}  -40.82{col 46}{space 3}0.000{col 54}{space 4}-.1858512{col 67}{space 3}-.1688205
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6135228{col 26}{space 2}  .002853{col 37}{space 1}  215.04{col 46}{space 3}0.000{col 54}{space 4}  .607931{col 67}{space 3} .6191147
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .600823{col 26}{space 2} .0040733{col 37}{space 1}  147.50{col 46}{space 3}0.000{col 54}{space 4} .5928395{col 67}{space 3} .6088065
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5765172{col 26}{space 2} .0046394{col 37}{space 1}  124.26{col 46}{space 3}0.000{col 54}{space 4}  .567424{col 67}{space 3} .5856103
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5691468{col 26}{space 2} .0054022{col 37}{space 1}  105.35{col 46}{space 3}0.000{col 54}{space 4} .5585586{col 67}{space 3} .5797349
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5881851{col 26}{space 2} .0059478{col 37}{space 1}   98.89{col 46}{space 3}0.000{col 54}{space 4} .5765275{col 67}{space 3} .5998426
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .000191{col 26}{space 2} .0015046{col 37}{space 1}    0.13{col 46}{space 3}0.899{col 54}{space 4}-.0027579{col 67}{space 3} .0031399
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0015702{col 26}{space 2} .0019736{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4}-.0054385{col 67}{space 3}  .002298
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0125973{col 26}{space 2} .0023962{col 37}{space 1}   -5.26{col 46}{space 3}0.000{col 54}{space 4}-.0172939{col 67}{space 3}-.0079008
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0124104{col 26}{space 2} .0023818{col 37}{space 1}    5.21{col 46}{space 3}0.000{col 54}{space 4} .0077422{col 67}{space 3} .0170787
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}  .002901{col 26}{space 2} .0026847{col 37}{space 1}    1.08{col 46}{space 3}0.280{col 54}{space 4}-.0023609{col 67}{space 3} .0081629
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275665{col 26}{space 2} .0006939{col 37}{space 1}  -39.73{col 46}{space 3}0.000{col 54}{space 4}-.0289266{col 67}{space 3}-.0262064
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0254684{col 26}{space 2} .0009609{col 37}{space 1}  -26.50{col 46}{space 3}0.000{col 54}{space 4}-.0273518{col 67}{space 3} -.023585
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.022987{col 26}{space 2} .0009844{col 37}{space 1}  -23.35{col 46}{space 3}0.000{col 54}{space 4}-.0249163{col 67}{space 3}-.0210577
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0293048{col 26}{space 2} .0015717{col 37}{space 1}  -18.64{col 46}{space 3}0.000{col 54}{space 4}-.0323854{col 67}{space 3}-.0262243
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0302809{col 26}{space 2}  .001835{col 37}{space 1}  -16.50{col 46}{space 3}0.000{col 54}{space 4}-.0338775{col 67}{space 3}-.0266843
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1701308{col 26}{space 2} .0028288{col 37}{space 1}   60.14{col 46}{space 3}0.000{col 54}{space 4} .1645865{col 67}{space 3} .1756751
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1763389{col 26}{space 2} .0042766{col 37}{space 1}   41.23{col 46}{space 3}0.000{col 54}{space 4} .1679568{col 67}{space 3} .1847209
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1821748{col 26}{space 2} .0047904{col 37}{space 1}   38.03{col 46}{space 3}0.000{col 54}{space 4} .1727857{col 67}{space 3} .1915638
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2437151{col 26}{space 2} .0054888{col 37}{space 1}   44.40{col 46}{space 3}0.000{col 54}{space 4} .2329572{col 67}{space 3}  .254473
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}  .221817{col 26}{space 2} .0059773{col 37}{space 1}   37.11{col 46}{space 3}0.000{col 54}{space 4} .2101017{col 67}{space 3} .2335323
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0048713{col 26}{space 2} .0018821{col 37}{space 1}   -2.59{col 46}{space 3}0.010{col 54}{space 4}-.0085601{col 67}{space 3}-.0011825
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0116602{col 26}{space 2}  .002361{col 37}{space 1}   -4.94{col 46}{space 3}0.000{col 54}{space 4}-.0162877{col 67}{space 3}-.0070327
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0034175{col 26}{space 2} .0029322{col 37}{space 1}   -1.17{col 46}{space 3}0.244{col 54}{space 4}-.0091644{col 67}{space 3} .0023295
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0052293{col 26}{space 2}  .002321{col 37}{space 1}    2.25{col 46}{space 3}0.024{col 54}{space 4} .0006803{col 67}{space 3} .0097783
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0067863{col 26}{space 2} .0025719{col 37}{space 1}    2.64{col 46}{space 3}0.008{col 54}{space 4} .0017455{col 67}{space 3}  .011827
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.003064{col 26}{space 2} .0007737{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0045805{col 67}{space 3}-.0015475
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.000919{col 26}{space 2} .0012198{col 37}{space 1}   -0.75{col 46}{space 3}0.451{col 54}{space 4}-.0033097{col 67}{space 3} .0014717
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0073803{col 26}{space 2} .0012976{col 37}{space 1}   -5.69{col 46}{space 3}0.000{col 54}{space 4}-.0099236{col 67}{space 3} -.004837
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0048617{col 26}{space 2} .0015643{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-.0079277{col 67}{space 3}-.0017956
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.002776{col 26}{space 2} .0017695{col 37}{space 1}   -1.57{col 46}{space 3}0.117{col 54}{space 4}-.0062441{col 67}{space 3} .0006922
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.269805{col 26}{space 2} .0365451{col 37}{space 1}   62.11{col 46}{space 3}0.000{col 54}{space 4} 2.198178{col 67}{space 3} 2.341432
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.575411 .18758962 .54397422 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .020365575    .500699807          4536{txt}  {c |}
  2 {c |}  {res}.0154930833   .3876315367          3325{txt}  {c |}
  3 {c |}  {res}.0101233128   .2485563716          2148{txt}  {c |}
  4 {c |}  {res}.0083591297   .2057977015          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .020365575{txt}  {c |}
  2 {c |}  {res}.0154930833{txt}  {c |}
  3 {c |}  {res}.0101233128{txt}  {c |}
  4 {c |}  {res}.0101233128{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 51}{lalign 17:Number of obs}{col 68} = {res}{ralign 8:452,964}
{txt}{col 1}Absorbed variable: {res:school_id}{col 51}{lalign 17:No. of categories}{col 68} = {res}{ralign 8:1,375}
{txt}{col 51}{lalign 17:F({res:44}, {res:451545})}{col 68} = {res}{ralign 8:12810.11}
{txt}{col 51}{lalign 17:Prob > F}{col 68} = {res}{ralign 8:0.0000}
{txt}{col 51}{lalign 17:R-squared}{col 68} = {res}{ralign 8:0.6212}
{txt}{col 51}{lalign 17:Adj R-squared}{col 68} = {res}{ralign 8:0.6200}
{txt}{col 51}{lalign 17:Root MSE}{col 68} = {res}{ralign 8:0.5564}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0223237{col 26}{space 2} .0032607{col 37}{space 1}   -6.85{col 46}{space 3}0.000{col 54}{space 4}-.0287145{col 67}{space 3}-.0159329
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0624515{col 26}{space 2} .0035897{col 37}{space 1}   17.40{col 46}{space 3}0.000{col 54}{space 4} .0554158{col 67}{space 3} .0694873
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0790121{col 26}{space 2} .0035257{col 37}{space 1}  -22.41{col 46}{space 3}0.000{col 54}{space 4}-.0859224{col 67}{space 3}-.0721019
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0717548{col 26}{space 2} .0037073{col 37}{space 1}  -19.35{col 46}{space 3}0.000{col 54}{space 4}-.0790211{col 67}{space 3}-.0644886
{txt}{space 12} {c |}
1.has_old~nr {c |}{col 14}{res}{space 2} .0079882{col 26}{space 2} .0027514{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} .0025955{col 67}{space 3} .0133809
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003106{col 26}{space 2} 5.84e-06{col 37}{space 1}  -53.18{col 46}{space 3}0.000{col 54}{space 4} -.000322{col 67}{space 3}-.0002991
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0894297{col 26}{space 2} .0016967{col 37}{space 1}  -52.71{col 46}{space 3}0.000{col 54}{space 4}-.0927553{col 67}{space 3}-.0861042
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0838357{col 26}{space 2} .0031411{col 37}{space 1}   26.69{col 46}{space 3}0.000{col 54}{space 4} .0776793{col 67}{space 3} .0899921
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0192297{col 26}{space 2}  .002547{col 37}{space 1}   -7.55{col 46}{space 3}0.000{col 54}{space 4}-.0242217{col 67}{space 3}-.0142376
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1215812{col 26}{space 2} .0047884{col 37}{space 1}  -25.39{col 46}{space 3}0.000{col 54}{space 4}-.1309663{col 67}{space 3}-.1121961
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0029648{col 26}{space 2} .0051099{col 37}{space 1}    0.58{col 46}{space 3}0.562{col 54}{space 4}-.0070505{col 67}{space 3}   .01298
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}  -.02302{col 26}{space 2} .0021043{col 37}{space 1}  -10.94{col 46}{space 3}0.000{col 54}{space 4}-.0271444{col 67}{space 3}-.0188957
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2065984{col 26}{space 2} .0043238{col 37}{space 1}  -47.78{col 46}{space 3}0.000{col 54}{space 4} -.215073{col 67}{space 3}-.1981239
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1879488{col 26}{space 2} .0042402{col 37}{space 1}  -44.33{col 46}{space 3}0.000{col 54}{space 4}-.1962594{col 67}{space 3}-.1796383
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6039468{col 26}{space 2} .0027825{col 37}{space 1}  217.05{col 46}{space 3}0.000{col 54}{space 4} .5984932{col 67}{space 3} .6094003
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5894953{col 26}{space 2} .0039646{col 37}{space 1}  148.69{col 46}{space 3}0.000{col 54}{space 4} .5817249{col 67}{space 3} .5972657
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}   .57393{col 26}{space 2} .0045051{col 37}{space 1}  127.40{col 46}{space 3}0.000{col 54}{space 4} .5651001{col 67}{space 3} .5827599
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5692253{col 26}{space 2} .0052424{col 37}{space 1}  108.58{col 46}{space 3}0.000{col 54}{space 4} .5589503{col 67}{space 3} .5795003
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5872115{col 26}{space 2} .0057716{col 37}{space 1}  101.74{col 46}{space 3}0.000{col 54}{space 4} .5758994{col 67}{space 3} .5985236
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0038585{col 26}{space 2} .0014615{col 37}{space 1}    2.64{col 46}{space 3}0.008{col 54}{space 4}  .000994{col 67}{space 3} .0067229
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0024523{col 26}{space 2} .0019177{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.0013064{col 67}{space 3} .0062111
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0098333{col 26}{space 2} .0023241{col 37}{space 1}   -4.23{col 46}{space 3}0.000{col 54}{space 4}-.0143885{col 67}{space 3}-.0052781
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0126573{col 26}{space 2} .0023089{col 37}{space 1}    5.48{col 46}{space 3}0.000{col 54}{space 4} .0081319{col 67}{space 3} .0171826
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0045325{col 26}{space 2} .0026029{col 37}{space 1}    1.74{col 46}{space 3}0.082{col 54}{space 4}-.0005691{col 67}{space 3} .0096341
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.027904{col 26}{space 2} .0006726{col 37}{space 1}  -41.49{col 46}{space 3}0.000{col 54}{space 4}-.0292222{col 67}{space 3}-.0265857
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0255115{col 26}{space 2} .0009314{col 37}{space 1}  -27.39{col 46}{space 3}0.000{col 54}{space 4} -.027337{col 67}{space 3} -.023686
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0236158{col 26}{space 2} .0009537{col 37}{space 1}  -24.76{col 46}{space 3}0.000{col 54}{space 4} -.025485{col 67}{space 3}-.0217465
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0302196{col 26}{space 2} .0015225{col 37}{space 1}  -19.85{col 46}{space 3}0.000{col 54}{space 4}-.0332037{col 67}{space 3}-.0272355
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0308177{col 26}{space 2} .0017778{col 37}{space 1}  -17.33{col 46}{space 3}0.000{col 54}{space 4}-.0343022{col 67}{space 3}-.0273332
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1716184{col 26}{space 2} .0027561{col 37}{space 1}   62.27{col 46}{space 3}0.000{col 54}{space 4} .1662166{col 67}{space 3} .1770202
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1767385{col 26}{space 2} .0041541{col 37}{space 1}   42.55{col 46}{space 3}0.000{col 54}{space 4} .1685966{col 67}{space 3} .1848804
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1835819{col 26}{space 2} .0046497{col 37}{space 1}   39.48{col 46}{space 3}0.000{col 54}{space 4} .1744685{col 67}{space 3} .1926952
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2383754{col 26}{space 2}  .005329{col 37}{space 1}   44.73{col 46}{space 3}0.000{col 54}{space 4} .2279308{col 67}{space 3} .2488201
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2172303{col 26}{space 2} .0058033{col 37}{space 1}   37.43{col 46}{space 3}0.000{col 54}{space 4}  .205856{col 67}{space 3} .2286046
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0034009{col 26}{space 2}  .001827{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 54}{space 4}-.0069818{col 67}{space 3}   .00018
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0107131{col 26}{space 2} .0022905{col 37}{space 1}   -4.68{col 46}{space 3}0.000{col 54}{space 4}-.0152025{col 67}{space 3}-.0062238
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0026199{col 26}{space 2}  .002842{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-.0081901{col 67}{space 3} .0029503
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0071654{col 26}{space 2} .0022523{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0027509{col 67}{space 3}   .01158
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0085818{col 26}{space 2} .0024961{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .0036896{col 67}{space 3}  .013474
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0036528{col 26}{space 2} .0007501{col 37}{space 1}   -4.87{col 46}{space 3}0.000{col 54}{space 4}-.0051229{col 67}{space 3}-.0021826
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0013745{col 26}{space 2}  .001182{col 37}{space 1}   -1.16{col 46}{space 3}0.245{col 54}{space 4}-.0036911{col 67}{space 3} .0009422
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0075855{col 26}{space 2} .0012572{col 37}{space 1}   -6.03{col 46}{space 3}0.000{col 54}{space 4}-.0100495{col 67}{space 3}-.0051214
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0034574{col 26}{space 2} .0015171{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-.0064308{col 67}{space 3}-.0004839
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0018019{col 26}{space 2} .0017157{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-.0051646{col 67}{space 3} .0015608
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.075514{col 26}{space 2} .0357378{col 37}{space 1}   58.08{col 46}{space 3}0.000{col 54}{space 4} 2.005469{col 67}{space 3} 2.145559
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1374{txt}, {res}451545{txt}) = {res}23.865{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.57562982 .18883518 .54377474 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0208482323   .5068855794          4536{txt}  {c |}
  2 {c |}  {res}.0157951689   .3918012897          3325{txt}  {c |}
  3 {c |}  {res}.0102857354     .25061977          2148{txt}  {c |}
  4 {c |}  {res} .008493283   .2080369441          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0208482323{txt}  {c |}
  2 {c |}  {res}.0157951689{txt}  {c |}
  3 {c |}  {res}.0102857354{txt}  {c |}
  4 {c |}  {res}.0102857354{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   452,964
{txt}{hline 13}{c +}{hline 34}   F(83, 452880)   = {res}  8113.50
{txt}       Model {c |} {res} 220668.397        83  2658.65538   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 148401.096   452,880  .327683043   {txt}R-squared       ={res}    0.5979
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5978
{txt}       Total {c |} {res} 369069.493   452,963  .814789493   {txt}Root MSE        =   {res} .57244

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0138045{col 26}{space 2} .0037265{col 37}{space 1}   -3.70{col 46}{space 3}0.000{col 54}{space 4}-.0211084{col 67}{space 3}-.0065006
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0728478{col 26}{space 2} .0041764{col 37}{space 1}   17.44{col 46}{space 3}0.000{col 54}{space 4} .0646623{col 67}{space 3} .0810334
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0586824{col 26}{space 2} .0041652{col 37}{space 1}  -14.09{col 46}{space 3}0.000{col 54}{space 4} -.066846{col 67}{space 3}-.0505188
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.054431{col 26}{space 2} .0044251{col 37}{space 1}  -12.30{col 46}{space 3}0.000{col 54}{space 4}-.0631041{col 67}{space 3}-.0457578
{txt}{space 12} {c |}
1.has_old~nr {c |}{col 14}{res}{space 2}  .007793{col 26}{space 2} .0028185{col 37}{space 1}    2.76{col 46}{space 3}0.006{col 54}{space 4} .0022688{col 67}{space 3} .0133173
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003172{col 26}{space 2} 5.99e-06{col 37}{space 1}  -52.92{col 46}{space 3}0.000{col 54}{space 4} -.000329{col 67}{space 3}-.0003055
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0887284{col 26}{space 2} .0017422{col 37}{space 1}  -50.93{col 46}{space 3}0.000{col 54}{space 4} -.092143{col 67}{space 3}-.0853138
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0836792{col 26}{space 2} .0032211{col 37}{space 1}   25.98{col 46}{space 3}0.000{col 54}{space 4} .0773659{col 67}{space 3} .0899924
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} -.020304{col 26}{space 2} .0026121{col 37}{space 1}   -7.77{col 46}{space 3}0.000{col 54}{space 4}-.0254237{col 67}{space 3}-.0151842
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1217701{col 26}{space 2}  .004908{col 37}{space 1}  -24.81{col 46}{space 3}0.000{col 54}{space 4}-.1313896{col 67}{space 3}-.1121505
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0046304{col 26}{space 2} .0052379{col 37}{space 1}    0.88{col 46}{space 3}0.377{col 54}{space 4}-.0056358{col 67}{space 3} .0148966
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0222964{col 26}{space 2} .0021754{col 37}{space 1}  -10.25{col 46}{space 3}0.000{col 54}{space 4}  -.02656{col 67}{space 3}-.0180327
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2051942{col 26}{space 2} .0044263{col 37}{space 1}  -46.36{col 46}{space 3}0.000{col 54}{space 4}-.2138697{col 67}{space 3}-.1965188
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1773372{col 26}{space 2} .0043477{col 37}{space 1}  -40.79{col 46}{space 3}0.000{col 54}{space 4}-.1858586{col 67}{space 3}-.1688159
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .5972205{col 26}{space 2}  .002894{col 37}{space 1}  206.36{col 46}{space 3}0.000{col 54}{space 4} .5915483{col 67}{space 3} .6028927
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .587937{col 26}{space 2} .0041429{col 37}{space 1}  141.91{col 46}{space 3}0.000{col 54}{space 4}  .579817{col 67}{space 3}  .596057
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5699128{col 26}{space 2} .0047244{col 37}{space 1}  120.63{col 46}{space 3}0.000{col 54}{space 4} .5606531{col 67}{space 3} .5791724
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5809631{col 26}{space 2} .0054292{col 37}{space 1}  107.01{col 46}{space 3}0.000{col 54}{space 4} .5703221{col 67}{space 3} .5916042
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5957636{col 26}{space 2} .0059668{col 37}{space 1}   99.85{col 46}{space 3}0.000{col 54}{space 4} .5840689{col 67}{space 3} .6074583
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0015411{col 26}{space 2} .0015034{col 37}{space 1}    1.03{col 46}{space 3}0.305{col 54}{space 4}-.0014056{col 67}{space 3} .0044878
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .001655{col 26}{space 2} .0019753{col 37}{space 1}    0.84{col 46}{space 3}0.402{col 54}{space 4}-.0022166{col 67}{space 3} .0055265
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0111476{col 26}{space 2} .0023945{col 37}{space 1}   -4.66{col 46}{space 3}0.000{col 54}{space 4}-.0158408{col 67}{space 3}-.0064544
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0117859{col 26}{space 2} .0023749{col 37}{space 1}    4.96{col 46}{space 3}0.000{col 54}{space 4} .0071312{col 67}{space 3} .0164406
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0026687{col 26}{space 2}  .002678{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}  -.00258{col 67}{space 3} .0079174
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0273218{col 26}{space 2} .0006912{col 37}{space 1}  -39.53{col 46}{space 3}0.000{col 54}{space 4}-.0286766{col 67}{space 3}-.0259671
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0255481{col 26}{space 2} .0009572{col 37}{space 1}  -26.69{col 46}{space 3}0.000{col 54}{space 4}-.0274242{col 67}{space 3}-.0236719
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0230925{col 26}{space 2} .0009815{col 37}{space 1}  -23.53{col 46}{space 3}0.000{col 54}{space 4}-.0250162{col 67}{space 3}-.0211687
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.030176{col 26}{space 2} .0015643{col 37}{space 1}  -19.29{col 46}{space 3}0.000{col 54}{space 4} -.033242{col 67}{space 3}  -.02711
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0312164{col 26}{space 2} .0018261{col 37}{space 1}  -17.09{col 46}{space 3}0.000{col 54}{space 4}-.0347956{col 67}{space 3}-.0276372
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1690732{col 26}{space 2} .0028513{col 37}{space 1}   59.30{col 46}{space 3}0.000{col 54}{space 4} .1634847{col 67}{space 3} .1746617
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1756638{col 26}{space 2} .0042978{col 37}{space 1}   40.87{col 46}{space 3}0.000{col 54}{space 4} .1672402{col 67}{space 3} .1840875
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}   .18398{col 26}{space 2} .0048191{col 37}{space 1}   38.18{col 46}{space 3}0.000{col 54}{space 4} .1745348{col 67}{space 3} .1934252
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2503408{col 26}{space 2} .0055455{col 37}{space 1}   45.14{col 46}{space 3}0.000{col 54}{space 4} .2394719{col 67}{space 3} .2612097
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2333005{col 26}{space 2} .0060473{col 37}{space 1}   38.58{col 46}{space 3}0.000{col 54}{space 4} .2214479{col 67}{space 3} .2451531
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0049852{col 26}{space 2} .0018782{col 37}{space 1}   -2.65{col 46}{space 3}0.008{col 54}{space 4}-.0086665{col 67}{space 3}-.0013039
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0105158{col 26}{space 2} .0023555{col 37}{space 1}   -4.46{col 46}{space 3}0.000{col 54}{space 4}-.0151324{col 67}{space 3}-.0058992
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0028274{col 26}{space 2} .0029216{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-.0085537{col 67}{space 3} .0028989
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0102803{col 26}{space 2} .0023371{col 37}{space 1}    4.40{col 46}{space 3}0.000{col 54}{space 4} .0056996{col 67}{space 3}  .014861
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0114323{col 26}{space 2} .0025855{col 37}{space 1}    4.42{col 46}{space 3}0.000{col 54}{space 4} .0063647{col 67}{space 3} .0164999
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0033267{col 26}{space 2} .0007707{col 37}{space 1}   -4.32{col 46}{space 3}0.000{col 54}{space 4}-.0048372{col 67}{space 3}-.0018161
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0014484{col 26}{space 2} .0012145{col 37}{space 1}   -1.19{col 46}{space 3}0.233{col 54}{space 4}-.0038287{col 67}{space 3} .0009319
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0075699{col 26}{space 2} .0012926{col 37}{space 1}   -5.86{col 46}{space 3}0.000{col 54}{space 4}-.0101034{col 67}{space 3}-.0050364
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0038846{col 26}{space 2} .0015661{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.0069541{col 67}{space 3}-.0008152
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0023547{col 26}{space 2}   .00177{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-.0058238{col 67}{space 3} .0011144
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2} -.000515{col 26}{space 2} .0000275{col 37}{space 1}  -18.76{col 46}{space 3}0.000{col 54}{space 4}-.0005688{col 67}{space 3}-.0004611
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2}-.1538988{col 26}{space 2} .0244788{col 37}{space 1}   -6.29{col 46}{space 3}0.000{col 54}{space 4}-.2018766{col 67}{space 3} -.105921
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2} .1389683{col 26}{space 2} .0087903{col 37}{space 1}   15.81{col 46}{space 3}0.000{col 54}{space 4} .1217395{col 67}{space 3}  .156197
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2}  .158715{col 26}{space 2}  .008094{col 37}{space 1}   19.61{col 46}{space 3}0.000{col 54}{space 4}  .142851{col 67}{space 3} .1745789
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2}-.2530103{col 26}{space 2} .0159369{col 37}{space 1}  -15.88{col 46}{space 3}0.000{col 54}{space 4}-.2842462{col 67}{space 3}-.2217744
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2} .1239843{col 26}{space 2} .0319347{col 37}{space 1}    3.88{col 46}{space 3}0.000{col 54}{space 4} .0613933{col 67}{space 3} .1865754
{txt}peer_econ_~e {c |}{col 14}{res}{space 2}-.0652972{col 26}{space 2} .0081465{col 37}{space 1}   -8.02{col 46}{space 3}0.000{col 54}{space 4}-.0812642{col 67}{space 3}-.0493303
{txt}peer_limit~f {c |}{col 14}{res}{space 2}-.1192067{col 26}{space 2}  .017754{col 37}{space 1}   -6.71{col 46}{space 3}0.000{col 54}{space 4} -.154004{col 67}{space 3}-.0844094
{txt}peer_disab~d {c |}{col 14}{res}{space 2}-.1783445{col 26}{space 2}   .02952{col 37}{space 1}   -6.04{col 46}{space 3}0.000{col 54}{space 4}-.2362028{col 67}{space 3}-.1204862
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1491495{col 26}{space 2} .0134721{col 37}{space 1}   11.07{col 46}{space 3}0.000{col 54}{space 4} .1227446{col 67}{space 3} .1755543
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1160274{col 26}{space 2} .0184805{col 37}{space 1}    6.28{col 46}{space 3}0.000{col 54}{space 4} .0798062{col 67}{space 3} .1522486
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1438391{col 26}{space 2}  .022285{col 37}{space 1}    6.45{col 46}{space 3}0.000{col 54}{space 4} .1001612{col 67}{space 3} .1875169
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.3179939{col 26}{space 2} .0263739{col 37}{space 1}  -12.06{col 46}{space 3}0.000{col 54}{space 4} -.369686{col 67}{space 3}-.2663018
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1997825{col 26}{space 2} .0275057{col 37}{space 1}   -7.26{col 46}{space 3}0.000{col 54}{space 4}-.2536928{col 67}{space 3}-.1458722
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.2667167{col 26}{space 2} .0161459{col 37}{space 1}  -16.52{col 46}{space 3}0.000{col 54}{space 4}-.2983621{col 67}{space 3}-.2350713
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.182158{col 26}{space 2} .0213603{col 37}{space 1}   -8.53{col 46}{space 3}0.000{col 54}{space 4}-.2240236{col 67}{space 3}-.1402924
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0890385{col 26}{space 2} .0291088{col 37}{space 1}   -3.06{col 46}{space 3}0.002{col 54}{space 4}-.1460908{col 67}{space 3}-.0319862
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1233226{col 26}{space 2} .0320164{col 37}{space 1}    3.85{col 46}{space 3}0.000{col 54}{space 4} .0605715{col 67}{space 3} .1860737
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1138763{col 26}{space 2} .0342828{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .0466832{col 67}{space 3} .1810695
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1467482{col 26}{space 2}   .01799{col 37}{space 1}    8.16{col 46}{space 3}0.000{col 54}{space 4} .1114883{col 67}{space 3} .1820081
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0057164{col 26}{space 2}  .027549{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4}-.0597116{col 67}{space 3} .0482788
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0195492{col 26}{space 2} .0293066{col 37}{space 1}    0.67{col 46}{space 3}0.505{col 54}{space 4}-.0378909{col 67}{space 3} .0769893
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .205134{col 26}{space 2}  .035875{col 37}{space 1}    5.72{col 46}{space 3}0.000{col 54}{space 4} .1348201{col 67}{space 3} .2754479
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1597323{col 26}{space 2} .0364586{col 37}{space 1}    4.38{col 46}{space 3}0.000{col 54}{space 4} .0882747{col 67}{space 3}   .23119
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0885615{col 26}{space 2} .0123683{col 37}{space 1}   -7.16{col 46}{space 3}0.000{col 54}{space 4} -.112803{col 67}{space 3}  -.06432
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0579604{col 26}{space 2} .0181578{col 37}{space 1}   -3.19{col 46}{space 3}0.001{col 54}{space 4}-.0935491{col 67}{space 3}-.0223716
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.1346369{col 26}{space 2} .0215534{col 37}{space 1}   -6.25{col 46}{space 3}0.000{col 54}{space 4}-.1768809{col 67}{space 3}-.0923929
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1722318{col 26}{space 2} .0238608{col 37}{space 1}    7.22{col 46}{space 3}0.000{col 54}{space 4} .1254654{col 67}{space 3} .2189982
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0488891{col 26}{space 2} .0241404{col 37}{space 1}    2.03{col 46}{space 3}0.043{col 54}{space 4} .0015746{col 67}{space 3} .0962036
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .2301102{col 26}{space 2} .0184179{col 37}{space 1}   12.49{col 46}{space 3}0.000{col 54}{space 4} .1940118{col 67}{space 3} .2662087
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0344969{col 26}{space 2}   .02421{col 37}{space 1}    1.42{col 46}{space 3}0.154{col 54}{space 4}-.0129539{col 67}{space 3} .0819477
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0138978{col 26}{space 2} .0330676{col 37}{space 1}    0.42{col 46}{space 3}0.674{col 54}{space 4}-.0509137{col 67}{space 3} .0787093
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1903259{col 26}{space 2} .0308474{col 37}{space 1}   -6.17{col 46}{space 3}0.000{col 54}{space 4}-.2507859{col 67}{space 3} -.129866
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1512471{col 26}{space 2} .0319905{col 37}{space 1}   -4.73{col 46}{space 3}0.000{col 54}{space 4}-.2139474{col 67}{space 3}-.0885468
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.125669{col 26}{space 2}  .012982{col 37}{space 1}   -9.68{col 46}{space 3}0.000{col 54}{space 4}-.1511132{col 67}{space 3}-.1002247
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0456576{col 26}{space 2} .0252099{col 37}{space 1}    1.81{col 46}{space 3}0.070{col 54}{space 4}-.0037531{col 67}{space 3} .0950683
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0041252{col 26}{space 2} .0233043{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-.0415505{col 67}{space 3}  .049801
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0618737{col 26}{space 2} .0240175{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 54}{space 4}-.1089473{col 67}{space 3}-.0148001
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0303972{col 26}{space 2}  .022477{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-.0744514{col 67}{space 3} .0136571
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.316882{col 26}{space 2} .1688522{col 37}{space 1}   31.49{col 46}{space 3}0.000{col 54}{space 4} 4.985937{col 67}{space 3} 5.647827
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.57243606 .17915597 .54367838 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .017092691   .4557603551          4536{txt}  {c |}
  2 {c |}  {res}.0131753161   .3529923779          3325{txt}  {c |}
  3 {c |}  {res}.0090041814   .2347375441          2148{txt}  {c |}
  4 {c |}  {res}.0083821277   .2157770169          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .017092691{txt}  {c |}
  2 {c |}  {res}.0131753161{txt}  {c |}
  3 {c |}  {res}.0090041814{txt}  {c |}
  4 {c |}  {res}.0090041814{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:452,964}
{txt}{col 1}Absorbed variable: {res:school_id}{col 52}{lalign 17:No. of categories}{col 69} = {res}{ralign 7:1,375}
{txt}{col 52}{lalign 17:F({res:83}, {res:451506})}{col 69} = {res}{ralign 7:6835.37}
{txt}{col 52}{lalign 17:Prob > F}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 52}{lalign 17:R-squared}{col 69} = {res}{ralign 7:0.6226}
{txt}{col 52}{lalign 17:Adj R-squared}{col 69} = {res}{ralign 7:0.6214}
{txt}{col 52}{lalign 17:Root MSE}{col 69} = {res}{ralign 7:0.5554}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0150966{col 26}{space 2}  .003744{col 37}{space 1}   -4.03{col 46}{space 3}0.000{col 54}{space 4}-.0224348{col 67}{space 3}-.0077584
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0637333{col 26}{space 2} .0042706{col 37}{space 1}   14.92{col 46}{space 3}0.000{col 54}{space 4} .0553631{col 67}{space 3} .0721035
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0641968{col 26}{space 2} .0043745{col 37}{space 1}  -14.68{col 46}{space 3}0.000{col 54}{space 4}-.0727707{col 67}{space 3}-.0556229
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0510535{col 26}{space 2} .0047655{col 37}{space 1}  -10.71{col 46}{space 3}0.000{col 54}{space 4}-.0603938{col 67}{space 3}-.0417132
{txt}{space 12} {c |}
1.has_old~nr {c |}{col 14}{res}{space 2} .0074129{col 26}{space 2} .0027467{col 37}{space 1}    2.70{col 46}{space 3}0.007{col 54}{space 4} .0020295{col 67}{space 3} .0127964
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003103{col 26}{space 2} 5.84e-06{col 37}{space 1}  -53.14{col 46}{space 3}0.000{col 54}{space 4}-.0003217{col 67}{space 3}-.0002988
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0891712{col 26}{space 2}  .001694{col 37}{space 1}  -52.64{col 46}{space 3}0.000{col 54}{space 4}-.0924914{col 67}{space 3} -.085851
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0832505{col 26}{space 2}  .003136{col 37}{space 1}   26.55{col 46}{space 3}0.000{col 54}{space 4}  .077104{col 67}{space 3} .0893971
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0189597{col 26}{space 2}  .002544{col 37}{space 1}   -7.45{col 46}{space 3}0.000{col 54}{space 4}-.0239459{col 67}{space 3}-.0139734
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1211356{col 26}{space 2} .0047805{col 37}{space 1}  -25.34{col 46}{space 3}0.000{col 54}{space 4}-.1305052{col 67}{space 3}-.1117661
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}  .003979{col 26}{space 2} .0051029{col 37}{space 1}    0.78{col 46}{space 3}0.436{col 54}{space 4}-.0060226{col 67}{space 3} .0139807
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0225191{col 26}{space 2} .0021158{col 37}{space 1}  -10.64{col 46}{space 3}0.000{col 54}{space 4}-.0266661{col 67}{space 3}-.0183721
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2057629{col 26}{space 2} .0043207{col 37}{space 1}  -47.62{col 46}{space 3}0.000{col 54}{space 4}-.2142314{col 67}{space 3}-.1972944
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1815503{col 26}{space 2} .0042371{col 37}{space 1}  -42.85{col 46}{space 3}0.000{col 54}{space 4}-.1898549{col 67}{space 3}-.1732458
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .5969173{col 26}{space 2} .0028125{col 37}{space 1}  212.24{col 46}{space 3}0.000{col 54}{space 4} .5914049{col 67}{space 3} .6024297
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5863964{col 26}{space 2} .0040286{col 37}{space 1}  145.56{col 46}{space 3}0.000{col 54}{space 4} .5785004{col 67}{space 3} .5942924
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5698749{col 26}{space 2} .0045919{col 37}{space 1}  124.11{col 46}{space 3}0.000{col 54}{space 4}  .560875{col 67}{space 3} .5788748
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5809091{col 26}{space 2} .0052767{col 37}{space 1}  110.09{col 46}{space 3}0.000{col 54}{space 4} .5705668{col 67}{space 3} .5912513
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5958401{col 26}{space 2} .0058007{col 37}{space 1}  102.72{col 46}{space 3}0.000{col 54}{space 4} .5844709{col 67}{space 3} .6072093
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0030354{col 26}{space 2} .0014624{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0001692{col 67}{space 3} .0059016
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0023305{col 26}{space 2} .0019218{col 37}{space 1}    1.21{col 46}{space 3}0.225{col 54}{space 4}-.0014363{col 67}{space 3} .0060972
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0101893{col 26}{space 2} .0023286{col 37}{space 1}   -4.38{col 46}{space 3}0.000{col 54}{space 4}-.0147532{col 67}{space 3}-.0056254
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0118545{col 26}{space 2}  .002309{col 37}{space 1}    5.13{col 46}{space 3}0.000{col 54}{space 4} .0073289{col 67}{space 3} .0163801
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0033281{col 26}{space 2} .0026039{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.0017754{col 67}{space 3} .0084316
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275773{col 26}{space 2} .0006719{col 37}{space 1}  -41.04{col 46}{space 3}0.000{col 54}{space 4}-.0288942{col 67}{space 3}-.0262604
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0252748{col 26}{space 2} .0009306{col 37}{space 1}  -27.16{col 46}{space 3}0.000{col 54}{space 4}-.0270988{col 67}{space 3}-.0234508
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0233387{col 26}{space 2}  .000954{col 37}{space 1}  -24.47{col 46}{space 3}0.000{col 54}{space 4}-.0252084{col 67}{space 3}-.0214689
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0307398{col 26}{space 2} .0015204{col 37}{space 1}  -20.22{col 46}{space 3}0.000{col 54}{space 4}-.0337197{col 67}{space 3}-.0277598
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0312252{col 26}{space 2} .0017751{col 37}{space 1}  -17.59{col 46}{space 3}0.000{col 54}{space 4}-.0347043{col 67}{space 3}-.0277461
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1685585{col 26}{space 2}  .002771{col 37}{space 1}   60.83{col 46}{space 3}0.000{col 54}{space 4} .1631274{col 67}{space 3} .1739896
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1757057{col 26}{space 2} .0041783{col 37}{space 1}   42.05{col 46}{space 3}0.000{col 54}{space 4} .1675163{col 67}{space 3} .1838951
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1845811{col 26}{space 2} .0046833{col 37}{space 1}   39.41{col 46}{space 3}0.000{col 54}{space 4} .1754019{col 67}{space 3} .1937603
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2488468{col 26}{space 2} .0053901{col 37}{space 1}   46.17{col 46}{space 3}0.000{col 54}{space 4} .2382824{col 67}{space 3} .2594113
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2328188{col 26}{space 2} .0058786{col 37}{space 1}   39.60{col 46}{space 3}0.000{col 54}{space 4}  .221297{col 67}{space 3} .2443407
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0038647{col 26}{space 2} .0018267{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4} -.007445{col 67}{space 3}-.0002843
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106487{col 26}{space 2} .0022909{col 37}{space 1}   -4.65{col 46}{space 3}0.000{col 54}{space 4}-.0151388{col 67}{space 3}-.0061586
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0025812{col 26}{space 2} .0028406{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4}-.0081487{col 67}{space 3} .0029864
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0108721{col 26}{space 2} .0022722{col 37}{space 1}    4.78{col 46}{space 3}0.000{col 54}{space 4} .0064187{col 67}{space 3} .0153254
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0123863{col 26}{space 2} .0025142{col 37}{space 1}    4.93{col 46}{space 3}0.000{col 54}{space 4} .0074586{col 67}{space 3}  .017314
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0035983{col 26}{space 2} .0007492{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-.0050668{col 67}{space 3}-.0021298
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0014316{col 26}{space 2} .0011806{col 37}{space 1}   -1.21{col 46}{space 3}0.225{col 54}{space 4}-.0037456{col 67}{space 3} .0008823
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0076453{col 26}{space 2} .0012563{col 37}{space 1}   -6.09{col 46}{space 3}0.000{col 54}{space 4}-.0101076{col 67}{space 3} -.005183
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0029971{col 26}{space 2} .0015224{col 37}{space 1}   -1.97{col 46}{space 3}0.049{col 54}{space 4}-.0059809{col 67}{space 3}-.0000133
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0022123{col 26}{space 2} .0017205{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-.0055845{col 67}{space 3} .0011598
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2} .0001136{col 26}{space 2} .0000561{col 37}{space 1}    2.02{col 46}{space 3}0.043{col 54}{space 4} 3.57e-06{col 67}{space 3} .0002236
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2}-.4015039{col 26}{space 2} .0348964{col 37}{space 1}  -11.51{col 46}{space 3}0.000{col 54}{space 4}-.4698997{col 67}{space 3}-.3331081
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2}-.0985343{col 26}{space 2} .0568121{col 37}{space 1}   -1.73{col 46}{space 3}0.083{col 54}{space 4}-.2098842{col 67}{space 3} .0128157
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2}-.0397194{col 26}{space 2} .0420999{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-.1222339{col 67}{space 3} .0427951
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2}-.1062202{col 26}{space 2} .0801213{col 37}{space 1}   -1.33{col 46}{space 3}0.185{col 54}{space 4}-.2632555{col 67}{space 3} .0508151
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2}-.0541056{col 26}{space 2} .0560748{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4}-.1640105{col 67}{space 3} .0557994
{txt}peer_econ_~e {c |}{col 14}{res}{space 2}-.0003742{col 26}{space 2} .0154425{col 37}{space 1}   -0.02{col 46}{space 3}0.981{col 54}{space 4} -.030641{col 67}{space 3} .0298927
{txt}peer_limit~f {c |}{col 14}{res}{space 2} .0000505{col 26}{space 2} .0420716{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.0824087{col 67}{space 3} .0825096
{txt}peer_disab~d {c |}{col 14}{res}{space 2}-.1964278{col 26}{space 2} .0527052{col 37}{space 1}   -3.73{col 46}{space 3}0.000{col 54}{space 4}-.2997284{col 67}{space 3}-.0931273
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1535952{col 26}{space 2} .0209721{col 37}{space 1}   -7.32{col 46}{space 3}0.000{col 54}{space 4}-.1946999{col 67}{space 3}-.1124905
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1115094{col 26}{space 2} .0242217{col 37}{space 1}   -4.60{col 46}{space 3}0.000{col 54}{space 4}-.1589831{col 67}{space 3}-.0640357
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0989599{col 26}{space 2} .0265073{col 37}{space 1}   -3.73{col 46}{space 3}0.000{col 54}{space 4}-.1509134{col 67}{space 3}-.0470064
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.4125573{col 26}{space 2} .0299832{col 37}{space 1}  -13.76{col 46}{space 3}0.000{col 54}{space 4}-.4713234{col 67}{space 3}-.3537912
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.3049281{col 26}{space 2} .0308434{col 37}{space 1}   -9.89{col 46}{space 3}0.000{col 54}{space 4}-.3653801{col 67}{space 3} -.244476
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1762725{col 26}{space 2} .0245598{col 37}{space 1}   -7.18{col 46}{space 3}0.000{col 54}{space 4}-.2244089{col 67}{space 3}-.1281361
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1079023{col 26}{space 2} .0284174{col 37}{space 1}   -3.80{col 46}{space 3}0.000{col 54}{space 4}-.1635996{col 67}{space 3}-.0522051
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0223077{col 26}{space 2} .0336229{col 37}{space 1}    0.66{col 46}{space 3}0.507{col 54}{space 4}-.0435922{col 67}{space 3} .0882076
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0240573{col 26}{space 2} .0357337{col 37}{space 1}    0.67{col 46}{space 3}0.501{col 54}{space 4}-.0459796{col 67}{space 3} .0940943
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0788735{col 26}{space 2} .0378766{col 37}{space 1}    2.08{col 46}{space 3}0.037{col 54}{space 4} .0046364{col 67}{space 3} .1531105
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1434535{col 26}{space 2} .0271311{col 37}{space 1}    5.29{col 46}{space 3}0.000{col 54}{space 4} .0902774{col 67}{space 3} .1966296
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0846034{col 26}{space 2}  .036921{col 37}{space 1}   -2.29{col 46}{space 3}0.022{col 54}{space 4}-.1569674{col 67}{space 3}-.0122395
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0462057{col 26}{space 2} .0346726{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4} -.114163{col 67}{space 3} .0217516
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .190313{col 26}{space 2}  .040241{col 37}{space 1}    4.73{col 46}{space 3}0.000{col 54}{space 4} .1114419{col 67}{space 3} .2691841
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1349953{col 26}{space 2} .0414735{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0537086{col 67}{space 3}  .216282
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0222532{col 26}{space 2}  .017682{col 37}{space 1}   -1.26{col 46}{space 3}0.208{col 54}{space 4}-.0569094{col 67}{space 3} .0124031
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.063339{col 26}{space 2} .0220058{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-.1064697{col 67}{space 3}-.0202083
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.099213{col 26}{space 2} .0240944{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-.1464373{col 67}{space 3}-.0519887
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0431717{col 26}{space 2} .0265929{col 37}{space 1}    1.62{col 46}{space 3}0.104{col 54}{space 4}-.0089497{col 67}{space 3}  .095293
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0702639{col 26}{space 2} .0268492{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-.1228876{col 67}{space 3}-.0176402
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1367777{col 26}{space 2} .0259169{col 37}{space 1}    5.28{col 46}{space 3}0.000{col 54}{space 4} .0859813{col 67}{space 3} .1875741
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0239882{col 26}{space 2} .0300814{col 37}{space 1}    0.80{col 46}{space 3}0.425{col 54}{space 4}-.0349704{col 67}{space 3} .0829469
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.084113{col 26}{space 2} .0367374{col 37}{space 1}   -2.29{col 46}{space 3}0.022{col 54}{space 4}-.1561173{col 67}{space 3}-.0121088
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0640579{col 26}{space 2} .0341303{col 37}{space 1}   -1.88{col 46}{space 3}0.061{col 54}{space 4}-.1309522{col 67}{space 3} .0028363
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1343649{col 26}{space 2} .0354644{col 37}{space 1}   -3.79{col 46}{space 3}0.000{col 54}{space 4}-.2038741{col 67}{space 3}-.0648557
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0808538{col 26}{space 2} .0206445{col 37}{space 1}   -3.92{col 46}{space 3}0.000{col 54}{space 4}-.1213163{col 67}{space 3}-.0403912
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0929557{col 26}{space 2} .0317118{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .0308016{col 67}{space 3} .1551099
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0885777{col 26}{space 2} .0273025{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} .0350655{col 67}{space 3} .1420898
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0554726{col 26}{space 2} .0290011{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4}-.1123139{col 67}{space 3} .0013686
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0231846{col 26}{space 2} .0283375{col 37}{space 1}    0.82{col 46}{space 3}0.413{col 54}{space 4} -.032356{col 67}{space 3} .0787252
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.666666{col 26}{space 2} .3455041{col 37}{space 1}    4.82{col 46}{space 3}0.000{col 54}{space 4} .9894891{col 67}{space 3} 2.343844
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1374{txt}, {res}451506{txt}) = {res}21.483{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.58237391 .20873794 .54367991 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0287501406   .5906600944          4536{txt}  {c |}
  2 {c |}  {res}.0247673719   .5151923828          3325{txt}  {c |}
  3 {c |}  {res}.0205193194   .4201447199          2148{txt}  {c |}
  4 {c |}  {res}.0193903736   .3953055373          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0287501406{txt}  {c |}
  2 {c |}  {res}.0247673719{txt}  {c |}
  3 {c |}  {res}.0205193194{txt}  {c |}
  4 {c |}  {res}.0205193194{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   451,951
                                                {txt}F(1, 1288)        =  {res}  1507.41
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0390
                                                {txt}Root MSE          =    {res} .56399

{txt}{ralign 78:(Std. err. adjusted for {res:1,289} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~_r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~a {c |}{col 14}{res}{space 2} .9779508{col 26}{space 2} .0251885{col 37}{space 1}   38.83{col 46}{space 3}0.000{col 54}{space 4} .9285359{col 67}{space 3} 1.027366
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .002547{col 26}{space 2} .0019772{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4}-.0013319{col 67}{space 3} .0064259
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling_enr.ster} saved

Linear regression                               Number of obs     = {res}   451,951
                                                {txt}F(1, 1288)        =  {res}  1292.31
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0315
                                                {txt}Root MSE          =    {res} .56326

{txt}{ralign 78:(Std. err. adjusted for {res:1,289} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~er{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} .9815573{col 26}{space 2} .0273044{col 37}{space 1}   35.95{col 46}{space 3}0.000{col 54}{space 4} .9279913{col 67}{space 3} 1.035123
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0036977{col 26}{space 2} .0019938{col 37}{space 1}    1.85{col 46}{space 3}0.064{col 54}{space 4}-.0002137{col 67}{space 3} .0076091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_peer_sibling_enr.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_ela_sibling_enr.dta{rm}
saved
{p_end}
(CST/SBAC Student Test Score Samples)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   452,964
{txt}{hline 13}{c +}{hline 34}   F(44, 452919)   = {res} 15040.44
{txt}       Model {c |} {res} 219110.909        44  4979.79339   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 149958.584   452,919  .331093603   {txt}R-squared       ={res}    0.5937
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5936
{txt}       Total {c |} {res} 369069.493   452,963  .814789493   {txt}Root MSE        =   {res} .57541

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0299538{col 26}{space 2}   .00334{col 37}{space 1}   -8.97{col 46}{space 3}0.000{col 54}{space 4}   -.0365{col 67}{space 3}-.0234075
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0700523{col 26}{space 2} .0036647{col 37}{space 1}   19.12{col 46}{space 3}0.000{col 54}{space 4} .0628696{col 67}{space 3} .0772351
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0691739{col 26}{space 2}  .003591{col 37}{space 1}  -19.26{col 46}{space 3}0.000{col 54}{space 4}-.0762122{col 67}{space 3}-.0621355
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0616567{col 26}{space 2} .0037777{col 37}{space 1}  -16.32{col 46}{space 3}0.000{col 54}{space 4} -.069061{col 67}{space 3}-.0542525
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0146292{col 26}{space 2} .0035423{col 37}{space 1}   -4.13{col 46}{space 3}0.000{col 54}{space 4}-.0215721{col 67}{space 3}-.0076863
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003443{col 26}{space 2} 5.97e-06{col 37}{space 1}  -57.69{col 46}{space 3}0.000{col 54}{space 4} -.000356{col 67}{space 3}-.0003326
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0876331{col 26}{space 2}  .001749{col 37}{space 1}  -50.10{col 46}{space 3}0.000{col 54}{space 4}-.0910612{col 67}{space 3}-.0842051
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1018353{col 26}{space 2} .0029054{col 37}{space 1}   35.05{col 46}{space 3}0.000{col 54}{space 4} .0961408{col 67}{space 3} .1075298
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0020805{col 26}{space 2} .0023896{col 37}{space 1}   -0.87{col 46}{space 3}0.384{col 54}{space 4} -.006764{col 67}{space 3}  .002603
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1430445{col 26}{space 2} .0047273{col 37}{space 1}  -30.26{col 46}{space 3}0.000{col 54}{space 4}-.1523098{col 67}{space 3}-.1337792
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0089632{col 26}{space 2} .0052142{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0012564{col 67}{space 3} .0191828
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0312698{col 26}{space 2} .0020172{col 37}{space 1}  -15.50{col 46}{space 3}0.000{col 54}{space 4}-.0352236{col 67}{space 3}-.0273161
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2086683{col 26}{space 2} .0043965{col 37}{space 1}  -47.46{col 46}{space 3}0.000{col 54}{space 4}-.2172853{col 67}{space 3}-.2000512
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1775946{col 26}{space 2} .0043446{col 37}{space 1}  -40.88{col 46}{space 3}0.000{col 54}{space 4}-.1861098{col 67}{space 3}-.1690793
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6133074{col 26}{space 2} .0028532{col 37}{space 1}  214.95{col 46}{space 3}0.000{col 54}{space 4} .6077152{col 67}{space 3} .6188997
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .6005736{col 26}{space 2} .0040734{col 37}{space 1}  147.44{col 46}{space 3}0.000{col 54}{space 4} .5925898{col 67}{space 3} .6085574
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5763234{col 26}{space 2} .0046395{col 37}{space 1}  124.22{col 46}{space 3}0.000{col 54}{space 4}   .56723{col 67}{space 3} .5854167
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5690655{col 26}{space 2} .0054022{col 37}{space 1}  105.34{col 46}{space 3}0.000{col 54}{space 4} .5584773{col 67}{space 3} .5796536
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5881378{col 26}{space 2} .0059478{col 37}{space 1}   98.88{col 46}{space 3}0.000{col 54}{space 4} .5764803{col 67}{space 3} .5997952
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0000971{col 26}{space 2} .0015046{col 37}{space 1}    0.06{col 46}{space 3}0.949{col 54}{space 4}-.0028518{col 67}{space 3}  .003046
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.001639{col 26}{space 2} .0019736{col 37}{space 1}   -0.83{col 46}{space 3}0.406{col 54}{space 4}-.0055073{col 67}{space 3} .0022293
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0126914{col 26}{space 2} .0023962{col 37}{space 1}   -5.30{col 46}{space 3}0.000{col 54}{space 4}-.0173879{col 67}{space 3}-.0079949
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0123427{col 26}{space 2} .0023818{col 37}{space 1}    5.18{col 46}{space 3}0.000{col 54}{space 4} .0076745{col 67}{space 3} .0170109
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0027963{col 26}{space 2} .0026847{col 37}{space 1}    1.04{col 46}{space 3}0.298{col 54}{space 4}-.0024656{col 67}{space 3} .0080581
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275465{col 26}{space 2} .0006939{col 37}{space 1}  -39.70{col 46}{space 3}0.000{col 54}{space 4}-.0289066{col 67}{space 3}-.0261864
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0254476{col 26}{space 2} .0009609{col 37}{space 1}  -26.48{col 46}{space 3}0.000{col 54}{space 4} -.027331{col 67}{space 3}-.0235642
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0229646{col 26}{space 2} .0009844{col 37}{space 1}  -23.33{col 46}{space 3}0.000{col 54}{space 4}-.0248939{col 67}{space 3}-.0210353
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0293054{col 26}{space 2} .0015717{col 37}{space 1}  -18.65{col 46}{space 3}0.000{col 54}{space 4}-.0323859{col 67}{space 3}-.0262248
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0302538{col 26}{space 2}  .001835{col 37}{space 1}  -16.49{col 46}{space 3}0.000{col 54}{space 4}-.0338504{col 67}{space 3}-.0266572
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1701864{col 26}{space 2} .0028286{col 37}{space 1}   60.17{col 46}{space 3}0.000{col 54}{space 4} .1646423{col 67}{space 3} .1757304
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1765146{col 26}{space 2} .0042764{col 37}{space 1}   41.28{col 46}{space 3}0.000{col 54}{space 4} .1681329{col 67}{space 3} .1848962
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1821376{col 26}{space 2} .0047904{col 37}{space 1}   38.02{col 46}{space 3}0.000{col 54}{space 4} .1727486{col 67}{space 3} .1915266
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2436567{col 26}{space 2} .0054888{col 37}{space 1}   44.39{col 46}{space 3}0.000{col 54}{space 4} .2328988{col 67}{space 3} .2544146
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2216723{col 26}{space 2} .0059773{col 37}{space 1}   37.09{col 46}{space 3}0.000{col 54}{space 4}  .209957{col 67}{space 3} .2333876
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0049502{col 26}{space 2} .0018821{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4} -.008639{col 67}{space 3}-.0012614
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0117177{col 26}{space 2}  .002361{col 37}{space 1}   -4.96{col 46}{space 3}0.000{col 54}{space 4}-.0163452{col 67}{space 3}-.0070902
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0034905{col 26}{space 2} .0029321{col 37}{space 1}   -1.19{col 46}{space 3}0.234{col 54}{space 4}-.0092375{col 67}{space 3} .0022564
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0051337{col 26}{space 2}  .002321{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .0005847{col 67}{space 3} .0096828
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0067113{col 26}{space 2} .0025718{col 37}{space 1}    2.61{col 46}{space 3}0.009{col 54}{space 4} .0016706{col 67}{space 3}  .011752
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0030566{col 26}{space 2} .0007737{col 37}{space 1}   -3.95{col 46}{space 3}0.000{col 54}{space 4}-.0045731{col 67}{space 3}  -.00154
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0009267{col 26}{space 2} .0012198{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-.0033174{col 67}{space 3}  .001464
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0073742{col 26}{space 2} .0012976{col 37}{space 1}   -5.68{col 46}{space 3}0.000{col 54}{space 4}-.0099175{col 67}{space 3} -.004831
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0048943{col 26}{space 2} .0015643{col 37}{space 1}   -3.13{col 46}{space 3}0.002{col 54}{space 4}-.0079603{col 67}{space 3}-.0018283
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0028064{col 26}{space 2} .0017695{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.0062746{col 67}{space 3} .0006617
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  2.27585{col 26}{space 2} .0365385{col 37}{space 1}   62.29{col 46}{space 3}0.000{col 54}{space 4} 2.204236{col 67}{space 3} 2.347465
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.57540734 .18759061 .54397001 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0203628226   .5006761856          4536{txt}  {c |}
  2 {c |}  {res}.0154916423   .3876623331          3325{txt}  {c |}
  3 {c |}  {res}.0101204006   .2484965548          2148{txt}  {c |}
  4 {c |}  {res}.0083604398   .2057381801          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0203628226{txt}  {c |}
  2 {c |}  {res}.0154916423{txt}  {c |}
  3 {c |}  {res}.0101204006{txt}  {c |}
  4 {c |}  {res}.0101204006{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 51}{lalign 17:Number of obs}{col 68} = {res}{ralign 8:452,964}
{txt}{col 1}Absorbed variable: {res:school_id}{col 51}{lalign 17:No. of categories}{col 68} = {res}{ralign 8:1,375}
{txt}{col 51}{lalign 17:F({res:44}, {res:451545})}{col 68} = {res}{ralign 8:12810.30}
{txt}{col 51}{lalign 17:Prob > F}{col 68} = {res}{ralign 8:0.0000}
{txt}{col 51}{lalign 17:R-squared}{col 68} = {res}{ralign 8:0.6212}
{txt}{col 51}{lalign 17:Adj R-squared}{col 68} = {res}{ralign 8:0.6200}
{txt}{col 51}{lalign 17:Root MSE}{col 68} = {res}{ralign 8:0.5564}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0222218{col 26}{space 2} .0032607{col 37}{space 1}   -6.82{col 46}{space 3}0.000{col 54}{space 4}-.0286126{col 67}{space 3}-.0158309
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0626994{col 26}{space 2} .0035897{col 37}{space 1}   17.47{col 46}{space 3}0.000{col 54}{space 4} .0556638{col 67}{space 3}  .069735
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0788669{col 26}{space 2} .0035258{col 37}{space 1}  -22.37{col 46}{space 3}0.000{col 54}{space 4}-.0857773{col 67}{space 3}-.0719564
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.071812{col 26}{space 2} .0037072{col 37}{space 1}  -19.37{col 46}{space 3}0.000{col 54}{space 4}-.0790781{col 67}{space 3}-.0645459
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0119683{col 26}{space 2} .0034406{col 37}{space 1}   -3.48{col 46}{space 3}0.001{col 54}{space 4}-.0187118{col 67}{space 3}-.0052249
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003112{col 26}{space 2} 5.84e-06{col 37}{space 1}  -53.28{col 46}{space 3}0.000{col 54}{space 4}-.0003226{col 67}{space 3}-.0002997
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0894131{col 26}{space 2} .0016967{col 37}{space 1}  -52.70{col 46}{space 3}0.000{col 54}{space 4}-.0927386{col 67}{space 3}-.0860876
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0843101{col 26}{space 2} .0031405{col 37}{space 1}   26.85{col 46}{space 3}0.000{col 54}{space 4} .0781548{col 67}{space 3} .0904655
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0190535{col 26}{space 2} .0025473{col 37}{space 1}   -7.48{col 46}{space 3}0.000{col 54}{space 4}-.0240461{col 67}{space 3}-.0140608
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1216364{col 26}{space 2} .0047883{col 37}{space 1}  -25.40{col 46}{space 3}0.000{col 54}{space 4}-.1310214{col 67}{space 3}-.1122513
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0028608{col 26}{space 2} .0051098{col 37}{space 1}    0.56{col 46}{space 3}0.576{col 54}{space 4}-.0071543{col 67}{space 3} .0128759
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2} -.022926{col 26}{space 2} .0021043{col 37}{space 1}  -10.89{col 46}{space 3}0.000{col 54}{space 4}-.0270504{col 67}{space 3}-.0188015
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2} -.206551{col 26}{space 2} .0043238{col 37}{space 1}  -47.77{col 46}{space 3}0.000{col 54}{space 4}-.2150255{col 67}{space 3}-.1980765
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1881318{col 26}{space 2} .0042401{col 37}{space 1}  -44.37{col 46}{space 3}0.000{col 54}{space 4}-.1964423{col 67}{space 3}-.1798213
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .603788{col 26}{space 2} .0027826{col 37}{space 1}  216.98{col 46}{space 3}0.000{col 54}{space 4} .5983341{col 67}{space 3} .6092419
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5892938{col 26}{space 2} .0039647{col 37}{space 1}  148.63{col 46}{space 3}0.000{col 54}{space 4} .5815231{col 67}{space 3} .5970645
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5737871{col 26}{space 2} .0045052{col 37}{space 1}  127.36{col 46}{space 3}0.000{col 54}{space 4}  .564957{col 67}{space 3} .5826172
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5691612{col 26}{space 2} .0052424{col 37}{space 1}  108.57{col 46}{space 3}0.000{col 54}{space 4} .5588862{col 67}{space 3} .5794362
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5871753{col 26}{space 2} .0057716{col 37}{space 1}  101.74{col 46}{space 3}0.000{col 54}{space 4} .5758631{col 67}{space 3} .5984874
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0037906{col 26}{space 2} .0014615{col 37}{space 1}    2.59{col 46}{space 3}0.009{col 54}{space 4} .0009261{col 67}{space 3} .0066551
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0024074{col 26}{space 2} .0019178{col 37}{space 1}    1.26{col 46}{space 3}0.209{col 54}{space 4}-.0013513{col 67}{space 3} .0061662
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0098966{col 26}{space 2} .0023241{col 37}{space 1}   -4.26{col 46}{space 3}0.000{col 54}{space 4}-.0144518{col 67}{space 3}-.0053414
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0126022{col 26}{space 2} .0023089{col 37}{space 1}    5.46{col 46}{space 3}0.000{col 54}{space 4} .0080768{col 67}{space 3} .0171275
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0044476{col 26}{space 2} .0026029{col 37}{space 1}    1.71{col 46}{space 3}0.088{col 54}{space 4}-.0006539{col 67}{space 3} .0095492
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0278884{col 26}{space 2} .0006726{col 37}{space 1}  -41.46{col 46}{space 3}0.000{col 54}{space 4}-.0292066{col 67}{space 3}-.0265701
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0254953{col 26}{space 2} .0009314{col 37}{space 1}  -27.37{col 46}{space 3}0.000{col 54}{space 4}-.0273208{col 67}{space 3}-.0236699
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0235999{col 26}{space 2} .0009537{col 37}{space 1}  -24.75{col 46}{space 3}0.000{col 54}{space 4}-.0254691{col 67}{space 3}-.0217307
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0302199{col 26}{space 2} .0015225{col 37}{space 1}  -19.85{col 46}{space 3}0.000{col 54}{space 4} -.033204{col 67}{space 3}-.0272358
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0307949{col 26}{space 2} .0017778{col 37}{space 1}  -17.32{col 46}{space 3}0.000{col 54}{space 4}-.0342794{col 67}{space 3}-.0273104
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1716689{col 26}{space 2} .0027559{col 37}{space 1}   62.29{col 46}{space 3}0.000{col 54}{space 4} .1662674{col 67}{space 3} .1770705
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1768753{col 26}{space 2} .0041539{col 37}{space 1}   42.58{col 46}{space 3}0.000{col 54}{space 4} .1687338{col 67}{space 3} .1850168
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1835627{col 26}{space 2} .0046497{col 37}{space 1}   39.48{col 46}{space 3}0.000{col 54}{space 4} .1744494{col 67}{space 3} .1926761
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2383428{col 26}{space 2}  .005329{col 37}{space 1}   44.73{col 46}{space 3}0.000{col 54}{space 4} .2278982{col 67}{space 3} .2487875
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2171213{col 26}{space 2} .0058033{col 37}{space 1}   37.41{col 46}{space 3}0.000{col 54}{space 4}  .205747{col 67}{space 3} .2284957
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0034529{col 26}{space 2}  .001827{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-.0070338{col 67}{space 3}  .000128
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0107538{col 26}{space 2} .0022905{col 37}{space 1}   -4.69{col 46}{space 3}0.000{col 54}{space 4}-.0152431{col 67}{space 3}-.0062644
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0026735{col 26}{space 2}  .002842{col 37}{space 1}   -0.94{col 46}{space 3}0.347{col 54}{space 4}-.0082437{col 67}{space 3} .0028966
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0071059{col 26}{space 2} .0022524{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4} .0026913{col 67}{space 3} .0115204
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0085392{col 26}{space 2} .0024961{col 37}{space 1}    3.42{col 46}{space 3}0.001{col 54}{space 4}  .003647{col 67}{space 3} .0134314
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0036482{col 26}{space 2} .0007501{col 37}{space 1}   -4.86{col 46}{space 3}0.000{col 54}{space 4}-.0051184{col 67}{space 3} -.002178
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0013803{col 26}{space 2}  .001182{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-.0036969{col 67}{space 3} .0009364
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0075803{col 26}{space 2} .0012572{col 37}{space 1}   -6.03{col 46}{space 3}0.000{col 54}{space 4}-.0100443{col 67}{space 3}-.0051162
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0034801{col 26}{space 2} .0015171{col 37}{space 1}   -2.29{col 46}{space 3}0.022{col 54}{space 4}-.0064535{col 67}{space 3}-.0005067
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.001821{col 26}{space 2} .0017157{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-.0051837{col 67}{space 3} .0015416
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.080536{col 26}{space 2} .0357316{col 37}{space 1}   58.23{col 46}{space 3}0.000{col 54}{space 4} 2.010503{col 67}{space 3} 2.150569
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1374{txt}, {res}451545{txt}) = {res}23.863{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.57562624 .18883636 .54377054 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0208465785   .5068746921          4536{txt}  {c |}
  2 {c |}  {res}.0157937692   .3918197475          3325{txt}  {c |}
  3 {c |}  {res}.0102833286   .2505674259          2148{txt}  {c |}
  4 {c |}  {res}.0084945002    .207991042          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0208465785{txt}  {c |}
  2 {c |}  {res}.0157937692{txt}  {c |}
  3 {c |}  {res}.0102833286{txt}  {c |}
  4 {c |}  {res}.0102833286{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   452,964
{txt}{hline 13}{c +}{hline 34}   F(83, 452880)   = {res}  8113.89
{txt}       Model {c |} {res} 220672.651        83  2658.70664   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 148396.842   452,880  .327673648   {txt}R-squared       ={res}    0.5979
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5978
{txt}       Total {c |} {res} 369069.493   452,963  .814789493   {txt}Root MSE        =   {res} .57243

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0137034{col 26}{space 2} .0037265{col 37}{space 1}   -3.68{col 46}{space 3}0.000{col 54}{space 4}-.0210072{col 67}{space 3}-.0063995
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0731834{col 26}{space 2} .0041763{col 37}{space 1}   17.52{col 46}{space 3}0.000{col 54}{space 4}  .064998{col 67}{space 3} .0813689
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0584718{col 26}{space 2} .0041652{col 37}{space 1}  -14.04{col 46}{space 3}0.000{col 54}{space 4}-.0666355{col 67}{space 3}-.0503081
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0544477{col 26}{space 2}  .004425{col 37}{space 1}  -12.30{col 46}{space 3}0.000{col 54}{space 4}-.0631207{col 67}{space 3}-.0457748
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0160131{col 26}{space 2} .0035256{col 37}{space 1}   -4.54{col 46}{space 3}0.000{col 54}{space 4}-.0229231{col 67}{space 3}-.0091031
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003179{col 26}{space 2} 5.99e-06{col 37}{space 1}  -53.03{col 46}{space 3}0.000{col 54}{space 4}-.0003296{col 67}{space 3}-.0003061
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0887098{col 26}{space 2} .0017421{col 37}{space 1}  -50.92{col 46}{space 3}0.000{col 54}{space 4}-.0921244{col 67}{space 3}-.0852953
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0842341{col 26}{space 2} .0032205{col 37}{space 1}   26.16{col 46}{space 3}0.000{col 54}{space 4}  .077922{col 67}{space 3} .0905462
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0200824{col 26}{space 2} .0026124{col 37}{space 1}   -7.69{col 46}{space 3}0.000{col 54}{space 4}-.0252027{col 67}{space 3}-.0149621
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1218357{col 26}{space 2} .0049079{col 37}{space 1}  -24.82{col 46}{space 3}0.000{col 54}{space 4}-.1314551{col 67}{space 3}-.1122163
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0045197{col 26}{space 2} .0052378{col 37}{space 1}    0.86{col 46}{space 3}0.388{col 54}{space 4}-.0057462{col 67}{space 3} .0147856
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0221839{col 26}{space 2} .0021754{col 37}{space 1}  -10.20{col 46}{space 3}0.000{col 54}{space 4}-.0264476{col 67}{space 3}-.0179203
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2051088{col 26}{space 2} .0044263{col 37}{space 1}  -46.34{col 46}{space 3}0.000{col 54}{space 4}-.2137842{col 67}{space 3}-.1964335
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1775553{col 26}{space 2} .0043476{col 37}{space 1}  -40.84{col 46}{space 3}0.000{col 54}{space 4}-.1860765{col 67}{space 3}-.1690341
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}   .59702{col 26}{space 2} .0028942{col 37}{space 1}  206.28{col 46}{space 3}0.000{col 54}{space 4} .5913475{col 67}{space 3} .6026924
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5876857{col 26}{space 2}  .004143{col 37}{space 1}  141.85{col 46}{space 3}0.000{col 54}{space 4} .5795655{col 67}{space 3} .5958059
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5697291{col 26}{space 2} .0047244{col 37}{space 1}  120.59{col 46}{space 3}0.000{col 54}{space 4} .5604693{col 67}{space 3} .5789888
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .580882{col 26}{space 2} .0054292{col 37}{space 1}  106.99{col 46}{space 3}0.000{col 54}{space 4} .5702411{col 67}{space 3}  .591523
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5957275{col 26}{space 2} .0059667{col 37}{space 1}   99.84{col 46}{space 3}0.000{col 54}{space 4} .5840329{col 67}{space 3}  .607422
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0014564{col 26}{space 2} .0015034{col 37}{space 1}    0.97{col 46}{space 3}0.333{col 54}{space 4}-.0014902{col 67}{space 3}  .004403
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0015929{col 26}{space 2} .0019753{col 37}{space 1}    0.81{col 46}{space 3}0.420{col 54}{space 4}-.0022786{col 67}{space 3} .0054644
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0112265{col 26}{space 2} .0023945{col 37}{space 1}   -4.69{col 46}{space 3}0.000{col 54}{space 4}-.0159196{col 67}{space 3}-.0065334
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0117214{col 26}{space 2} .0023748{col 37}{space 1}    4.94{col 46}{space 3}0.000{col 54}{space 4} .0070668{col 67}{space 3}  .016376
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}  .002567{col 26}{space 2} .0026779{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-.0026816{col 67}{space 3} .0078156
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.027302{col 26}{space 2} .0006912{col 37}{space 1}  -39.50{col 46}{space 3}0.000{col 54}{space 4}-.0286567{col 67}{space 3}-.0259473
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0255275{col 26}{space 2} .0009572{col 37}{space 1}  -26.67{col 46}{space 3}0.000{col 54}{space 4}-.0274037{col 67}{space 3}-.0236514
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0230704{col 26}{space 2} .0009815{col 37}{space 1}  -23.51{col 46}{space 3}0.000{col 54}{space 4}-.0249941{col 67}{space 3}-.0211466
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0301746{col 26}{space 2} .0015643{col 37}{space 1}  -19.29{col 46}{space 3}0.000{col 54}{space 4}-.0332405{col 67}{space 3}-.0271086
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}  -.03119{col 26}{space 2} .0018261{col 37}{space 1}  -17.08{col 46}{space 3}0.000{col 54}{space 4}-.0347691{col 67}{space 3}-.0276109
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1691012{col 26}{space 2} .0028512{col 37}{space 1}   59.31{col 46}{space 3}0.000{col 54}{space 4}  .163513{col 67}{space 3} .1746894
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1757978{col 26}{space 2} .0042976{col 37}{space 1}   40.91{col 46}{space 3}0.000{col 54}{space 4} .1673746{col 67}{space 3}  .184221
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1839467{col 26}{space 2}  .004819{col 37}{space 1}   38.17{col 46}{space 3}0.000{col 54}{space 4} .1745016{col 67}{space 3} .1933918
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2503105{col 26}{space 2} .0055454{col 37}{space 1}   45.14{col 46}{space 3}0.000{col 54}{space 4} .2394418{col 67}{space 3} .2611793
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2331703{col 26}{space 2} .0060473{col 37}{space 1}   38.56{col 46}{space 3}0.000{col 54}{space 4} .2213178{col 67}{space 3} .2450228
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0050511{col 26}{space 2} .0018782{col 37}{space 1}   -2.69{col 46}{space 3}0.007{col 54}{space 4}-.0087324{col 67}{space 3}-.0013699
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0105657{col 26}{space 2} .0023554{col 37}{space 1}   -4.49{col 46}{space 3}0.000{col 54}{space 4}-.0151823{col 67}{space 3}-.0059492
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0028901{col 26}{space 2} .0029216{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-.0086163{col 67}{space 3} .0028361
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .010207{col 26}{space 2} .0023371{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4} .0056263{col 67}{space 3} .0147877
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0113811{col 26}{space 2} .0025855{col 37}{space 1}    4.40{col 46}{space 3}0.000{col 54}{space 4} .0063136{col 67}{space 3} .0164486
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0033182{col 26}{space 2} .0007707{col 37}{space 1}   -4.31{col 46}{space 3}0.000{col 54}{space 4}-.0048287{col 67}{space 3}-.0018076
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0014539{col 26}{space 2} .0012144{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-.0038342{col 67}{space 3} .0009263
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.007562{col 26}{space 2} .0012926{col 37}{space 1}   -5.85{col 46}{space 3}0.000{col 54}{space 4}-.0100955{col 67}{space 3}-.0050285
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.003911{col 26}{space 2} .0015661{col 37}{space 1}   -2.50{col 46}{space 3}0.013{col 54}{space 4}-.0069805{col 67}{space 3}-.0008416
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.002377{col 26}{space 2} .0017699{col 37}{space 1}   -1.34{col 46}{space 3}0.179{col 54}{space 4}-.0058461{col 67}{space 3}  .001092
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2} -.000515{col 26}{space 2} .0000275{col 37}{space 1}  -18.76{col 46}{space 3}0.000{col 54}{space 4}-.0005688{col 67}{space 3}-.0004611
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2} -.153332{col 26}{space 2} .0244785{col 37}{space 1}   -6.26{col 46}{space 3}0.000{col 54}{space 4} -.201309{col 67}{space 3} -.105355
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2} .1393681{col 26}{space 2} .0087902{col 37}{space 1}   15.85{col 46}{space 3}0.000{col 54}{space 4} .1221396{col 67}{space 3} .1565966
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2}  .158602{col 26}{space 2} .0080939{col 37}{space 1}   19.60{col 46}{space 3}0.000{col 54}{space 4} .1427381{col 67}{space 3} .1744659
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2}-.2535001{col 26}{space 2} .0159369{col 37}{space 1}  -15.91{col 46}{space 3}0.000{col 54}{space 4}-.2847359{col 67}{space 3}-.2222643
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2} .1239909{col 26}{space 2} .0319342{col 37}{space 1}    3.88{col 46}{space 3}0.000{col 54}{space 4} .0614008{col 67}{space 3} .1865811
{txt}peer_econ_~e {c |}{col 14}{res}{space 2}-.0649872{col 26}{space 2} .0081462{col 37}{space 1}   -7.98{col 46}{space 3}0.000{col 54}{space 4}-.0809536{col 67}{space 3}-.0490209
{txt}peer_limit~f {c |}{col 14}{res}{space 2} -.119359{col 26}{space 2} .0177536{col 37}{space 1}   -6.72{col 46}{space 3}0.000{col 54}{space 4}-.1541555{col 67}{space 3}-.0845624
{txt}peer_disab~d {c |}{col 14}{res}{space 2}-.1783829{col 26}{space 2} .0295196{col 37}{space 1}   -6.04{col 46}{space 3}0.000{col 54}{space 4}-.2362404{col 67}{space 3}-.1205254
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1488314{col 26}{space 2}  .013472{col 37}{space 1}   11.05{col 46}{space 3}0.000{col 54}{space 4} .1224268{col 67}{space 3}  .175236
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1155938{col 26}{space 2} .0184803{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4}  .079373{col 67}{space 3} .1518146
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1439517{col 26}{space 2} .0222846{col 37}{space 1}    6.46{col 46}{space 3}0.000{col 54}{space 4} .1002746{col 67}{space 3} .1876289
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.3180108{col 26}{space 2} .0263736{col 37}{space 1}  -12.06{col 46}{space 3}0.000{col 54}{space 4}-.3697021{col 67}{space 3}-.2663194
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.2003554{col 26}{space 2} .0275053{col 37}{space 1}   -7.28{col 46}{space 3}0.000{col 54}{space 4} -.254265{col 67}{space 3}-.1464457
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.2666791{col 26}{space 2} .0161456{col 37}{space 1}  -16.52{col 46}{space 3}0.000{col 54}{space 4} -.298324{col 67}{space 3}-.2350343
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1823546{col 26}{space 2} .0213601{col 37}{space 1}   -8.54{col 46}{space 3}0.000{col 54}{space 4}-.2242198{col 67}{space 3}-.1404895
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0891679{col 26}{space 2} .0291084{col 37}{space 1}   -3.06{col 46}{space 3}0.002{col 54}{space 4}-.1462194{col 67}{space 3}-.0321164
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1230815{col 26}{space 2}  .032016{col 37}{space 1}    3.84{col 46}{space 3}0.000{col 54}{space 4} .0603313{col 67}{space 3} .1858318
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1139837{col 26}{space 2} .0342822{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .0467916{col 67}{space 3} .1811758
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1465768{col 26}{space 2} .0179898{col 37}{space 1}    8.15{col 46}{space 3}0.000{col 54}{space 4} .1113174{col 67}{space 3} .1818362
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0055368{col 26}{space 2} .0275485{col 37}{space 1}   -0.20{col 46}{space 3}0.841{col 54}{space 4}-.0595311{col 67}{space 3} .0484575
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0196928{col 26}{space 2} .0293062{col 37}{space 1}    0.67{col 46}{space 3}0.502{col 54}{space 4}-.0377464{col 67}{space 3}  .077132
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2058554{col 26}{space 2} .0358745{col 37}{space 1}    5.74{col 46}{space 3}0.000{col 54}{space 4} .1355425{col 67}{space 3} .2761683
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1604466{col 26}{space 2}  .036458{col 37}{space 1}    4.40{col 46}{space 3}0.000{col 54}{space 4}   .08899{col 67}{space 3} .2319032
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0882099{col 26}{space 2}  .012368{col 37}{space 1}   -7.13{col 46}{space 3}0.000{col 54}{space 4}-.1124509{col 67}{space 3} -.063969
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0573339{col 26}{space 2} .0181574{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4} -.092922{col 67}{space 3}-.0217459
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.1349291{col 26}{space 2} .0215531{col 37}{space 1}   -6.26{col 46}{space 3}0.000{col 54}{space 4}-.1771724{col 67}{space 3}-.0926857
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1718133{col 26}{space 2} .0238604{col 37}{space 1}    7.20{col 46}{space 3}0.000{col 54}{space 4} .1250476{col 67}{space 3}  .218579
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0491079{col 26}{space 2} .0241401{col 37}{space 1}    2.03{col 46}{space 3}0.042{col 54}{space 4}  .001794{col 67}{space 3} .0964217
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .2293545{col 26}{space 2} .0184176{col 37}{space 1}   12.45{col 46}{space 3}0.000{col 54}{space 4} .1932564{col 67}{space 3} .2654525
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0341287{col 26}{space 2} .0242096{col 37}{space 1}    1.41{col 46}{space 3}0.159{col 54}{space 4}-.0133213{col 67}{space 3} .0815787
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0130825{col 26}{space 2}  .033067{col 37}{space 1}    0.40{col 46}{space 3}0.692{col 54}{space 4}-.0517278{col 67}{space 3} .0778928
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1908243{col 26}{space 2} .0308469{col 37}{space 1}   -6.19{col 46}{space 3}0.000{col 54}{space 4}-.2512833{col 67}{space 3}-.1303652
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.151987{col 26}{space 2}   .03199{col 37}{space 1}   -4.75{col 46}{space 3}0.000{col 54}{space 4}-.2146864{col 67}{space 3}-.0892875
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1254352{col 26}{space 2} .0129818{col 37}{space 1}   -9.66{col 46}{space 3}0.000{col 54}{space 4}-.1508792{col 67}{space 3}-.0999912
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0453601{col 26}{space 2} .0252094{col 37}{space 1}    1.80{col 46}{space 3}0.072{col 54}{space 4}-.0040496{col 67}{space 3} .0947698
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0042909{col 26}{space 2}  .023304{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-.0413842{col 67}{space 3} .0499661
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0619155{col 26}{space 2} .0240172{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 54}{space 4}-.1089884{col 67}{space 3}-.0148426
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0305247{col 26}{space 2} .0224767{col 37}{space 1}   -1.36{col 46}{space 3}0.174{col 54}{space 4}-.0745783{col 67}{space 3} .0135289
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.322154{col 26}{space 2} .1688485{col 37}{space 1}   31.52{col 46}{space 3}0.000{col 54}{space 4} 4.991216{col 67}{space 3} 5.653092
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.57242785 .17914142 .54367453 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0170831716   .4556295357          4536{txt}  {c |}
  2 {c |}  {res} .013169817   .3529452345          3325{txt}  {c |}
  3 {c |}  {res}.0089992917   .2346483697          2148{txt}  {c |}
  4 {c |}  {res}.0083773435   .2155781938          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0170831716{txt}  {c |}
  2 {c |}  {res} .013169817{txt}  {c |}
  3 {c |}  {res}.0089992917{txt}  {c |}
  4 {c |}  {res}.0089992917{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:452,964}
{txt}{col 1}Absorbed variable: {res:school_id}{col 52}{lalign 17:No. of categories}{col 69} = {res}{ralign 7:1,375}
{txt}{col 52}{lalign 17:F({res:83}, {res:451506})}{col 69} = {res}{ralign 7:6835.51}
{txt}{col 52}{lalign 17:Prob > F}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 52}{lalign 17:R-squared}{col 69} = {res}{ralign 7:0.6226}
{txt}{col 52}{lalign 17:Adj R-squared}{col 69} = {res}{ralign 7:0.6214}
{txt}{col 52}{lalign 17:Root MSE}{col 69} = {res}{ralign 7:0.5554}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0150142{col 26}{space 2}  .003744{col 37}{space 1}   -4.01{col 46}{space 3}0.000{col 54}{space 4}-.0223524{col 67}{space 3} -.007676
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0640022{col 26}{space 2} .0042705{col 37}{space 1}   14.99{col 46}{space 3}0.000{col 54}{space 4} .0556322{col 67}{space 3} .0723723
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0640211{col 26}{space 2} .0043745{col 37}{space 1}  -14.63{col 46}{space 3}0.000{col 54}{space 4}-.0725951{col 67}{space 3}-.0554471
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0510771{col 26}{space 2} .0047655{col 37}{space 1}  -10.72{col 46}{space 3}0.000{col 54}{space 4}-.0604173{col 67}{space 3}-.0417369
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0120489{col 26}{space 2} .0034346{col 37}{space 1}   -3.51{col 46}{space 3}0.000{col 54}{space 4}-.0187806{col 67}{space 3}-.0053171
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003108{col 26}{space 2} 5.84e-06{col 37}{space 1}  -53.25{col 46}{space 3}0.000{col 54}{space 4}-.0003223{col 67}{space 3}-.0002994
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0891545{col 26}{space 2}  .001694{col 37}{space 1}  -52.63{col 46}{space 3}0.000{col 54}{space 4}-.0924747{col 67}{space 3}-.0858344
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0837089{col 26}{space 2} .0031355{col 37}{space 1}   26.70{col 46}{space 3}0.000{col 54}{space 4} .0775635{col 67}{space 3} .0898544
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0187849{col 26}{space 2} .0025443{col 37}{space 1}   -7.38{col 46}{space 3}0.000{col 54}{space 4}-.0237717{col 67}{space 3} -.013798
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1211885{col 26}{space 2} .0047804{col 37}{space 1}  -25.35{col 46}{space 3}0.000{col 54}{space 4} -.130558{col 67}{space 3}-.1118191
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0038792{col 26}{space 2} .0051029{col 37}{space 1}    0.76{col 46}{space 3}0.447{col 54}{space 4}-.0061223{col 67}{space 3} .0138806
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0224263{col 26}{space 2} .0021159{col 37}{space 1}  -10.60{col 46}{space 3}0.000{col 54}{space 4}-.0265733{col 67}{space 3}-.0182793
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2057165{col 26}{space 2} .0043207{col 37}{space 1}  -47.61{col 46}{space 3}0.000{col 54}{space 4}-.2141849{col 67}{space 3} -.197248
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1817238{col 26}{space 2}  .004237{col 37}{space 1}  -42.89{col 46}{space 3}0.000{col 54}{space 4}-.1900283{col 67}{space 3}-.1734194
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .5967567{col 26}{space 2} .0028127{col 37}{space 1}  212.17{col 46}{space 3}0.000{col 54}{space 4} .5912439{col 67}{space 3} .6022694
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5861932{col 26}{space 2} .0040288{col 37}{space 1}  145.50{col 46}{space 3}0.000{col 54}{space 4}  .578297{col 67}{space 3} .5940894
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5697336{col 26}{space 2} .0045919{col 37}{space 1}  124.07{col 46}{space 3}0.000{col 54}{space 4} .5607335{col 67}{space 3} .5787337
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .580852{col 26}{space 2} .0052767{col 37}{space 1}  110.08{col 46}{space 3}0.000{col 54}{space 4} .5705098{col 67}{space 3} .5911943
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5958105{col 26}{space 2} .0058007{col 37}{space 1}  102.71{col 46}{space 3}0.000{col 54}{space 4} .5844414{col 67}{space 3} .6071797
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0029684{col 26}{space 2} .0014624{col 37}{space 1}    2.03{col 46}{space 3}0.042{col 54}{space 4} .0001021{col 67}{space 3} .0058346
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0022841{col 26}{space 2} .0019218{col 37}{space 1}    1.19{col 46}{space 3}0.235{col 54}{space 4}-.0014826{col 67}{space 3} .0060509
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.010249{col 26}{space 2} .0023286{col 37}{space 1}   -4.40{col 46}{space 3}0.000{col 54}{space 4}-.0148129{col 67}{space 3}-.0056851
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0118031{col 26}{space 2}  .002309{col 37}{space 1}    5.11{col 46}{space 3}0.000{col 54}{space 4} .0072775{col 67}{space 3} .0163286
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0032474{col 26}{space 2} .0026038{col 37}{space 1}    1.25{col 46}{space 3}0.212{col 54}{space 4} -.001856{col 67}{space 3} .0083509
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275616{col 26}{space 2} .0006719{col 37}{space 1}  -41.02{col 46}{space 3}0.000{col 54}{space 4}-.0288786{col 67}{space 3}-.0262447
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0252584{col 26}{space 2} .0009306{col 37}{space 1}  -27.14{col 46}{space 3}0.000{col 54}{space 4}-.0270824{col 67}{space 3}-.0234344
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0233229{col 26}{space 2}  .000954{col 37}{space 1}  -24.45{col 46}{space 3}0.000{col 54}{space 4}-.0251927{col 67}{space 3}-.0214532
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  -.03074{col 26}{space 2} .0015204{col 37}{space 1}  -20.22{col 46}{space 3}0.000{col 54}{space 4}-.0337199{col 67}{space 3}  -.02776
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0312029{col 26}{space 2} .0017751{col 37}{space 1}  -17.58{col 46}{space 3}0.000{col 54}{space 4} -.034682{col 67}{space 3}-.0277238
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1685957{col 26}{space 2} .0027709{col 37}{space 1}   60.84{col 46}{space 3}0.000{col 54}{space 4} .1631648{col 67}{space 3} .1740266
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1758221{col 26}{space 2} .0041782{col 37}{space 1}   42.08{col 46}{space 3}0.000{col 54}{space 4} .1676331{col 67}{space 3} .1840112
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1845664{col 26}{space 2} .0046833{col 37}{space 1}   39.41{col 46}{space 3}0.000{col 54}{space 4} .1753873{col 67}{space 3} .1937456
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2488343{col 26}{space 2} .0053901{col 37}{space 1}   46.17{col 46}{space 3}0.000{col 54}{space 4} .2382699{col 67}{space 3} .2593987
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2327197{col 26}{space 2} .0058786{col 37}{space 1}   39.59{col 46}{space 3}0.000{col 54}{space 4} .2211978{col 67}{space 3} .2442415
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0039151{col 26}{space 2} .0018267{col 37}{space 1}   -2.14{col 46}{space 3}0.032{col 54}{space 4}-.0074955{col 67}{space 3}-.0003348
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106892{col 26}{space 2} .0022909{col 37}{space 1}   -4.67{col 46}{space 3}0.000{col 54}{space 4}-.0151794{col 67}{space 3}-.0061991
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0026314{col 26}{space 2} .0028406{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4} -.008199{col 67}{space 3} .0029361
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0108156{col 26}{space 2} .0022722{col 37}{space 1}    4.76{col 46}{space 3}0.000{col 54}{space 4} .0063622{col 67}{space 3}  .015269
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}  .012346{col 26}{space 2} .0025142{col 37}{space 1}    4.91{col 46}{space 3}0.000{col 54}{space 4} .0074183{col 67}{space 3} .0172737
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0035934{col 26}{space 2} .0007492{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-.0050619{col 67}{space 3}-.0021249
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0014361{col 26}{space 2} .0011806{col 37}{space 1}   -1.22{col 46}{space 3}0.224{col 54}{space 4}  -.00375{col 67}{space 3} .0008778
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  -.00764{col 26}{space 2} .0012563{col 37}{space 1}   -6.08{col 46}{space 3}0.000{col 54}{space 4}-.0101023{col 67}{space 3}-.0051777
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0030214{col 26}{space 2} .0015224{col 37}{space 1}   -1.98{col 46}{space 3}0.047{col 54}{space 4}-.0060052{col 67}{space 3}-.0000377
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0022314{col 26}{space 2} .0017205{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-.0056036{col 67}{space 3} .0011408
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2} .0001142{col 26}{space 2} .0000561{col 37}{space 1}    2.03{col 46}{space 3}0.042{col 54}{space 4} 4.20e-06{col 67}{space 3} .0002242
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2}-.4009392{col 26}{space 2} .0348963{col 37}{space 1}  -11.49{col 46}{space 3}0.000{col 54}{space 4}-.4693348{col 67}{space 3}-.3325436
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2}-.0988352{col 26}{space 2} .0568115{col 37}{space 1}   -1.74{col 46}{space 3}0.082{col 54}{space 4}-.2101841{col 67}{space 3} .0125137
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2}-.0398112{col 26}{space 2} .0420996{col 37}{space 1}   -0.95{col 46}{space 3}0.344{col 54}{space 4}-.1223252{col 67}{space 3} .0427028
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2} -.106676{col 26}{space 2}  .080121{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-.2637107{col 67}{space 3} .0503586
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2}-.0533397{col 26}{space 2} .0560745{col 37}{space 1}   -0.95{col 46}{space 3}0.341{col 54}{space 4}-.1632441{col 67}{space 3} .0565646
{txt}peer_econ_~e {c |}{col 14}{res}{space 2}-.0004034{col 26}{space 2} .0154424{col 37}{space 1}   -0.03{col 46}{space 3}0.979{col 54}{space 4}-.0306701{col 67}{space 3} .0298633
{txt}peer_limit~f {c |}{col 14}{res}{space 2}-.0000992{col 26}{space 2} .0420714{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-.0825578{col 67}{space 3} .0823595
{txt}peer_disab~d {c |}{col 14}{res}{space 2}-.1966284{col 26}{space 2} .0527049{col 37}{space 1}   -3.73{col 46}{space 3}0.000{col 54}{space 4}-.2999284{col 67}{space 3}-.0933285
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1535782{col 26}{space 2}  .020972{col 37}{space 1}   -7.32{col 46}{space 3}0.000{col 54}{space 4}-.1946827{col 67}{space 3}-.1124737
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1115917{col 26}{space 2} .0242215{col 37}{space 1}   -4.61{col 46}{space 3}0.000{col 54}{space 4}-.1590652{col 67}{space 3}-.0641182
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0987278{col 26}{space 2} .0265072{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.1506811{col 67}{space 3}-.0467746
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.4124515{col 26}{space 2}  .029983{col 37}{space 1}  -13.76{col 46}{space 3}0.000{col 54}{space 4}-.4712173{col 67}{space 3}-.3536858
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.3049974{col 26}{space 2} .0308432{col 37}{space 1}   -9.89{col 46}{space 3}0.000{col 54}{space 4}-.3654491{col 67}{space 3}-.2445456
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1759896{col 26}{space 2} .0245597{col 37}{space 1}   -7.17{col 46}{space 3}0.000{col 54}{space 4}-.2241258{col 67}{space 3}-.1278534
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1076766{col 26}{space 2} .0284172{col 37}{space 1}   -3.79{col 46}{space 3}0.000{col 54}{space 4}-.1633735{col 67}{space 3}-.0519797
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0224732{col 26}{space 2} .0336227{col 37}{space 1}    0.67{col 46}{space 3}0.504{col 54}{space 4}-.0434263{col 67}{space 3} .0883726
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0236099{col 26}{space 2} .0357335{col 37}{space 1}    0.66{col 46}{space 3}0.509{col 54}{space 4}-.0464268{col 67}{space 3} .0936465
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0785464{col 26}{space 2} .0378765{col 37}{space 1}    2.07{col 46}{space 3}0.038{col 54}{space 4} .0043097{col 67}{space 3} .1527831
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1428726{col 26}{space 2}  .027131{col 37}{space 1}    5.27{col 46}{space 3}0.000{col 54}{space 4} .0896967{col 67}{space 3} .1960485
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.085052{col 26}{space 2} .0369208{col 37}{space 1}   -2.30{col 46}{space 3}0.021{col 54}{space 4}-.1574158{col 67}{space 3}-.0126883
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0466251{col 26}{space 2} .0346725{col 37}{space 1}   -1.34{col 46}{space 3}0.179{col 54}{space 4}-.1145822{col 67}{space 3}  .021332
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1904212{col 26}{space 2} .0402408{col 37}{space 1}    4.73{col 46}{space 3}0.000{col 54}{space 4} .1115505{col 67}{space 3} .2692919
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1349457{col 26}{space 2} .0414732{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0536594{col 67}{space 3} .2162319
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0219134{col 26}{space 2}  .017682{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.0565696{col 67}{space 3} .0127427
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0628207{col 26}{space 2} .0220058{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 54}{space 4}-.1059514{col 67}{space 3}  -.01969
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0992489{col 26}{space 2} .0240943{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-.1464729{col 67}{space 3}-.0520248
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0430135{col 26}{space 2} .0265927{col 37}{space 1}    1.62{col 46}{space 3}0.106{col 54}{space 4}-.0091074{col 67}{space 3} .0951345
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0701174{col 26}{space 2} .0268491{col 37}{space 1}   -2.61{col 46}{space 3}0.009{col 54}{space 4}-.1227409{col 67}{space 3} -.017494
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1364782{col 26}{space 2} .0259168{col 37}{space 1}    5.27{col 46}{space 3}0.000{col 54}{space 4} .0856821{col 67}{space 3} .1872743
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0239355{col 26}{space 2} .0300812{col 37}{space 1}    0.80{col 46}{space 3}0.426{col 54}{space 4}-.0350228{col 67}{space 3} .0828938
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0844678{col 26}{space 2} .0367372{col 37}{space 1}   -2.30{col 46}{space 3}0.021{col 54}{space 4}-.1564715{col 67}{space 3} -.012464
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0637826{col 26}{space 2} .0341301{col 37}{space 1}   -1.87{col 46}{space 3}0.062{col 54}{space 4}-.1306766{col 67}{space 3} .0031115
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1341712{col 26}{space 2} .0354643{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}-.2036801{col 67}{space 3}-.0646623
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0807007{col 26}{space 2} .0206443{col 37}{space 1}   -3.91{col 46}{space 3}0.000{col 54}{space 4}-.1211629{col 67}{space 3}-.0402384
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0928117{col 26}{space 2} .0317116{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4}  .030658{col 67}{space 3} .1549655
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0887754{col 26}{space 2} .0273024{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0352635{col 67}{space 3} .1422873
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0555564{col 26}{space 2} .0290009{col 37}{space 1}   -1.92{col 46}{space 3}0.055{col 54}{space 4}-.1123974{col 67}{space 3} .0012845
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0230452{col 26}{space 2} .0283373{col 37}{space 1}    0.81{col 46}{space 3}0.416{col 54}{space 4}-.0324951{col 67}{space 3} .0785855
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.667499{col 26}{space 2}  .345502{col 37}{space 1}    4.83{col 46}{space 3}0.000{col 54}{space 4} .9903257{col 67}{space 3} 2.344672
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1374{txt}, {res}451506{txt}) = {res}21.476{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.58235319 .20869159 .54367551 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0287281981   .5904803761          4536{txt}  {c |}
  2 {c |}  {res}.0247453447   .5150227613          3325{txt}  {c |}
  3 {c |}  {res}.0204962633   .4198722227          2148{txt}  {c |}
  4 {c |}  {res}.0193669742   .3948922784          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0287281981{txt}  {c |}
  2 {c |}  {res}.0247453447{txt}  {c |}
  3 {c |}  {res}.0204962633{txt}  {c |}
  4 {c |}  {res}.0204962633{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   451,951
                                                {txt}F(1, 1288)        =  {res}  1506.16
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0390
                                                {txt}Root MSE          =    {res} .56399

{txt}{ralign 78:(Std. err. adjusted for {res:1,289} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~_r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~a {c |}{col 14}{res}{space 2} .9778549{col 26}{space 2} .0251964{col 37}{space 1}   38.81{col 46}{space 3}0.000{col 54}{space 4} .9284243{col 67}{space 3} 1.027286
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0025361{col 26}{space 2} .0019775{col 37}{space 1}    1.28{col 46}{space 3}0.200{col 54}{space 4}-.0013432{col 67}{space 3} .0064155
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling_enr_2year.ster} saved

Linear regression                               Number of obs     = {res}   451,951
                                                {txt}F(1, 1288)        =  {res}  1290.60
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0314
                                                {txt}Root MSE          =    {res} .56326

{txt}{ralign 78:(Std. err. adjusted for {res:1,289} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~er{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2}  .981501{col 26}{space 2} .0273209{col 37}{space 1}   35.92{col 46}{space 3}0.000{col 54}{space 4} .9279026{col 67}{space 3} 1.035099
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .003688{col 26}{space 2} .0019942{col 37}{space 1}    1.85{col 46}{space 3}0.065{col 54}{space 4}-.0002242{col 67}{space 3} .0076001
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_peer_sibling_enr_2year.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_ela_sibling_enr_2year.dta{rm}
saved
{p_end}
(CST/SBAC Student Test Score Samples)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   452,964
{txt}{hline 13}{c +}{hline 34}   F(44, 452919)   = {res} 15045.32
{txt}       Model {c |} {res} 219139.807        44  4980.45015   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 149929.686   452,919  .331029801   {txt}R-squared       ={res}    0.5938
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5937
{txt}       Total {c |} {res} 369069.493   452,963  .814789493   {txt}Root MSE        =   {res} .57535

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0299931{col 26}{space 2} .0033396{col 37}{space 1}   -8.98{col 46}{space 3}0.000{col 54}{space 4}-.0365386{col 67}{space 3}-.0234476
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0696751{col 26}{space 2} .0036642{col 37}{space 1}   19.02{col 46}{space 3}0.000{col 54}{space 4} .0624934{col 67}{space 3} .0768568
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0691633{col 26}{space 2} .0035906{col 37}{space 1}  -19.26{col 46}{space 3}0.000{col 54}{space 4}-.0762007{col 67}{space 3}-.0621259
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0612824{col 26}{space 2} .0037776{col 37}{space 1}  -16.22{col 46}{space 3}0.000{col 54}{space 4}-.0686863{col 67}{space 3}-.0538785
{txt}{space 12} {c |}
1.has_~4year {c |}{col 14}{res}{space 2} .0422012{col 26}{space 2} .0041311{col 37}{space 1}   10.22{col 46}{space 3}0.000{col 54}{space 4} .0341043{col 67}{space 3} .0502981
{txt}{space 9}age {c |}{col 14}{res}{space 2} -.000343{col 26}{space 2} 5.97e-06{col 37}{space 1}  -57.48{col 46}{space 3}0.000{col 54}{space 4}-.0003547{col 67}{space 3}-.0003313
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0876992{col 26}{space 2} .0017489{col 37}{space 1}  -50.15{col 46}{space 3}0.000{col 54}{space 4}-.0911269{col 67}{space 3}-.0842714
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1006735{col 26}{space 2} .0029055{col 37}{space 1}   34.65{col 46}{space 3}0.000{col 54}{space 4} .0949788{col 67}{space 3} .1063681
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0020521{col 26}{space 2}  .002389{col 37}{space 1}   -0.86{col 46}{space 3}0.390{col 54}{space 4}-.0067345{col 67}{space 3} .0026302
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1429763{col 26}{space 2} .0047268{col 37}{space 1}  -30.25{col 46}{space 3}0.000{col 54}{space 4}-.1522408{col 67}{space 3}-.1337119
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0093189{col 26}{space 2} .0052138{col 37}{space 1}    1.79{col 46}{space 3}0.074{col 54}{space 4}   -.0009{col 67}{space 3} .0195377
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0315839{col 26}{space 2}  .002017{col 37}{space 1}  -15.66{col 46}{space 3}0.000{col 54}{space 4} -.035537{col 67}{space 3}-.0276307
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2087358{col 26}{space 2} .0043961{col 37}{space 1}  -47.48{col 46}{space 3}0.000{col 54}{space 4} -.217352{col 67}{space 3}-.2001196
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1772605{col 26}{space 2} .0043441{col 37}{space 1}  -40.81{col 46}{space 3}0.000{col 54}{space 4}-.1857748{col 67}{space 3}-.1687462
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6132821{col 26}{space 2} .0028527{col 37}{space 1}  214.98{col 46}{space 3}0.000{col 54}{space 4} .6076908{col 67}{space 3} .6188734
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .600649{col 26}{space 2} .0040728{col 37}{space 1}  147.48{col 46}{space 3}0.000{col 54}{space 4} .5926664{col 67}{space 3} .6086316
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5762554{col 26}{space 2}  .004639{col 37}{space 1}  124.22{col 46}{space 3}0.000{col 54}{space 4} .5671631{col 67}{space 3} .5853477
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5688649{col 26}{space 2} .0054017{col 37}{space 1}  105.31{col 46}{space 3}0.000{col 54}{space 4} .5582777{col 67}{space 3} .5794521
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5879709{col 26}{space 2} .0059472{col 37}{space 1}   98.86{col 46}{space 3}0.000{col 54}{space 4} .5763145{col 67}{space 3} .5996273
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0001899{col 26}{space 2} .0015044{col 37}{space 1}    0.13{col 46}{space 3}0.900{col 54}{space 4}-.0027586{col 67}{space 3} .0031385
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0016096{col 26}{space 2} .0019734{col 37}{space 1}   -0.82{col 46}{space 3}0.415{col 54}{space 4}-.0054774{col 67}{space 3} .0022583
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0125607{col 26}{space 2}  .002396{col 37}{space 1}   -5.24{col 46}{space 3}0.000{col 54}{space 4}-.0172567{col 67}{space 3}-.0078647
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .012449{col 26}{space 2} .0023815{col 37}{space 1}    5.23{col 46}{space 3}0.000{col 54}{space 4} .0077813{col 67}{space 3} .0171168
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0029163{col 26}{space 2} .0026844{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4} -.002345{col 67}{space 3} .0081776
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275381{col 26}{space 2} .0006939{col 37}{space 1}  -39.69{col 46}{space 3}0.000{col 54}{space 4} -.028898{col 67}{space 3}-.0261781
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0254586{col 26}{space 2} .0009608{col 37}{space 1}  -26.50{col 46}{space 3}0.000{col 54}{space 4}-.0273418{col 67}{space 3}-.0235754
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0229666{col 26}{space 2} .0009843{col 37}{space 1}  -23.33{col 46}{space 3}0.000{col 54}{space 4}-.0248957{col 67}{space 3}-.0210375
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0292579{col 26}{space 2} .0015716{col 37}{space 1}  -18.62{col 46}{space 3}0.000{col 54}{space 4}-.0323381{col 67}{space 3}-.0261776
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0302514{col 26}{space 2} .0018349{col 37}{space 1}  -16.49{col 46}{space 3}0.000{col 54}{space 4}-.0338476{col 67}{space 3}-.0266551
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1696982{col 26}{space 2} .0028288{col 37}{space 1}   59.99{col 46}{space 3}0.000{col 54}{space 4} .1641538{col 67}{space 3} .1752426
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .175903{col 26}{space 2} .0042763{col 37}{space 1}   41.13{col 46}{space 3}0.000{col 54}{space 4} .1675215{col 67}{space 3} .1842845
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1818202{col 26}{space 2}   .00479{col 37}{space 1}   37.96{col 46}{space 3}0.000{col 54}{space 4} .1724318{col 67}{space 3} .1912085
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2434179{col 26}{space 2} .0054883{col 37}{space 1}   44.35{col 46}{space 3}0.000{col 54}{space 4} .2326609{col 67}{space 3} .2541748
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}  .221706{col 26}{space 2} .0059767{col 37}{space 1}   37.10{col 46}{space 3}0.000{col 54}{space 4} .2099919{col 67}{space 3} .2334201
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0048777{col 26}{space 2} .0018819{col 37}{space 1}   -2.59{col 46}{space 3}0.010{col 54}{space 4} -.008566{col 67}{space 3}-.0011893
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.011691{col 26}{space 2} .0023608{col 37}{space 1}   -4.95{col 46}{space 3}0.000{col 54}{space 4} -.016318{col 67}{space 3} -.007064
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0034509{col 26}{space 2} .0029318{col 37}{space 1}   -1.18{col 46}{space 3}0.239{col 54}{space 4}-.0091972{col 67}{space 3} .0022954
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0051754{col 26}{space 2} .0023207{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 54}{space 4} .0006269{col 67}{space 3} .0097239
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0067931{col 26}{space 2} .0025716{col 37}{space 1}    2.64{col 46}{space 3}0.008{col 54}{space 4} .0017529{col 67}{space 3} .0118333
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0030289{col 26}{space 2} .0007737{col 37}{space 1}   -3.91{col 46}{space 3}0.000{col 54}{space 4}-.0045453{col 67}{space 3}-.0015125
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0008843{col 26}{space 2} .0012197{col 37}{space 1}   -0.73{col 46}{space 3}0.468{col 54}{space 4}-.0032748{col 67}{space 3} .0015061
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0073449{col 26}{space 2} .0012975{col 37}{space 1}   -5.66{col 46}{space 3}0.000{col 54}{space 4}-.0098879{col 67}{space 3}-.0048019
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0048327{col 26}{space 2} .0015642{col 37}{space 1}   -3.09{col 46}{space 3}0.002{col 54}{space 4}-.0078984{col 67}{space 3} -.001767
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0027755{col 26}{space 2} .0017693{col 37}{space 1}   -1.57{col 46}{space 3}0.117{col 54}{space 4}-.0062433{col 67}{space 3} .0006923
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  2.26533{col 26}{space 2} .0365364{col 37}{space 1}   62.00{col 46}{space 3}0.000{col 54}{space 4}  2.19372{col 67}{space 3}  2.33694
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.57535189 .18752712 .54393325 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0203376632   .5002705867          4536{txt}  {c |}
  2 {c |}  {res}.0154685114   .3872018307          3325{txt}  {c |}
  3 {c |}  {res}.0100997297   .2480467841          2148{txt}  {c |}
  4 {c |}  {res}.0083390921   .2053309505          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0203376632{txt}  {c |}
  2 {c |}  {res}.0154685114{txt}  {c |}
  3 {c |}  {res}.0100997297{txt}  {c |}
  4 {c |}  {res}.0100997297{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 51}{lalign 17:Number of obs}{col 68} = {res}{ralign 8:452,964}
{txt}{col 1}Absorbed variable: {res:school_id}{col 51}{lalign 17:No. of categories}{col 68} = {res}{ralign 8:1,375}
{txt}{col 51}{lalign 17:F({res:44}, {res:451545})}{col 68} = {res}{ralign 8:12813.57}
{txt}{col 51}{lalign 17:Prob > F}{col 68} = {res}{ralign 8:0.0000}
{txt}{col 51}{lalign 17:R-squared}{col 68} = {res}{ralign 8:0.6212}
{txt}{col 51}{lalign 17:Adj R-squared}{col 68} = {res}{ralign 8:0.6201}
{txt}{col 51}{lalign 17:Root MSE}{col 68} = {res}{ralign 8:0.5564}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0222543{col 26}{space 2} .0032604{col 37}{space 1}   -6.83{col 46}{space 3}0.000{col 54}{space 4}-.0286445{col 67}{space 3} -.015864
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0623555{col 26}{space 2} .0035893{col 37}{space 1}   17.37{col 46}{space 3}0.000{col 54}{space 4} .0553206{col 67}{space 3} .0693905
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0788811{col 26}{space 2} .0035254{col 37}{space 1}  -22.37{col 46}{space 3}0.000{col 54}{space 4}-.0857909{col 67}{space 3}-.0719714
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0715348{col 26}{space 2} .0037071{col 37}{space 1}  -19.30{col 46}{space 3}0.000{col 54}{space 4}-.0788006{col 67}{space 3}-.0642689
{txt}{space 12} {c |}
1.has_~4year {c |}{col 14}{res}{space 2} .0350192{col 26}{space 2} .0040109{col 37}{space 1}    8.73{col 46}{space 3}0.000{col 54}{space 4} .0271579{col 67}{space 3} .0428804
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003101{col 26}{space 2} 5.84e-06{col 37}{space 1}  -53.11{col 46}{space 3}0.000{col 54}{space 4}-.0003216{col 67}{space 3}-.0002987
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0894658{col 26}{space 2} .0016966{col 37}{space 1}  -52.73{col 46}{space 3}0.000{col 54}{space 4}-.0927911{col 67}{space 3}-.0861404
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0833619{col 26}{space 2} .0031407{col 37}{space 1}   26.54{col 46}{space 3}0.000{col 54}{space 4} .0772061{col 67}{space 3} .0895176
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0188899{col 26}{space 2}  .002547{col 37}{space 1}   -7.42{col 46}{space 3}0.000{col 54}{space 4} -.023882{col 67}{space 3}-.0138978
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1215064{col 26}{space 2}  .004788{col 37}{space 1}  -25.38{col 46}{space 3}0.000{col 54}{space 4}-.1308907{col 67}{space 3} -.112122
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0031494{col 26}{space 2} .0051095{col 37}{space 1}    0.62{col 46}{space 3}0.538{col 54}{space 4}-.0068651{col 67}{space 3}  .013164
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0230278{col 26}{space 2} .0021041{col 37}{space 1}  -10.94{col 46}{space 3}0.000{col 54}{space 4}-.0271518{col 67}{space 3}-.0189038
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2066022{col 26}{space 2} .0043235{col 37}{space 1}  -47.79{col 46}{space 3}0.000{col 54}{space 4}-.2150761{col 67}{space 3}-.1981283
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1879072{col 26}{space 2} .0042398{col 37}{space 1}  -44.32{col 46}{space 3}0.000{col 54}{space 4} -.196217{col 67}{space 3}-.1795975
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6037321{col 26}{space 2} .0027823{col 37}{space 1}  216.99{col 46}{space 3}0.000{col 54}{space 4} .5982789{col 67}{space 3} .6091853
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5893405{col 26}{space 2} .0039642{col 37}{space 1}  148.66{col 46}{space 3}0.000{col 54}{space 4} .5815708{col 67}{space 3} .5971103
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5737113{col 26}{space 2} .0045048{col 37}{space 1}  127.35{col 46}{space 3}0.000{col 54}{space 4}  .564882{col 67}{space 3} .5825406
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5689868{col 26}{space 2} .0052421{col 37}{space 1}  108.54{col 46}{space 3}0.000{col 54}{space 4} .5587124{col 67}{space 3} .5792611
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5870318{col 26}{space 2} .0057712{col 37}{space 1}  101.72{col 46}{space 3}0.000{col 54}{space 4} .5757205{col 67}{space 3} .5983432
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0038579{col 26}{space 2} .0014614{col 37}{space 1}    2.64{col 46}{space 3}0.008{col 54}{space 4} .0009937{col 67}{space 3} .0067221
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0024239{col 26}{space 2} .0019176{col 37}{space 1}    1.26{col 46}{space 3}0.206{col 54}{space 4}-.0013345{col 67}{space 3} .0061823
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0097969{col 26}{space 2} .0023239{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.0143518{col 67}{space 3} -.005242
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0126931{col 26}{space 2} .0023087{col 37}{space 1}    5.50{col 46}{space 3}0.000{col 54}{space 4} .0081681{col 67}{space 3} .0172182
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0045473{col 26}{space 2} .0026027{col 37}{space 1}    1.75{col 46}{space 3}0.081{col 54}{space 4}-.0005538{col 67}{space 3} .0096485
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0278799{col 26}{space 2} .0006725{col 37}{space 1}  -41.45{col 46}{space 3}0.000{col 54}{space 4}-.0291981{col 67}{space 3}-.0265617
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0255022{col 26}{space 2} .0009313{col 37}{space 1}  -27.38{col 46}{space 3}0.000{col 54}{space 4}-.0273276{col 67}{space 3}-.0236769
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0236004{col 26}{space 2} .0009536{col 37}{space 1}  -24.75{col 46}{space 3}0.000{col 54}{space 4}-.0254695{col 67}{space 3}-.0217313
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0301811{col 26}{space 2} .0015224{col 37}{space 1}  -19.82{col 46}{space 3}0.000{col 54}{space 4} -.033165{col 67}{space 3}-.0271972
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0307926{col 26}{space 2} .0017777{col 37}{space 1}  -17.32{col 46}{space 3}0.000{col 54}{space 4}-.0342769{col 67}{space 3}-.0273084
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1712724{col 26}{space 2} .0027562{col 37}{space 1}   62.14{col 46}{space 3}0.000{col 54}{space 4} .1658705{col 67}{space 3} .1766744
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1763902{col 26}{space 2} .0041539{col 37}{space 1}   42.46{col 46}{space 3}0.000{col 54}{space 4} .1682486{col 67}{space 3} .1845318
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1832908{col 26}{space 2} .0046495{col 37}{space 1}   39.42{col 46}{space 3}0.000{col 54}{space 4} .1741779{col 67}{space 3} .1924037
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2381252{col 26}{space 2} .0053287{col 37}{space 1}   44.69{col 46}{space 3}0.000{col 54}{space 4} .2276811{col 67}{space 3} .2485692
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2171333{col 26}{space 2} .0058029{col 37}{space 1}   37.42{col 46}{space 3}0.000{col 54}{space 4} .2057598{col 67}{space 3} .2285067
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0034046{col 26}{space 2} .0018269{col 37}{space 1}   -1.86{col 46}{space 3}0.062{col 54}{space 4}-.0069853{col 67}{space 3}  .000176
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0107363{col 26}{space 2} .0022903{col 37}{space 1}   -4.69{col 46}{space 3}0.000{col 54}{space 4}-.0152253{col 67}{space 3}-.0062472
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0026448{col 26}{space 2} .0028417{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4}-.0082146{col 67}{space 3} .0029249
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0071192{col 26}{space 2} .0022522{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4}  .002705{col 67}{space 3} .0115334
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0085865{col 26}{space 2} .0024959{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .0036946{col 67}{space 3} .0134783
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0036268{col 26}{space 2}   .00075{col 37}{space 1}   -4.84{col 46}{space 3}0.000{col 54}{space 4}-.0050969{col 67}{space 3}-.0021568
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0013477{col 26}{space 2} .0011819{col 37}{space 1}   -1.14{col 46}{space 3}0.254{col 54}{space 4}-.0036641{col 67}{space 3} .0009688
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0075583{col 26}{space 2} .0012571{col 37}{space 1}   -6.01{col 46}{space 3}0.000{col 54}{space 4}-.0100222{col 67}{space 3}-.0050944
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.003434{col 26}{space 2}  .001517{col 37}{space 1}   -2.26{col 46}{space 3}0.024{col 54}{space 4}-.0064072{col 67}{space 3}-.0004608
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0018053{col 26}{space 2} .0017156{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-.0051677{col 67}{space 3} .0015571
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.071861{col 26}{space 2} .0357303{col 37}{space 1}   57.99{col 46}{space 3}0.000{col 54}{space 4}  2.00183{col 67}{space 3} 2.141891
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1374{txt}, {res}451545{txt}) = {res}23.845{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.57557306 .18878546 .54373191 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0208254708   .5065488253          4536{txt}  {c |}
  2 {c |}  {res}.0157751852   .3914624706          3325{txt}  {c |}
  3 {c |}  {res}.0102657767   .2501957507          2148{txt}  {c |}
  4 {c |}  {res}.0084763829   .2076443108          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0208254708{txt}  {c |}
  2 {c |}  {res}.0157751852{txt}  {c |}
  3 {c |}  {res}.0102657767{txt}  {c |}
  4 {c |}  {res}.0102657767{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   452,964
{txt}{hline 13}{c +}{hline 34}   F(83, 452880)   = {res}  8116.19
{txt}       Model {c |} {res} 220697.874        83  2659.01054   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 148371.619   452,880  .327617953   {txt}R-squared       ={res}    0.5980
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5979
{txt}       Total {c |} {res} 369069.493   452,963  .814789493   {txt}Root MSE        =   {res} .57238

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0137261{col 26}{space 2} .0037262{col 37}{space 1}   -3.68{col 46}{space 3}0.000{col 54}{space 4}-.0210293{col 67}{space 3}-.0064229
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0727817{col 26}{space 2} .0041757{col 37}{space 1}   17.43{col 46}{space 3}0.000{col 54}{space 4} .0645974{col 67}{space 3}  .080966
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.058513{col 26}{space 2} .0041647{col 37}{space 1}  -14.05{col 46}{space 3}0.000{col 54}{space 4}-.0666758{col 67}{space 3}-.0503503
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0540763{col 26}{space 2} .0044249{col 37}{space 1}  -12.22{col 46}{space 3}0.000{col 54}{space 4}-.0627489{col 67}{space 3}-.0454037
{txt}{space 12} {c |}
1.has_~4year {c |}{col 14}{res}{space 2} .0406248{col 26}{space 2} .0041117{col 37}{space 1}    9.88{col 46}{space 3}0.000{col 54}{space 4} .0325661{col 67}{space 3} .0486835
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003166{col 26}{space 2} 5.99e-06{col 37}{space 1}  -52.83{col 46}{space 3}0.000{col 54}{space 4}-.0003284{col 67}{space 3}-.0003049
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0887742{col 26}{space 2}  .001742{col 37}{space 1}  -50.96{col 46}{space 3}0.000{col 54}{space 4}-.0921885{col 67}{space 3}  -.08536
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0830747{col 26}{space 2} .0032207{col 37}{space 1}   25.79{col 46}{space 3}0.000{col 54}{space 4} .0767623{col 67}{space 3} .0893872
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0199063{col 26}{space 2} .0026121{col 37}{space 1}   -7.62{col 46}{space 3}0.000{col 54}{space 4} -.025026{col 67}{space 3}-.0147866
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1216649{col 26}{space 2} .0049075{col 37}{space 1}  -24.79{col 46}{space 3}0.000{col 54}{space 4}-.1312835{col 67}{space 3}-.1120462
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0048675{col 26}{space 2} .0052374{col 37}{space 1}    0.93{col 46}{space 3}0.353{col 54}{space 4}-.0053977{col 67}{space 3} .0151327
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0223081{col 26}{space 2} .0021751{col 37}{space 1}  -10.26{col 46}{space 3}0.000{col 54}{space 4}-.0265713{col 67}{space 3} -.018045
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2052118{col 26}{space 2} .0044259{col 37}{space 1}  -46.37{col 46}{space 3}0.000{col 54}{space 4}-.2138864{col 67}{space 3}-.1965373
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1772844{col 26}{space 2} .0043472{col 37}{space 1}  -40.78{col 46}{space 3}0.000{col 54}{space 4}-.1858048{col 67}{space 3}-.1687641
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .596996{col 26}{space 2} .0028938{col 37}{space 1}  206.30{col 46}{space 3}0.000{col 54}{space 4} .5913243{col 67}{space 3} .6026677
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5877922{col 26}{space 2} .0041425{col 37}{space 1}  141.89{col 46}{space 3}0.000{col 54}{space 4} .5796731{col 67}{space 3} .5959113
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5696564{col 26}{space 2}  .004724{col 37}{space 1}  120.59{col 46}{space 3}0.000{col 54}{space 4} .5603975{col 67}{space 3} .5789152
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5806717{col 26}{space 2} .0054287{col 37}{space 1}  106.96{col 46}{space 3}0.000{col 54}{space 4} .5700315{col 67}{space 3} .5913118
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5955454{col 26}{space 2} .0059662{col 37}{space 1}   99.82{col 46}{space 3}0.000{col 54}{space 4} .5838518{col 67}{space 3} .6072391
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0015518{col 26}{space 2} .0015032{col 37}{space 1}    1.03{col 46}{space 3}0.302{col 54}{space 4}-.0013945{col 67}{space 3} .0044981
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0016268{col 26}{space 2} .0019751{col 37}{space 1}    0.82{col 46}{space 3}0.410{col 54}{space 4}-.0022443{col 67}{space 3}  .005498
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0110938{col 26}{space 2} .0023943{col 37}{space 1}   -4.63{col 46}{space 3}0.000{col 54}{space 4}-.0157865{col 67}{space 3}-.0064011
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0118355{col 26}{space 2} .0023746{col 37}{space 1}    4.98{col 46}{space 3}0.000{col 54}{space 4} .0071813{col 67}{space 3} .0164898
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0027057{col 26}{space 2} .0026777{col 37}{space 1}    1.01{col 46}{space 3}0.312{col 54}{space 4}-.0025424{col 67}{space 3} .0079538
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0272957{col 26}{space 2} .0006911{col 37}{space 1}  -39.49{col 46}{space 3}0.000{col 54}{space 4}-.0286503{col 67}{space 3}-.0259412
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0255398{col 26}{space 2} .0009571{col 37}{space 1}  -26.68{col 46}{space 3}0.000{col 54}{space 4}-.0274157{col 67}{space 3}-.0236638
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0230756{col 26}{space 2} .0009814{col 37}{space 1}  -23.51{col 46}{space 3}0.000{col 54}{space 4}-.0249991{col 67}{space 3}-.0211521
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0301281{col 26}{space 2} .0015642{col 37}{space 1}  -19.26{col 46}{space 3}0.000{col 54}{space 4}-.0331938{col 67}{space 3}-.0270623
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0311881{col 26}{space 2}  .001826{col 37}{space 1}  -17.08{col 46}{space 3}0.000{col 54}{space 4}-.0347669{col 67}{space 3}-.0276093
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1686648{col 26}{space 2} .0028513{col 37}{space 1}   59.15{col 46}{space 3}0.000{col 54}{space 4} .1630762{col 67}{space 3} .1742533
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1752367{col 26}{space 2} .0042976{col 37}{space 1}   40.78{col 46}{space 3}0.000{col 54}{space 4} .1668135{col 67}{space 3} .1836598
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1836306{col 26}{space 2} .0048187{col 37}{space 1}   38.11{col 46}{space 3}0.000{col 54}{space 4}  .174186{col 67}{space 3} .1930751
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2500058{col 26}{space 2}  .005545{col 37}{space 1}   45.09{col 46}{space 3}0.000{col 54}{space 4} .2391377{col 67}{space 3} .2608738
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2331586{col 26}{space 2} .0060467{col 37}{space 1}   38.56{col 46}{space 3}0.000{col 54}{space 4} .2213072{col 67}{space 3}   .24501
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0049829{col 26}{space 2}  .001878{col 37}{space 1}   -2.65{col 46}{space 3}0.008{col 54}{space 4}-.0086638{col 67}{space 3} -.001302
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0105395{col 26}{space 2} .0023552{col 37}{space 1}   -4.47{col 46}{space 3}0.000{col 54}{space 4}-.0151557{col 67}{space 3}-.0059234
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0028509{col 26}{space 2} .0029213{col 37}{space 1}   -0.98{col 46}{space 3}0.329{col 54}{space 4}-.0085766{col 67}{space 3} .0028748
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0102222{col 26}{space 2} .0023369{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4}  .005642{col 67}{space 3} .0148025
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0114326{col 26}{space 2} .0025853{col 37}{space 1}    4.42{col 46}{space 3}0.000{col 54}{space 4} .0063656{col 67}{space 3} .0164997
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0032957{col 26}{space 2} .0007706{col 37}{space 1}   -4.28{col 46}{space 3}0.000{col 54}{space 4}-.0048061{col 67}{space 3}-.0017852
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0014161{col 26}{space 2} .0012143{col 37}{space 1}   -1.17{col 46}{space 3}0.244{col 54}{space 4}-.0037962{col 67}{space 3} .0009639
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0075386{col 26}{space 2} .0012925{col 37}{space 1}   -5.83{col 46}{space 3}0.000{col 54}{space 4}-.0100719{col 67}{space 3}-.0050053
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0038556{col 26}{space 2} .0015659{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 54}{space 4}-.0069247{col 67}{space 3}-.0007864
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0023563{col 26}{space 2} .0017698{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-.0058251{col 67}{space 3} .0011124
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2}-.0005149{col 26}{space 2} .0000275{col 37}{space 1}  -18.76{col 46}{space 3}0.000{col 54}{space 4}-.0005687{col 67}{space 3}-.0004611
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2}-.1542307{col 26}{space 2} .0244763{col 37}{space 1}   -6.30{col 46}{space 3}0.000{col 54}{space 4}-.2022036{col 67}{space 3}-.1062579
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2} .1390173{col 26}{space 2} .0087893{col 37}{space 1}   15.82{col 46}{space 3}0.000{col 54}{space 4} .1217906{col 67}{space 3} .1562441
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2} .1582378{col 26}{space 2} .0080933{col 37}{space 1}   19.55{col 46}{space 3}0.000{col 54}{space 4} .1423751{col 67}{space 3} .1741005
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2}-.2536308{col 26}{space 2} .0159354{col 37}{space 1}  -15.92{col 46}{space 3}0.000{col 54}{space 4}-.2848636{col 67}{space 3}-.2223979
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2} .1249915{col 26}{space 2} .0319317{col 37}{space 1}    3.91{col 46}{space 3}0.000{col 54}{space 4} .0624063{col 67}{space 3} .1875767
{txt}peer_econ_~e {c |}{col 14}{res}{space 2}-.0660162{col 26}{space 2}  .008146{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4} -.081982{col 67}{space 3}-.0500503
{txt}peer_limit~f {c |}{col 14}{res}{space 2}-.1180286{col 26}{space 2} .0177526{col 37}{space 1}   -6.65{col 46}{space 3}0.000{col 54}{space 4}-.1528233{col 67}{space 3} -.083234
{txt}peer_disab~d {c |}{col 14}{res}{space 2}-.1782616{col 26}{space 2} .0295171{col 37}{space 1}   -6.04{col 46}{space 3}0.000{col 54}{space 4}-.2361142{col 67}{space 3}-.1204091
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1491643{col 26}{space 2} .0134707{col 37}{space 1}   11.07{col 46}{space 3}0.000{col 54}{space 4} .1227621{col 67}{space 3} .1755665
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1159633{col 26}{space 2} .0184786{col 37}{space 1}    6.28{col 46}{space 3}0.000{col 54}{space 4} .0797458{col 67}{space 3} .1521808
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1435813{col 26}{space 2} .0222828{col 37}{space 1}    6.44{col 46}{space 3}0.000{col 54}{space 4} .0999078{col 67}{space 3} .1872548
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.3179951{col 26}{space 2} .0263713{col 37}{space 1}  -12.06{col 46}{space 3}0.000{col 54}{space 4}-.3696821{col 67}{space 3}-.2663082
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1997452{col 26}{space 2} .0275029{col 37}{space 1}   -7.26{col 46}{space 3}0.000{col 54}{space 4}-.2536499{col 67}{space 3}-.1458404
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.2672636{col 26}{space 2} .0161443{col 37}{space 1}  -16.55{col 46}{space 3}0.000{col 54}{space 4} -.298906{col 67}{space 3}-.2356212
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1829284{col 26}{space 2} .0213584{col 37}{space 1}   -8.56{col 46}{space 3}0.000{col 54}{space 4}-.2247901{col 67}{space 3}-.1410667
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0901657{col 26}{space 2} .0291061{col 37}{space 1}   -3.10{col 46}{space 3}0.002{col 54}{space 4}-.1472128{col 67}{space 3}-.0331187
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1226361{col 26}{space 2} .0320133{col 37}{space 1}    3.83{col 46}{space 3}0.000{col 54}{space 4} .0598911{col 67}{space 3} .1853811
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1127756{col 26}{space 2} .0342795{col 37}{space 1}    3.29{col 46}{space 3}0.001{col 54}{space 4} .0455887{col 67}{space 3} .1799624
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .146623{col 26}{space 2} .0179882{col 37}{space 1}    8.15{col 46}{space 3}0.000{col 54}{space 4} .1113666{col 67}{space 3} .1818793
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0066318{col 26}{space 2} .0275464{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4}-.0606219{col 67}{space 3} .0473584
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0192708{col 26}{space 2} .0293037{col 37}{space 1}    0.66{col 46}{space 3}0.511{col 54}{space 4}-.0381636{col 67}{space 3} .0767052
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2048864{col 26}{space 2} .0358713{col 37}{space 1}    5.71{col 46}{space 3}0.000{col 54}{space 4} .1345796{col 67}{space 3} .2751931
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1594243{col 26}{space 2} .0364548{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4}  .087974{col 67}{space 3} .2308747
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0890941{col 26}{space 2} .0123671{col 37}{space 1}   -7.20{col 46}{space 3}0.000{col 54}{space 4}-.1133332{col 67}{space 3}-.0648549
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0583822{col 26}{space 2} .0181559{col 37}{space 1}   -3.22{col 46}{space 3}0.001{col 54}{space 4}-.0939672{col 67}{space 3}-.0227973
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.1344978{col 26}{space 2} .0215512{col 37}{space 1}   -6.24{col 46}{space 3}0.000{col 54}{space 4}-.1767376{col 67}{space 3} -.092258
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1722831{col 26}{space 2} .0238583{col 37}{space 1}    7.22{col 46}{space 3}0.000{col 54}{space 4} .1255215{col 67}{space 3} .2190447
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0487849{col 26}{space 2}  .024138{col 37}{space 1}    2.02{col 46}{space 3}0.043{col 54}{space 4} .0014751{col 67}{space 3} .0960947
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .2302797{col 26}{space 2} .0184158{col 37}{space 1}   12.50{col 46}{space 3}0.000{col 54}{space 4} .1941853{col 67}{space 3} .2663742
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0348186{col 26}{space 2} .0242075{col 37}{space 1}    1.44{col 46}{space 3}0.150{col 54}{space 4}-.0126274{col 67}{space 3} .0822647
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0143934{col 26}{space 2} .0330642{col 37}{space 1}    0.44{col 46}{space 3}0.663{col 54}{space 4}-.0504113{col 67}{space 3} .0791981
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1899562{col 26}{space 2} .0308443{col 37}{space 1}   -6.16{col 46}{space 3}0.000{col 54}{space 4}-.2504101{col 67}{space 3}-.1295023
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1510041{col 26}{space 2} .0319872{col 37}{space 1}   -4.72{col 46}{space 3}0.000{col 54}{space 4} -.213698{col 67}{space 3}-.0883103
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1252974{col 26}{space 2} .0129807{col 37}{space 1}   -9.65{col 46}{space 3}0.000{col 54}{space 4}-.1507392{col 67}{space 3}-.0998557
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0467174{col 26}{space 2} .0252076{col 37}{space 1}    1.85{col 46}{space 3}0.064{col 54}{space 4}-.0026888{col 67}{space 3} .0961235
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0045567{col 26}{space 2} .0233021{col 37}{space 1}    0.20{col 46}{space 3}0.845{col 54}{space 4}-.0411146{col 67}{space 3}  .050228
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0617312{col 26}{space 2} .0240151{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-.1088002{col 67}{space 3}-.0146623
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0298788{col 26}{space 2} .0224749{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-.0739288{col 67}{space 3} .0141712
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  5.31238{col 26}{space 2} .1688345{col 37}{space 1}   31.47{col 46}{space 3}0.000{col 54}{space 4}  4.98147{col 67}{space 3} 5.643291
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.5723792 .17909837 .5436375 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0170675251   .4553151562          4536{txt}  {c |}
  2 {c |}  {res}.0131512014   .3525067957          3325{txt}  {c |}
  3 {c |}  {res}.0089803837   .2341676785          2148{txt}  {c |}
  4 {c |}  {res}.0083639777     .21533008          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0170675251{txt}  {c |}
  2 {c |}  {res}.0131512014{txt}  {c |}
  3 {c |}  {res}.0089803837{txt}  {c |}
  4 {c |}  {res}.0089803837{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:452,964}
{txt}{col 1}Absorbed variable: {res:school_id}{col 52}{lalign 17:No. of categories}{col 69} = {res}{ralign 7:1,375}
{txt}{col 52}{lalign 17:F({res:83}, {res:451506})}{col 69} = {res}{ralign 7:6837.13}
{txt}{col 52}{lalign 17:Prob > F}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 52}{lalign 17:R-squared}{col 69} = {res}{ralign 7:0.6226}
{txt}{col 52}{lalign 17:Adj R-squared}{col 69} = {res}{ralign 7:0.6214}
{txt}{col 52}{lalign 17:Root MSE}{col 69} = {res}{ralign 7:0.5554}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0150347{col 26}{space 2} .0037438{col 37}{space 1}   -4.02{col 46}{space 3}0.000{col 54}{space 4}-.0223724{col 67}{space 3}-.0076971
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0636222{col 26}{space 2} .0042701{col 37}{space 1}   14.90{col 46}{space 3}0.000{col 54}{space 4} .0552529{col 67}{space 3} .0719914
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0641198{col 26}{space 2} .0043741{col 37}{space 1}  -14.66{col 46}{space 3}0.000{col 54}{space 4} -.072693{col 67}{space 3}-.0555467
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0508357{col 26}{space 2} .0047652{col 37}{space 1}  -10.67{col 46}{space 3}0.000{col 54}{space 4}-.0601754{col 67}{space 3}-.0414959
{txt}{space 12} {c |}
1.has_~4year {c |}{col 14}{res}{space 2} .0339834{col 26}{space 2} .0040041{col 37}{space 1}    8.49{col 46}{space 3}0.000{col 54}{space 4} .0261355{col 67}{space 3} .0418314
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003098{col 26}{space 2} 5.84e-06{col 37}{space 1}  -53.07{col 46}{space 3}0.000{col 54}{space 4}-.0003213{col 67}{space 3}-.0002984
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0892067{col 26}{space 2} .0016939{col 37}{space 1}  -52.66{col 46}{space 3}0.000{col 54}{space 4}-.0925266{col 67}{space 3}-.0858868
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0827809{col 26}{space 2} .0031357{col 37}{space 1}   26.40{col 46}{space 3}0.000{col 54}{space 4}  .076635{col 67}{space 3} .0889268
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0186327{col 26}{space 2} .0025441{col 37}{space 1}   -7.32{col 46}{space 3}0.000{col 54}{space 4} -.023619{col 67}{space 3}-.0136464
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1210631{col 26}{space 2} .0047801{col 37}{space 1}  -25.33{col 46}{space 3}0.000{col 54}{space 4} -.130432{col 67}{space 3}-.1116942
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0041604{col 26}{space 2} .0051026{col 37}{space 1}    0.82{col 46}{space 3}0.415{col 54}{space 4}-.0058406{col 67}{space 3} .0141613
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0225242{col 26}{space 2} .0021157{col 37}{space 1}  -10.65{col 46}{space 3}0.000{col 54}{space 4}-.0266708{col 67}{space 3}-.0183775
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2057683{col 26}{space 2} .0043204{col 37}{space 1}  -47.63{col 46}{space 3}0.000{col 54}{space 4}-.2142362{col 67}{space 3}-.1973004
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1815163{col 26}{space 2} .0042367{col 37}{space 1}  -42.84{col 46}{space 3}0.000{col 54}{space 4}  -.18982{col 67}{space 3}-.1732125
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .5967238{col 26}{space 2} .0028123{col 37}{space 1}  212.18{col 46}{space 3}0.000{col 54}{space 4} .5912117{col 67}{space 3} .6022359
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5862691{col 26}{space 2} .0040283{col 37}{space 1}  145.54{col 46}{space 3}0.000{col 54}{space 4} .5783738{col 67}{space 3} .5941645
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .569658{col 26}{space 2} .0045916{col 37}{space 1}  124.07{col 46}{space 3}0.000{col 54}{space 4} .5606586{col 67}{space 3} .5786573
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5806665{col 26}{space 2} .0052764{col 37}{space 1}  110.05{col 46}{space 3}0.000{col 54}{space 4} .5703249{col 67}{space 3} .5910082
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .5956576{col 26}{space 2} .0058003{col 37}{space 1}  102.69{col 46}{space 3}0.000{col 54}{space 4} .5842891{col 67}{space 3} .6070261
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0030372{col 26}{space 2} .0014622{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0001712{col 67}{space 3} .0059031
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0023048{col 26}{space 2} .0019217{col 37}{space 1}    1.20{col 46}{space 3}0.230{col 54}{space 4}-.0014617{col 67}{space 3} .0060712
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0101499{col 26}{space 2} .0023284{col 37}{space 1}   -4.36{col 46}{space 3}0.000{col 54}{space 4}-.0147135{col 67}{space 3}-.0055863
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0118896{col 26}{space 2} .0023088{col 37}{space 1}    5.15{col 46}{space 3}0.000{col 54}{space 4} .0073644{col 67}{space 3} .0164149
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0033489{col 26}{space 2} .0026037{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4}-.0017542{col 67}{space 3}  .008452
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275546{col 26}{space 2} .0006719{col 37}{space 1}  -41.01{col 46}{space 3}0.000{col 54}{space 4}-.0288714{col 67}{space 3}-.0262378
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0252669{col 26}{space 2} .0009306{col 37}{space 1}  -27.15{col 46}{space 3}0.000{col 54}{space 4}-.0270907{col 67}{space 3} -.023443
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0233238{col 26}{space 2} .0009539{col 37}{space 1}  -24.45{col 46}{space 3}0.000{col 54}{space 4}-.0251934{col 67}{space 3}-.0214542
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0307017{col 26}{space 2} .0015203{col 37}{space 1}  -20.19{col 46}{space 3}0.000{col 54}{space 4}-.0336814{col 67}{space 3}-.0277219
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0312005{col 26}{space 2}  .001775{col 37}{space 1}  -17.58{col 46}{space 3}0.000{col 54}{space 4}-.0346794{col 67}{space 3}-.0277216
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1682288{col 26}{space 2} .0027711{col 37}{space 1}   60.71{col 46}{space 3}0.000{col 54}{space 4} .1627975{col 67}{space 3}   .17366
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1753608{col 26}{space 2} .0041782{col 37}{space 1}   41.97{col 46}{space 3}0.000{col 54}{space 4} .1671717{col 67}{space 3} .1835499
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1842916{col 26}{space 2} .0046831{col 37}{space 1}   39.35{col 46}{space 3}0.000{col 54}{space 4} .1751128{col 67}{space 3} .1934704
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2485736{col 26}{space 2} .0053898{col 37}{space 1}   46.12{col 46}{space 3}0.000{col 54}{space 4} .2380096{col 67}{space 3} .2591375
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2327031{col 26}{space 2} .0058782{col 37}{space 1}   39.59{col 46}{space 3}0.000{col 54}{space 4} .2211821{col 67}{space 3} .2442241
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0038673{col 26}{space 2} .0018266{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4}-.0074474{col 67}{space 3}-.0002873
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106716{col 26}{space 2} .0022907{col 37}{space 1}   -4.66{col 46}{space 3}0.000{col 54}{space 4}-.0151614{col 67}{space 3}-.0061819
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0026042{col 26}{space 2} .0028404{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-.0081713{col 67}{space 3}  .002963
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}   .01082{col 26}{space 2}  .002272{col 37}{space 1}    4.76{col 46}{space 3}0.000{col 54}{space 4} .0063669{col 67}{space 3}  .015273
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0123843{col 26}{space 2}  .002514{col 37}{space 1}    4.93{col 46}{space 3}0.000{col 54}{space 4}  .007457{col 67}{space 3} .0173117
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.003573{col 26}{space 2} .0007492{col 37}{space 1}   -4.77{col 46}{space 3}0.000{col 54}{space 4}-.0050414{col 67}{space 3}-.0021046
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0014054{col 26}{space 2} .0011805{col 37}{space 1}   -1.19{col 46}{space 3}0.234{col 54}{space 4}-.0037192{col 67}{space 3} .0009084
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0076183{col 26}{space 2} .0012562{col 37}{space 1}   -6.06{col 46}{space 3}0.000{col 54}{space 4}-.0100804{col 67}{space 3}-.0051562
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0029728{col 26}{space 2} .0015223{col 37}{space 1}   -1.95{col 46}{space 3}0.051{col 54}{space 4}-.0059564{col 67}{space 3} .0000108
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0022164{col 26}{space 2} .0017204{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-.0055883{col 67}{space 3} .0011555
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2} .0001135{col 26}{space 2} .0000561{col 37}{space 1}    2.02{col 46}{space 3}0.043{col 54}{space 4} 3.51e-06{col 67}{space 3} .0002235
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2}-.4015011{col 26}{space 2} .0348938{col 37}{space 1}  -11.51{col 46}{space 3}0.000{col 54}{space 4}-.4698919{col 67}{space 3}-.3331103
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2}-.0967266{col 26}{space 2} .0568084{col 37}{space 1}   -1.70{col 46}{space 3}0.089{col 54}{space 4}-.2080693{col 67}{space 3} .0146161
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2}-.0393943{col 26}{space 2} .0420969{col 37}{space 1}   -0.94{col 46}{space 3}0.349{col 54}{space 4}-.1219029{col 67}{space 3} .0431143
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2}-.1079489{col 26}{space 2} .0801158{col 37}{space 1}   -1.35{col 46}{space 3}0.178{col 54}{space 4}-.2649735{col 67}{space 3} .0490756
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2}-.0542008{col 26}{space 2} .0560707{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-.1640976{col 67}{space 3} .0556961
{txt}peer_econ_~e {c |}{col 14}{res}{space 2}-.0006815{col 26}{space 2} .0154415{col 37}{space 1}   -0.04{col 46}{space 3}0.965{col 54}{space 4}-.0309463{col 67}{space 3} .0295833
{txt}peer_limit~f {c |}{col 14}{res}{space 2} .0002225{col 26}{space 2} .0420686{col 37}{space 1}    0.01{col 46}{space 3}0.996{col 54}{space 4}-.0822307{col 67}{space 3} .0826758
{txt}peer_disab~d {c |}{col 14}{res}{space 2}-.1965461{col 26}{space 2} .0527014{col 37}{space 1}   -3.73{col 46}{space 3}0.000{col 54}{space 4}-.2998392{col 67}{space 3}-.0932529
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1538901{col 26}{space 2} .0209707{col 37}{space 1}   -7.34{col 46}{space 3}0.000{col 54}{space 4}-.1949919{col 67}{space 3}-.1127883
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.111951{col 26}{space 2}   .02422{col 37}{space 1}   -4.62{col 46}{space 3}0.000{col 54}{space 4}-.1594214{col 67}{space 3}-.0644805
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0990271{col 26}{space 2} .0265054{col 37}{space 1}   -3.74{col 46}{space 3}0.000{col 54}{space 4}-.1509768{col 67}{space 3}-.0470773
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.4128387{col 26}{space 2}  .029981{col 37}{space 1}  -13.77{col 46}{space 3}0.000{col 54}{space 4}-.4716006{col 67}{space 3}-.3540768
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.3051333{col 26}{space 2} .0308412{col 37}{space 1}   -9.89{col 46}{space 3}0.000{col 54}{space 4} -.365581{col 67}{space 3}-.2446855
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1759919{col 26}{space 2}  .024558{col 37}{space 1}   -7.17{col 46}{space 3}0.000{col 54}{space 4}-.2241248{col 67}{space 3} -.127859
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1078445{col 26}{space 2} .0284153{col 37}{space 1}   -3.80{col 46}{space 3}0.000{col 54}{space 4}-.1635377{col 67}{space 3}-.0521514
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0224579{col 26}{space 2} .0336205{col 37}{space 1}    0.67{col 46}{space 3}0.504{col 54}{space 4}-.0434372{col 67}{space 3}  .088353
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0240579{col 26}{space 2} .0357311{col 37}{space 1}    0.67{col 46}{space 3}0.501{col 54}{space 4} -.045974{col 67}{space 3} .0940897
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0784299{col 26}{space 2} .0378739{col 37}{space 1}    2.07{col 46}{space 3}0.038{col 54}{space 4} .0041981{col 67}{space 3} .1526616
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1433447{col 26}{space 2}  .027129{col 37}{space 1}    5.28{col 46}{space 3}0.000{col 54}{space 4} .0901727{col 67}{space 3} .1965167
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0851663{col 26}{space 2} .0369183{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.1575251{col 67}{space 3}-.0128075
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0468117{col 26}{space 2} .0346702{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-.1147642{col 67}{space 3} .0211408
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1903679{col 26}{space 2} .0402381{col 37}{space 1}    4.73{col 46}{space 3}0.000{col 54}{space 4} .1115025{col 67}{space 3} .2692334
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1349401{col 26}{space 2} .0414705{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0536592{col 67}{space 3}  .216221
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0221818{col 26}{space 2} .0176807{col 37}{space 1}   -1.25{col 46}{space 3}0.210{col 54}{space 4}-.0568354{col 67}{space 3} .0124718
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0630502{col 26}{space 2} .0220041{col 37}{space 1}   -2.87{col 46}{space 3}0.004{col 54}{space 4}-.1061776{col 67}{space 3}-.0199228
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0990446{col 26}{space 2} .0240927{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4}-.1462656{col 67}{space 3}-.0518237
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0435939{col 26}{space 2} .0265911{col 37}{space 1}    1.64{col 46}{space 3}0.101{col 54}{space 4}-.0085237{col 67}{space 3} .0957116
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0699719{col 26}{space 2} .0268473{col 37}{space 1}   -2.61{col 46}{space 3}0.009{col 54}{space 4}-.1225918{col 67}{space 3} -.017352
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1368253{col 26}{space 2}  .025915{col 37}{space 1}    5.28{col 46}{space 3}0.000{col 54}{space 4} .0860326{col 67}{space 3}  .187618
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0242388{col 26}{space 2} .0300793{col 37}{space 1}    0.81{col 46}{space 3}0.420{col 54}{space 4}-.0347156{col 67}{space 3} .0831933
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0840606{col 26}{space 2} .0367347{col 37}{space 1}   -2.29{col 46}{space 3}0.022{col 54}{space 4}-.1560595{col 67}{space 3}-.0120616
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.063568{col 26}{space 2} .0341279{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 54}{space 4}-.1304576{col 67}{space 3} .0033215
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1339608{col 26}{space 2} .0354619{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}-.2034651{col 67}{space 3}-.0644565
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0809849{col 26}{space 2}  .020643{col 37}{space 1}   -3.92{col 46}{space 3}0.000{col 54}{space 4}-.1214445{col 67}{space 3}-.0405253
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0931622{col 26}{space 2} .0317095{col 37}{space 1}    2.94{col 46}{space 3}0.003{col 54}{space 4} .0310125{col 67}{space 3} .1553119
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0887153{col 26}{space 2} .0273006{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4}  .035207{col 67}{space 3} .1422236
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0559728{col 26}{space 2} .0289991{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}  -.11281{col 67}{space 3} .0008645
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0230515{col 26}{space 2} .0283354{col 37}{space 1}    0.81{col 46}{space 3}0.416{col 54}{space 4}-.0324851{col 67}{space 3} .0785881
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.663284{col 26}{space 2} .3454796{col 37}{space 1}    4.81{col 46}{space 3}0.000{col 54}{space 4} .9861552{col 67}{space 3} 2.340414
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1374{txt}, {res}451506{txt}) = {res}21.463{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.58230124 .20864549 .54363755 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0287072756   .5902368671          4536{txt}  {c |}
  2 {c |}  {res}.0247235406   .5146891025          3325{txt}  {c |}
  3 {c |}  {res}.0204754912   .4195073126          2148{txt}  {c |}
  4 {c |}  {res}.0193493264   .3946597404          1062{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0287072756{txt}  {c |}
  2 {c |}  {res}.0247235406{txt}  {c |}
  3 {c |}  {res}.0204754912{txt}  {c |}
  4 {c |}  {res}.0204754912{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   451,951
                                                {txt}F(1, 1288)        =  {res}  1504.08
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0389
                                                {txt}Root MSE          =    {res} .56395

{txt}{ralign 78:(Std. err. adjusted for {res:1,289} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~_r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~a {c |}{col 14}{res}{space 2} .9780416{col 26}{space 2} .0252187{col 37}{space 1}   38.78{col 46}{space 3}0.000{col 54}{space 4} .9285674{col 67}{space 3} 1.027516
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0025435{col 26}{space 2} .0019777{col 37}{space 1}    1.29{col 46}{space 3}0.199{col 54}{space 4}-.0013364{col 67}{space 3} .0064235
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling_enr_4year.ster} saved

Linear regression                               Number of obs     = {res}   451,951
                                                {txt}F(1, 1288)        =  {res}  1288.85
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0314
                                                {txt}Root MSE          =    {res} .56322

{txt}{ralign 78:(Std. err. adjusted for {res:1,289} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~er{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} .9816782{col 26}{space 2} .0273444{col 37}{space 1}   35.90{col 46}{space 3}0.000{col 54}{space 4} .9280338{col 67}{space 3} 1.035323
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0036974{col 26}{space 2} .0019944{col 37}{space 1}    1.85{col 46}{space 3}0.064{col 54}{space 4}-.0002151{col 67}{space 3} .0076099
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_peer_sibling_enr_4year.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_ela_sibling_enr_4year.dta{rm}
saved
{p_end}
(CST/SBAC Student Test Score Samples)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   450,884
{txt}{hline 13}{c +}{hline 34}   F(44, 450839)   = {res} 19237.25
{txt}       Model {c |} {res}  259758.18        44    5903.595   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 138355.063   450,839  .306883528   {txt}R-squared       ={res}    0.6525
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6524
{txt}       Total {c |} {res} 398113.243   450,883  .882963524   {txt}Root MSE        =   {res} .55397

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0291136{col 26}{space 2} .0032238{col 37}{space 1}   -9.03{col 46}{space 3}0.000{col 54}{space 4}-.0354321{col 67}{space 3}-.0227951
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0642694{col 26}{space 2} .0035371{col 37}{space 1}   18.17{col 46}{space 3}0.000{col 54}{space 4} .0573368{col 67}{space 3} .0712019
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0992874{col 26}{space 2} .0034633{col 37}{space 1}  -28.67{col 46}{space 3}0.000{col 54}{space 4}-.1060753{col 67}{space 3}-.0924994
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.088031{col 26}{space 2} .0036458{col 37}{space 1}  -24.15{col 46}{space 3}0.000{col 54}{space 4}-.0951767{col 67}{space 3}-.0808853
{txt}{space 12} {c |}
1.has_old~nr {c |}{col 14}{res}{space 2} .0153476{col 26}{space 2} .0027319{col 37}{space 1}    5.62{col 46}{space 3}0.000{col 54}{space 4} .0099932{col 67}{space 3}  .020702
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003448{col 26}{space 2} 5.76e-06{col 37}{space 1}  -59.86{col 46}{space 3}0.000{col 54}{space 4}-.0003561{col 67}{space 3}-.0003335
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0451189{col 26}{space 2} .0016878{col 37}{space 1}   26.73{col 46}{space 3}0.000{col 54}{space 4}  .041811{col 67}{space 3} .0484269
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}  .189621{col 26}{space 2} .0028033{col 37}{space 1}   67.64{col 46}{space 3}0.000{col 54}{space 4} .1841266{col 67}{space 3} .1951154
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}  -.05951{col 26}{space 2} .0023068{col 37}{space 1}  -25.80{col 46}{space 3}0.000{col 54}{space 4}-.0640313{col 67}{space 3}-.0549887
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1616721{col 26}{space 2} .0045614{col 37}{space 1}  -35.44{col 46}{space 3}0.000{col 54}{space 4}-.1706123{col 67}{space 3}-.1527319
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0086572{col 26}{space 2}  .005039{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4} -.001219{col 67}{space 3} .0185335
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0540337{col 26}{space 2}  .001947{col 37}{space 1}  -27.75{col 46}{space 3}0.000{col 54}{space 4}-.0578498{col 67}{space 3}-.0502176
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0849044{col 26}{space 2} .0042437{col 37}{space 1}  -20.01{col 46}{space 3}0.000{col 54}{space 4}-.0932219{col 67}{space 3} -.076587
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1461362{col 26}{space 2} .0041989{col 37}{space 1}  -34.80{col 46}{space 3}0.000{col 54}{space 4}-.1543659{col 67}{space 3}-.1379065
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3481322{col 26}{space 2} .0027533{col 37}{space 1}  126.44{col 46}{space 3}0.000{col 54}{space 4} .3427358{col 67}{space 3} .3535285
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3279625{col 26}{space 2} .0039332{col 37}{space 1}   83.38{col 46}{space 3}0.000{col 54}{space 4} .3202535{col 67}{space 3} .3356715
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2876403{col 26}{space 2} .0044761{col 37}{space 1}   64.26{col 46}{space 3}0.000{col 54}{space 4} .2788673{col 67}{space 3} .2964134
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1801003{col 26}{space 2} .0052066{col 37}{space 1}   34.59{col 46}{space 3}0.000{col 54}{space 4} .1698956{col 67}{space 3}  .190305
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1762794{col 26}{space 2} .0057396{col 37}{space 1}   30.71{col 46}{space 3}0.000{col 54}{space 4} .1650299{col 67}{space 3} .1875289
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .024546{col 26}{space 2} .0014568{col 37}{space 1}   16.85{col 46}{space 3}0.000{col 54}{space 4} .0216908{col 67}{space 3} .0274013
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0127022{col 26}{space 2} .0019056{col 37}{space 1}    6.67{col 46}{space 3}0.000{col 54}{space 4} .0089673{col 67}{space 3}  .016437
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0185805{col 26}{space 2}  .002311{col 37}{space 1}    8.04{col 46}{space 3}0.000{col 54}{space 4}  .014051{col 67}{space 3} .0231101
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .002792{col 26}{space 2} .0022941{col 37}{space 1}    1.22{col 46}{space 3}0.224{col 54}{space 4}-.0017043{col 67}{space 3} .0072883
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0051252{col 26}{space 2} .0025934{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-.0102082{col 67}{space 3}-.0000421
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0157977{col 26}{space 2} .0006701{col 37}{space 1}  -23.58{col 46}{space 3}0.000{col 54}{space 4} -.017111{col 67}{space 3}-.0144844
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.011045{col 26}{space 2} .0009266{col 37}{space 1}  -11.92{col 46}{space 3}0.000{col 54}{space 4}-.0128611{col 67}{space 3}-.0092289
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0121202{col 26}{space 2} .0009487{col 37}{space 1}  -12.78{col 46}{space 3}0.000{col 54}{space 4}-.0139796{col 67}{space 3}-.0102607
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0064949{col 26}{space 2}  .001512{col 37}{space 1}   -4.30{col 46}{space 3}0.000{col 54}{space 4}-.0094583{col 67}{space 3}-.0035314
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0044047{col 26}{space 2} .0017738{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.0078812{col 67}{space 3}-.0009282
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4898947{col 26}{space 2} .0027288{col 37}{space 1}  179.53{col 46}{space 3}0.000{col 54}{space 4} .4845463{col 67}{space 3} .4952431
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .4936273{col 26}{space 2} .0041304{col 37}{space 1}  119.51{col 46}{space 3}0.000{col 54}{space 4} .4855318{col 67}{space 3} .5017228
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5368802{col 26}{space 2} .0046238{col 37}{space 1}  116.11{col 46}{space 3}0.000{col 54}{space 4} .5278177{col 67}{space 3} .5459427
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6741776{col 26}{space 2} .0052951{col 37}{space 1}  127.32{col 46}{space 3}0.000{col 54}{space 4} .6637994{col 67}{space 3} .6845558
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .6694684{col 26}{space 2} .0057645{col 37}{space 1}  116.14{col 46}{space 3}0.000{col 54}{space 4} .6581701{col 67}{space 3} .6807667
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0239927{col 26}{space 2} .0018178{col 37}{space 1}   13.20{col 46}{space 3}0.000{col 54}{space 4} .0204299{col 67}{space 3} .0275556
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0108015{col 26}{space 2}  .002278{col 37}{space 1}    4.74{col 46}{space 3}0.000{col 54}{space 4} .0063367{col 67}{space 3} .0152663
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0043172{col 26}{space 2} .0028324{col 37}{space 1}    1.52{col 46}{space 3}0.127{col 54}{space 4}-.0012342{col 67}{space 3} .0098685
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0772392{col 26}{space 2} .0022409{col 37}{space 1}   34.47{col 46}{space 3}0.000{col 54}{space 4} .0728472{col 67}{space 3} .0816313
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0840721{col 26}{space 2} .0024821{col 37}{space 1}   33.87{col 46}{space 3}0.000{col 54}{space 4} .0792073{col 67}{space 3} .0889369
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0228654{col 26}{space 2} .0007461{col 37}{space 1}  -30.65{col 46}{space 3}0.000{col 54}{space 4}-.0243277{col 67}{space 3}-.0214031
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0189085{col 26}{space 2} .0011774{col 37}{space 1}  -16.06{col 46}{space 3}0.000{col 54}{space 4}-.0212162{col 67}{space 3}-.0166008
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0224562{col 26}{space 2} .0012523{col 37}{space 1}  -17.93{col 46}{space 3}0.000{col 54}{space 4}-.0249107{col 67}{space 3}-.0200017
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0257879{col 26}{space 2} .0015104{col 37}{space 1}  -17.07{col 46}{space 3}0.000{col 54}{space 4}-.0287482{col 67}{space 3}-.0228275
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0248816{col 26}{space 2} .0017073{col 37}{space 1}  -14.57{col 46}{space 3}0.000{col 54}{space 4}-.0282279{col 67}{space 3}-.0215353
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.185167{col 26}{space 2} .0352653{col 37}{space 1}   61.96{col 46}{space 3}0.000{col 54}{space 4} 2.116048{col 67}{space 3} 2.254286
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.55397069 .16533717 .52872219 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0191757742   .6159682805          4527{txt}  {c |}
  2 {c |}  {res}.0154394052   .4827314154          3319{txt}  {c |}
  3 {c |}  {res}.0098844115   .3287982505          2147{txt}  {c |}
  4 {c |}  {res}.0082466121   .2600582612          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0191757742{txt}  {c |}
  2 {c |}  {res}.0154394052{txt}  {c |}
  3 {c |}  {res}.0098844115{txt}  {c |}
  4 {c |}  {res}.0098844115{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 51}{lalign 17:Number of obs}{col 68} = {res}{ralign 8:450,884}
{txt}{col 1}Absorbed variable: {res:school_id}{col 51}{lalign 17:No. of categories}{col 68} = {res}{ralign 8:1,372}
{txt}{col 51}{lalign 17:F({res:44}, {res:449468})}{col 68} = {res}{ralign 8:15117.64}
{txt}{col 51}{lalign 17:Prob > F}{col 68} = {res}{ralign 8:0.0000}
{txt}{col 51}{lalign 17:R-squared}{col 68} = {res}{ralign 8:0.6767}
{txt}{col 51}{lalign 17:Adj R-squared}{col 68} = {res}{ralign 8:0.6756}
{txt}{col 51}{lalign 17:Root MSE}{col 68} = {res}{ralign 8:0.5352}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0213915{col 26}{space 2} .0031443{col 37}{space 1}   -6.80{col 46}{space 3}0.000{col 54}{space 4}-.0275542{col 67}{space 3}-.0152288
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0572956{col 26}{space 2} .0034609{col 37}{space 1}   16.55{col 46}{space 3}0.000{col 54}{space 4} .0505123{col 67}{space 3} .0640789
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1081042{col 26}{space 2}  .003397{col 37}{space 1}  -31.82{col 46}{space 3}0.000{col 54}{space 4}-.1147622{col 67}{space 3}-.1014463
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0967492{col 26}{space 2} .0035743{col 37}{space 1}  -27.07{col 46}{space 3}0.000{col 54}{space 4}-.1037547{col 67}{space 3}-.0897436
{txt}{space 12} {c |}
1.has_old~nr {c |}{col 14}{res}{space 2} .0193321{col 26}{space 2} .0026517{col 37}{space 1}    7.29{col 46}{space 3}0.000{col 54}{space 4} .0141349{col 67}{space 3} .0245294
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003168{col 26}{space 2} 5.63e-06{col 37}{space 1}  -56.27{col 46}{space 3}0.000{col 54}{space 4}-.0003278{col 67}{space 3}-.0003058
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0414404{col 26}{space 2} .0016355{col 37}{space 1}   25.34{col 46}{space 3}0.000{col 54}{space 4} .0382348{col 67}{space 3}  .044646
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1622035{col 26}{space 2} .0030271{col 37}{space 1}   53.58{col 46}{space 3}0.000{col 54}{space 4} .1562704{col 67}{space 3} .1681365
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0431263{col 26}{space 2} .0024564{col 37}{space 1}  -17.56{col 46}{space 3}0.000{col 54}{space 4}-.0479407{col 67}{space 3}-.0383119
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1100021{col 26}{space 2} .0046161{col 37}{space 1}  -23.83{col 46}{space 3}0.000{col 54}{space 4}-.1190496{col 67}{space 3}-.1009547
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0068797{col 26}{space 2} .0049335{col 37}{space 1}    1.39{col 46}{space 3}0.163{col 54}{space 4}-.0027899{col 67}{space 3} .0165493
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0176278{col 26}{space 2} .0020292{col 37}{space 1}   -8.69{col 46}{space 3}0.000{col 54}{space 4}-.0216049{col 67}{space 3}-.0136507
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0814211{col 26}{space 2} .0041696{col 37}{space 1}  -19.53{col 46}{space 3}0.000{col 54}{space 4}-.0895933{col 67}{space 3}-.0732489
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1722401{col 26}{space 2} .0040938{col 37}{space 1}  -42.07{col 46}{space 3}0.000{col 54}{space 4}-.1802638{col 67}{space 3}-.1642164
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3279033{col 26}{space 2} .0026824{col 37}{space 1}  122.24{col 46}{space 3}0.000{col 54}{space 4} .3226458{col 67}{space 3} .3331608
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3068137{col 26}{space 2} .0038245{col 37}{space 1}   80.22{col 46}{space 3}0.000{col 54}{space 4} .2993178{col 67}{space 3} .3143096
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2724531{col 26}{space 2} .0043422{col 37}{space 1}   62.75{col 46}{space 3}0.000{col 54}{space 4} .2639426{col 67}{space 3} .2809636
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1792367{col 26}{space 2} .0050476{col 37}{space 1}   35.51{col 46}{space 3}0.000{col 54}{space 4} .1693436{col 67}{space 3} .1891298
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1774109{col 26}{space 2} .0055641{col 37}{space 1}   31.89{col 46}{space 3}0.000{col 54}{space 4} .1665055{col 67}{space 3} .1883163
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0241173{col 26}{space 2} .0014136{col 37}{space 1}   17.06{col 46}{space 3}0.000{col 54}{space 4} .0213468{col 67}{space 3} .0268879
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0126019{col 26}{space 2} .0018497{col 37}{space 1}    6.81{col 46}{space 3}0.000{col 54}{space 4} .0089764{col 67}{space 3} .0162273
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0177105{col 26}{space 2} .0022391{col 37}{space 1}    7.91{col 46}{space 3}0.000{col 54}{space 4} .0133218{col 67}{space 3} .0220992
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0049217{col 26}{space 2} .0022217{col 37}{space 1}    2.22{col 46}{space 3}0.027{col 54}{space 4} .0005672{col 67}{space 3} .0092762
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0028563{col 26}{space 2} .0025119{col 37}{space 1}   -1.14{col 46}{space 3}0.256{col 54}{space 4}-.0077795{col 67}{space 3}  .002067
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0153006{col 26}{space 2} .0006487{col 37}{space 1}  -23.58{col 46}{space 3}0.000{col 54}{space 4}-.0165721{col 67}{space 3} -.014029
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0109753{col 26}{space 2} .0008972{col 37}{space 1}  -12.23{col 46}{space 3}0.000{col 54}{space 4}-.0127338{col 67}{space 3}-.0092168
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  -.01179{col 26}{space 2} .0009182{col 37}{space 1}  -12.84{col 46}{space 3}0.000{col 54}{space 4}-.0135896{col 67}{space 3}-.0099903
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0073496{col 26}{space 2} .0014632{col 37}{space 1}   -5.02{col 46}{space 3}0.000{col 54}{space 4}-.0102174{col 67}{space 3}-.0044818
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0052441{col 26}{space 2} .0017167{col 37}{space 1}   -3.05{col 46}{space 3}0.002{col 54}{space 4}-.0086088{col 67}{space 3}-.0018793
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4916933{col 26}{space 2}  .002656{col 37}{space 1}  185.13{col 46}{space 3}0.000{col 54}{space 4} .4864877{col 67}{space 3} .4968989
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .4919046{col 26}{space 2} .0040081{col 37}{space 1}  122.73{col 46}{space 3}0.000{col 54}{space 4} .4840489{col 67}{space 3} .4997603
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5385461{col 26}{space 2} .0044836{col 37}{space 1}  120.11{col 46}{space 3}0.000{col 54}{space 4} .5297584{col 67}{space 3} .5473338
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6624775{col 26}{space 2} .0051358{col 37}{space 1}  128.99{col 46}{space 3}0.000{col 54}{space 4} .6524114{col 67}{space 3} .6725436
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}  .653216{col 26}{space 2} .0055911{col 37}{space 1}  116.83{col 46}{space 3}0.000{col 54}{space 4} .6422576{col 67}{space 3} .6641744
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0240467{col 26}{space 2} .0017629{col 37}{space 1}   13.64{col 46}{space 3}0.000{col 54}{space 4} .0205915{col 67}{space 3} .0275019
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0094353{col 26}{space 2} .0022079{col 37}{space 1}    4.27{col 46}{space 3}0.000{col 54}{space 4} .0051078{col 67}{space 3} .0137628
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0041672{col 26}{space 2} .0027425{col 37}{space 1}    1.52{col 46}{space 3}0.129{col 54}{space 4} -.001208{col 67}{space 3} .0095424
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0739367{col 26}{space 2} .0021725{col 37}{space 1}   34.03{col 46}{space 3}0.000{col 54}{space 4} .0696787{col 67}{space 3} .0781947
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0799914{col 26}{space 2} .0024066{col 37}{space 1}   33.24{col 46}{space 3}0.000{col 54}{space 4} .0752746{col 67}{space 3} .0847082
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0236504{col 26}{space 2} .0007226{col 37}{space 1}  -32.73{col 46}{space 3}0.000{col 54}{space 4}-.0250666{col 67}{space 3}-.0222342
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0189936{col 26}{space 2} .0011398{col 37}{space 1}  -16.66{col 46}{space 3}0.000{col 54}{space 4}-.0212277{col 67}{space 3}-.0167595
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0229819{col 26}{space 2} .0012121{col 37}{space 1}  -18.96{col 46}{space 3}0.000{col 54}{space 4}-.0253577{col 67}{space 3}-.0206062
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0271274{col 26}{space 2} .0014633{col 37}{space 1}  -18.54{col 46}{space 3}0.000{col 54}{space 4}-.0299955{col 67}{space 3}-.0242593
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0249263{col 26}{space 2} .0016538{col 37}{space 1}  -15.07{col 46}{space 3}0.000{col 54}{space 4}-.0281676{col 67}{space 3}-.0216849
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.995444{col 26}{space 2} .0344486{col 37}{space 1}   57.93{col 46}{space 3}0.000{col 54}{space 4} 1.927926{col 67}{space 3} 2.062962
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1371{txt}, {res}449468{txt}) = {res}24.520{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.55551523 .17343052 .52774902 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0216994435   .6452709282          4527{txt}  {c |}
  2 {c |}  {res}.0180156647   .5216939503          3319{txt}  {c |}
  3 {c |}  {res}.0118163996    .370793979          2147{txt}  {c |}
  4 {c |}  {res}.0101793219   .3024514331          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0216994435{txt}  {c |}
  2 {c |}  {res}.0180156647{txt}  {c |}
  3 {c |}  {res}.0118163996{txt}  {c |}
  4 {c |}  {res}.0118163996{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   450,884
{txt}{hline 13}{c +}{hline 34}   F(83, 450800)   = {res} 10508.10
{txt}       Model {c |} {res} 262456.987        83  3162.13237   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 135656.256   450,800  .300923371   {txt}R-squared       ={res}    0.6593
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6592
{txt}       Total {c |} {res} 398113.243   450,883  .882963524   {txt}Root MSE        =   {res} .54856

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0147911{col 26}{space 2} .0035799{col 37}{space 1}   -4.13{col 46}{space 3}0.000{col 54}{space 4}-.0218076{col 67}{space 3}-.0077746
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0661633{col 26}{space 2} .0040074{col 37}{space 1}   16.51{col 46}{space 3}0.000{col 54}{space 4} .0583089{col 67}{space 3} .0740178
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  -.07823{col 26}{space 2} .0039978{col 37}{space 1}  -19.57{col 46}{space 3}0.000{col 54}{space 4}-.0860656{col 67}{space 3}-.0703945
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0757852{col 26}{space 2}  .004249{col 37}{space 1}  -17.84{col 46}{space 3}0.000{col 54}{space 4}-.0841131{col 67}{space 3}-.0674572
{txt}{space 12} {c |}
1.has_old~nr {c |}{col 14}{res}{space 2} .0166024{col 26}{space 2} .0027065{col 37}{space 1}    6.13{col 46}{space 3}0.000{col 54}{space 4} .0112976{col 67}{space 3} .0219071
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003224{col 26}{space 2} 5.76e-06{col 37}{space 1}  -55.98{col 46}{space 3}0.000{col 54}{space 4}-.0003337{col 67}{space 3}-.0003111
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}  .042149{col 26}{space 2} .0016733{col 37}{space 1}   25.19{col 46}{space 3}0.000{col 54}{space 4} .0388694{col 67}{space 3} .0454287
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}  .160653{col 26}{space 2}  .003093{col 37}{space 1}   51.94{col 46}{space 3}0.000{col 54}{space 4} .1545908{col 67}{space 3} .1667151
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0442853{col 26}{space 2} .0025101{col 37}{space 1}  -17.64{col 46}{space 3}0.000{col 54}{space 4} -.049205{col 67}{space 3}-.0393656
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1111807{col 26}{space 2} .0047143{col 37}{space 1}  -23.58{col 46}{space 3}0.000{col 54}{space 4}-.1204205{col 67}{space 3}-.1019408
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0078791{col 26}{space 2} .0050389{col 37}{space 1}    1.56{col 46}{space 3}0.118{col 54}{space 4}-.0019969{col 67}{space 3} .0177551
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0174004{col 26}{space 2} .0020902{col 37}{space 1}   -8.32{col 46}{space 3}0.000{col 54}{space 4}-.0214971{col 67}{space 3}-.0133037
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2} -.083768{col 26}{space 2} .0042528{col 37}{space 1}  -19.70{col 46}{space 3}0.000{col 54}{space 4}-.0921033{col 67}{space 3}-.0754327
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1594233{col 26}{space 2} .0041823{col 37}{space 1}  -38.12{col 46}{space 3}0.000{col 54}{space 4}-.1676204{col 67}{space 3}-.1512262
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3217575{col 26}{space 2} .0027801{col 37}{space 1}  115.74{col 46}{space 3}0.000{col 54}{space 4} .3163086{col 67}{space 3} .3272064
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3004851{col 26}{space 2} .0039824{col 37}{space 1}   75.45{col 46}{space 3}0.000{col 54}{space 4} .2926796{col 67}{space 3} .3082905
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2641628{col 26}{space 2} .0045376{col 37}{space 1}   58.22{col 46}{space 3}0.000{col 54}{space 4} .2552694{col 67}{space 3} .2730563
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .185799{col 26}{space 2} .0052082{col 37}{space 1}   35.67{col 46}{space 3}0.000{col 54}{space 4} .1755911{col 67}{space 3} .1960069
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1800574{col 26}{space 2}  .005732{col 37}{space 1}   31.41{col 46}{space 3}0.000{col 54}{space 4} .1688229{col 67}{space 3}  .191292
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0228665{col 26}{space 2}  .001449{col 37}{space 1}   15.78{col 46}{space 3}0.000{col 54}{space 4} .0200266{col 67}{space 3} .0257064
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0129144{col 26}{space 2} .0018984{col 37}{space 1}    6.80{col 46}{space 3}0.000{col 54}{space 4} .0091936{col 67}{space 3} .0166353
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0170598{col 26}{space 2} .0022987{col 37}{space 1}    7.42{col 46}{space 3}0.000{col 54}{space 4} .0125545{col 67}{space 3} .0215651
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0028053{col 26}{space 2} .0022772{col 37}{space 1}    1.23{col 46}{space 3}0.218{col 54}{space 4}-.0016579{col 67}{space 3} .0072684
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0048761{col 26}{space 2}  .002575{col 37}{space 1}   -1.89{col 46}{space 3}0.058{col 54}{space 4} -.009923{col 67}{space 3} .0001707
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0150531{col 26}{space 2} .0006643{col 37}{space 1}  -22.66{col 46}{space 3}0.000{col 54}{space 4}-.0163552{col 67}{space 3} -.013751
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106644{col 26}{space 2} .0009188{col 37}{space 1}  -11.61{col 46}{space 3}0.000{col 54}{space 4}-.0124652{col 67}{space 3}-.0088636
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0114694{col 26}{space 2} .0009416{col 37}{space 1}  -12.18{col 46}{space 3}0.000{col 54}{space 4} -.013315{col 67}{space 3}-.0096239
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0073889{col 26}{space 2} .0014979{col 37}{space 1}   -4.93{col 46}{space 3}0.000{col 54}{space 4}-.0103247{col 67}{space 3}-.0044531
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0056394{col 26}{space 2}  .001757{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-.0090831{col 67}{space 3}-.0021957
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4891591{col 26}{space 2}  .002738{col 37}{space 1}  178.66{col 46}{space 3}0.000{col 54}{space 4} .4837928{col 67}{space 3} .4945254
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .4941093{col 26}{space 2} .0041319{col 37}{space 1}  119.58{col 46}{space 3}0.000{col 54}{space 4} .4860108{col 67}{space 3} .5022077
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5409615{col 26}{space 2} .0046308{col 37}{space 1}  116.82{col 46}{space 3}0.000{col 54}{space 4} .5318852{col 67}{space 3} .5500379
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6811662{col 26}{space 2} .0053251{col 37}{space 1}  127.92{col 46}{space 3}0.000{col 54}{space 4} .6707292{col 67}{space 3} .6916032
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .6791839{col 26}{space 2} .0058051{col 37}{space 1}  117.00{col 46}{space 3}0.000{col 54}{space 4}  .667806{col 67}{space 3} .6905618
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0226872{col 26}{space 2} .0018058{col 37}{space 1}   12.56{col 46}{space 3}0.000{col 54}{space 4}  .019148{col 67}{space 3} .0262265
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}   .01037{col 26}{space 2} .0022623{col 37}{space 1}    4.58{col 46}{space 3}0.000{col 54}{space 4}  .005936{col 67}{space 3}  .014804
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0042986{col 26}{space 2} .0028092{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4}-.0012074{col 67}{space 3} .0098047
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .080337{col 26}{space 2} .0022458{col 37}{space 1}   35.77{col 46}{space 3}0.000{col 54}{space 4} .0759354{col 67}{space 3} .0847387
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0871524{col 26}{space 2} .0024841{col 37}{space 1}   35.08{col 46}{space 3}0.000{col 54}{space 4} .0822836{col 67}{space 3} .0920211
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0234024{col 26}{space 2} .0007397{col 37}{space 1}  -31.64{col 46}{space 3}0.000{col 54}{space 4}-.0248522{col 67}{space 3}-.0219525
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0193763{col 26}{space 2} .0011669{col 37}{space 1}  -16.60{col 46}{space 3}0.000{col 54}{space 4}-.0216634{col 67}{space 3}-.0170892
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0233127{col 26}{space 2} .0012418{col 37}{space 1}  -18.77{col 46}{space 3}0.000{col 54}{space 4}-.0257466{col 67}{space 3}-.0208788
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0262897{col 26}{space 2} .0015051{col 37}{space 1}  -17.47{col 46}{space 3}0.000{col 54}{space 4}-.0292396{col 67}{space 3}-.0233397
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0251601{col 26}{space 2}    .0017{col 37}{space 1}  -14.80{col 46}{space 3}0.000{col 54}{space 4}-.0284919{col 67}{space 3}-.0218282
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2}-.0005554{col 26}{space 2} .0000266{col 37}{space 1}  -20.85{col 46}{space 3}0.000{col 54}{space 4}-.0006077{col 67}{space 3}-.0005032
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2} .1402849{col 26}{space 2} .0235735{col 37}{space 1}    5.95{col 46}{space 3}0.000{col 54}{space 4} .0940816{col 67}{space 3} .1864882
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2} .1655059{col 26}{space 2} .0084531{col 37}{space 1}   19.58{col 46}{space 3}0.000{col 54}{space 4} .1489381{col 67}{space 3} .1820738
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2}  .061178{col 26}{space 2} .0077794{col 37}{space 1}    7.86{col 46}{space 3}0.000{col 54}{space 4} .0459306{col 67}{space 3} .0764255
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2}-.4095269{col 26}{space 2} .0153014{col 37}{space 1}  -26.76{col 46}{space 3}0.000{col 54}{space 4}-.4395171{col 67}{space 3}-.3795366
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2} .1518653{col 26}{space 2} .0307383{col 37}{space 1}    4.94{col 46}{space 3}0.000{col 54}{space 4} .0916191{col 67}{space 3} .2121115
{txt}peer_econ_~e {c |}{col 14}{res}{space 2}-.0421225{col 26}{space 2} .0078302{col 37}{space 1}   -5.38{col 46}{space 3}0.000{col 54}{space 4}-.0574695{col 67}{space 3}-.0267755
{txt}peer_limit~f {c |}{col 14}{res}{space 2} -.101538{col 26}{space 2} .0170488{col 37}{space 1}   -5.96{col 46}{space 3}0.000{col 54}{space 4}-.1349531{col 67}{space 3}-.0681229
{txt}peer_disab~d {c |}{col 14}{res}{space 2}-.1506883{col 26}{space 2} .0283529{col 37}{space 1}   -5.31{col 46}{space 3}0.000{col 54}{space 4} -.206259{col 67}{space 3}-.0951176
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .2703056{col 26}{space 2} .0129558{col 37}{space 1}   20.86{col 46}{space 3}0.000{col 54}{space 4} .2449127{col 67}{space 3} .2956986
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .2823625{col 26}{space 2} .0177616{col 37}{space 1}   15.90{col 46}{space 3}0.000{col 54}{space 4} .2475503{col 67}{space 3} .3171748
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3224759{col 26}{space 2} .0213967{col 37}{space 1}   15.07{col 46}{space 3}0.000{col 54}{space 4}  .280539{col 67}{space 3} .3644129
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  -.13031{col 26}{space 2} .0253229{col 37}{space 1}   -5.15{col 46}{space 3}0.000{col 54}{space 4}-.1799422{col 67}{space 3}-.0806778
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0994517{col 26}{space 2} .0263824{col 37}{space 1}   -3.77{col 46}{space 3}0.000{col 54}{space 4}-.1511603{col 67}{space 3}-.0477431
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0491919{col 26}{space 2} .0154912{col 37}{space 1}   -3.18{col 46}{space 3}0.001{col 54}{space 4}-.0795542{col 67}{space 3}-.0188295
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0038728{col 26}{space 2} .0205677{col 37}{space 1}   -0.19{col 46}{space 3}0.851{col 54}{space 4} -.044185{col 67}{space 3} .0364393
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .063361{col 26}{space 2} .0279284{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} .0086221{col 67}{space 3} .1180999
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1283637{col 26}{space 2} .0306452{col 37}{space 1}    4.19{col 46}{space 3}0.000{col 54}{space 4}    .0683{col 67}{space 3} .1884274
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1434448{col 26}{space 2} .0328693{col 37}{space 1}    4.36{col 46}{space 3}0.000{col 54}{space 4} .0790221{col 67}{space 3} .2078676
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1031666{col 26}{space 2} .0172401{col 37}{space 1}    5.98{col 46}{space 3}0.000{col 54}{space 4} .0693766{col 67}{space 3} .1369567
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1136701{col 26}{space 2}  .026548{col 37}{space 1}    4.28{col 46}{space 3}0.000{col 54}{space 4} .0616369{col 67}{space 3} .1657034
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .043383{col 26}{space 2} .0279837{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4}-.0114642{col 67}{space 3} .0982301
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1718704{col 26}{space 2} .0344685{col 37}{space 1}    4.99{col 46}{space 3}0.000{col 54}{space 4} .1043131{col 67}{space 3} .2394277
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2559996{col 26}{space 2} .0349501{col 37}{space 1}    7.32{col 46}{space 3}0.000{col 54}{space 4} .1874985{col 67}{space 3} .3245007
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1842062{col 26}{space 2} .0118908{col 37}{space 1}  -15.49{col 46}{space 3}0.000{col 54}{space 4}-.2075118{col 67}{space 3}-.1609006
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1866691{col 26}{space 2} .0174364{col 37}{space 1}  -10.71{col 46}{space 3}0.000{col 54}{space 4}-.2208439{col 67}{space 3}-.1524943
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.2603223{col 26}{space 2} .0207096{col 37}{space 1}  -12.57{col 46}{space 3}0.000{col 54}{space 4}-.3009126{col 67}{space 3}-.2197321
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0368224{col 26}{space 2} .0229093{col 37}{space 1}    1.61{col 46}{space 3}0.108{col 54}{space 4}-.0080791{col 67}{space 3} .0817239
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.017828{col 26}{space 2} .0231594{col 37}{space 1}   -0.77{col 46}{space 3}0.441{col 54}{space 4}-.0632197{col 67}{space 3} .0275637
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1668876{col 26}{space 2} .0176983{col 37}{space 1}    9.43{col 46}{space 3}0.000{col 54}{space 4} .1321995{col 67}{space 3} .2015756
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0455166{col 26}{space 2} .0233453{col 37}{space 1}    1.95{col 46}{space 3}0.051{col 54}{space 4}-.0002395{col 67}{space 3} .0912727
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0006389{col 26}{space 2} .0318169{col 37}{space 1}   -0.02{col 46}{space 3}0.984{col 54}{space 4}-.0629991{col 67}{space 3} .0617212
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1516298{col 26}{space 2} .0295738{col 37}{space 1}   -5.13{col 46}{space 3}0.000{col 54}{space 4}-.2095935{col 67}{space 3}-.0936661
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0928316{col 26}{space 2} .0307166{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-.1530352{col 67}{space 3} -.032628
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0884473{col 26}{space 2} .0124547{col 37}{space 1}   -7.10{col 46}{space 3}0.000{col 54}{space 4}-.1128581{col 67}{space 3}-.0640365
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.060084{col 26}{space 2} .0242916{col 37}{space 1}   -2.47{col 46}{space 3}0.013{col 54}{space 4}-.1076948{col 67}{space 3}-.0124733
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0301305{col 26}{space 2} .0223687{col 37}{space 1}   -1.35{col 46}{space 3}0.178{col 54}{space 4}-.0739724{col 67}{space 3} .0137115
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.039633{col 26}{space 2} .0230523{col 37}{space 1}   -1.72{col 46}{space 3}0.086{col 54}{space 4}-.0848148{col 67}{space 3} .0055487
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1025127{col 26}{space 2} .0215861{col 37}{space 1}   -4.75{col 46}{space 3}0.000{col 54}{space 4}-.1448209{col 67}{space 3}-.0602046
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.338894{col 26}{space 2} .1638004{col 37}{space 1}   32.59{col 46}{space 3}0.000{col 54}{space 4}  5.01785{col 67}{space 3} 5.659938
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.54856483 .15039806 .52754506 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0148091446   .5526876359          4527{txt}  {c |}
  2 {c |}  {res}.0115948975   .4222169235          3319{txt}  {c |}
  3 {c |}  {res}.0084915192   .3145781845          2147{txt}  {c |}
  4 {c |}  {res}.0074303147   .2623238818          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0148091446{txt}  {c |}
  2 {c |}  {res}.0115948975{txt}  {c |}
  3 {c |}  {res}.0084915192{txt}  {c |}
  4 {c |}  {res}.0084915192{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:450,884}
{txt}{col 1}Absorbed variable: {res:school_id}{col 52}{lalign 17:No. of categories}{col 69} = {res}{ralign 7:1,372}
{txt}{col 52}{lalign 17:F({res:83}, {res:449429})}{col 69} = {res}{ralign 7:8096.50}
{txt}{col 52}{lalign 17:Prob > F}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 52}{lalign 17:R-squared}{col 69} = {res}{ralign 7:0.6786}
{txt}{col 52}{lalign 17:Adj R-squared}{col 69} = {res}{ralign 7:0.6776}
{txt}{col 52}{lalign 17:Root MSE}{col 69} = {res}{ralign 7:0.5335}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0126874{col 26}{space 2} .0036042{col 37}{space 1}   -3.52{col 46}{space 3}0.000{col 54}{space 4}-.0197515{col 67}{space 3}-.0056234
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0632081{col 26}{space 2} .0041086{col 37}{space 1}   15.38{col 46}{space 3}0.000{col 54}{space 4} .0551553{col 67}{space 3} .0712609
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0806679{col 26}{space 2} .0042084{col 37}{space 1}  -19.17{col 46}{space 3}0.000{col 54}{space 4}-.0889161{col 67}{space 3}-.0724196
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0711032{col 26}{space 2} .0045881{col 37}{space 1}  -15.50{col 46}{space 3}0.000{col 54}{space 4}-.0800957{col 67}{space 3}-.0621107
{txt}{space 12} {c |}
1.has_old~nr {c |}{col 14}{res}{space 2} .0185816{col 26}{space 2} .0026439{col 37}{space 1}    7.03{col 46}{space 3}0.000{col 54}{space 4} .0133996{col 67}{space 3} .0237635
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003149{col 26}{space 2} 5.62e-06{col 37}{space 1}  -56.02{col 46}{space 3}0.000{col 54}{space 4}-.0003259{col 67}{space 3}-.0003039
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0411906{col 26}{space 2} .0016309{col 37}{space 1}   25.26{col 46}{space 3}0.000{col 54}{space 4} .0379941{col 67}{space 3}  .044387
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1608827{col 26}{space 2} .0030185{col 37}{space 1}   53.30{col 46}{space 3}0.000{col 54}{space 4} .1549666{col 67}{space 3} .1667989
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0426077{col 26}{space 2} .0024504{col 37}{space 1}  -17.39{col 46}{space 3}0.000{col 54}{space 4}-.0474105{col 67}{space 3}-.0378049
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1087696{col 26}{space 2} .0046028{col 37}{space 1}  -23.63{col 46}{space 3}0.000{col 54}{space 4}-.1177909{col 67}{space 3}-.0997483
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0075455{col 26}{space 2} .0049208{col 37}{space 1}    1.53{col 46}{space 3}0.125{col 54}{space 4}-.0020991{col 67}{space 3} .0171901
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2} -.017449{col 26}{space 2} .0020378{col 37}{space 1}   -8.56{col 46}{space 3}0.000{col 54}{space 4}-.0214431{col 67}{space 3}-.0134549
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0803117{col 26}{space 2} .0041614{col 37}{space 1}  -19.30{col 46}{space 3}0.000{col 54}{space 4} -.088468{col 67}{space 3}-.0721555
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1652449{col 26}{space 2} .0040856{col 37}{space 1}  -40.45{col 46}{space 3}0.000{col 54}{space 4}-.1732526{col 67}{space 3}-.1572372
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3200413{col 26}{space 2} .0027082{col 37}{space 1}  118.18{col 46}{space 3}0.000{col 54}{space 4} .3147334{col 67}{space 3} .3253492
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .2995222{col 26}{space 2} .0038818{col 37}{space 1}   77.16{col 46}{space 3}0.000{col 54}{space 4} .2919139{col 67}{space 3} .3071304
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2628314{col 26}{space 2} .0044208{col 37}{space 1}   59.45{col 46}{space 3}0.000{col 54}{space 4} .2541669{col 67}{space 3}  .271496
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1858052{col 26}{space 2}  .005074{col 37}{space 1}   36.62{col 46}{space 3}0.000{col 54}{space 4} .1758602{col 67}{space 3} .1957501
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1822543{col 26}{space 2} .0055857{col 37}{space 1}   32.63{col 46}{space 3}0.000{col 54}{space 4} .1713065{col 67}{space 3} .1932021
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0226211{col 26}{space 2} .0014127{col 37}{space 1}   16.01{col 46}{space 3}0.000{col 54}{space 4} .0198523{col 67}{space 3} .0253899
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0117882{col 26}{space 2} .0018514{col 37}{space 1}    6.37{col 46}{space 3}0.000{col 54}{space 4} .0081595{col 67}{space 3} .0154169
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0169359{col 26}{space 2} .0022406{col 37}{space 1}    7.56{col 46}{space 3}0.000{col 54}{space 4} .0125444{col 67}{space 3} .0213274
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0039395{col 26}{space 2} .0022193{col 37}{space 1}    1.78{col 46}{space 3}0.076{col 54}{space 4}-.0004103{col 67}{space 3} .0082892
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.004837{col 26}{space 2} .0025097{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-.0097559{col 67}{space 3}  .000082
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0148241{col 26}{space 2} .0006473{col 37}{space 1}  -22.90{col 46}{space 3}0.000{col 54}{space 4}-.0160928{col 67}{space 3}-.0135554
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.010601{col 26}{space 2} .0008954{col 37}{space 1}  -11.84{col 46}{space 3}0.000{col 54}{space 4}-.0123559{col 67}{space 3}-.0088461
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0112927{col 26}{space 2} .0009173{col 37}{space 1}  -12.31{col 46}{space 3}0.000{col 54}{space 4}-.0130907{col 67}{space 3}-.0094948
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0076331{col 26}{space 2} .0014593{col 37}{space 1}   -5.23{col 46}{space 3}0.000{col 54}{space 4}-.0104933{col 67}{space 3}-.0047729
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0058013{col 26}{space 2}  .001712{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4}-.0091567{col 67}{space 3}-.0024459
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .489279{col 26}{space 2} .0026672{col 37}{space 1}  183.44{col 46}{space 3}0.000{col 54}{space 4} .4840514{col 67}{space 3} .4945066
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .4934475{col 26}{space 2} .0040266{col 37}{space 1}  122.55{col 46}{space 3}0.000{col 54}{space 4} .4855556{col 67}{space 3} .5013395
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5408918{col 26}{space 2} .0045111{col 37}{space 1}  119.90{col 46}{space 3}0.000{col 54}{space 4} .5320502{col 67}{space 3} .5497333
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6818615{col 26}{space 2} .0051883{col 37}{space 1}  131.42{col 46}{space 3}0.000{col 54}{space 4} .6716925{col 67}{space 3} .6920304
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .6771403{col 26}{space 2} .0056565{col 37}{space 1}  119.71{col 46}{space 3}0.000{col 54}{space 4} .6660539{col 67}{space 3} .6882268
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0233131{col 26}{space 2} .0017604{col 37}{space 1}   13.24{col 46}{space 3}0.000{col 54}{space 4} .0198627{col 67}{space 3} .0267636
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0089266{col 26}{space 2} .0022056{col 37}{space 1}    4.05{col 46}{space 3}0.000{col 54}{space 4} .0046036{col 67}{space 3} .0132496
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0040484{col 26}{space 2} .0027379{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-.0013177{col 67}{space 3} .0094145
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0805404{col 26}{space 2} .0021886{col 37}{space 1}   36.80{col 46}{space 3}0.000{col 54}{space 4} .0762508{col 67}{space 3}   .08483
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0869689{col 26}{space 2} .0024214{col 37}{space 1}   35.92{col 46}{space 3}0.000{col 54}{space 4} .0822232{col 67}{space 3} .0917147
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.023623{col 26}{space 2} .0007209{col 37}{space 1}  -32.77{col 46}{space 3}0.000{col 54}{space 4}-.0250358{col 67}{space 3}-.0222101
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0189977{col 26}{space 2} .0011371{col 37}{space 1}  -16.71{col 46}{space 3}0.000{col 54}{space 4}-.0212264{col 67}{space 3} -.016769
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0232064{col 26}{space 2} .0012098{col 37}{space 1}  -19.18{col 46}{space 3}0.000{col 54}{space 4}-.0255775{col 67}{space 3}-.0208353
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0265826{col 26}{space 2} .0014666{col 37}{space 1}  -18.13{col 46}{space 3}0.000{col 54}{space 4}-.0294571{col 67}{space 3}-.0237081
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.024835{col 26}{space 2} .0016565{col 37}{space 1}  -14.99{col 46}{space 3}0.000{col 54}{space 4}-.0280816{col 67}{space 3}-.0215884
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2}-.0000175{col 26}{space 2} .0000541{col 37}{space 1}   -0.32{col 46}{space 3}0.746{col 54}{space 4}-.0001236{col 67}{space 3} .0000886
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2}-.2198814{col 26}{space 2} .0336038{col 37}{space 1}   -6.54{col 46}{space 3}0.000{col 54}{space 4}-.2857437{col 67}{space 3} -.154019
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2}-.0501897{col 26}{space 2} .0546991{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-.1573982{col 67}{space 3} .0570188
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2}-.2099541{col 26}{space 2} .0405371{col 37}{space 1}   -5.18{col 46}{space 3}0.000{col 54}{space 4}-.2894056{col 67}{space 3}-.1305026
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2}-.2157772{col 26}{space 2} .0771503{col 37}{space 1}   -2.80{col 46}{space 3}0.005{col 54}{space 4}-.3669895{col 67}{space 3}-.0645649
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2} .1321354{col 26}{space 2} .0540839{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} .0261326{col 67}{space 3} .2381381
{txt}peer_econ_~e {c |}{col 14}{res}{space 2} .0362705{col 26}{space 2} .0148657{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} .0071342{col 67}{space 3} .0654067
{txt}peer_limit~f {c |}{col 14}{res}{space 2}-.1517106{col 26}{space 2} .0405094{col 37}{space 1}   -3.75{col 46}{space 3}0.000{col 54}{space 4}-.2311078{col 67}{space 3}-.0723135
{txt}peer_disab~d {c |}{col 14}{res}{space 2}-.3215633{col 26}{space 2} .0507228{col 37}{space 1}   -6.34{col 46}{space 3}0.000{col 54}{space 4}-.4209784{col 67}{space 3}-.2221481
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0064235{col 26}{space 2} .0202061{col 37}{space 1}   -0.32{col 46}{space 3}0.751{col 54}{space 4}-.0460268{col 67}{space 3} .0331799
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0502713{col 26}{space 2} .0233161{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0045724{col 67}{space 3} .0959702
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0389609{col 26}{space 2} .0254889{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4}-.0109967{col 67}{space 3} .0889184
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0528014{col 26}{space 2} .0288715{col 37}{space 1}   -1.83{col 46}{space 3}0.067{col 54}{space 4}-.1093886{col 67}{space 3} .0037859
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0272552{col 26}{space 2} .0296633{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-.0853943{col 67}{space 3} .0308838
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0799843{col 26}{space 2}  .023629{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4}-.1262964{col 67}{space 3}-.0336721
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0625061{col 26}{space 2} .0273184{col 37}{space 1}   -2.29{col 46}{space 3}0.022{col 54}{space 4}-.1160493{col 67}{space 3}-.0089629
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0811977{col 26}{space 2} .0322607{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-.1444277{col 67}{space 3}-.0179677
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0359136{col 26}{space 2}  .034309{col 37}{space 1}    1.05{col 46}{space 3}0.295{col 54}{space 4} -.031331{col 67}{space 3} .1031582
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}   .14928{col 26}{space 2} .0364447{col 37}{space 1}    4.10{col 46}{space 3}0.000{col 54}{space 4} .0778496{col 67}{space 3} .2207104
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0471223{col 26}{space 2} .0261123{col 37}{space 1}    1.80{col 46}{space 3}0.071{col 54}{space 4}-.0040569{col 67}{space 3} .0983016
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0244915{col 26}{space 2} .0355051{col 37}{space 1}    0.69{col 46}{space 3}0.490{col 54}{space 4}-.0450973{col 67}{space 3} .0940803
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0673054{col 26}{space 2} .0330586{col 37}{space 1}    2.04{col 46}{space 3}0.042{col 54}{space 4} .0025115{col 67}{space 3} .1320993
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1027709{col 26}{space 2} .0387915{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4} .0267407{col 67}{space 3} .1788011
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1719167{col 26}{space 2} .0399156{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0936833{col 67}{space 3} .2501502
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.2276639{col 26}{space 2} .0170377{col 37}{space 1}  -13.36{col 46}{space 3}0.000{col 54}{space 4}-.2610572{col 67}{space 3}-.1942706
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.3045181{col 26}{space 2} .0211836{col 37}{space 1}  -14.38{col 46}{space 3}0.000{col 54}{space 4}-.3460372{col 67}{space 3} -.262999
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.302088{col 26}{space 2}  .023202{col 37}{space 1}  -13.02{col 46}{space 3}0.000{col 54}{space 4}-.3475631{col 67}{space 3}-.2566129
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.349347{col 26}{space 2} .0256131{col 37}{space 1}  -13.64{col 46}{space 3}0.000{col 54}{space 4}-.3995479{col 67}{space 3}-.2991461
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.3864911{col 26}{space 2} .0258189{col 37}{space 1}  -14.97{col 46}{space 3}0.000{col 54}{space 4}-.4370953{col 67}{space 3} -.335887
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0317939{col 26}{space 2} .0249709{col 37}{space 1}    1.27{col 46}{space 3}0.203{col 54}{space 4}-.0171483{col 67}{space 3} .0807362
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0056129{col 26}{space 2} .0289745{col 37}{space 1}   -0.19{col 46}{space 3}0.846{col 54}{space 4} -.062402{col 67}{space 3} .0511762
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0088419{col 26}{space 2}  .035431{col 37}{space 1}    0.25{col 46}{space 3}0.803{col 54}{space 4}-.0606017{col 67}{space 3} .0782855
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1769912{col 26}{space 2} .0328138{col 37}{space 1}   -5.39{col 46}{space 3}0.000{col 54}{space 4}-.2413052{col 67}{space 3}-.1126772
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.2250652{col 26}{space 2} .0341627{col 37}{space 1}   -6.59{col 46}{space 3}0.000{col 54}{space 4}-.2920231{col 67}{space 3}-.1581072
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0005026{col 26}{space 2} .0199008{col 37}{space 1}   -0.03{col 46}{space 3}0.980{col 54}{space 4}-.0395076{col 67}{space 3} .0385024
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0168658{col 26}{space 2} .0305484{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4} -.043008{col 67}{space 3} .0767397
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0014844{col 26}{space 2}  .026311{col 37}{space 1}   -0.06{col 46}{space 3}0.955{col 54}{space 4}-.0530531{col 67}{space 3} .0500843
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0411376{col 26}{space 2} .0279838{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.0137098{col 67}{space 3}  .095985
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0031482{col 26}{space 2} .0273021{col 37}{space 1}    0.12{col 46}{space 3}0.908{col 54}{space 4}-.0503631{col 67}{space 3} .0566596
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.379982{col 26}{space 2} .3330718{col 37}{space 1}    7.15{col 46}{space 3}0.000{col 54}{space 4} 1.727171{col 67}{space 3} 3.032792
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1371{txt}, {res}449429{txt}) = {res}19.781{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.56684317 .20737249 .52754889 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}  .03512598   .7597927101          4527{txt}  {c |}
  2 {c |}  {res}.0321918292    .690219516          3319{txt}  {c |}
  3 {c |}  {res}.0293265028   .6405043736          2147{txt}  {c |}
  4 {c |}  {res}.0285959204   .5989474126          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}  .03512598{txt}  {c |}
  2 {c |}  {res}.0321918292{txt}  {c |}
  3 {c |}  {res}.0293265028{txt}  {c |}
  4 {c |}  {res}.0293265028{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   449,911
                                                {txt}F(1, 1287)        =  {res}  2423.83
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0463
                                                {txt}Root MSE          =    {res} .54083

{txt}{ralign 78:(Std. err. adjusted for {res:1,288} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~_r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~h {c |}{col 14}{res}{space 2} 1.007242{col 26}{space 2} .0204589{col 37}{space 1}   49.23{col 46}{space 3}0.000{col 54}{space 4} .9671052{col 67}{space 3} 1.047378
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0012504{col 26}{space 2} .0014724{col 37}{space 1}    0.85{col 46}{space 3}0.396{col 54}{space 4}-.0016382{col 67}{space 3}  .004139
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling_enr.ster} saved

Linear regression                               Number of obs     = {res}   449,911
                                                {txt}F(1, 1287)        =  {res}  2566.92
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0344
                                                {txt}Root MSE          =    {res} .53888

{txt}{ralign 78:(Std. err. adjusted for {res:1,288} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~er{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2}  1.02571{col 26}{space 2}  .020245{col 37}{space 1}   50.66{col 46}{space 3}0.000{col 54}{space 4} .9859934{col 67}{space 3} 1.065427
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0034897{col 26}{space 2} .0014053{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .0007328{col 67}{space 3} .0062466
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_peer_sibling_enr.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_math_sibling_enr.dta{rm}
saved
{p_end}
(CST/SBAC Student Test Score Samples)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   450,884
{txt}{hline 13}{c +}{hline 34}   F(44, 450839)   = {res} 19238.34
{txt}       Model {c |} {res} 259763.284        44    5903.711   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 138349.959   450,839  .306872207   {txt}R-squared       ={res}    0.6525
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6525
{txt}       Total {c |} {res} 398113.243   450,883  .882963524   {txt}Root MSE        =   {res} .55396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0289201{col 26}{space 2} .0032238{col 37}{space 1}   -8.97{col 46}{space 3}0.000{col 54}{space 4}-.0352386{col 67}{space 3}-.0226016
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0647858{col 26}{space 2}  .003537{col 37}{space 1}   18.32{col 46}{space 3}0.000{col 54}{space 4} .0578534{col 67}{space 3} .0717181
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0989695{col 26}{space 2} .0034634{col 37}{space 1}  -28.58{col 46}{space 3}0.000{col 54}{space 4}-.1057576{col 67}{space 3}-.0921814
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0881239{col 26}{space 2} .0036457{col 37}{space 1}  -24.17{col 46}{space 3}0.000{col 54}{space 4}-.0952694{col 67}{space 3}-.0809785
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0237227{col 26}{space 2} .0034171{col 37}{space 1}   -6.94{col 46}{space 3}0.000{col 54}{space 4}-.0304201{col 67}{space 3}-.0170252
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003459{col 26}{space 2} 5.76e-06{col 37}{space 1}  -60.07{col 46}{space 3}0.000{col 54}{space 4}-.0003572{col 67}{space 3}-.0003346
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0451525{col 26}{space 2} .0016877{col 37}{space 1}   26.75{col 46}{space 3}0.000{col 54}{space 4} .0418446{col 67}{space 3} .0484604
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}  .190601{col 26}{space 2} .0028027{col 37}{space 1}   68.01{col 46}{space 3}0.000{col 54}{space 4} .1851078{col 67}{space 3} .1960943
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0590866{col 26}{space 2} .0023071{col 37}{space 1}  -25.61{col 46}{space 3}0.000{col 54}{space 4}-.0636085{col 67}{space 3}-.0545648
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1617654{col 26}{space 2} .0045613{col 37}{space 1}  -35.46{col 46}{space 3}0.000{col 54}{space 4}-.1707054{col 67}{space 3}-.1528254
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0084862{col 26}{space 2} .0050388{col 37}{space 1}    1.68{col 46}{space 3}0.092{col 54}{space 4}-.0013897{col 67}{space 3} .0183622
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0537073{col 26}{space 2}  .001947{col 37}{space 1}  -27.58{col 46}{space 3}0.000{col 54}{space 4}-.0575233{col 67}{space 3}-.0498913
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0847413{col 26}{space 2} .0042436{col 37}{space 1}  -19.97{col 46}{space 3}0.000{col 54}{space 4}-.0930586{col 67}{space 3}-.0764239
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1465362{col 26}{space 2} .0041988{col 37}{space 1}  -34.90{col 46}{space 3}0.000{col 54}{space 4}-.1547657{col 67}{space 3}-.1383068
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3477859{col 26}{space 2} .0027534{col 37}{space 1}  126.31{col 46}{space 3}0.000{col 54}{space 4} .3423893{col 67}{space 3} .3531825
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3275551{col 26}{space 2} .0039333{col 37}{space 1}   83.28{col 46}{space 3}0.000{col 54}{space 4} .3198458{col 67}{space 3} .3352643
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2873046{col 26}{space 2} .0044762{col 37}{space 1}   64.19{col 46}{space 3}0.000{col 54}{space 4} .2785315{col 67}{space 3} .2960778
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1799708{col 26}{space 2} .0052065{col 37}{space 1}   34.57{col 46}{space 3}0.000{col 54}{space 4} .1697662{col 67}{space 3} .1901754
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1761969{col 26}{space 2} .0057395{col 37}{space 1}   30.70{col 46}{space 3}0.000{col 54}{space 4} .1649476{col 67}{space 3} .1874462
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0243975{col 26}{space 2} .0014568{col 37}{space 1}   16.75{col 46}{space 3}0.000{col 54}{space 4} .0215423{col 67}{space 3} .0272528
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0125855{col 26}{space 2} .0019056{col 37}{space 1}    6.60{col 46}{space 3}0.000{col 54}{space 4} .0088506{col 67}{space 3} .0163203
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0184292{col 26}{space 2}  .002311{col 37}{space 1}    7.97{col 46}{space 3}0.000{col 54}{space 4} .0138998{col 67}{space 3} .0229587
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0026874{col 26}{space 2}  .002294{col 37}{space 1}    1.17{col 46}{space 3}0.241{col 54}{space 4}-.0018088{col 67}{space 3} .0071836
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0052899{col 26}{space 2} .0025934{col 37}{space 1}   -2.04{col 46}{space 3}0.041{col 54}{space 4}-.0103728{col 67}{space 3} -.000207
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0157659{col 26}{space 2} .0006701{col 37}{space 1}  -23.53{col 46}{space 3}0.000{col 54}{space 4}-.0170792{col 67}{space 3}-.0144526
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0110098{col 26}{space 2} .0009266{col 37}{space 1}  -11.88{col 46}{space 3}0.000{col 54}{space 4}-.0128259{col 67}{space 3}-.0091937
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0120842{col 26}{space 2} .0009487{col 37}{space 1}  -12.74{col 46}{space 3}0.000{col 54}{space 4}-.0139436{col 67}{space 3}-.0102248
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0064988{col 26}{space 2} .0015119{col 37}{space 1}   -4.30{col 46}{space 3}0.000{col 54}{space 4}-.0094622{col 67}{space 3}-.0035354
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0043628{col 26}{space 2} .0017737{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 54}{space 4}-.0078392{col 67}{space 3}-.0008863
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4899878{col 26}{space 2} .0027287{col 37}{space 1}  179.57{col 46}{space 3}0.000{col 54}{space 4} .4846397{col 67}{space 3} .4953359
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}   .49391{col 26}{space 2} .0041302{col 37}{space 1}  119.59{col 46}{space 3}0.000{col 54}{space 4}  .485815{col 67}{space 3}  .502005
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .536845{col 26}{space 2} .0046237{col 37}{space 1}  116.11{col 46}{space 3}0.000{col 54}{space 4} .5277827{col 67}{space 3} .5459074
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6740833{col 26}{space 2}  .005295{col 37}{space 1}  127.31{col 46}{space 3}0.000{col 54}{space 4} .6637052{col 67}{space 3} .6844613
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .6692539{col 26}{space 2} .0057645{col 37}{space 1}  116.10{col 46}{space 3}0.000{col 54}{space 4} .6579557{col 67}{space 3} .6805521
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0238633{col 26}{space 2} .0018178{col 37}{space 1}   13.13{col 46}{space 3}0.000{col 54}{space 4} .0203005{col 67}{space 3} .0274261
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0107185{col 26}{space 2}  .002278{col 37}{space 1}    4.71{col 46}{space 3}0.000{col 54}{space 4} .0062538{col 67}{space 3} .0151833
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0041951{col 26}{space 2} .0028323{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-.0013562{col 67}{space 3} .0097464
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0770797{col 26}{space 2} .0022409{col 37}{space 1}   34.40{col 46}{space 3}0.000{col 54}{space 4} .0726876{col 67}{space 3} .0814717
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0839475{col 26}{space 2}  .002482{col 37}{space 1}   33.82{col 46}{space 3}0.000{col 54}{space 4} .0790828{col 67}{space 3} .0888122
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.022854{col 26}{space 2} .0007461{col 37}{space 1}  -30.63{col 46}{space 3}0.000{col 54}{space 4}-.0243163{col 67}{space 3}-.0213918
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0189232{col 26}{space 2} .0011774{col 37}{space 1}  -16.07{col 46}{space 3}0.000{col 54}{space 4}-.0212308{col 67}{space 3}-.0166155
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0224467{col 26}{space 2} .0012523{col 37}{space 1}  -17.92{col 46}{space 3}0.000{col 54}{space 4}-.0249011{col 67}{space 3}-.0199922
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0258399{col 26}{space 2} .0015104{col 37}{space 1}  -17.11{col 46}{space 3}0.000{col 54}{space 4}-.0288002{col 67}{space 3}-.0228796
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0249332{col 26}{space 2} .0017073{col 37}{space 1}  -14.60{col 46}{space 3}0.000{col 54}{space 4}-.0282794{col 67}{space 3}-.0215869
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.194817{col 26}{space 2} .0352587{col 37}{space 1}   62.25{col 46}{space 3}0.000{col 54}{space 4} 2.125711{col 67}{space 3} 2.263923
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.55396047 .1652385 .52874232 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .019146452   .6156981593          4527{txt}  {c |}
  2 {c |}  {res}.0154054491   .4823291897          3319{txt}  {c |}
  3 {c |}  {res}.0098632745     .32863153          2147{txt}  {c |}
  4 {c |}  {res}.0082335945   .2600227212          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .019146452{txt}  {c |}
  2 {c |}  {res}.0154054491{txt}  {c |}
  3 {c |}  {res}.0098632745{txt}  {c |}
  4 {c |}  {res}.0098632745{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 51}{lalign 17:Number of obs}{col 68} = {res}{ralign 8:450,884}
{txt}{col 1}Absorbed variable: {res:school_id}{col 51}{lalign 17:No. of categories}{col 68} = {res}{ralign 8:1,372}
{txt}{col 51}{lalign 17:F({res:44}, {res:449468})}{col 68} = {res}{ralign 8:15115.84}
{txt}{col 51}{lalign 17:Prob > F}{col 68} = {res}{ralign 8:0.0000}
{txt}{col 51}{lalign 17:R-squared}{col 68} = {res}{ralign 8:0.6766}
{txt}{col 51}{lalign 17:Adj R-squared}{col 68} = {res}{ralign 8:0.6756}
{txt}{col 51}{lalign 17:Root MSE}{col 68} = {res}{ralign 8:0.5352}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0212231{col 26}{space 2} .0031444{col 37}{space 1}   -6.75{col 46}{space 3}0.000{col 54}{space 4}-.0273861{col 67}{space 3}-.0150602
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0577546{col 26}{space 2}  .003461{col 37}{space 1}   16.69{col 46}{space 3}0.000{col 54}{space 4} .0509711{col 67}{space 3}  .064538
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1078651{col 26}{space 2} .0033972{col 37}{space 1}  -31.75{col 46}{space 3}0.000{col 54}{space 4}-.1145235{col 67}{space 3}-.1012068
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0968977{col 26}{space 2} .0035744{col 37}{space 1}  -27.11{col 46}{space 3}0.000{col 54}{space 4}-.1039034{col 67}{space 3}-.0898919
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0152596{col 26}{space 2} .0033159{col 37}{space 1}   -4.60{col 46}{space 3}0.000{col 54}{space 4}-.0217587{col 67}{space 3}-.0087605
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003179{col 26}{space 2} 5.63e-06{col 37}{space 1}  -56.47{col 46}{space 3}0.000{col 54}{space 4}-.0003289{col 67}{space 3}-.0003069
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0414743{col 26}{space 2} .0016356{col 37}{space 1}   25.36{col 46}{space 3}0.000{col 54}{space 4} .0382686{col 67}{space 3}   .04468
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1630999{col 26}{space 2} .0030267{col 37}{space 1}   53.89{col 46}{space 3}0.000{col 54}{space 4} .1571677{col 67}{space 3} .1690322
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0428684{col 26}{space 2} .0024568{col 37}{space 1}  -17.45{col 46}{space 3}0.000{col 54}{space 4}-.0476836{col 67}{space 3}-.0380533
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1101068{col 26}{space 2} .0046162{col 37}{space 1}  -23.85{col 46}{space 3}0.000{col 54}{space 4}-.1191545{col 67}{space 3}-.1010591
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0066667{col 26}{space 2} .0049337{col 37}{space 1}    1.35{col 46}{space 3}0.177{col 54}{space 4}-.0030031{col 67}{space 3} .0163365
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0174672{col 26}{space 2} .0020293{col 37}{space 1}   -8.61{col 46}{space 3}0.000{col 54}{space 4}-.0214445{col 67}{space 3}-.0134898
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0813263{col 26}{space 2} .0041697{col 37}{space 1}  -19.50{col 46}{space 3}0.000{col 54}{space 4}-.0894988{col 67}{space 3}-.0731537
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1725597{col 26}{space 2} .0040939{col 37}{space 1}  -42.15{col 46}{space 3}0.000{col 54}{space 4}-.1805837{col 67}{space 3}-.1645358
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3276624{col 26}{space 2} .0026827{col 37}{space 1}  122.14{col 46}{space 3}0.000{col 54}{space 4} .3224043{col 67}{space 3} .3329204
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3064896{col 26}{space 2} .0038248{col 37}{space 1}   80.13{col 46}{space 3}0.000{col 54}{space 4} .2989932{col 67}{space 3} .3139861
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2722189{col 26}{space 2} .0043424{col 37}{space 1}   62.69{col 46}{space 3}0.000{col 54}{space 4} .2637079{col 67}{space 3} .2807299
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1791644{col 26}{space 2} .0050478{col 37}{space 1}   35.49{col 46}{space 3}0.000{col 54}{space 4} .1692709{col 67}{space 3} .1890579
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1773693{col 26}{space 2} .0055643{col 37}{space 1}   31.88{col 46}{space 3}0.000{col 54}{space 4} .1664635{col 67}{space 3} .1882751
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0240019{col 26}{space 2} .0014136{col 37}{space 1}   16.98{col 46}{space 3}0.000{col 54}{space 4} .0212312{col 67}{space 3} .0267725
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0125249{col 26}{space 2} .0018498{col 37}{space 1}    6.77{col 46}{space 3}0.000{col 54}{space 4} .0088993{col 67}{space 3} .0161505
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0175942{col 26}{space 2} .0022392{col 37}{space 1}    7.86{col 46}{space 3}0.000{col 54}{space 4} .0132054{col 67}{space 3}  .021983
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0048236{col 26}{space 2} .0022218{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} .0004689{col 67}{space 3} .0091782
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0030084{col 26}{space 2}  .002512{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-.0079318{col 67}{space 3}  .001915
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0152779{col 26}{space 2} .0006488{col 37}{space 1}  -23.55{col 46}{space 3}0.000{col 54}{space 4}-.0165495{col 67}{space 3}-.0140063
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0109485{col 26}{space 2} .0008972{col 37}{space 1}  -12.20{col 46}{space 3}0.000{col 54}{space 4} -.012707{col 67}{space 3}-.0091899
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0117654{col 26}{space 2} .0009183{col 37}{space 1}  -12.81{col 46}{space 3}0.000{col 54}{space 4}-.0135651{col 67}{space 3}-.0099656
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0073617{col 26}{space 2} .0014632{col 37}{space 1}   -5.03{col 46}{space 3}0.000{col 54}{space 4}-.0102296{col 67}{space 3}-.0044938
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0052098{col 26}{space 2} .0017168{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-.0085747{col 67}{space 3}-.0018449
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .491846{col 26}{space 2}  .002656{col 37}{space 1}  185.19{col 46}{space 3}0.000{col 54}{space 4} .4866404{col 67}{space 3} .4970516
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .492204{col 26}{space 2} .0040081{col 37}{space 1}  122.80{col 46}{space 3}0.000{col 54}{space 4} .4843483{col 67}{space 3} .5000597
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5385839{col 26}{space 2} .0044838{col 37}{space 1}  120.12{col 46}{space 3}0.000{col 54}{space 4} .5297959{col 67}{space 3} .5473719
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6624645{col 26}{space 2}  .005136{col 37}{space 1}  128.98{col 46}{space 3}0.000{col 54}{space 4}  .652398{col 67}{space 3} .6725309
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .6530571{col 26}{space 2} .0055913{col 37}{space 1}  116.80{col 46}{space 3}0.000{col 54}{space 4} .6420983{col 67}{space 3} .6640159
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0239565{col 26}{space 2}  .001763{col 37}{space 1}   13.59{col 46}{space 3}0.000{col 54}{space 4} .0205012{col 67}{space 3} .0274118
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0093777{col 26}{space 2}  .002208{col 37}{space 1}    4.25{col 46}{space 3}0.000{col 54}{space 4}   .00505{col 67}{space 3} .0137053
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0040717{col 26}{space 2} .0027426{col 37}{space 1}    1.48{col 46}{space 3}0.138{col 54}{space 4}-.0013037{col 67}{space 3} .0094472
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0738352{col 26}{space 2} .0021726{col 37}{space 1}   33.99{col 46}{space 3}0.000{col 54}{space 4}  .069577{col 67}{space 3} .0780933
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0799142{col 26}{space 2} .0024067{col 37}{space 1}   33.21{col 46}{space 3}0.000{col 54}{space 4} .0751972{col 67}{space 3} .0846312
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0236485{col 26}{space 2} .0007226{col 37}{space 1}  -32.73{col 46}{space 3}0.000{col 54}{space 4}-.0250648{col 67}{space 3}-.0222323
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0190117{col 26}{space 2} .0011399{col 37}{space 1}  -16.68{col 46}{space 3}0.000{col 54}{space 4}-.0212458{col 67}{space 3}-.0167775
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0229766{col 26}{space 2} .0012122{col 37}{space 1}  -18.95{col 46}{space 3}0.000{col 54}{space 4}-.0253524{col 67}{space 3}-.0206008
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0271695{col 26}{space 2} .0014634{col 37}{space 1}  -18.57{col 46}{space 3}0.000{col 54}{space 4}-.0300378{col 67}{space 3}-.0243013
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0249612{col 26}{space 2} .0016538{col 37}{space 1}  -15.09{col 46}{space 3}0.000{col 54}{space 4}-.0282027{col 67}{space 3}-.0217198
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.004823{col 26}{space 2} .0344441{col 37}{space 1}   58.21{col 46}{space 3}0.000{col 54}{space 4} 1.937314{col 67}{space 3} 2.072332
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1371{txt}, {res}449468{txt}) = {res}24.482{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.55549974 .17331651 .52777017 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0216636593   .6449722168          4527{txt}  {c |}
  2 {c |}  {res}.0179723468   .5212110309          3319{txt}  {c |}
  3 {c |}  {res}.0117856965   .3704632369          2147{txt}  {c |}
  4 {c |}  {res}.0101564454   .3022397352          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0216636593{txt}  {c |}
  2 {c |}  {res}.0179723468{txt}  {c |}
  3 {c |}  {res}.0117856965{txt}  {c |}
  4 {c |}  {res}.0117856965{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   450,884
{txt}{hline 13}{c +}{hline 34}   F(83, 450800)   = {res} 10508.21
{txt}       Model {c |} {res} 262457.951        83  3162.14398   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 135655.292   450,800  .300921234   {txt}R-squared       ={res}    0.6593
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6592
{txt}       Total {c |} {res} 398113.243   450,883  .882963524   {txt}Root MSE        =   {res} .54856

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0146404{col 26}{space 2} .0035799{col 37}{space 1}   -4.09{col 46}{space 3}0.000{col 54}{space 4} -.021657{col 67}{space 3}-.0076239
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0667093{col 26}{space 2} .0040074{col 37}{space 1}   16.65{col 46}{space 3}0.000{col 54}{space 4} .0588549{col 67}{space 3} .0745637
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0778997{col 26}{space 2} .0039979{col 37}{space 1}  -19.49{col 46}{space 3}0.000{col 54}{space 4}-.0857354{col 67}{space 3}-.0700639
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0758654{col 26}{space 2}  .004249{col 37}{space 1}  -17.85{col 46}{space 3}0.000{col 54}{space 4}-.0841932{col 67}{space 3}-.0675375
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0216323{col 26}{space 2} .0033854{col 37}{space 1}   -6.39{col 46}{space 3}0.000{col 54}{space 4}-.0282676{col 67}{space 3} -.014997
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003235{col 26}{space 2} 5.76e-06{col 37}{space 1}  -56.18{col 46}{space 3}0.000{col 54}{space 4}-.0003348{col 67}{space 3}-.0003122
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}  .042183{col 26}{space 2} .0016733{col 37}{space 1}   25.21{col 46}{space 3}0.000{col 54}{space 4} .0389033{col 67}{space 3} .0454626
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1616008{col 26}{space 2} .0030924{col 37}{space 1}   52.26{col 46}{space 3}0.000{col 54}{space 4} .1555398{col 67}{space 3} .1676619
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0439684{col 26}{space 2} .0025104{col 37}{space 1}  -17.51{col 46}{space 3}0.000{col 54}{space 4}-.0488886{col 67}{space 3}-.0390481
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} -.111292{col 26}{space 2} .0047143{col 37}{space 1}  -23.61{col 46}{space 3}0.000{col 54}{space 4}-.1205318{col 67}{space 3}-.1020522
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0076775{col 26}{space 2} .0050388{col 37}{space 1}    1.52{col 46}{space 3}0.128{col 54}{space 4}-.0021984{col 67}{space 3} .0175534
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}  -.01722{col 26}{space 2} .0020902{col 37}{space 1}   -8.24{col 46}{space 3}0.000{col 54}{space 4}-.0213168{col 67}{space 3}-.0131232
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0836154{col 26}{space 2} .0042528{col 37}{space 1}  -19.66{col 46}{space 3}0.000{col 54}{space 4}-.0919507{col 67}{space 3}  -.07528
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1597681{col 26}{space 2} .0041822{col 37}{space 1}  -38.20{col 46}{space 3}0.000{col 54}{space 4}-.1679652{col 67}{space 3}-.1515711
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3214598{col 26}{space 2} .0027802{col 37}{space 1}  115.62{col 46}{space 3}0.000{col 54}{space 4} .3160107{col 67}{space 3}  .326909
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3000923{col 26}{space 2} .0039826{col 37}{space 1}   75.35{col 46}{space 3}0.000{col 54}{space 4} .2922865{col 67}{space 3}  .307898
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2638767{col 26}{space 2} .0045377{col 37}{space 1}   58.15{col 46}{space 3}0.000{col 54}{space 4}  .254983{col 67}{space 3} .2727703
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1856982{col 26}{space 2} .0052082{col 37}{space 1}   35.65{col 46}{space 3}0.000{col 54}{space 4} .1754903{col 67}{space 3} .1959061
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1800117{col 26}{space 2}  .005732{col 37}{space 1}   31.40{col 46}{space 3}0.000{col 54}{space 4} .1687771{col 67}{space 3} .1912462
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0227327{col 26}{space 2}  .001449{col 37}{space 1}   15.69{col 46}{space 3}0.000{col 54}{space 4} .0198928{col 67}{space 3} .0255726
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0128123{col 26}{space 2} .0018984{col 37}{space 1}    6.75{col 46}{space 3}0.000{col 54}{space 4} .0090914{col 67}{space 3} .0165331
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0169281{col 26}{space 2} .0022986{col 37}{space 1}    7.36{col 46}{space 3}0.000{col 54}{space 4} .0124229{col 67}{space 3} .0214334
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0027011{col 26}{space 2} .0022771{col 37}{space 1}    1.19{col 46}{space 3}0.236{col 54}{space 4} -.001762{col 67}{space 3} .0071643
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0050428{col 26}{space 2} .0025749{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-.0100896{col 67}{space 3} 3.96e-06
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0150247{col 26}{space 2} .0006643{col 37}{space 1}  -22.62{col 46}{space 3}0.000{col 54}{space 4}-.0163268{col 67}{space 3}-.0137226
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106311{col 26}{space 2} .0009188{col 37}{space 1}  -11.57{col 46}{space 3}0.000{col 54}{space 4}-.0124319{col 67}{space 3}-.0088303
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0114364{col 26}{space 2} .0009416{col 37}{space 1}  -12.15{col 46}{space 3}0.000{col 54}{space 4} -.013282{col 67}{space 3}-.0095909
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0073961{col 26}{space 2} .0014979{col 37}{space 1}   -4.94{col 46}{space 3}0.000{col 54}{space 4}-.0103319{col 67}{space 3}-.0044602
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0056022{col 26}{space 2}  .001757{col 37}{space 1}   -3.19{col 46}{space 3}0.001{col 54}{space 4}-.0090458{col 67}{space 3}-.0021585
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4892513{col 26}{space 2} .0027379{col 37}{space 1}  178.70{col 46}{space 3}0.000{col 54}{space 4} .4838852{col 67}{space 3} .4946174
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .4943708{col 26}{space 2} .0041318{col 37}{space 1}  119.65{col 46}{space 3}0.000{col 54}{space 4} .4862727{col 67}{space 3} .5024689
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5409727{col 26}{space 2} .0046308{col 37}{space 1}  116.82{col 46}{space 3}0.000{col 54}{space 4} .5318965{col 67}{space 3}  .550049
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6811523{col 26}{space 2} .0053251{col 37}{space 1}  127.91{col 46}{space 3}0.000{col 54}{space 4} .6707153{col 67}{space 3} .6915893
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .6790104{col 26}{space 2} .0058052{col 37}{space 1}  116.97{col 46}{space 3}0.000{col 54}{space 4} .6676325{col 67}{space 3} .6903883
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0225798{col 26}{space 2} .0018058{col 37}{space 1}   12.50{col 46}{space 3}0.000{col 54}{space 4} .0190406{col 67}{space 3} .0261191
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0103019{col 26}{space 2} .0022623{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 54}{space 4} .0058679{col 67}{space 3} .0147359
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0041947{col 26}{space 2} .0028092{col 37}{space 1}    1.49{col 46}{space 3}0.135{col 54}{space 4}-.0013114{col 67}{space 3} .0097007
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0802203{col 26}{space 2} .0022458{col 37}{space 1}   35.72{col 46}{space 3}0.000{col 54}{space 4} .0758186{col 67}{space 3}  .084622
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0870685{col 26}{space 2} .0024841{col 37}{space 1}   35.05{col 46}{space 3}0.000{col 54}{space 4} .0821998{col 67}{space 3} .0919373
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0233931{col 26}{space 2} .0007397{col 37}{space 1}  -31.62{col 46}{space 3}0.000{col 54}{space 4} -.024843{col 67}{space 3}-.0219433
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0193916{col 26}{space 2} .0011669{col 37}{space 1}  -16.62{col 46}{space 3}0.000{col 54}{space 4}-.0216787{col 67}{space 3}-.0171045
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0233031{col 26}{space 2} .0012418{col 37}{space 1}  -18.77{col 46}{space 3}0.000{col 54}{space 4} -.025737{col 67}{space 3}-.0208692
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0263335{col 26}{space 2} .0015051{col 37}{space 1}  -17.50{col 46}{space 3}0.000{col 54}{space 4}-.0292835{col 67}{space 3}-.0233836
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0251979{col 26}{space 2}    .0017{col 37}{space 1}  -14.82{col 46}{space 3}0.000{col 54}{space 4}-.0285298{col 67}{space 3} -.021866
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2}-.0005554{col 26}{space 2} .0000266{col 37}{space 1}  -20.85{col 46}{space 3}0.000{col 54}{space 4}-.0006076{col 67}{space 3}-.0005032
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2} .1413164{col 26}{space 2} .0235734{col 37}{space 1}    5.99{col 46}{space 3}0.000{col 54}{space 4} .0951133{col 67}{space 3} .1875194
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2} .1661764{col 26}{space 2} .0084531{col 37}{space 1}   19.66{col 46}{space 3}0.000{col 54}{space 4} .1496085{col 67}{space 3} .1827443
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2} .0610884{col 26}{space 2} .0077794{col 37}{space 1}    7.85{col 46}{space 3}0.000{col 54}{space 4} .0458409{col 67}{space 3} .0763359
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2} -.410351{col 26}{space 2} .0153016{col 37}{space 1}  -26.82{col 46}{space 3}0.000{col 54}{space 4}-.4403415{col 67}{space 3}-.3803604
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2} .1518477{col 26}{space 2} .0307382{col 37}{space 1}    4.94{col 46}{space 3}0.000{col 54}{space 4} .0916018{col 67}{space 3} .2120937
{txt}peer_econ_~e {c |}{col 14}{res}{space 2}-.0415684{col 26}{space 2}   .00783{col 37}{space 1}   -5.31{col 46}{space 3}0.000{col 54}{space 4} -.056915{col 67}{space 3}-.0262218
{txt}peer_limit~f {c |}{col 14}{res}{space 2}-.1019125{col 26}{space 2} .0170486{col 37}{space 1}   -5.98{col 46}{space 3}0.000{col 54}{space 4}-.1353272{col 67}{space 3}-.0684978
{txt}peer_disab~d {c |}{col 14}{res}{space 2}-.1507197{col 26}{space 2} .0283528{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4}-.2062902{col 67}{space 3}-.0951491
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .2697562{col 26}{space 2} .0129558{col 37}{space 1}   20.82{col 46}{space 3}0.000{col 54}{space 4} .2443632{col 67}{space 3} .2951492
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .2817327{col 26}{space 2} .0177616{col 37}{space 1}   15.86{col 46}{space 3}0.000{col 54}{space 4} .2469205{col 67}{space 3}  .316545
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3226448{col 26}{space 2} .0213966{col 37}{space 1}   15.08{col 46}{space 3}0.000{col 54}{space 4}  .280708{col 67}{space 3} .3645816
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.130287{col 26}{space 2} .0253228{col 37}{space 1}   -5.15{col 46}{space 3}0.000{col 54}{space 4} -.179919{col 67}{space 3} -.080655
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1002298{col 26}{space 2} .0263823{col 37}{space 1}   -3.80{col 46}{space 3}0.000{col 54}{space 4}-.1519383{col 67}{space 3}-.0485213
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0490915{col 26}{space 2} .0154912{col 37}{space 1}   -3.17{col 46}{space 3}0.002{col 54}{space 4}-.0794537{col 67}{space 3}-.0187293
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0040893{col 26}{space 2} .0205677{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4}-.0444013{col 67}{space 3} .0362228
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0632722{col 26}{space 2} .0279284{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} .0085335{col 67}{space 3}  .118011
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1279296{col 26}{space 2} .0306452{col 37}{space 1}    4.17{col 46}{space 3}0.000{col 54}{space 4}  .067866{col 67}{space 3} .1879931
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1436943{col 26}{space 2} .0328691{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4} .0792719{col 67}{space 3} .2081167
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1029128{col 26}{space 2}   .01724{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} .0691229{col 67}{space 3} .1367027
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1139474{col 26}{space 2} .0265479{col 37}{space 1}    4.29{col 46}{space 3}0.000{col 54}{space 4} .0619145{col 67}{space 3} .1659804
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0436428{col 26}{space 2} .0279836{col 37}{space 1}    1.56{col 46}{space 3}0.119{col 54}{space 4}-.0112041{col 67}{space 3} .0984897
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1731146{col 26}{space 2} .0344684{col 37}{space 1}    5.02{col 46}{space 3}0.000{col 54}{space 4} .1055576{col 67}{space 3} .2406717
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2571672{col 26}{space 2}   .03495{col 37}{space 1}    7.36{col 46}{space 3}0.000{col 54}{space 4} .1886664{col 67}{space 3}  .325668
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1835317{col 26}{space 2} .0118906{col 37}{space 1}  -15.43{col 46}{space 3}0.000{col 54}{space 4} -.206837{col 67}{space 3}-.1602264
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1856409{col 26}{space 2} .0174362{col 37}{space 1}  -10.65{col 46}{space 3}0.000{col 54}{space 4}-.2198154{col 67}{space 3}-.1514664
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.2608046{col 26}{space 2} .0207096{col 37}{space 1}  -12.59{col 46}{space 3}0.000{col 54}{space 4}-.3013947{col 67}{space 3}-.2202145
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0361136{col 26}{space 2} .0229092{col 37}{space 1}    1.58{col 46}{space 3}0.115{col 54}{space 4}-.0087877{col 67}{space 3} .0810149
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0176016{col 26}{space 2} .0231593{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-.0629931{col 67}{space 3} .0277899
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1656241{col 26}{space 2} .0176983{col 37}{space 1}    9.36{col 46}{space 3}0.000{col 54}{space 4}  .130936{col 67}{space 3} .2003122
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0448673{col 26}{space 2} .0233452{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}-.0008886{col 67}{space 3} .0906231
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0019639{col 26}{space 2} .0318167{col 37}{space 1}   -0.06{col 46}{space 3}0.951{col 54}{space 4}-.0643236{col 67}{space 3} .0603958
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.152444{col 26}{space 2} .0295737{col 37}{space 1}   -5.15{col 46}{space 3}0.000{col 54}{space 4}-.2104075{col 67}{space 3}-.0944805
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0940538{col 26}{space 2} .0307165{col 37}{space 1}   -3.06{col 46}{space 3}0.002{col 54}{space 4}-.1542571{col 67}{space 3}-.0338504
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0881042{col 26}{space 2} .0124547{col 37}{space 1}   -7.07{col 46}{space 3}0.000{col 54}{space 4} -.112515{col 67}{space 3}-.0636934
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0606226{col 26}{space 2} .0242914{col 37}{space 1}   -2.50{col 46}{space 3}0.013{col 54}{space 4}-.1082329{col 67}{space 3}-.0130123
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0299344{col 26}{space 2} .0223686{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-.0737762{col 67}{space 3} .0139075
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0397303{col 26}{space 2} .0230522{col 37}{space 1}   -1.72{col 46}{space 3}0.085{col 54}{space 4}-.0849119{col 67}{space 3} .0054513
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1027444{col 26}{space 2}  .021586{col 37}{space 1}   -4.76{col 46}{space 3}0.000{col 54}{space 4}-.1450524{col 67}{space 3}-.0604365
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.347306{col 26}{space 2} .1637988{col 37}{space 1}   32.65{col 46}{space 3}0.000{col 54}{space 4} 5.026266{col 67}{space 3} 5.668347
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.54856288 .15031158 .52756768 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0147853141   .5524046063          4527{txt}  {c |}
  2 {c |}  {res}.0115729352   .4219001457          3319{txt}  {c |}
  3 {c |}  {res}.0084836778   .3147607717          2147{txt}  {c |}
  4 {c |}  {res}.0074248096   .2624383377          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0147853141{txt}  {c |}
  2 {c |}  {res}.0115729352{txt}  {c |}
  3 {c |}  {res}.0084836778{txt}  {c |}
  4 {c |}  {res}.0084836778{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:450,884}
{txt}{col 1}Absorbed variable: {res:school_id}{col 52}{lalign 17:No. of categories}{col 69} = {res}{ralign 7:1,372}
{txt}{col 52}{lalign 17:F({res:83}, {res:449429})}{col 69} = {res}{ralign 7:8095.65}
{txt}{col 52}{lalign 17:Prob > F}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 52}{lalign 17:R-squared}{col 69} = {res}{ralign 7:0.6786}
{txt}{col 52}{lalign 17:Adj R-squared}{col 69} = {res}{ralign 7:0.6776}
{txt}{col 52}{lalign 17:Root MSE}{col 69} = {res}{ralign 7:0.5336}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0125595{col 26}{space 2} .0036043{col 37}{space 1}   -3.48{col 46}{space 3}0.000{col 54}{space 4}-.0196239{col 67}{space 3}-.0054952
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0637006{col 26}{space 2} .0041087{col 37}{space 1}   15.50{col 46}{space 3}0.000{col 54}{space 4} .0556477{col 67}{space 3} .0717535
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0803665{col 26}{space 2} .0042086{col 37}{space 1}  -19.10{col 46}{space 3}0.000{col 54}{space 4}-.0886151{col 67}{space 3}-.0721178
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0711992{col 26}{space 2} .0045882{col 37}{space 1}  -15.52{col 46}{space 3}0.000{col 54}{space 4}-.0801919{col 67}{space 3}-.0622065
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0151679{col 26}{space 2} .0033061{col 37}{space 1}   -4.59{col 46}{space 3}0.000{col 54}{space 4}-.0216476{col 67}{space 3}-.0086881
{txt}{space 9}age {c |}{col 14}{res}{space 2} -.000316{col 26}{space 2} 5.62e-06{col 37}{space 1}  -56.21{col 46}{space 3}0.000{col 54}{space 4} -.000327{col 67}{space 3} -.000305
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0412249{col 26}{space 2} .0016309{col 37}{space 1}   25.28{col 46}{space 3}0.000{col 54}{space 4} .0380284{col 67}{space 3} .0444215
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1617544{col 26}{space 2} .0030181{col 37}{space 1}   53.60{col 46}{space 3}0.000{col 54}{space 4} .1558391{col 67}{space 3} .1676698
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} -.042354{col 26}{space 2} .0024508{col 37}{space 1}  -17.28{col 46}{space 3}0.000{col 54}{space 4}-.0471576{col 67}{space 3}-.0375505
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1088711{col 26}{space 2} .0046029{col 37}{space 1}  -23.65{col 46}{space 3}0.000{col 54}{space 4}-.1178926{col 67}{space 3}-.0998495
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0073371{col 26}{space 2} .0049209{col 37}{space 1}    1.49{col 46}{space 3}0.136{col 54}{space 4}-.0023077{col 67}{space 3} .0169818
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0172914{col 26}{space 2} .0020379{col 37}{space 1}   -8.48{col 46}{space 3}0.000{col 54}{space 4}-.0212857{col 67}{space 3}-.0132971
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0802189{col 26}{space 2} .0041615{col 37}{space 1}  -19.28{col 46}{space 3}0.000{col 54}{space 4}-.0883754{col 67}{space 3}-.0720624
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1655477{col 26}{space 2} .0040857{col 37}{space 1}  -40.52{col 46}{space 3}0.000{col 54}{space 4}-.1735557{col 67}{space 3}-.1575398
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3197956{col 26}{space 2} .0027084{col 37}{space 1}  118.08{col 46}{space 3}0.000{col 54}{space 4} .3144873{col 67}{space 3}  .325104
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .2991896{col 26}{space 2} .0038821{col 37}{space 1}   77.07{col 46}{space 3}0.000{col 54}{space 4} .2915808{col 67}{space 3} .3067984
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2626072{col 26}{space 2}  .004421{col 37}{space 1}   59.40{col 46}{space 3}0.000{col 54}{space 4} .2539421{col 67}{space 3} .2712722
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .185748{col 26}{space 2} .0050742{col 37}{space 1}   36.61{col 46}{space 3}0.000{col 54}{space 4} .1758027{col 67}{space 3} .1956934
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1822243{col 26}{space 2} .0055859{col 37}{space 1}   32.62{col 46}{space 3}0.000{col 54}{space 4} .1712761{col 67}{space 3} .1931725
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0225069{col 26}{space 2} .0014127{col 37}{space 1}   15.93{col 46}{space 3}0.000{col 54}{space 4}  .019738{col 67}{space 3} .0252758
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0117079{col 26}{space 2} .0018515{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4}  .008079{col 67}{space 3} .0153367
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0168247{col 26}{space 2} .0022407{col 37}{space 1}    7.51{col 46}{space 3}0.000{col 54}{space 4} .0124331{col 67}{space 3} .0212163
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0038478{col 26}{space 2} .0022194{col 37}{space 1}    1.73{col 46}{space 3}0.083{col 54}{space 4}-.0005021{col 67}{space 3} .0081977
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0049833{col 26}{space 2} .0025098{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4}-.0099024{col 67}{space 3}-.0000642
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0148015{col 26}{space 2} .0006473{col 37}{space 1}  -22.87{col 46}{space 3}0.000{col 54}{space 4}-.0160702{col 67}{space 3}-.0135327
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0105734{col 26}{space 2} .0008954{col 37}{space 1}  -11.81{col 46}{space 3}0.000{col 54}{space 4}-.0123284{col 67}{space 3}-.0088184
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0112685{col 26}{space 2} .0009174{col 37}{space 1}  -12.28{col 46}{space 3}0.000{col 54}{space 4}-.0130665{col 67}{space 3}-.0094705
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0076454{col 26}{space 2} .0014594{col 37}{space 1}   -5.24{col 46}{space 3}0.000{col 54}{space 4}-.0105057{col 67}{space 3}-.0047851
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0057683{col 26}{space 2}  .001712{col 37}{space 1}   -3.37{col 46}{space 3}0.001{col 54}{space 4}-.0091238{col 67}{space 3}-.0024128
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4894077{col 26}{space 2} .0026672{col 37}{space 1}  183.49{col 46}{space 3}0.000{col 54}{space 4} .4841801{col 67}{space 3} .4946353
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .4937145{col 26}{space 2} .0040266{col 37}{space 1}  122.61{col 46}{space 3}0.000{col 54}{space 4} .4858226{col 67}{space 3} .5016064
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5409426{col 26}{space 2} .0045112{col 37}{space 1}  119.91{col 46}{space 3}0.000{col 54}{space 4} .5321008{col 67}{space 3} .5497844
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6818903{col 26}{space 2} .0051885{col 37}{space 1}  131.42{col 46}{space 3}0.000{col 54}{space 4}  .671721{col 67}{space 3} .6920596
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}  .677007{col 26}{space 2} .0056567{col 37}{space 1}  119.68{col 46}{space 3}0.000{col 54}{space 4} .6659201{col 67}{space 3} .6880939
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0232259{col 26}{space 2} .0017605{col 37}{space 1}   13.19{col 46}{space 3}0.000{col 54}{space 4} .0197754{col 67}{space 3} .0266765
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0088689{col 26}{space 2} .0022057{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4} .0045457{col 67}{space 3}  .013192
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0039585{col 26}{space 2} .0027379{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-.0014078{col 67}{space 3} .0093248
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0804461{col 26}{space 2} .0021887{col 37}{space 1}   36.76{col 46}{space 3}0.000{col 54}{space 4} .0761564{col 67}{space 3} .0847359
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0868977{col 26}{space 2} .0024214{col 37}{space 1}   35.89{col 46}{space 3}0.000{col 54}{space 4} .0821518{col 67}{space 3} .0916437
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0236208{col 26}{space 2} .0007209{col 37}{space 1}  -32.77{col 46}{space 3}0.000{col 54}{space 4}-.0250337{col 67}{space 3}-.0222079
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0190135{col 26}{space 2} .0011372{col 37}{space 1}  -16.72{col 46}{space 3}0.000{col 54}{space 4}-.0212423{col 67}{space 3}-.0167847
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0232012{col 26}{space 2} .0012098{col 37}{space 1}  -19.18{col 46}{space 3}0.000{col 54}{space 4}-.0255723{col 67}{space 3}  -.02083
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0266279{col 26}{space 2} .0014666{col 37}{space 1}  -18.16{col 46}{space 3}0.000{col 54}{space 4}-.0295025{col 67}{space 3}-.0237533
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0248698{col 26}{space 2} .0016565{col 37}{space 1}  -15.01{col 46}{space 3}0.000{col 54}{space 4}-.0281165{col 67}{space 3}-.0216231
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2}-.0000164{col 26}{space 2} .0000541{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4}-.0001225{col 67}{space 3} .0000897
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2}-.2188579{col 26}{space 2} .0336049{col 37}{space 1}   -6.51{col 46}{space 3}0.000{col 54}{space 4}-.2847225{col 67}{space 3}-.1529934
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2}-.0510742{col 26}{space 2} .0547006{col 37}{space 1}   -0.93{col 46}{space 3}0.350{col 54}{space 4}-.1582857{col 67}{space 3} .0561373
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2}-.2100685{col 26}{space 2} .0405384{col 37}{space 1}   -5.18{col 46}{space 3}0.000{col 54}{space 4}-.2895225{col 67}{space 3}-.1306145
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2}-.2164121{col 26}{space 2} .0771529{col 37}{space 1}   -2.80{col 46}{space 3}0.005{col 54}{space 4}-.3676295{col 67}{space 3}-.0651947
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2} .1337121{col 26}{space 2} .0540856{col 37}{space 1}    2.47{col 46}{space 3}0.013{col 54}{space 4}  .027706{col 67}{space 3} .2397182
{txt}peer_econ_~e {c |}{col 14}{res}{space 2} .0362717{col 26}{space 2} .0148661{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} .0071345{col 67}{space 3} .0654089
{txt}peer_limit~f {c |}{col 14}{res}{space 2} -.152025{col 26}{space 2} .0405107{col 37}{space 1}   -3.75{col 46}{space 3}0.000{col 54}{space 4}-.2314246{col 67}{space 3}-.0726253
{txt}peer_disab~d {c |}{col 14}{res}{space 2}-.3220405{col 26}{space 2} .0507244{col 37}{space 1}   -6.35{col 46}{space 3}0.000{col 54}{space 4}-.4214587{col 67}{space 3}-.2226222
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0063865{col 26}{space 2} .0202067{col 37}{space 1}   -0.32{col 46}{space 3}0.752{col 54}{space 4}-.0459911{col 67}{space 3} .0332181
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0502433{col 26}{space 2} .0233169{col 37}{space 1}    2.15{col 46}{space 3}0.031{col 54}{space 4}  .004543{col 67}{space 3} .0959436
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0393561{col 26}{space 2} .0254897{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4} -.010603{col 67}{space 3} .0893152
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.052555{col 26}{space 2} .0288724{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4} -.109144{col 67}{space 3}  .004034
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.027199{col 26}{space 2} .0296642{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-.0853399{col 67}{space 3} .0309418
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0795861{col 26}{space 2} .0236298{col 37}{space 1}   -3.37{col 46}{space 3}0.001{col 54}{space 4}-.1258998{col 67}{space 3}-.0332725
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0621095{col 26}{space 2} .0273192{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.1156544{col 67}{space 3}-.0085646
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0809366{col 26}{space 2} .0322617{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.1441686{col 67}{space 3}-.0177046
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .035042{col 26}{space 2} .0343101{col 37}{space 1}    1.02{col 46}{space 3}0.307{col 54}{space 4}-.0322047{col 67}{space 3} .1022887
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1487916{col 26}{space 2} .0364459{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} .0773588{col 67}{space 3} .2202244
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0461659{col 26}{space 2} .0261131{col 37}{space 1}    1.77{col 46}{space 3}0.077{col 54}{space 4} -.005015{col 67}{space 3} .0973468
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0237612{col 26}{space 2} .0355063{col 37}{space 1}    0.67{col 46}{space 3}0.503{col 54}{space 4}  -.04583{col 67}{space 3} .0933523
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0666877{col 26}{space 2} .0330598{col 37}{space 1}    2.02{col 46}{space 3}0.044{col 54}{space 4} .0018915{col 67}{space 3} .1314838
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1030165{col 26}{space 2} .0387927{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} .0269839{col 67}{space 3} .1790491
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1718089{col 26}{space 2} .0399169{col 37}{space 1}    4.30{col 46}{space 3}0.000{col 54}{space 4}  .093573{col 67}{space 3} .2500448
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.2270334{col 26}{space 2} .0170382{col 37}{space 1}  -13.32{col 46}{space 3}0.000{col 54}{space 4}-.2604278{col 67}{space 3}-.1936389
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.3036846{col 26}{space 2} .0211843{col 37}{space 1}  -14.34{col 46}{space 3}0.000{col 54}{space 4}-.3452051{col 67}{space 3} -.262164
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.3022132{col 26}{space 2} .0232027{col 37}{space 1}  -13.02{col 46}{space 3}0.000{col 54}{space 4}-.3476897{col 67}{space 3}-.2567366
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.3497182{col 26}{space 2} .0256139{col 37}{space 1}  -13.65{col 46}{space 3}0.000{col 54}{space 4}-.3999206{col 67}{space 3}-.2995158
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.3864361{col 26}{space 2} .0258197{col 37}{space 1}  -14.97{col 46}{space 3}0.000{col 54}{space 4}-.4370419{col 67}{space 3}-.3358303
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0312599{col 26}{space 2} .0249717{col 37}{space 1}    1.25{col 46}{space 3}0.211{col 54}{space 4}-.0176839{col 67}{space 3} .0802038
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0057408{col 26}{space 2} .0289754{col 37}{space 1}   -0.20{col 46}{space 3}0.843{col 54}{space 4}-.0625317{col 67}{space 3} .0510501
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0082548{col 26}{space 2}  .035432{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4}-.0611909{col 67}{space 3} .0777005
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1765835{col 26}{space 2} .0328149{col 37}{space 1}   -5.38{col 46}{space 3}0.000{col 54}{space 4}-.2408996{col 67}{space 3}-.1122674
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.2248437{col 26}{space 2} .0341638{col 37}{space 1}   -6.58{col 46}{space 3}0.000{col 54}{space 4}-.2918038{col 67}{space 3}-.1578836
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0002377{col 26}{space 2} .0199014{col 37}{space 1}   -0.01{col 46}{space 3}0.990{col 54}{space 4}-.0392439{col 67}{space 3} .0387685
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0165696{col 26}{space 2} .0305493{col 37}{space 1}    0.54{col 46}{space 3}0.588{col 54}{space 4}-.0433061{col 67}{space 3} .0764453
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0011995{col 26}{space 2} .0263118{col 37}{space 1}   -0.05{col 46}{space 3}0.964{col 54}{space 4}-.0527699{col 67}{space 3} .0503708
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0410572{col 26}{space 2} .0279847{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4} -.013792{col 67}{space 3} .0959064
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0029703{col 26}{space 2}  .027303{col 37}{space 1}    0.11{col 46}{space 3}0.913{col 54}{space 4}-.0505427{col 67}{space 3} .0564833
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.381865{col 26}{space 2} .3330822{col 37}{space 1}    7.15{col 46}{space 3}0.000{col 54}{space 4} 1.729034{col 67}{space 3} 3.034696
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1371{txt}, {res}449429{txt}) = {res}19.757{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.56681328 .20723887 .52756927 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0350727643   .7595714463          4527{txt}  {c |}
  2 {c |}  {res}.0321337407   .6899571164          3319{txt}  {c |}
  3 {c |}  {res}.0292777337   .6404816563          2147{txt}  {c |}
  4 {c |}  {res}.0285522122   .5988535479          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0350727643{txt}  {c |}
  2 {c |}  {res}.0321337407{txt}  {c |}
  3 {c |}  {res}.0292777337{txt}  {c |}
  4 {c |}  {res}.0292777337{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   449,911
                                                {txt}F(1, 1287)        =  {res}  2424.01
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0463
                                                {txt}Root MSE          =    {res} .54084

{txt}{ralign 78:(Std. err. adjusted for {res:1,288} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~_r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~h {c |}{col 14}{res}{space 2} 1.007493{col 26}{space 2} .0204633{col 37}{space 1}   49.23{col 46}{space 3}0.000{col 54}{space 4} .9673483{col 67}{space 3} 1.047638
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0012327{col 26}{space 2} .0014719{col 37}{space 1}    0.84{col 46}{space 3}0.402{col 54}{space 4}-.0016549{col 67}{space 3} .0041204
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling_enr_2year.ster} saved

Linear regression                               Number of obs     = {res}   449,911
                                                {txt}F(1, 1287)        =  {res}  2566.14
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0344
                                                {txt}Root MSE          =    {res} .53889

{txt}{ralign 78:(Std. err. adjusted for {res:1,288} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~er{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.025859{col 26}{space 2} .0202511{col 37}{space 1}   50.66{col 46}{space 3}0.000{col 54}{space 4} .9861306{col 67}{space 3} 1.065588
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0034725{col 26}{space 2} .0014051{col 37}{space 1}    2.47{col 46}{space 3}0.014{col 54}{space 4} .0007159{col 67}{space 3}  .006229
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_peer_sibling_enr_2year.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_math_sibling_enr_2year.dta{rm}
saved
{p_end}
(CST/SBAC Student Test Score Samples)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   450,884
{txt}{hline 13}{c +}{hline 34}   F(44, 450839)   = {res} 19253.44
{txt}       Model {c |} {res} 259834.098        44  5905.32042   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 138279.144   450,839  .306715134   {txt}R-squared       ={res}    0.6527
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6526
{txt}       Total {c |} {res} 398113.243   450,883  .882963524   {txt}Root MSE        =   {res} .55382

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0289787{col 26}{space 2} .0032229{col 37}{space 1}   -8.99{col 46}{space 3}0.000{col 54}{space 4}-.0352955{col 67}{space 3}-.0226619
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0641807{col 26}{space 2} .0035359{col 37}{space 1}   18.15{col 46}{space 3}0.000{col 54}{space 4} .0572504{col 67}{space 3} .0711109
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0989685{col 26}{space 2} .0034623{col 37}{space 1}  -28.58{col 46}{space 3}0.000{col 54}{space 4}-.1057546{col 67}{space 3}-.0921824
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0875253{col 26}{space 2}  .003645{col 37}{space 1}  -24.01{col 46}{space 3}0.000{col 54}{space 4}-.0946693{col 67}{space 3}-.0803813
{txt}{space 12} {c |}
1.has_~4year {c |}{col 14}{res}{space 2} .0665673{col 26}{space 2} .0039846{col 37}{space 1}   16.71{col 46}{space 3}0.000{col 54}{space 4} .0587577{col 67}{space 3} .0743769
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003439{col 26}{space 2} 5.76e-06{col 37}{space 1}  -59.72{col 46}{space 3}0.000{col 54}{space 4}-.0003552{col 67}{space 3}-.0003326
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0450506{col 26}{space 2} .0016873{col 37}{space 1}   26.70{col 46}{space 3}0.000{col 54}{space 4} .0417435{col 67}{space 3} .0483577
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}  .188751{col 26}{space 2} .0028023{col 37}{space 1}   67.35{col 46}{space 3}0.000{col 54}{space 4} .1832585{col 67}{space 3} .1942435
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0590562{col 26}{space 2} .0023062{col 37}{space 1}  -25.61{col 46}{space 3}0.000{col 54}{space 4}-.0635762{col 67}{space 3}-.0545361
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1616621{col 26}{space 2} .0045601{col 37}{space 1}  -35.45{col 46}{space 3}0.000{col 54}{space 4}-.1705998{col 67}{space 3}-.1527243
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0090382{col 26}{space 2} .0050376{col 37}{space 1}    1.79{col 46}{space 3}0.073{col 54}{space 4}-.0008354{col 67}{space 3} .0189118
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0542154{col 26}{space 2} .0019464{col 37}{space 1}  -27.85{col 46}{space 3}0.000{col 54}{space 4}-.0580303{col 67}{space 3}-.0504005
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0848481{col 26}{space 2} .0042425{col 37}{space 1}  -20.00{col 46}{space 3}0.000{col 54}{space 4}-.0931632{col 67}{space 3}-.0765329
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1460034{col 26}{space 2} .0041976{col 37}{space 1}  -34.78{col 46}{space 3}0.000{col 54}{space 4}-.1542306{col 67}{space 3}-.1377762
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3477466{col 26}{space 2} .0027525{col 37}{space 1}  126.34{col 46}{space 3}0.000{col 54}{space 4} .3423518{col 67}{space 3} .3531415
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3276538{col 26}{space 2} .0039321{col 37}{space 1}   83.33{col 46}{space 3}0.000{col 54}{space 4}  .319947{col 67}{space 3} .3353606
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2872208{col 26}{space 2} .0044749{col 37}{space 1}   64.18{col 46}{space 3}0.000{col 54}{space 4} .2784501{col 67}{space 3} .2959914
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1796513{col 26}{space 2} .0052052{col 37}{space 1}   34.51{col 46}{space 3}0.000{col 54}{space 4} .1694492{col 67}{space 3} .1898533
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1759366{col 26}{space 2} .0057381{col 37}{space 1}   30.66{col 46}{space 3}0.000{col 54}{space 4} .1646901{col 67}{space 3} .1871831
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0245349{col 26}{space 2} .0014564{col 37}{space 1}   16.85{col 46}{space 3}0.000{col 54}{space 4} .0216805{col 67}{space 3} .0273893
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0126308{col 26}{space 2}  .001905{col 37}{space 1}    6.63{col 46}{space 3}0.000{col 54}{space 4}  .008897{col 67}{space 3} .0163646
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0186415{col 26}{space 2} .0023104{col 37}{space 1}    8.07{col 46}{space 3}0.000{col 54}{space 4} .0141132{col 67}{space 3} .0231697
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0028539{col 26}{space 2} .0022934{col 37}{space 1}    1.24{col 46}{space 3}0.213{col 54}{space 4}-.0016411{col 67}{space 3} .0073489
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0051079{col 26}{space 2} .0025927{col 37}{space 1}   -1.97{col 46}{space 3}0.049{col 54}{space 4}-.0101894{col 67}{space 3}-.0000263
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0157521{col 26}{space 2} .0006699{col 37}{space 1}  -23.51{col 46}{space 3}0.000{col 54}{space 4}-.0170651{col 67}{space 3}-.0144392
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0110243{col 26}{space 2} .0009264{col 37}{space 1}  -11.90{col 46}{space 3}0.000{col 54}{space 4}  -.01284{col 67}{space 3}-.0092087
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0120897{col 26}{space 2} .0009485{col 37}{space 1}  -12.75{col 46}{space 3}0.000{col 54}{space 4}-.0139486{col 67}{space 3}-.0102307
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0064168{col 26}{space 2} .0015116{col 37}{space 1}   -4.25{col 46}{space 3}0.000{col 54}{space 4}-.0093795{col 67}{space 3}-.0034542
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0043612{col 26}{space 2} .0017733{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 54}{space 4}-.0078367{col 67}{space 3}-.0008856
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4892158{col 26}{space 2} .0027284{col 37}{space 1}  179.30{col 46}{space 3}0.000{col 54}{space 4} .4838682{col 67}{space 3} .4945634
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .492966{col 26}{space 2} .0041294{col 37}{space 1}  119.38{col 46}{space 3}0.000{col 54}{space 4} .4848724{col 67}{space 3} .5010596
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5363347{col 26}{space 2} .0046227{col 37}{space 1}  116.02{col 46}{space 3}0.000{col 54}{space 4} .5272744{col 67}{space 3}  .545395
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .673706{col 26}{space 2} .0052937{col 37}{space 1}  127.27{col 46}{space 3}0.000{col 54}{space 4} .6633305{col 67}{space 3} .6840815
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .6692877{col 26}{space 2} .0057629{col 37}{space 1}  116.14{col 46}{space 3}0.000{col 54}{space 4} .6579925{col 67}{space 3} .6805829
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0239845{col 26}{space 2} .0018173{col 37}{space 1}   13.20{col 46}{space 3}0.000{col 54}{space 4} .0204227{col 67}{space 3} .0275463
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0107561{col 26}{space 2} .0022774{col 37}{space 1}    4.72{col 46}{space 3}0.000{col 54}{space 4} .0062926{col 67}{space 3} .0152197
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .004261{col 26}{space 2} .0028316{col 37}{space 1}    1.50{col 46}{space 3}0.132{col 54}{space 4}-.0012889{col 67}{space 3} .0098108
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0771526{col 26}{space 2} .0022403{col 37}{space 1}   34.44{col 46}{space 3}0.000{col 54}{space 4} .0727618{col 67}{space 3} .0815434
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0840835{col 26}{space 2} .0024814{col 37}{space 1}   33.89{col 46}{space 3}0.000{col 54}{space 4} .0792201{col 67}{space 3}  .088947
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0228083{col 26}{space 2} .0007459{col 37}{space 1}  -30.58{col 46}{space 3}0.000{col 54}{space 4}-.0242702{col 67}{space 3}-.0213464
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0188576{col 26}{space 2} .0011771{col 37}{space 1}  -16.02{col 46}{space 3}0.000{col 54}{space 4}-.0211646{col 67}{space 3}-.0165505
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0224007{col 26}{space 2}  .001252{col 37}{space 1}  -17.89{col 46}{space 3}0.000{col 54}{space 4}-.0248545{col 67}{space 3}-.0199468
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0257431{col 26}{space 2}   .00151{col 37}{space 1}  -17.05{col 46}{space 3}0.000{col 54}{space 4}-.0287027{col 67}{space 3}-.0227836
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0248763{col 26}{space 2} .0017068{col 37}{space 1}  -14.57{col 46}{space 3}0.000{col 54}{space 4}-.0282216{col 67}{space 3}-.0215309
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.178213{col 26}{space 2} .0352512{col 37}{space 1}   61.79{col 46}{space 3}0.000{col 54}{space 4} 2.109122{col 67}{space 3} 2.247304
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.55381868 .16525184 .5285896 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0191458479   .6155950942          4527{txt}  {c |}
  2 {c |}  {res}.0154143353   .4823261467          3319{txt}  {c |}
  3 {c |}  {res}.0098638301    .328430584          2147{txt}  {c |}
  4 {c |}  {res}.0082139447   .2593326959          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0191458479{txt}  {c |}
  2 {c |}  {res}.0154143353{txt}  {c |}
  3 {c |}  {res}.0098638301{txt}  {c |}
  4 {c |}  {res}.0098638301{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 51}{lalign 17:Number of obs}{col 68} = {res}{ralign 8:450,884}
{txt}{col 1}Absorbed variable: {res:school_id}{col 51}{lalign 17:No. of categories}{col 68} = {res}{ralign 8:1,372}
{txt}{col 51}{lalign 17:F({res:44}, {res:449468})}{col 68} = {res}{ralign 8:15130.65}
{txt}{col 51}{lalign 17:Prob > F}{col 68} = {res}{ralign 8:0.0000}
{txt}{col 51}{lalign 17:R-squared}{col 68} = {res}{ralign 8:0.6768}
{txt}{col 51}{lalign 17:Adj R-squared}{col 68} = {res}{ralign 8:0.6758}
{txt}{col 51}{lalign 17:Root MSE}{col 68} = {res}{ralign 8:0.5350}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} -.021237{col 26}{space 2} .0031434{col 37}{space 1}   -6.76{col 46}{space 3}0.000{col 54}{space 4}-.0273981{col 67}{space 3} -.015076
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0571851{col 26}{space 2} .0034599{col 37}{space 1}   16.53{col 46}{space 3}0.000{col 54}{space 4} .0504038{col 67}{space 3} .0639664
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1078407{col 26}{space 2} .0033961{col 37}{space 1}  -31.75{col 46}{space 3}0.000{col 54}{space 4}-.1144969{col 67}{space 3}-.1011845
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0963763{col 26}{space 2} .0035735{col 37}{space 1}  -26.97{col 46}{space 3}0.000{col 54}{space 4}-.1033803{col 67}{space 3}-.0893724
{txt}{space 12} {c |}
1.has_~4year {c |}{col 14}{res}{space 2} .0651292{col 26}{space 2} .0038647{col 37}{space 1}   16.85{col 46}{space 3}0.000{col 54}{space 4} .0575545{col 67}{space 3} .0727038
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003161{col 26}{space 2} 5.63e-06{col 37}{space 1}  -56.17{col 46}{space 3}0.000{col 54}{space 4}-.0003272{col 67}{space 3}-.0003051
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0413819{col 26}{space 2} .0016351{col 37}{space 1}   25.31{col 46}{space 3}0.000{col 54}{space 4} .0381771{col 67}{space 3} .0445867
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1614643{col 26}{space 2} .0030262{col 37}{space 1}   53.36{col 46}{space 3}0.000{col 54}{space 4}  .155533{col 67}{space 3} .1673956
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0424823{col 26}{space 2} .0024559{col 37}{space 1}  -17.30{col 46}{space 3}0.000{col 54}{space 4}-.0472958{col 67}{space 3}-.0376687
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1098842{col 26}{space 2} .0046149{col 37}{space 1}  -23.81{col 46}{space 3}0.000{col 54}{space 4}-.1189293{col 67}{space 3}-.1008391
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0071802{col 26}{space 2} .0049323{col 37}{space 1}    1.46{col 46}{space 3}0.145{col 54}{space 4}-.0024869{col 67}{space 3} .0168474
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0176252{col 26}{space 2} .0020286{col 37}{space 1}   -8.69{col 46}{space 3}0.000{col 54}{space 4}-.0216013{col 67}{space 3}-.0136492
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0814025{col 26}{space 2} .0041685{col 37}{space 1}  -19.53{col 46}{space 3}0.000{col 54}{space 4}-.0895726{col 67}{space 3}-.0732324
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1721918{col 26}{space 2} .0040927{col 37}{space 1}  -42.07{col 46}{space 3}0.000{col 54}{space 4}-.1802132{col 67}{space 3}-.1641703
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3274795{col 26}{space 2} .0026818{col 37}{space 1}  122.11{col 46}{space 3}0.000{col 54}{space 4} .3222233{col 67}{space 3} .3327358
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3064627{col 26}{space 2} .0038235{col 37}{space 1}   80.15{col 46}{space 3}0.000{col 54}{space 4} .2989687{col 67}{space 3} .3139566
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2720218{col 26}{space 2} .0043411{col 37}{space 1}   62.66{col 46}{space 3}0.000{col 54}{space 4} .2635134{col 67}{space 3} .2805302
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1787951{col 26}{space 2} .0050463{col 37}{space 1}   35.43{col 46}{space 3}0.000{col 54}{space 4} .1689044{col 67}{space 3} .1886858
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1770763{col 26}{space 2} .0055627{col 37}{space 1}   31.83{col 46}{space 3}0.000{col 54}{space 4} .1661736{col 67}{space 3} .1879789
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0240932{col 26}{space 2} .0014132{col 37}{space 1}   17.05{col 46}{space 3}0.000{col 54}{space 4} .0213234{col 67}{space 3} .0268629
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0125328{col 26}{space 2} .0018493{col 37}{space 1}    6.78{col 46}{space 3}0.000{col 54}{space 4} .0089083{col 67}{space 3} .0161573
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0177652{col 26}{space 2} .0022386{col 37}{space 1}    7.94{col 46}{space 3}0.000{col 54}{space 4} .0133777{col 67}{space 3} .0221527
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0049759{col 26}{space 2} .0022211{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4} .0006226{col 67}{space 3} .0093293
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0028569{col 26}{space 2} .0025112{col 37}{space 1}   -1.14{col 46}{space 3}0.255{col 54}{space 4}-.0077788{col 67}{space 3}  .002065
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0152536{col 26}{space 2} .0006486{col 37}{space 1}  -23.52{col 46}{space 3}0.000{col 54}{space 4}-.0165248{col 67}{space 3}-.0139824
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0109509{col 26}{space 2}  .000897{col 37}{space 1}  -12.21{col 46}{space 3}0.000{col 54}{space 4}-.0127089{col 67}{space 3}-.0091928
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0117608{col 26}{space 2}  .000918{col 37}{space 1}  -12.81{col 46}{space 3}0.000{col 54}{space 4}  -.01356{col 67}{space 3}-.0099616
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.007279{col 26}{space 2} .0014628{col 37}{space 1}   -4.98{col 46}{space 3}0.000{col 54}{space 4} -.010146{col 67}{space 3}-.0044119
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.005198{col 26}{space 2} .0017163{col 37}{space 1}   -3.03{col 46}{space 3}0.002{col 54}{space 4}-.0085619{col 67}{space 3}-.0018341
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4910911{col 26}{space 2} .0026556{col 37}{space 1}  184.93{col 46}{space 3}0.000{col 54}{space 4} .4858863{col 67}{space 3}  .496296
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .4913378{col 26}{space 2} .0040072{col 37}{space 1}  122.61{col 46}{space 3}0.000{col 54}{space 4} .4834838{col 67}{space 3} .4991918
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5380389{col 26}{space 2} .0044826{col 37}{space 1}  120.03{col 46}{space 3}0.000{col 54}{space 4} .5292532{col 67}{space 3} .5468246
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .662019{col 26}{space 2} .0051346{col 37}{space 1}  128.93{col 46}{space 3}0.000{col 54}{space 4} .6519553{col 67}{space 3} .6720826
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .6530143{col 26}{space 2} .0055897{col 37}{space 1}  116.83{col 46}{space 3}0.000{col 54}{space 4} .6420587{col 67}{space 3} .6639699
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0240309{col 26}{space 2} .0017624{col 37}{space 1}   13.64{col 46}{space 3}0.000{col 54}{space 4} .0205766{col 67}{space 3} .0274852
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0093897{col 26}{space 2} .0022074{col 37}{space 1}    4.25{col 46}{space 3}0.000{col 54}{space 4} .0050633{col 67}{space 3} .0137161
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0041059{col 26}{space 2} .0027418{col 37}{space 1}    1.50{col 46}{space 3}0.134{col 54}{space 4}-.0012679{col 67}{space 3} .0094797
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0738386{col 26}{space 2} .0021719{col 37}{space 1}   34.00{col 46}{space 3}0.000{col 54}{space 4} .0695817{col 67}{space 3} .0780955
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0799916{col 26}{space 2}  .002406{col 37}{space 1}   33.25{col 46}{space 3}0.000{col 54}{space 4}  .075276{col 67}{space 3} .0847072
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0236017{col 26}{space 2} .0007224{col 37}{space 1}  -32.67{col 46}{space 3}0.000{col 54}{space 4}-.0250175{col 67}{space 3}-.0221858
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0189514{col 26}{space 2} .0011396{col 37}{space 1}  -16.63{col 46}{space 3}0.000{col 54}{space 4}-.0211849{col 67}{space 3}-.0167179
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0229323{col 26}{space 2} .0012118{col 37}{space 1}  -18.92{col 46}{space 3}0.000{col 54}{space 4}-.0253074{col 67}{space 3}-.0205571
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0270909{col 26}{space 2}  .001463{col 37}{space 1}  -18.52{col 46}{space 3}0.000{col 54}{space 4}-.0299583{col 67}{space 3}-.0242235
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.024932{col 26}{space 2} .0016534{col 37}{space 1}  -15.08{col 46}{space 3}0.000{col 54}{space 4}-.0281725{col 67}{space 3}-.0216915
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.990137{col 26}{space 2} .0344354{col 37}{space 1}   57.79{col 46}{space 3}0.000{col 54}{space 4} 1.922644{col 67}{space 3} 2.057629
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1371{txt}, {res}449468{txt}) = {res}24.507{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.5553716 .17338824 .52761172 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}  .02168346   .6451334545          4527{txt}  {c |}
  2 {c |}  {res}.0180034596   .5215598825          3319{txt}  {c |}
  3 {c |}  {res}.0118070998   .3707554439          2147{txt}  {c |}
  4 {c |}  {res}.0101593551   .3021064002          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}  .02168346{txt}  {c |}
  2 {c |}  {res}.0180034596{txt}  {c |}
  3 {c |}  {res}.0118070998{txt}  {c |}
  4 {c |}  {res}.0118070998{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   450,884
{txt}{hline 13}{c +}{hline 34}   F(83, 450800)   = {res} 10517.22
{txt}       Model {c |} {res} 262534.601        83  3163.06749   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 135578.641   450,800  .300751201   {txt}R-squared       ={res}    0.6594
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6594
{txt}       Total {c |} {res} 398113.243   450,883  .882963524   {txt}Root MSE        =   {res} .54841

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0146488{col 26}{space 2} .0035789{col 37}{space 1}   -4.09{col 46}{space 3}0.000{col 54}{space 4}-.0216632{col 67}{space 3}-.0076343
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .066097{col 26}{space 2} .0040061{col 37}{space 1}   16.50{col 46}{space 3}0.000{col 54}{space 4} .0582452{col 67}{space 3} .0739488
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0779334{col 26}{space 2} .0039966{col 37}{space 1}  -19.50{col 46}{space 3}0.000{col 54}{space 4}-.0857667{col 67}{space 3}-.0701002
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0752242{col 26}{space 2}  .004248{col 37}{space 1}  -17.71{col 46}{space 3}0.000{col 54}{space 4}-.0835501{col 67}{space 3}-.0668983
{txt}{space 12} {c |}
1.has_~4year {c |}{col 14}{res}{space 2} .0678822{col 26}{space 2} .0039474{col 37}{space 1}   17.20{col 46}{space 3}0.000{col 54}{space 4} .0601453{col 67}{space 3} .0756191
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003215{col 26}{space 2} 5.76e-06{col 37}{space 1}  -55.85{col 46}{space 3}0.000{col 54}{space 4}-.0003328{col 67}{space 3}-.0003103
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0420798{col 26}{space 2} .0016729{col 37}{space 1}   25.15{col 46}{space 3}0.000{col 54}{space 4} .0388011{col 67}{space 3} .0453586
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}  .159759{col 26}{space 2}  .003092{col 37}{space 1}   51.67{col 46}{space 3}0.000{col 54}{space 4} .1536988{col 67}{space 3} .1658192
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} -.043613{col 26}{space 2} .0025096{col 37}{space 1}  -17.38{col 46}{space 3}0.000{col 54}{space 4}-.0485318{col 67}{space 3}-.0386943
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1110221{col 26}{space 2} .0047129{col 37}{space 1}  -23.56{col 46}{space 3}0.000{col 54}{space 4}-.1202593{col 67}{space 3}-.1017849
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0082398{col 26}{space 2} .0050374{col 37}{space 1}    1.64{col 46}{space 3}0.102{col 54}{space 4}-.0016335{col 67}{space 3}  .018113
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0174071{col 26}{space 2} .0020896{col 37}{space 1}   -8.33{col 46}{space 3}0.000{col 54}{space 4}-.0215026{col 67}{space 3}-.0133116
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0837671{col 26}{space 2} .0042516{col 37}{space 1}  -19.70{col 46}{space 3}0.000{col 54}{space 4}   -.0921{col 67}{space 3}-.0754341
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1593565{col 26}{space 2}  .004181{col 37}{space 1}  -38.11{col 46}{space 3}0.000{col 54}{space 4}-.1675511{col 67}{space 3}-.1511619
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3213625{col 26}{space 2} .0027793{col 37}{space 1}  115.63{col 46}{space 3}0.000{col 54}{space 4} .3159152{col 67}{space 3} .3268099
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3001788{col 26}{space 2} .0039813{col 37}{space 1}   75.40{col 46}{space 3}0.000{col 54}{space 4} .2923756{col 67}{space 3} .3079819
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2637142{col 26}{space 2} .0045363{col 37}{space 1}   58.13{col 46}{space 3}0.000{col 54}{space 4} .2548231{col 67}{space 3} .2726052
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1853092{col 26}{space 2} .0052068{col 37}{space 1}   35.59{col 46}{space 3}0.000{col 54}{space 4} .1751041{col 67}{space 3} .1955143
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1796922{col 26}{space 2} .0057304{col 37}{space 1}   31.36{col 46}{space 3}0.000{col 54}{space 4} .1684608{col 67}{space 3} .1909237
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0228633{col 26}{space 2} .0014485{col 37}{space 1}   15.78{col 46}{space 3}0.000{col 54}{space 4} .0200243{col 67}{space 3} .0257023
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0128505{col 26}{space 2} .0018979{col 37}{space 1}    6.77{col 46}{space 3}0.000{col 54}{space 4} .0091307{col 67}{space 3} .0165703
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0171385{col 26}{space 2}  .002298{col 37}{space 1}    7.46{col 46}{space 3}0.000{col 54}{space 4} .0126345{col 67}{space 3} .0216425
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0028767{col 26}{space 2} .0022765{col 37}{space 1}    1.26{col 46}{space 3}0.206{col 54}{space 4}-.0015852{col 67}{space 3} .0073385
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} -.004839{col 26}{space 2} .0025742{col 37}{space 1}   -1.88{col 46}{space 3}0.060{col 54}{space 4}-.0098844{col 67}{space 3} .0002063
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0150079{col 26}{space 2} .0006642{col 37}{space 1}  -22.60{col 46}{space 3}0.000{col 54}{space 4}-.0163096{col 67}{space 3}-.0137061
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0106431{col 26}{space 2} .0009185{col 37}{space 1}  -11.59{col 46}{space 3}0.000{col 54}{space 4}-.0124433{col 67}{space 3}-.0088428
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0114408{col 26}{space 2} .0009413{col 37}{space 1}  -12.15{col 46}{space 3}0.000{col 54}{space 4}-.0132858{col 67}{space 3}-.0095958
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0073082{col 26}{space 2} .0014975{col 37}{space 1}   -4.88{col 46}{space 3}0.000{col 54}{space 4}-.0102432{col 67}{space 3}-.0043732
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0055934{col 26}{space 2} .0017565{col 37}{space 1}   -3.18{col 46}{space 3}0.001{col 54}{space 4}-.0090361{col 67}{space 3}-.0021507
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4885091{col 26}{space 2} .0027375{col 37}{space 1}  178.45{col 46}{space 3}0.000{col 54}{space 4} .4831437{col 67}{space 3} .4938744
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .4934655{col 26}{space 2} .0041309{col 37}{space 1}  119.46{col 46}{space 3}0.000{col 54}{space 4} .4853691{col 67}{space 3} .5015619
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .540409{col 26}{space 2} .0046297{col 37}{space 1}  116.73{col 46}{space 3}0.000{col 54}{space 4}  .531335{col 67}{space 3}  .549483
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6806162{col 26}{space 2} .0053237{col 37}{space 1}  127.85{col 46}{space 3}0.000{col 54}{space 4} .6701819{col 67}{space 3} .6910505
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .6789326{col 26}{space 2} .0058035{col 37}{space 1}  116.99{col 46}{space 3}0.000{col 54}{space 4}  .667558{col 67}{space 3} .6903073
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0226849{col 26}{space 2} .0018052{col 37}{space 1}   12.57{col 46}{space 3}0.000{col 54}{space 4} .0191467{col 67}{space 3} .0262231
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0103281{col 26}{space 2} .0022616{col 37}{space 1}    4.57{col 46}{space 3}0.000{col 54}{space 4} .0058954{col 67}{space 3} .0147608
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0042477{col 26}{space 2} .0028084{col 37}{space 1}    1.51{col 46}{space 3}0.130{col 54}{space 4}-.0012567{col 67}{space 3} .0097521
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .080232{col 26}{space 2} .0022451{col 37}{space 1}   35.74{col 46}{space 3}0.000{col 54}{space 4} .0758316{col 67}{space 3} .0846324
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0871464{col 26}{space 2} .0024834{col 37}{space 1}   35.09{col 46}{space 3}0.000{col 54}{space 4}  .082279{col 67}{space 3} .0920138
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0233498{col 26}{space 2} .0007395{col 37}{space 1}  -31.57{col 46}{space 3}0.000{col 54}{space 4}-.0247992{col 67}{space 3}-.0219003
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0193294{col 26}{space 2} .0011666{col 37}{space 1}  -16.57{col 46}{space 3}0.000{col 54}{space 4}-.0216158{col 67}{space 3}-.0170429
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0232612{col 26}{space 2} .0012414{col 37}{space 1}  -18.74{col 46}{space 3}0.000{col 54}{space 4}-.0256944{col 67}{space 3} -.020828
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0262465{col 26}{space 2} .0015047{col 37}{space 1}  -17.44{col 46}{space 3}0.000{col 54}{space 4}-.0291956{col 67}{space 3}-.0232974
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0251612{col 26}{space 2} .0016995{col 37}{space 1}  -14.81{col 46}{space 3}0.000{col 54}{space 4}-.0284921{col 67}{space 3}-.0218303
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2}-.0005553{col 26}{space 2} .0000266{col 37}{space 1}  -20.85{col 46}{space 3}0.000{col 54}{space 4}-.0006075{col 67}{space 3}-.0005031
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2} .1398124{col 26}{space 2} .0235666{col 37}{space 1}    5.93{col 46}{space 3}0.000{col 54}{space 4} .0936225{col 67}{space 3} .1860023
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2} .1656453{col 26}{space 2} .0084506{col 37}{space 1}   19.60{col 46}{space 3}0.000{col 54}{space 4} .1490825{col 67}{space 3} .1822082
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2} .0603785{col 26}{space 2} .0077774{col 37}{space 1}    7.76{col 46}{space 3}0.000{col 54}{space 4} .0451351{col 67}{space 3} .0756219
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2}-.4106532{col 26}{space 2}  .015297{col 37}{space 1}  -26.85{col 46}{space 3}0.000{col 54}{space 4}-.4406349{col 67}{space 3}-.3806714
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2} .1533907{col 26}{space 2} .0307297{col 37}{space 1}    4.99{col 46}{space 3}0.000{col 54}{space 4} .0931615{col 67}{space 3}   .21362
{txt}peer_econ_~e {c |}{col 14}{res}{space 2}-.0432455{col 26}{space 2} .0078282{col 37}{space 1}   -5.52{col 46}{space 3}0.000{col 54}{space 4}-.0585886{col 67}{space 3}-.0279024
{txt}peer_limit~f {c |}{col 14}{res}{space 2}-.0996161{col 26}{space 2} .0170443{col 37}{space 1}   -5.84{col 46}{space 3}0.000{col 54}{space 4}-.1330225{col 67}{space 3}-.0662098
{txt}peer_disab~d {c |}{col 14}{res}{space 2} -.150591{col 26}{space 2} .0283447{col 37}{space 1}   -5.31{col 46}{space 3}0.000{col 54}{space 4}-.2061459{col 67}{space 3}-.0950362
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .270256{col 26}{space 2}  .012952{col 37}{space 1}   20.87{col 46}{space 3}0.000{col 54}{space 4} .2448704{col 67}{space 3} .2956416
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .2822275{col 26}{space 2} .0177565{col 37}{space 1}   15.89{col 46}{space 3}0.000{col 54}{space 4} .2474253{col 67}{space 3} .3170297
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3221108{col 26}{space 2} .0213906{col 37}{space 1}   15.06{col 46}{space 3}0.000{col 54}{space 4} .2801858{col 67}{space 3} .3640357
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1303269{col 26}{space 2} .0253157{col 37}{space 1}   -5.15{col 46}{space 3}0.000{col 54}{space 4}-.1799448{col 67}{space 3}-.0807089
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0994452{col 26}{space 2} .0263748{col 37}{space 1}   -3.77{col 46}{space 3}0.000{col 54}{space 4}-.1511389{col 67}{space 3}-.0477515
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0500554{col 26}{space 2} .0154869{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0804093{col 67}{space 3}-.0197016
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0051119{col 26}{space 2}  .020562{col 37}{space 1}   -0.25{col 46}{space 3}0.804{col 54}{space 4}-.0454128{col 67}{space 3}  .035189
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0615818{col 26}{space 2} .0279207{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .0068582{col 67}{space 3} .1163055
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1273214{col 26}{space 2} .0306365{col 37}{space 1}    4.16{col 46}{space 3}0.000{col 54}{space 4} .0672748{col 67}{space 3}  .187368
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1416285{col 26}{space 2}   .03286{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0772238{col 67}{space 3} .2060331
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1030076{col 26}{space 2} .0172351{col 37}{space 1}    5.98{col 46}{space 3}0.000{col 54}{space 4} .0692273{col 67}{space 3} .1367879
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1122629{col 26}{space 2} .0265405{col 37}{space 1}    4.23{col 46}{space 3}0.000{col 54}{space 4} .0602443{col 67}{space 3} .1642816
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0429142{col 26}{space 2} .0279757{col 37}{space 1}    1.53{col 46}{space 3}0.125{col 54}{space 4}-.0119173{col 67}{space 3} .0977456
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1716826{col 26}{space 2} .0344586{col 37}{space 1}    4.98{col 46}{space 3}0.000{col 54}{space 4} .1041448{col 67}{space 3} .2392203
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .2556289{col 26}{space 2}   .03494{col 37}{space 1}    7.32{col 46}{space 3}0.000{col 54}{space 4} .1871476{col 67}{space 3} .3241103
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.1850222{col 26}{space 2} .0118874{col 37}{space 1}  -15.56{col 46}{space 3}0.000{col 54}{space 4}-.2083212{col 67}{space 3}-.1617232
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.1872882{col 26}{space 2} .0174313{col 37}{space 1}  -10.74{col 46}{space 3}0.000{col 54}{space 4} -.221453{col 67}{space 3}-.1531234
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.2601814{col 26}{space 2} .0207037{col 37}{space 1}  -12.57{col 46}{space 3}0.000{col 54}{space 4}  -.30076{col 67}{space 3}-.2196028
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0368651{col 26}{space 2} .0229027{col 37}{space 1}    1.61{col 46}{space 3}0.107{col 54}{space 4}-.0080235{col 67}{space 3} .0817536
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0180005{col 26}{space 2} .0231528{col 37}{space 1}   -0.78{col 46}{space 3}0.437{col 54}{space 4}-.0633792{col 67}{space 3} .0273782
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .166957{col 26}{space 2}  .017693{col 37}{space 1}    9.44{col 46}{space 3}0.000{col 54}{space 4} .1322793{col 67}{space 3} .2016347
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}   .04594{col 26}{space 2} .0233386{col 37}{space 1}    1.97{col 46}{space 3}0.049{col 54}{space 4} .0001971{col 67}{space 3} .0916829
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0000274{col 26}{space 2} .0318077{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.0623146{col 67}{space 3} .0623695
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1512356{col 26}{space 2} .0295653{col 37}{space 1}   -5.12{col 46}{space 3}0.000{col 54}{space 4}-.2091827{col 67}{space 3}-.0932886
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0925146{col 26}{space 2} .0307077{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4}-.1527008{col 67}{space 3}-.0323285
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0877885{col 26}{space 2} .0124512{col 37}{space 1}   -7.05{col 46}{space 3}0.000{col 54}{space 4}-.1121924{col 67}{space 3}-.0633846
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0584229{col 26}{space 2} .0242848{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4}-.1060205{col 67}{space 3}-.0108254
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0293969{col 26}{space 2} .0223623{col 37}{space 1}   -1.31{col 46}{space 3}0.189{col 54}{space 4}-.0732264{col 67}{space 3} .0144326
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0394332{col 26}{space 2} .0230457{col 37}{space 1}   -1.71{col 46}{space 3}0.087{col 54}{space 4} -.084602{col 67}{space 3} .0057356
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.1016974{col 26}{space 2}   .02158{col 37}{space 1}   -4.71{col 46}{space 3}0.000{col 54}{space 4}-.1439936{col 67}{space 3}-.0594013
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.332553{col 26}{space 2} .1637529{col 37}{space 1}   32.56{col 46}{space 3}0.000{col 54}{space 4} 5.011602{col 67}{space 3} 5.653503
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Standard deviations: total, classes, students, teachers same year
.54840788 .15030453 .52740852 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0147771395   .5521553032          4527{txt}  {c |}
  2 {c |}  {res}.0115653173   .4215721716          3319{txt}  {c |}
  3 {c |}  {res}.0084667099   .3139923831          2147{txt}  {c |}
  4 {c |}  {res}.0073988443    .261513602          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0147771395{txt}  {c |}
  2 {c |}  {res}.0115653173{txt}  {c |}
  3 {c |}  {res}.0084667099{txt}  {c |}
  4 {c |}  {res}.0084667099{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}{txt}{hline}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:450,884}
{txt}{col 1}Absorbed variable: {res:school_id}{col 52}{lalign 17:No. of categories}{col 69} = {res}{ralign 7:1,372}
{txt}{col 52}{lalign 17:F({res:83}, {res:449429})}{col 69} = {res}{ralign 7:8103.18}
{txt}{col 52}{lalign 17:Prob > F}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 52}{lalign 17:R-squared}{col 69} = {res}{ralign 7:0.6788}
{txt}{col 52}{lalign 17:Adj R-squared}{col 69} = {res}{ralign 7:0.6778}
{txt}{col 52}{lalign 17:Root MSE}{col 69} = {res}{ralign 7:0.5334}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}-.0125556{col 26}{space 2} .0036033{col 37}{space 1}   -3.48{col 46}{space 3}0.000{col 54}{space 4}-.0196179{col 67}{space 3}-.0054933
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0630718{col 26}{space 2} .0041075{col 37}{space 1}   15.36{col 46}{space 3}0.000{col 54}{space 4} .0550213{col 67}{space 3} .0711222
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0804958{col 26}{space 2} .0042073{col 37}{space 1}  -19.13{col 46}{space 3}0.000{col 54}{space 4}-.0887419{col 67}{space 3}-.0722497
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0707346{col 26}{space 2}  .004587{col 37}{space 1}  -15.42{col 46}{space 3}0.000{col 54}{space 4} -.079725{col 67}{space 3}-.0617442
{txt}{space 12} {c |}
1.has_~4year {c |}{col 14}{res}{space 2} .0634821{col 26}{space 2} .0038534{col 37}{space 1}   16.47{col 46}{space 3}0.000{col 54}{space 4} .0559296{col 67}{space 3} .0710346
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003142{col 26}{space 2} 5.62e-06{col 37}{space 1}  -55.92{col 46}{space 3}0.000{col 54}{space 4}-.0003252{col 67}{space 3}-.0003032
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0411331{col 26}{space 2} .0016305{col 37}{space 1}   25.23{col 46}{space 3}0.000{col 54}{space 4} .0379374{col 67}{space 3} .0443288
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1601554{col 26}{space 2} .0030176{col 37}{space 1}   53.07{col 46}{space 3}0.000{col 54}{space 4} .1542409{col 67}{space 3} .1660699
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0419837{col 26}{space 2}   .00245{col 37}{space 1}  -17.14{col 46}{space 3}0.000{col 54}{space 4}-.0467857{col 67}{space 3}-.0371816
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1086566{col 26}{space 2} .0046016{col 37}{space 1}  -23.61{col 46}{space 3}0.000{col 54}{space 4}-.1176757{col 67}{space 3}-.0996375
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0078382{col 26}{space 2} .0049196{col 37}{space 1}    1.59{col 46}{space 3}0.111{col 54}{space 4} -.001804{col 67}{space 3} .0174804
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0174406{col 26}{space 2} .0020373{col 37}{space 1}   -8.56{col 46}{space 3}0.000{col 54}{space 4}-.0214336{col 67}{space 3}-.0134475
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0802954{col 26}{space 2} .0041604{col 37}{space 1}  -19.30{col 46}{space 3}0.000{col 54}{space 4}-.0884496{col 67}{space 3}-.0721412
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1652125{col 26}{space 2} .0040846{col 37}{space 1}  -40.45{col 46}{space 3}0.000{col 54}{space 4}-.1732181{col 67}{space 3}-.1572069
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3196539{col 26}{space 2} .0027075{col 37}{space 1}  118.06{col 46}{space 3}0.000{col 54}{space 4} .3143472{col 67}{space 3} .3249605
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .2992147{col 26}{space 2} .0038808{col 37}{space 1}   77.10{col 46}{space 3}0.000{col 54}{space 4} .2916084{col 67}{space 3}  .306821
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2624016{col 26}{space 2} .0044197{col 37}{space 1}   59.37{col 46}{space 3}0.000{col 54}{space 4} .2537391{col 67}{space 3} .2710641
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1853542{col 26}{space 2} .0050729{col 37}{space 1}   36.54{col 46}{space 3}0.000{col 54}{space 4} .1754116{col 67}{space 3} .1952969
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1819143{col 26}{space 2} .0055844{col 37}{space 1}   32.58{col 46}{space 3}0.000{col 54}{space 4} .1709692{col 67}{space 3} .1928595
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0226004{col 26}{space 2} .0014123{col 37}{space 1}   16.00{col 46}{space 3}0.000{col 54}{space 4} .0198324{col 67}{space 3} .0253685
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0117227{col 26}{space 2} .0018509{col 37}{space 1}    6.33{col 46}{space 3}0.000{col 54}{space 4} .0080949{col 67}{space 3} .0153505
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0169946{col 26}{space 2}   .00224{col 37}{space 1}    7.59{col 46}{space 3}0.000{col 54}{space 4} .0126042{col 67}{space 3}  .021385
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0039912{col 26}{space 2} .0022187{col 37}{space 1}    1.80{col 46}{space 3}0.072{col 54}{space 4}-.0003575{col 67}{space 3} .0083398
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0048277{col 26}{space 2} .0025091{col 37}{space 1}   -1.92{col 46}{space 3}0.054{col 54}{space 4}-.0097454{col 67}{space 3}   .00009
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0147795{col 26}{space 2} .0006471{col 37}{space 1}  -22.84{col 46}{space 3}0.000{col 54}{space 4}-.0160479{col 67}{space 3}-.0135111
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0105786{col 26}{space 2} .0008952{col 37}{space 1}  -11.82{col 46}{space 3}0.000{col 54}{space 4} -.012333{col 67}{space 3}-.0088241
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0112641{col 26}{space 2} .0009171{col 37}{space 1}  -12.28{col 46}{space 3}0.000{col 54}{space 4}-.0130616{col 67}{space 3}-.0094666
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0075634{col 26}{space 2}  .001459{col 37}{space 1}   -5.18{col 46}{space 3}0.000{col 54}{space 4} -.010423{col 67}{space 3}-.0047039
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0057556{col 26}{space 2} .0017115{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-.0091102{col 67}{space 3} -.002401
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4887044{col 26}{space 2} .0026668{col 37}{space 1}  183.26{col 46}{space 3}0.000{col 54}{space 4} .4834775{col 67}{space 3} .4939312
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .4928848{col 26}{space 2} .0040257{col 37}{space 1}  122.43{col 46}{space 3}0.000{col 54}{space 4} .4849945{col 67}{space 3} .5007751
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5403888{col 26}{space 2} .0045101{col 37}{space 1}  119.82{col 46}{space 3}0.000{col 54}{space 4} .5315492{col 67}{space 3} .5492285
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6813648{col 26}{space 2} .0051871{col 37}{space 1}  131.36{col 46}{space 3}0.000{col 54}{space 4} .6711981{col 67}{space 3} .6915314
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .6769075{col 26}{space 2} .0056551{col 37}{space 1}  119.70{col 46}{space 3}0.000{col 54}{space 4} .6658237{col 67}{space 3} .6879912
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .023299{col 26}{space 2}   .00176{col 37}{space 1}   13.24{col 46}{space 3}0.000{col 54}{space 4} .0198495{col 67}{space 3} .0267486
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0088801{col 26}{space 2} .0022051{col 37}{space 1}    4.03{col 46}{space 3}0.000{col 54}{space 4} .0045582{col 67}{space 3} .0132021
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0039899{col 26}{space 2} .0027372{col 37}{space 1}    1.46{col 46}{space 3}0.145{col 54}{space 4}-.0013749{col 67}{space 3} .0093547
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0804323{col 26}{space 2} .0021881{col 37}{space 1}   36.76{col 46}{space 3}0.000{col 54}{space 4} .0761438{col 67}{space 3} .0847209
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0869569{col 26}{space 2} .0024208{col 37}{space 1}   35.92{col 46}{space 3}0.000{col 54}{space 4} .0822123{col 67}{space 3} .0917015
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0235755{col 26}{space 2} .0007207{col 37}{space 1}  -32.71{col 46}{space 3}0.000{col 54}{space 4} -.024988{col 67}{space 3}-.0221629
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0189563{col 26}{space 2} .0011368{col 37}{space 1}  -16.67{col 46}{space 3}0.000{col 54}{space 4}-.0211844{col 67}{space 3}-.0167281
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.023157{col 26}{space 2} .0012095{col 37}{space 1}  -19.15{col 46}{space 3}0.000{col 54}{space 4}-.0255275{col 67}{space 3}-.0207865
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0265448{col 26}{space 2} .0014662{col 37}{space 1}  -18.10{col 46}{space 3}0.000{col 54}{space 4}-.0294186{col 67}{space 3} -.023671
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0248424{col 26}{space 2}  .001656{col 37}{space 1}  -15.00{col 46}{space 3}0.000{col 54}{space 4}-.0280882{col 67}{space 3}-.0215966
{txt}{space 12} {c |}
{space 4}peer_age {c |}{col 14}{res}{space 2}-.0000175{col 26}{space 2} .0000541{col 37}{space 1}   -0.32{col 46}{space 3}0.746{col 54}{space 4}-.0001236{col 67}{space 3} .0000886
{txt}{space 3}peer_male {c |}{col 14}{res}{space 2}-.2198413{col 26}{space 2} .0335954{col 37}{space 1}   -6.54{col 46}{space 3}0.000{col 54}{space 4}-.2856872{col 67}{space 3}-.1539954
{txt}peer_eth_a~n {c |}{col 14}{res}{space 2}-.0472909{col 26}{space 2} .0546859{col 37}{space 1}   -0.86{col 46}{space 3}0.387{col 54}{space 4}-.1544736{col 67}{space 3} .0598918
{txt}peer_eth_h~c {c |}{col 14}{res}{space 2}-.2093984{col 26}{space 2} .0405271{col 37}{space 1}   -5.17{col 46}{space 3}0.000{col 54}{space 4}-.2888304{col 67}{space 3}-.1299665
{txt}peer_eth_b~k {c |}{col 14}{res}{space 2}-.2193317{col 26}{space 2} .0771316{col 37}{space 1}   -2.84{col 46}{space 3}0.004{col 54}{space 4}-.3705073{col 67}{space 3}-.0681561
{txt}peer_eth_o~r {c |}{col 14}{res}{space 2} .1321533{col 26}{space 2} .0540704{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4}  .026177{col 67}{space 3} .2381297
{txt}peer_econ_~e {c |}{col 14}{res}{space 2} .0357231{col 26}{space 2}  .014862{col 37}{space 1}    2.40{col 46}{space 3}0.016{col 54}{space 4} .0065939{col 67}{space 3} .0648522
{txt}peer_limit~f {c |}{col 14}{res}{space 2}-.1515101{col 26}{space 2} .0404994{col 37}{space 1}   -3.74{col 46}{space 3}0.000{col 54}{space 4}-.2308876{col 67}{space 3}-.0721325
{txt}peer_disab~d {c |}{col 14}{res}{space 2}  -.32187{col 26}{space 2} .0507103{col 37}{space 1}   -6.35{col 46}{space 3}0.000{col 54}{space 4}-.4212605{col 67}{space 3}-.2224795
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0069781{col 26}{space 2} .0202012{col 37}{space 1}   -0.35{col 46}{space 3}0.730{col 54}{space 4}-.0465717{col 67}{space 3} .0326156
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0494989{col 26}{space 2} .0233104{col 37}{space 1}    2.12{col 46}{space 3}0.034{col 54}{space 4} .0038112{col 67}{space 3} .0951866
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0389186{col 26}{space 2} .0254826{col 37}{space 1}    1.53{col 46}{space 3}0.127{col 54}{space 4}-.0110265{col 67}{space 3} .0888638
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0532715{col 26}{space 2} .0288644{col 37}{space 1}   -1.85{col 46}{space 3}0.065{col 54}{space 4}-.1098448{col 67}{space 3} .0033018
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0275762{col 26}{space 2} .0296559{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4}-.0857009{col 67}{space 3} .0305485
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0793289{col 26}{space 2} .0236232{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-.1256297{col 67}{space 3}-.0330282
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0623107{col 26}{space 2} .0273116{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-.1158406{col 67}{space 3}-.0087807
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0808454{col 26}{space 2} .0322527{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.1440598{col 67}{space 3} -.017631
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0359948{col 26}{space 2} .0343005{col 37}{space 1}    1.05{col 46}{space 3}0.294{col 54}{space 4}-.0312331{col 67}{space 3} .1032226
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1484743{col 26}{space 2} .0364357{col 37}{space 1}    4.07{col 46}{space 3}0.000{col 54}{space 4} .0770615{col 67}{space 3} .2198871
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0468551{col 26}{space 2} .0261057{col 37}{space 1}    1.79{col 46}{space 3}0.073{col 54}{space 4}-.0043113{col 67}{space 3} .0980215
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0234356{col 26}{space 2} .0354963{col 37}{space 1}    0.66{col 46}{space 3}0.509{col 54}{space 4} -.046136{col 67}{space 3} .0930072
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0661536{col 26}{space 2} .0330505{col 37}{space 1}    2.00{col 46}{space 3}0.045{col 54}{space 4} .0013756{col 67}{space 3} .1309316
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .103022{col 26}{space 2} .0387819{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} .0270106{col 67}{space 3} .1790334
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .1718448{col 26}{space 2} .0399058{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0936306{col 67}{space 3} .2500589
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.2274546{col 26}{space 2} .0170334{col 37}{space 1}  -13.35{col 46}{space 3}0.000{col 54}{space 4}-.2608395{col 67}{space 3}-.1940697
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.3039084{col 26}{space 2} .0211782{col 37}{space 1}  -14.35{col 46}{space 3}0.000{col 54}{space 4} -.345417{col 67}{space 3}-.2623997
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.3018322{col 26}{space 2} .0231962{col 37}{space 1}  -13.01{col 46}{space 3}0.000{col 54}{space 4}-.3472961{col 67}{space 3}-.2563683
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.3486262{col 26}{space 2} .0256068{col 37}{space 1}  -13.61{col 46}{space 3}0.000{col 54}{space 4}-.3988148{col 67}{space 3}-.2984376
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.3860022{col 26}{space 2} .0258125{col 37}{space 1}  -14.95{col 46}{space 3}0.000{col 54}{space 4}-.4365939{col 67}{space 3}-.3354105
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0317107{col 26}{space 2} .0249647{col 37}{space 1}    1.27{col 46}{space 3}0.204{col 54}{space 4}-.0172195{col 67}{space 3} .0806408
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0051525{col 26}{space 2} .0289673{col 37}{space 1}   -0.18{col 46}{space 3}0.859{col 54}{space 4}-.0619276{col 67}{space 3} .0516227
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0088948{col 26}{space 2} .0354222{col 37}{space 1}    0.25{col 46}{space 3}0.802{col 54}{space 4}-.0605316{col 67}{space 3} .0783211
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.1762076{col 26}{space 2} .0328057{col 37}{space 1}   -5.37{col 46}{space 3}0.000{col 54}{space 4}-.2405057{col 67}{space 3}-.1119094
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.2243198{col 26}{space 2} .0341543{col 37}{space 1}   -6.57{col 46}{space 3}0.000{col 54}{space 4}-.2912613{col 67}{space 3}-.1573784
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior..#{c |}
{space 10}c. {c |}
peer_prior.. {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0006693{col 26}{space 2} .0198959{col 37}{space 1}   -0.03{col 46}{space 3}0.973{col 54}{space 4}-.0396647{col 67}{space 3}  .038326
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0171564{col 26}{space 2} .0305408{col 37}{space 1}    0.56{col 46}{space 3}0.574{col 54}{space 4}-.0427027{col 67}{space 3} .0770155
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0012194{col 26}{space 2} .0263045{col 37}{space 1}   -0.05{col 46}{space 3}0.963{col 54}{space 4}-.0527754{col 67}{space 3} .0503366
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0402001{col 26}{space 2}  .027977{col 37}{space 1}    1.44{col 46}{space 3}0.151{col 54}{space 4}-.0146339{col 67}{space 3} .0950341
{txt}{space 7}2019  {c |}{col 14}{res}{space 2} .0028904{col 26}{space 2} .0272954{col 37}{space 1}    0.11{col 46}{space 3}0.916{col 54}{space 4}-.0506077{col 67}{space 3} .0563885
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.374356{col 26}{space 2} .3329898{col 37}{space 1}    7.13{col 46}{space 3}0.000{col 54}{space 4} 1.721706{col 67}{space 3} 3.027005
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}1371{txt}, {res}449429{txt}) = {res}19.754{col 62}{txt} Prob > F = {res}0.000
Standard deviations: total, classes, students, teachers same year
.56662974 .207136 .5274125 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0350242375   .7592417714          4527{txt}  {c |}
  2 {c |}  {res}.0320874758   .6894766197          3319{txt}  {c |}
  3 {c |}  {res}.0292262455    .639733673          2147{txt}  {c |}
  4 {c |}  {res}.0284814339   .5979027932          1060{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
3
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0350242375{txt}  {c |}
  2 {c |}  {res}.0320874758{txt}  {c |}
  3 {c |}  {res}.0292262455{txt}  {c |}
  4 {c |}  {res}.0292262455{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   449,911
                                                {txt}F(1, 1287)        =  {res}  2413.26
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0463
                                                {txt}Root MSE          =    {res}  .5407

{txt}{ralign 78:(Std. err. adjusted for {res:1,288} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~_r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~h {c |}{col 14}{res}{space 2} 1.007403{col 26}{space 2}  .020507{col 37}{space 1}   49.12{col 46}{space 3}0.000{col 54}{space 4} .9671727{col 67}{space 3} 1.047634
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0012447{col 26}{space 2} .0014731{col 37}{space 1}    0.84{col 46}{space 3}0.398{col 54}{space 4}-.0016454{col 67}{space 3} .0041347
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling_enr_4year.ster} saved

Linear regression                               Number of obs     = {res}   449,911
                                                {txt}F(1, 1287)        =  {res}  2556.30
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0344
                                                {txt}Root MSE          =    {res} .53874

{txt}{ralign 78:(Std. err. adjusted for {res:1,288} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_~er{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~r {c |}{col 14}{res}{space 2} 1.025998{col 26}{space 2} .0202927{col 37}{space 1}   50.56{col 46}{space 3}0.000{col 54}{space 4} .9861877{col 67}{space 3} 1.065809
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0034874{col 26}{space 2} .0014062{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .0007288{col 67}{space 3} .0062461
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_peer_sibling_enr_4year.ster} saved
{res}{txt}{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_math_sibling_enr_4year.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:    671.11 /        1 =     671.1090
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}28 Oct 2021, 13:34:00
{txt}{.-}
{smcl}
{txt}{sf}{ul off}