-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_vam_tab.smcl
  log type:  smcl
 opened on:  25 Jul 2022, 22:18:05

. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative fil
> e paths  */
. cd $vaprojdir
/home/research/ca_ed_lab/projects/common_core_va

. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh

. *****************************************************************************
> ***
. /* Macros for common core VA project folder file paths, and relevant datasets
>  to make it possible
> to use Matt's doh files  */
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"

. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"

. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"

. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"

. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"

. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"

. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecond
> ary_out_merge"

. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"

. 
. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh

. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
delimiter now ;
. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;

. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_score
> s" ;

. local public_access "$vaprojdir/data/public_access" ;

. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_scho
> ols" ;

. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_sc
> ores" ;

. **** Dates ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2018
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;

. local acs_str
>         "Original + Census"
>         ;

. local sib_str
>         "Original + Sibling"
>         ;

. local both_str
>         "Original + Census + Sibling"
>         ;

. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_grade
>         6
>         ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;

. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;

. local sch_char_vars "`sch_chars'" ;

. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;

. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;

. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;

. local sch_char_vars : list uniq sch_char_vars ;

. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;

. local dem_char_vars "`dem_chars'" ;

. local dem_char_vars : list uniq dem_char_vars ;

. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;

. local expenditure_vars "`expenditures'" ;

. local expenditure_vars : list uniq expenditure_vars ;

. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;

. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;

. #delimit cr
delimiter now cr
. 
. 
. macro list
T_gm_fix_span:  0
S_4:            .0039002308063216
S_2:            300
S_3:            .0206002574343117
S_1:            epanechnikov
S_6:            .7098361624622439
S_5:            4
ReS_jv2:        __000006 __000007 __000008 __000009 __00000A __00000B __00000C
                __00000D __00000E __00000F __00000G __00000H __00000I __00000J
                __00000K
dropv:          _cdscode_x
n_offset:       0
sort:           0
dots:           nois _dots 5 0
dotss:          nois _dots 0, title(Survey results being calculated)
vaprojxwalks:   /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/crosswalks
mattxwalks:     /home/research/ca_ed_lab/users/msnaven/data/restricted_access/c
                > lean/crosswalks
nscdtadir_oldformat:
                /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/o
                > ldformat
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
vadtadir:       /home/research/ca_ed_lab/projects/common_core_va/data/sbac
vaprojdir:      /home/research/ca_ed_lab/projects/common_core_va
projdir:        /home/research/ca_ed_lab/users/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_CONSOLE:      console
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_sch_char_control_vars:
                fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total frpm_prop el_prop expenditures_instr_pc
                expenditures3000_pc expenditures4000_pc expenditures_other_pc
                expenditures7000_pc
_expenditure_vars:
                expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_expenditures:  expenditures_instr_pc expenditures3000_pc expenditures4000_pc
                expenditures_other_pc expenditures7000_pc
_dem_char_vars: enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_dem_chars:     enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
_sch_char_vars: fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                male_prop enr_male_prop eth_minority_prop enr_minority_prop
                enr_total
_sch_chars:     fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop
                c.male_prop##c.enr_male_prop
                c.eth_minority_prop##c.enr_minority_prop enr_total
_sibling_controls:
                i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_census_grade:  6
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_both_str:      Original + Census + Sibling
_sib_str:       Original + Sibling
_acs_str:       Original + Census
_og_str:        Original Specification
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2018
_test_score_min_year:
                2015
_k12_test_scores_public:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_test_scores
_k12_public_schools:
                /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess/clean/k12_public_schools
_public_access: /home/research/ca_ed_lab/projects/common_core_va/data/public_ac
                > cess
_k12_test_scores:
                /home/research/ca_ed_lab/projects/common_core_va/data/restricte
                > d_access/clean/k12_test_scores
_vaprojdofiles: /home/research/ca_ed_lab/projects/common_core_va/do_files"
                local ca_ed_lab "/home/research/ca_ed_lab
_sibling_out_xwalk:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/sibling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/ufamilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxw
                > alk/siblingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_co
                > re_va/va_dataset

. 
. //startomg timer
. timer on 1

. 
. 
. *****************************************************************************
> ***
. * begin main code
. 
. ********** test score VA coefficients table
. foreach subject in ela math {
  2.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_og.ste
> r
  3.   eststo
  4. 
.   // primary specification without sibling control, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_acs.st
> er
  5.   eststo
  6. 
.   // primary specification with sibling controls, withohut acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_sib.st
> er
  7.   eststo
  8. 
.   // primary specification with sibling and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_both.s
> ter
  9.   eststo
 10. }
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)
(est7 stored)
(est8 stored)

. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/vam/sib_acs_restr_smp/test_score_sib_acs_res
> tr_smp_vam.csv ///
>   , replace nonumbers se(%4.3f) b(%5.3f) ///
>   title("VAM Output for Test Score VA on Sibling Census Restricted Sample") /
> //
>   mtitles("Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls") ///
>   mgroups("ELA" "Math", pattern(1 0 0 0 1 0 0 0) )
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/vam/sib_acs_restr_smp/test_score_sib_acs_restr_smp_vam.csv)

. 
. 
.  eststo clear

. 
. 
. 
. ********** outcome VA coefficients table
. foreach outcome in enr enr_2year enr_4year {
  2.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_og.ster
  3.   eststo
  4. 
.   // primary specification without sibling control, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_acs.ster
  5.   eststo
  6. 
.   // primary specification with sibling controls, withohut acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_sib.ster
  7.   eststo
  8. 
.   // primary specification with sibling and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_both.ster
  9.   eststo
 10. }
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)
(est7 stored)
(est8 stored)
(est9 stored)
(est10 stored)
(est11 stored)
(est12 stored)

. 
. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/vam/sib_acs_restr_smp/outcome_sib_acs_restr_
> smp_vam.csv ///
>   , replace nonumbers se(%4.3f) b(%5.3f) ///
>   title("VAM Output for Outcome VA on Sibling Census Restricted Sample") ///
>   mtitles("Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ) ///
>   mgroups("Overall Enrollment" "2 Year Enrollment" "4 Year Enrollment", patte
> rn(1 0 0 0 1 0 0 0 1 0 0 0) )
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/vam/sib_acs_restr_smp/outcome_sib_acs_restr_smp_vam.csv)

. 
. eststo clear

. 
. 
. 
. ********** outcome deep knowledge VA coefficients
. foreach outcome in enr enr_2year enr_4year {
  2.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_og_dk.ste
> r
  3.   eststo
  4. 
.   // primary specification without sibling control, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_acs_dk.st
> er
  5.   eststo
  6. 
.   // primary specification with sibling controls, withohut acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_sib_dk.st
> er
  7.   eststo
  8. 
.   // primary specification with sibling and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/vam_`outcome'_both_dk.s
> ter
  9.   eststo
 10. }
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)
(est7 stored)
(est8 stored)
(est9 stored)
(est10 stored)
(est11 stored)
(est12 stored)

. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/vam/sib_acs_restr_smp/outcome_dk_sib_acs_res
> tr_smp_vam.csv ///
>   , replace nonumbers se(%4.3f) b(%5.3f) ///
>   title("VAM Output for Deep Knowledge Outcome VA on Sibling Census Restricte
> d Sample") ///
>   mtitles("Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ) ///
>   mgroups("Overall Enrollment" "2 Year Enrollment" "4 Year Enrollment", patte
> rn(1 0 0 0 1 0 0 0 1 0 0 0) )
(output written to /home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/si
> blingvaregs/vam/sib_acs_restr_smp/outcome_dk_sib_acs_restr_smp_vam.csv)

. 
. eststo clear

. 
. 
. 
. timer off 1

. timer list
   1:      1.03 /        1 =       1.0310

. 
. set trace off

. 
. //change directory back to my own personal directory
. cd $projdir 
/home/research/ca_ed_lab/users/chesun/gsr/caschls

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblin
> gvaregs/va_sib_acs_vam_tab.smcl
  log type:  smcl
 closed on:  25 Jul 2022, 22:18:06
-------------------------------------------------------------------------------
