-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvareg
> s/va_sibling_est_sumstats.smcl
  log type:  smcl
 opened on:  27 Oct 2021, 21:17:58

. 
. //include macros
. include do_files/sbac/macros_va.doh

. #delimit ;
delimiter now ;
. local test_score_min_year
>         2015
>         ;

. local test_score_max_year
>         2019
>         ;

. local star_min_year
>         2003
>         ;

. local star_max_year
>         2013
>         ;

. local caaspp_min_year
>         2015
>         ;

. local caaspp_max_year
>         2019
>         ;

. local outcome_min_year
>         2015
>         ;

. local outcome_max_year
>         2018
>         ;

. local ela_str
>         "ELA"
>         ;

. local math_str
>         "Math"
>         ;

. local enr_str
>         "Enrolled On Time"
>         ;

. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;

. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;

. local school_controls
>         /*cohort_size*/
>         ;

. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;

. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;

. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score
> )
>         ;

. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_pr
> ior_ela_z_score)
>         ;

. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_sc
> ore)
>         ;

. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_
> prior_math_z_score)
>         ;

. local va_control_vars "`school_controls' `demographic_controls'" ;

. local va_control_vars : subinstr local va_control_vars "i." "", all ;

. local va_control_vars : list uniq va_control_vars ;

. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_
> other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;

. #delimit cr
delimiter now cr
. 
. 
. #delimit ;
delimiter now ;
. #delimit cr
delimiter now cr
. macro list
T_gm_fix_span:  0
S_4:            .0031631980624826
S_2:            300
S_3:            .0164088505513895
S_1:            epanechnikov
nscdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/nsc
cstdtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/cst
vadtadir:       /home/research/ca_ed_lab/msnaven/common_core_va/data/sbac
projdir:        /home/research/ca_ed_lab/chesun/gsr/caschls
clndtadir:      /home/research/ca_ed_lab/data/restricted_access/clean/calschls
rawdtadir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/st
                > ata
rawcsvdir:      /home/research/ca_ed_lab/data/restricted_access/raw/calschls/cs
                > v
S_level:        95
F1:             help advice;
F2:             describe;
F7:             save
F8:             use
S_ADO:          BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
S_StataMP:      MP
S_StataSE:      SE
S_OS:           Unix
S_MACH:         PC (64-bit x86-64)
_census_controls:
                eth_asian_pct eth_hispanic_pct eth_black_pct
                educ_hs_dropout_prop educ_deg_4year_plus_prop
                pov_fam_child_lt18_pct inc_median_hh
_va_control_vars:
                age male eth_asian eth_hispanic eth_black eth_other
                econ_disadvantage limited_eng_prof disabled
_peer_math_score_controls:
                i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c
                > .peer_prior_math_z_score)
_math_score_controls:
                i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_mat
                > h_z_score)
_peer_ela_score_controls:
                i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.p
                > eer_prior_ela_z_score)
_ela_score_controls:
                i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z
                > _score)
_peer_demographic_controls:
                peer_age peer_male peer_eth_asian peer_eth_hispanic
                peer_eth_black peer_eth_other peer_econ_disadvantage
                peer_limited_eng_prof peer_disabled
_demographic_controls:
                age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other
                i.econ_disadvantage i.limited_eng_prof i.disabled
_enr_4year_str: Enrolled On Time 4-Year
_enr_2year_str: Enrolled On Time 2-Year
_enr_str:       Enrolled On Time
_math_str:      Math
_ela_str:       ELA
_outcome_max_year:
                2018
_outcome_min_year:
                2015
_caaspp_max_year:
                2019
_caaspp_min_year:
                2015
_star_max_year: 2013
_star_min_year: 2003
_test_score_max_year:
                2019
_test_score_min_year:
                2015
_sibling_out_xwalk:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/si
                > bling_out_xwalk
_k12_postsecondary_out_merge:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > k12_postsecondary_out_merge
_ufamilyxwalk:  /home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/uf
                > amilyxwalk
_siblingxwalk:  /home/research/ca_ed_lab/chesun/gsr/caschls/dta/siblingxwalk/si
                > blingpairxwalk
_va_g11_out_dataset:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > va_g11_out_dataset
_va_g11_dataset:
                /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > va_g11_dataset
_va_dataset:    /home/research/ca_ed_lab/chesun/gsr/caschls/dta/common_core_va/
                > va_dataset
_k12_test_scores_public:
                /home/research/ca_ed_lab/msnaven/data/public_access/clean/k12_t
                > est_scores
_k12_public_schools:
                /home/research/ca_ed_lab/msnaven/data/public_access/clean/k12_p
                > ublic_schools
_public_access: /home/research/ca_ed_lab/data/public_access
_k12_test_scores:
                /home/research/ca_ed_lab/msnaven/data/restricted_access/clean/k
                > 12_test_scores
_ca_ed_lab:     /home/research/ca_ed_lab
_common_core_va:
                /home/research/ca_ed_lab/msnaven/common_core_va
_mattdofiles:   /home/research/ca_ed_lab/msnaven/common_core_va/do_files/sbac
_matthomedir:   /home/research/ca_ed_lab/msnaven/common_core_va

. 
. 
. timer on 1

. 
. // 11th Grade (8th Grade ELA Controls, 6th Grade Math Controls)
. **************** Two Way Kernel Density for ELA and Math
. foreach subject in ela math {
  2.   foreach enrvar in enr enr_2year enr_4year {
  3.     use $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibling
> _`enrvar'.dta, clear
  4.     sort school_id year
  5.         xtset school_id year
  6. 
.     * Normalize to have mean zero
.         foreach v of varlist va_* {
  7.                 sum `v', meanonly
  8.                 replace `v' = `v' - r(mean)
  9.         }
 10. 
.     sum va_cfr_g11_`subject'
 11.     local mean_`subject'_`enrvar' = 0
 12.     local sd_`subject'_`enrvar' : di %4.3f = r(sd)
 13. 
.     sum va_cfr_g11_`subject'_peer
 14.     local mean_`subject'_`enrvar'_peer = 0
 15.     local sd_`subject'_`enrvar'_peer : di %4.3f = r(sd)
 16. 
.     tempfile va_`subject'_`enrvar'
 17.     save `va_`subject'_`enrvar''
 18.   }
 19. }
(CST/SBAC Student Test Score Samples)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2019, but with gaps
         Delta: 1 year
(5,902 real changes made)
(5,902 real changes made)
(5,902 real changes made)
(5,902 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~a |      5,902    5.83e-12    .1298853  -.5319522   .4950685

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~r |      5,902   -5.57e-10    .1148806  -.4559389   .4644651
file /home/tmp/St04618.000003 saved as .dta format
(CST/SBAC Student Test Score Samples)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2019, but with gaps
         Delta: 1 year
(5,902 real changes made)
(5,902 real changes made)
(5,902 real changes made)
(5,902 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~a |      5,902    5.56e-10    .1298751  -.5319546   .4950261

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~r |      5,902    9.34e-10    .1148365  -.4557379   .4643084
file /home/tmp/St04618.000004 saved as .dta format
(CST/SBAC Student Test Score Samples)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2019, but with gaps
         Delta: 1 year
(5,902 real changes made)
(5,902 real changes made)
(5,902 real changes made)
(5,902 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~a |      5,902    6.10e-10    .1297655  -.5310828   .4949354

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~r |      5,902    9.08e-10    .1147796  -.4550915   .4644928
file /home/tmp/St04618.000005 saved as .dta format
(CST/SBAC Student Test Score Samples)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2019, but with gaps
         Delta: 1 year
(5,895 real changes made)
(5,895 real changes made)
(5,895 real changes made)
(5,895 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~h |      5,895    4.09e-11    .1304266  -.4616478   .5800539

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~r |      5,895    7.35e-11    .1130788  -.4233344   .5239416
file /home/tmp/St04618.000006 saved as .dta format
(CST/SBAC Student Test Score Samples)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2019, but with gaps
         Delta: 1 year
(5,895 real changes made)
(5,895 real changes made)
(5,895 real changes made)
(5,895 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~h |      5,895   -6.69e-10    .1303286  -.4632705    .579084

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~r |      5,895    1.72e-09    .1129727  -.4243234    .522817
file /home/tmp/St04618.000007 saved as .dta format
(CST/SBAC Student Test Score Samples)

Panel variable: school_id (unbalanced)
 Time variable: year, 2015 to 2019, but with gaps
         Delta: 1 year
(5,895 real changes made)
(5,895 real changes made)
(5,895 real changes made)
(5,895 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~h |      5,895   -5.69e-10    .1302924  -.4611735   .5791686

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
va_cfr_g11~r |      5,895    6.54e-10    .1129398  -.4221287   .5233931
file /home/tmp/St04618.000008 saved as .dta format

. 
. foreach enrvar in enr enr_2year enr_4year {
  2.   use `va_ela_`enrvar'', clear
  3.   merge 1:1 cdscode year using `va_math_`enrvar'', nogen
  4. 
.   //get around the compound macro problem inside string in notes of the grpah
.   local mean_ela =  `mean_ela_`enrvar''
  5.   local sd_ela = `sd_ela_`enrvar''
  6. 
.   local mean_math = `mean_math_`enrvar''
  7.   local sd_math = `sd_math_`enrvar''
  8. 
.   **** No Peer Controls
.   twoway ///
>         (kdensity va_cfr_g11_ela) ///
>         (kdensity va_cfr_g11_math) ///
>     , ytitle("Density") xtitle("Value Added") ///
>     title("11th Grade Test Score VA controlling for has older sibling `ernvar
> '") ///
>         legend(label(1 "ELA") label(2 "Math")) ///
>     note("Mean (Standard Deviation) = `mean_ela' (`sd_ela')" ///
>         "Mean (Standard Deviation) = `mean_math' (`sd_math')")
  9.     graph export $projdir/out/graph/siblingvaregs/test_score_va/kdensity_v
> a_cfr_g11_`enrvar'.pdf, replace
 10. 
. 
.   local mean_ela_peer =  `mean_ela_`enrvar'_peer'
 11.   local sd_ela_peer = `sd_ela_`enrvar'_peer'
 12. 
.   local mean_math_peer = `mean_math_`enrvar'_peer'
 13.   local sd_math_peer = `sd_math_`enrvar'_peer'
 14. 
.   ****  Peer Controls
.   twoway ///
>         (kdensity va_cfr_g11_ela_peer) ///
>         (kdensity va_cfr_g11_math_peer) ///
>     , ytitle("Density") xtitle("Value Added") ///
>     title("11th Grade Test Score VA controlling for has older sibling `ernvar
> '") ///
>         legend(label(1 "ELA") label(2 "Math")) ///
>     note("Mean (Standard Deviation) = `mean_ela_peer' (`sd_ela_peer')" ///
>         "Mean (Standard Deviation) = `mean_math_peer' (`sd_math_peer')")
 15.     graph export $projdir/out/graph/siblingvaregs/test_score_va/kdensity_v
> a_cfr_g11_`enrvar'_peer.pdf, replace
 16. 
. }
(CST/SBAC Student Test Score Samples)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            15
        from master                        12  
        from using                          3  

    Matched                             5,976  
    -----------------------------------------
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/kdensity_va_cfr_g11_enr.pdf saved as PDF format
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/kdensity_va_cfr_g11_enr_peer.pdf saved as PDF format
(CST/SBAC Student Test Score Samples)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            15
        from master                        12  
        from using                          3  

    Matched                             5,976  
    -----------------------------------------
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/kdensity_va_cfr_g11_enr_2year.pdf saved as PDF format
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/kdensity_va_cfr_g11_enr_2year_peer.pdf saved as PDF format
(CST/SBAC Student Test Score Samples)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            15
        from master                        12  
        from using                          3  

    Matched                             5,976  
    -----------------------------------------
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/kdensity_va_cfr_g11_enr_4year.pdf saved as PDF format
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/kdensity_va_cfr_g11_enr_4year_peer.pdf saved as PDF format

. 
. 
. 
. 
. 
. 
. 
. ***********************
. //specification tests
. *****No peer controls
. foreach subject in ela math {
  2.   foreach enrvar in enr enr_2year enr_4year {
  3.     estimates use $projdir/est/siblingvaregs/test_score_va/spec_test_va_cf
> r_g11_`subject'_sibling_`enrvar'.ster,
  4. 
.     test _b[va_cfr_g11_`subject'] = 1
  5.     matrix test_p = r(p)
  6.         matrix rownames test_p = pvalue
  7.         matrix colnames test_p = va_cfr_g11_`subject'
  8.         estadd matrix test_p = test_p
  9. 
.     local slope : di %5.3f _b[va_cfr_g11_`subject']
 10.         local std_err : di %4.3f _se[va_cfr_g11_`subject']
 11.         binscatter sbac_g11_`subject'_r va_cfr_g11_`subject' ///
>                 [aw = n_g11_`subject'] ///
>                 , ytitle("11th Grade Score") xtitle("Value Added") ///
>       title("11th Grade ``subject'_str' with older sibling `enrvar' control S
> pecification Test") ///
>                 yline(0) xline(0) ///
>                 yscale(range(-.3 .3)) xscale(range(-.3 .3)) ylabel(-.3 (0.1) 
> .3) xlabel(-.3 (0.1) .3) ///
>                 note("Slope (Standard Error) = `slope' (`std_err')")
 12.         graph export $projdir/out/graph/siblingvaregs/test_score_va/spec_t
> est_va_cfr_g11_`subject'_`enrvar'.pdf, replace
 13. 
. 
. ******* with peer controls
.     estimates use $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g
> 11_`subject'_peer_sibling_`enrvar'.ster,
 14. 
.     test _b[va_cfr_g11_`subject'_peer] = 1
 15.     matrix test_p = r(p)
 16.         matrix rownames test_p = pvalue
 17.         matrix colnames test_p = va_cfr_g11_`subject'_peer
 18.         estadd matrix test_p = test_p
 19. 
.         local slope : di %5.3f _b[va_cfr_g11_`subject'_peer]
 20.         local std_err : di %4.3f _se[va_cfr_g11_`subject'_peer]
 21.         binscatter sbac_g11_`subject'_r_peer va_cfr_g11_`subject'_peer ///
>                 [aw = n_g11_`subject'] ///
>                 , ytitle("11th Grade Score") xtitle("Value Added") ///
>       title("11th Grade ``subject'_str' with older sibling `enrevar' control 
> Specification Test") ///
>                 yline(0) xline(0) ///
>                 yscale(range(-.3 .3)) xscale(range(-.3 .3)) ylabel(-.3 (0.1) 
> .3) xlabel(-.3 (0.1) .3) ///
>                 note("Slope (Standard Error) = `slope' (`std_err')")
 22.     graph export $projdir/out/graph/siblingvaregs/test_score_va/spec_test_
> va_cfr_g11_`subject'_`enrvar'_peer.pdf, replace
 23. 
. 
.   }
 24. 
. }

 ( 1)  va_cfr_g11_ela = 1

       F(  1,  1288) =   22.15
            Prob > F =    0.0000

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_ela_enr.pdf saved as PDF format

 ( 1)  va_cfr_g11_ela_peer = 1

       F(  1,  1288) =   21.48
            Prob > F =    0.0000

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_ela_enr_peer.pdf saved as PDF format

 ( 1)  va_cfr_g11_ela = 1

       F(  1,  1288) =   22.17
            Prob > F =    0.0000

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_ela_enr_2year.pdf saved as PDF format

 ( 1)  va_cfr_g11_ela_peer = 1

       F(  1,  1288) =   21.47
            Prob > F =    0.0000

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_ela_enr_2year_peer.pdf saved as PDF
    format

 ( 1)  va_cfr_g11_ela = 1

       F(  1,  1288) =   22.14
            Prob > F =    0.0000

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_ela_enr_4year.pdf saved as PDF format

 ( 1)  va_cfr_g11_ela_peer = 1

       F(  1,  1288) =   21.48
            Prob > F =    0.0000

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_ela_enr_4year_peer.pdf saved as PDF
    format

 ( 1)  va_cfr_g11_math = 1

       F(  1,  1287) =    4.71
            Prob > F =    0.0302

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_math_enr.pdf saved as PDF format

 ( 1)  va_cfr_g11_math_peer = 1

       F(  1,  1287) =   10.56
            Prob > F =    0.0012

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_math_enr_peer.pdf saved as PDF format

 ( 1)  va_cfr_g11_math = 1

       F(  1,  1287) =    4.72
            Prob > F =    0.0299

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_math_enr_2year.pdf saved as PDF format

 ( 1)  va_cfr_g11_math_peer = 1

       F(  1,  1287) =   10.55
            Prob > F =    0.0012

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_math_enr_2year_peer.pdf saved as PDF
    format

 ( 1)  va_cfr_g11_math = 1

       F(  1,  1287) =    4.69
            Prob > F =    0.0306

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_math_enr_4year.pdf saved as PDF format

 ( 1)  va_cfr_g11_math_peer = 1

       F(  1,  1287) =   10.54
            Prob > F =    0.0012

added matrix:
             e(test_p) :  1 x 1
file
    /home/research/ca_ed_lab/chesun/gsr/caschls/out/graph/siblingvaregs/test_
    > score_va/spec_test_va_cfr_g11_math_enr_4year_peer.pdf saved as PDF
    format

. 
. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1

. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/chesun/gsr/caschls/log/share/siblingvareg
> s/va_sibling_est_sumstats.smcl
  log type:  smcl
 closed on:  27 Oct 2021, 21:18:08
-------------------------------------------------------------------------------
