{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs_spec_test_tab.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Sep 2022, 15:15:33
{txt}
{com}. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative file paths  */
. cd $vaprojdir
{res}/home/research/ca_ed_lab/projects/common_core_va
{txt}
{com}. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh
{txt}
{com}. ********************************************************************************
. /* Macros for common core VA project folder file paths, and relevant datasets to make it possible
> to use Matt's doh files  */
. ********************************************************************************
. ********************************************************************************
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"
{txt}
{com}. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"
{txt}
{com}. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"
{txt}
{com}. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"
{txt}
{com}. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"
{txt}
{com}. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"
{txt}
{com}. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecondary_out_merge"
{txt}
{com}. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"
{txt}
{com}. {txt}
{com}. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk";
{txt}
{com}. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk";
{txt}
{com}. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk";
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Sibling Census Restricted Sample Controls Strings ;
. local og_str
>         "Original Specification"
>         ;
{txt}
{com}. local acs_str
>         "Original + Census"
>         ;
{txt}
{com}. local sib_str
>         "Original + Sibling"
>         ;
{txt}
{com}. local both_str
>         "Original + Census + Sibling"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. //peer controls
> local peer_controls
>         `peer_ela_score_controls'
>         `peer_math_score_controls'
>         `peer_demographic_controls'
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **********************************************
> *** macros for control var COMBINATIONS for running loops over all samples and specifications
> //base specification controls
> local base_spec_controls
>         `school_controls'
>         `demographic_controls'
>         `ela_score_controls'
>         `math_score_controls'
>         ;
. // leave out prior score controls
> local loscore_spec_controls
>         `base_controls'
>         loscore
>         ;
{txt}
{com}. // update the local macro name for looping in the creation of all sample VA estimates
> local acs_spec_controls
>         `base_controls'
>         `census_controls'
>         ;
{txt}
{com}. local sib_spec_controls
>         `base_controls'
>         `sibling_controls'
>         ;
{txt}
{com}. // control var groups for looping
> local loscore_acs_spec_controls
>         `base_controls'
>         `loscore_controls'
>         `acs_controls'
>         ;
{txt}
{com}. local loscore_sib_spec_controls
>         `base_controls'
>         `loscore_controls'
>         `sib_controls'
>         ;
{txt}
{com}. local acs_sib_spec_controls
>         `base_controls'
>         `acs_controls'
>         `sib_controls'
>         ;
{txt}
{com}. local loscore_acs_sib_spec_controls
>         `base_controls'
>         `loscore_controls'
>         `acs_controls'
>         `sib_controls'
>         ;
{txt}
{com}. *** macros for STANDALONE control vars for running loops over all samples and specifications
> //base specification controls
> local base_controls
>         `school_controls'
>         `demographic_controls'
>         `ela_score_controls'
>         `math_score_controls'
>         ;
. local loscore_controls
>         loscore
>         ;
{txt}
{com}. local acs_controls
>         `census_controls'
>         ;
{txt}
{com}. local sib_controls
>         `sibling_controls'
>         ;
{txt}
{com}. // control var groups for looping
> local loscore_acs_controls
>         `loscore_controls'
>         `acs_controls'
>         ;
{txt}
{com}. local loscore_sib_controls
>         `loscore_controls'
>         `sib_controls'
>         ;
{txt}
{com}. local acs_sib_controls
>         `acs_controls'
>         `sib_controls'
>         ;
{txt}
{com}. local loscore_acs_sib_controls
>         `loscore_controls'
>         `acs_controls'
>         `sib_controls'
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. macro list
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_loscore_acs_sib_controls:{break}
{res}loscore         eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh         i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_acs_sib_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh         i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_loscore_sib_controls:{break}
{res}loscore         i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_loscore_acs_controls:{break}
{res}loscore         eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_sib_controls:{space 2}{res}{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_acs_controls:{space 2}{res}{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_loscore_controls:{break}
{res}loscore
{p_end}
{txt}{p 0 16}
_sib_spec_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_acs_spec_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_loscore_spec_controls:{break}
{res}loscore
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_controls:{space 1}{res}{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)         peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_both_str:{space 6}{res}{res}Original + Census + Sibling
{p_end}
{txt}{p 0 16}
_sib_str:{space 7}{res}{res}Original + Sibling
{p_end}
{txt}{p 0 16}
_acs_str:{space 7}{res}{res}Original + Census
{p_end}
{txt}{p 0 16}
_og_str:{space 8}{res}{res}Original Specification
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}
{com}. 
. //startomg timer
. timer on 1
{txt}
{com}. 
. 
. 
. ********************************************************************************
. *start main code
. 
. ********** test score VA spec test
. foreach subject in ela math {c -(}
{txt}  2{com}.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_og.ster
{txt}  3{com}.   eststo
{txt}  4{com}.   test _b[va_`subject'_og] = 1
{txt}  5{com}.   matrix test_p = r(p)
{txt}  6{com}.   matrix rownames test_p = pvalue
{txt}  7{com}.   matrix colnames test_p = va_`subject'_og
{txt}  8{com}.   estadd matrix test_p = test_p
{txt}  9{com}. 
.   // without sibling controls, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_acs.ster
{txt} 10{com}.   eststo
{txt} 11{com}.   test _b[va_`subject'_acs] = 1
{txt} 12{com}.   matrix test_p = r(p)
{txt} 13{com}.   matrix rownames test_p = pvalue
{txt} 14{com}.   matrix colnames test_p = va_`subject'_acs
{txt} 15{com}.   estadd matrix test_p = test_p
{txt} 16{com}. 
.   // with sibling controls, without acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_sib.ster
{txt} 17{com}.   eststo
{txt} 18{com}.   test _b[va_`subject'_sib] = 1
{txt} 19{com}.   matrix test_p = r(p)
{txt} 20{com}.   matrix rownames test_p = pvalue
{txt} 21{com}.   matrix colnames test_p = va_`subject'_sib
{txt} 22{com}.   estadd matrix test_p = test_p
{txt} 23{com}. 
.   // with both sibling controls and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_both.ster
{txt} 24{com}.   eststo
{txt} 25{com}.   test _b[va_`subject'_both] = 1
{txt} 26{com}.   matrix test_p = r(p)
{txt} 27{com}.   matrix rownames test_p = pvalue
{txt} 28{com}.   matrix colnames test_p = va_`subject'_both
{txt} 29{com}.   estadd matrix test_p = test_p
{txt} 30{com}. 
. {c )-}
{res}{txt}({res}est1{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_ela_og = 1{p_end}

{txt}       F(  1,  1244) ={res}    0.00
{txt}{col 13}Prob > F ={res}    0.9458

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est2{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_ela_acs = 1{p_end}

{txt}       F(  1,  1244) ={res}    0.01
{txt}{col 13}Prob > F ={res}    0.9269

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est3{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_ela_sib = 1{p_end}

{txt}       F(  1,  1244) ={res}    0.00
{txt}{col 13}Prob > F ={res}    0.9461

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est4{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_ela_both = 1{p_end}

{txt}       F(  1,  1244) ={res}    0.01
{txt}{col 13}Prob > F ={res}    0.9262

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est5{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_math_og = 1{p_end}

{txt}       F(  1,  1241) ={res}    0.59
{txt}{col 13}Prob > F ={res}    0.4425

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est6{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_math_acs = 1{p_end}

{txt}       F(  1,  1241) ={res}    0.01
{txt}{col 13}Prob > F ={res}    0.9180

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est7{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_math_sib = 1{p_end}

{txt}       F(  1,  1241) ={res}    0.61
{txt}{col 13}Prob > F ={res}    0.4333

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est8{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_math_both = 1{p_end}

{txt}       F(  1,  1241) ={res}    0.01
{txt}{col 13}Prob > F ={res}    0.9115

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}
{com}. 
. 
.   esttab using ///
>     $projdir/out/csv/siblingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_acs_restr_smp_score.csv ///
>     , replace nonumbers  ///
>     cells(b(fmt(%5.3f) pvalue(test_p) star) se(fmt(%4.3f) par)) ///
>     title("Specification Tests for Test Score VA on Sibling Census Restricted Sample") ///
>     mtitles("Original Specification" "Census Controls" ///
>       "Sibling Controls" "Sibling and Census Controls" ///
>       "Original Specification" "Census Controls" ///
>       "Sibling Controls" "Sibling and Census Controls") ///
>     mgroups("ELA" "Math", pattern(1 0 0 0 1 0 0 0) )
{res}{txt}(output written to {browse  `"/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/siblingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_acs_restr_smp_score.csv"'})

{com}. 
.   eststo clear
{txt}
{com}. 
. 
. ********** outcome VA spec test
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_og.ster
{txt}  3{com}.   eststo
{txt}  4{com}.   test _b[va_`outcome'_og] = 1
{txt}  5{com}.   matrix test_p = r(p)
{txt}  6{com}.   matrix rownames test_p = pvalue
{txt}  7{com}.   matrix colnames test_p = va_`outcome'_og
{txt}  8{com}.   estadd matrix test_p = test_p
{txt}  9{com}. 
.   // without sibling controls, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_acs.ster
{txt} 10{com}.   eststo
{txt} 11{com}.   test _b[va_`outcome'_acs] = 1
{txt} 12{com}.   matrix test_p = r(p)
{txt} 13{com}.   matrix rownames test_p = pvalue
{txt} 14{com}.   matrix colnames test_p = va_`outcome'_acs
{txt} 15{com}.   estadd matrix test_p = test_p
{txt} 16{com}. 
.   // with sibling controls, without acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_sib.ster
{txt} 17{com}.   eststo
{txt} 18{com}.   test _b[va_`outcome'_sib] = 1
{txt} 19{com}.   matrix test_p = r(p)
{txt} 20{com}.   matrix rownames test_p = pvalue
{txt} 21{com}.   matrix colnames test_p = va_`outcome'_sib
{txt} 22{com}.   estadd matrix test_p = test_p
{txt} 23{com}. 
.   // with both sibling controls and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_both.ster
{txt} 24{com}.   eststo
{txt} 25{com}.   test _b[va_`outcome'_both] = 1
{txt} 26{com}.   matrix test_p = r(p)
{txt} 27{com}.   matrix rownames test_p = pvalue
{txt} 28{com}.   matrix colnames test_p = va_`outcome'_both
{txt} 29{com}.   estadd matrix test_p = test_p
{txt} 30{com}. 
. {c )-}
{res}{txt}({res}est1{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_og = 1{p_end}

{txt}       F(  1,  1248) ={res}   12.63
{txt}{col 13}Prob > F ={res}    0.0004

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est2{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_acs = 1{p_end}

{txt}       F(  1,  1248) ={res}   15.08
{txt}{col 13}Prob > F ={res}    0.0001

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est3{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_sib = 1{p_end}

{txt}       F(  1,  1248) ={res}   12.39
{txt}{col 13}Prob > F ={res}    0.0004

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est4{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_both = 1{p_end}

{txt}       F(  1,  1248) ={res}   14.86
{txt}{col 13}Prob > F ={res}    0.0001

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est5{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_2year_og = 1{p_end}

{txt}       F(  1,  1248) ={res}    2.17
{txt}{col 13}Prob > F ={res}    0.1410

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est6{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_2year_acs = 1{p_end}

{txt}       F(  1,  1248) ={res}    0.51
{txt}{col 13}Prob > F ={res}    0.4758

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est7{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_2year_sib = 1{p_end}

{txt}       F(  1,  1248) ={res}    1.87
{txt}{col 13}Prob > F ={res}    0.1713

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est8{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_2year_both = 1{p_end}

{txt}       F(  1,  1248) ={res}    0.40
{txt}{col 13}Prob > F ={res}    0.5264

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est9{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_4year_og = 1{p_end}

{txt}       F(  1,  1248) ={res}   10.94
{txt}{col 13}Prob > F ={res}    0.0010

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est10{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_4year_acs = 1{p_end}

{txt}       F(  1,  1248) ={res}   11.34
{txt}{col 13}Prob > F ={res}    0.0008

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est11{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_4year_sib = 1{p_end}

{txt}       F(  1,  1248) ={res}   10.23
{txt}{col 13}Prob > F ={res}    0.0014

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est12{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_4year_both = 1{p_end}

{txt}       F(  1,  1248) ={res}   10.90
{txt}{col 13}Prob > F ={res}    0.0010

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}
{com}. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_acs_restr_smp_outcome.csv ///
>   , replace nonumbers  ///
>   cells(b(fmt(%5.3f) pvalue(test_p) star) se(fmt(%4.3f) par)) ///
>   title("Specification Tests for outcome VA on Sibling Census Restricted Sample") ///
>   mtitles("Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ) ///
>   mgroups("Overall Enrollment" "2 Year Enrollment" "4 Year Enrollment", pattern(1 0 0 0 1 0 0 0 1 0 0 0) )
{res}{txt}(output written to {browse  `"/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/siblingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_acs_restr_smp_outcome.csv"'})

{com}. 
. eststo clear
{txt}
{com}. 
. 
. 
. ********** deep knowledge outcome VA spec test
. foreach outcome in enr enr_2year enr_4year {c -(}
{txt}  2{com}.   // primary specification without sibling or acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_og_dk.ster
{txt}  3{com}.   eststo
{txt}  4{com}.   test _b[va_`outcome'_og_dk] = 1
{txt}  5{com}.   matrix test_p = r(p)
{txt}  6{com}.   matrix rownames test_p = pvalue
{txt}  7{com}.   matrix colnames test_p = va_`outcome'_og_dk
{txt}  8{com}.   estadd matrix test_p = test_p
{txt}  9{com}. 
.   // without sibling controls, with acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_acs_dk.ster
{txt} 10{com}.   eststo
{txt} 11{com}.   test _b[va_`outcome'_acs_dk] = 1
{txt} 12{com}.   matrix test_p = r(p)
{txt} 13{com}.   matrix rownames test_p = pvalue
{txt} 14{com}.   matrix colnames test_p = va_`outcome'_acs_dk
{txt} 15{com}.   estadd matrix test_p = test_p
{txt} 16{com}. 
.   // with sibling controls, without acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_sib_dk.ster
{txt} 17{com}.   eststo
{txt} 18{com}.   test _b[va_`outcome'_sib_dk] = 1
{txt} 19{com}.   matrix test_p = r(p)
{txt} 20{com}.   matrix rownames test_p = pvalue
{txt} 21{com}.   matrix colnames test_p = va_`outcome'_sib_dk
{txt} 22{com}.   estadd matrix test_p = test_p
{txt} 23{com}. 
.   // with both sibling controls and acs controls
.   estimates use ///
>     $vaprojdir/estimates/sib_acs_restr_smp/outcome_va/spec_test_`outcome'_both_dk.ster
{txt} 24{com}.   eststo
{txt} 25{com}.   test _b[va_`outcome'_both_dk] = 1
{txt} 26{com}.   matrix test_p = r(p)
{txt} 27{com}.   matrix rownames test_p = pvalue
{txt} 28{com}.   matrix colnames test_p = va_`outcome'_both_dk
{txt} 29{com}.   estadd matrix test_p = test_p
{txt} 30{com}. 
. {c )-}
{res}{txt}({res}est1{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_og_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    6.31
{txt}{col 13}Prob > F ={res}    0.0122

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est2{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_acs_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    8.26
{txt}{col 13}Prob > F ={res}    0.0041

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est3{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_sib_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    6.15
{txt}{col 13}Prob > F ={res}    0.0132

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est4{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_both_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    8.11
{txt}{col 13}Prob > F ={res}    0.0045

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est5{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_2year_og_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    1.02
{txt}{col 13}Prob > F ={res}    0.3133

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est6{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_2year_acs_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    0.21
{txt}{col 13}Prob > F ={res}    0.6499

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est7{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_2year_sib_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    0.87
{txt}{col 13}Prob > F ={res}    0.3498

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est8{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_2year_both_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    0.15
{txt}{col 13}Prob > F ={res}    0.6945

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est9{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_4year_og_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    7.37
{txt}{col 13}Prob > F ={res}    0.0067

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est10{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_4year_acs_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    6.71
{txt}{col 13}Prob > F ={res}    0.0097

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est11{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_4year_sib_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    7.56
{txt}{col 13}Prob > F ={res}    0.0061

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}({res}est12{txt} stored)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}va_enr_4year_both_dk = 1{p_end}

{txt}       F(  1,  1236) ={res}    6.72
{txt}{col 13}Prob > F ={res}    0.0096

{txt}added matrix:
             e(test_p) :  {res}1 x 1
{txt}
{com}. 
. 
. esttab using ///
>   $projdir/out/csv/siblingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_acs_restr_smp_outcome_dk.csv ///
>   , replace nonumbers  ///
>   cells(b(fmt(%5.3f) pvalue(test_p) star) se(fmt(%4.3f) par)) ///
>   title("Specification Tests for Deep Knowledge VA on Sibling Census Restricted Sample") ///
>   mtitles("Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ///
>     "Original Specification" "Census Controls" ///
>     "Sibling Controls" "Sibling and Census Controls" ) ///
>   mgroups("Overall Enrollment" "2 Year Enrollment" "4 Year Enrollment", pattern(1 0 0 0 1 0 0 0 1 0 0 0) )
{res}{txt}(output written to {browse  `"/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/csv/siblingvaregs/spec_test/sib_acs_restr_smp/spec_test_sib_acs_restr_smp_outcome_dk.csv"'})

{com}. 
. eststo clear
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:      0.72 /        1 =       0.7200
{txt}
{com}. 
. set trace off
{txt}
{com}. 
. //change directory back to my own personal directory
. cd $projdir
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs_spec_test_tab.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}19 Sep 2022, 15:15:34
{txt}{.-}
{smcl}
{txt}{sf}{ul off}