{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 Apr 2022, 23:03:52
{txt}
{com}. 
. /* change directory to common_core_va project directory for all value added
> do files because some called subroutines written by Matt may use relative file paths  */
. cd $vaprojdir
{res}/home/research/ca_ed_lab/projects/common_core_va
{txt}
{com}. 
. /* file path macros for datasets */
. include $projdir/do/share/siblingvaregs/vafilemacros.doh
{txt}
{com}. ********************************************************************************
. /* Macros for common core VA project folder file paths, and relevant datasets to make it possible
> to use Matt's doh files  */
. ********************************************************************************
. ********************************************************************************
. /* First written by Che Sun, 12/13/2021
> 1/27/2022: changed mattdofiles path to the do files folder in project folder
> after Matt updated the do files to reconcile file paths. Now direct run these
> do files from the $vaprojdir/do_files_sbac folder*/
. 
. /* to include this in do files:
> include $projdir/do/share/siblingvaregs/vafilemacros.doh
>  */
. 
.  local vaprojdofiles "$vaprojdir/do_files"
{txt}
{com}. 
. *** macros for my own datasets
. local va_dataset "$projdir/dta/common_core_va/va_dataset"
{txt}
{com}. local va_g11_dataset "$projdir/dta/common_core_va/va_g11_dataset"
{txt}
{com}. local va_g11_out_dataset "$projdir/dta/common_core_va/va_g11_out_dataset"
{txt}
{com}. local siblingxwalk "$projdir/dta/siblingxwalk/siblingpairxwalk"
{txt}
{com}. local ufamilyxwalk "$projdir/dta/siblingxwalk/ufamilyxwalk"
{txt}
{com}. local k12_postsecondary_out_merge "$projdir/dta/common_core_va/k12_postsecondary_out_merge"
{txt}
{com}. local sibling_out_xwalk "$projdir/dta/siblingxwalk/sibling_out_xwalk"
{txt}
{com}. {txt}
{com}. 
. //run Matt's do helper file to set the local macros for VA project
. include $vaprojdir/do_files/sbac/macros_va.doh
{txt}
{com}. /* CHANGE LOG
> 4/28/2022: Added macro for sibling controls  */
. 
. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local vaprojdofiles "$vaprojdir/do_files"
> local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. local sibling_controls
>         i.has_older_sibling_enr_2year
>         i.has_older_sibling_enr_4year
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. macro list
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_sibling_controls:{break}
{res}i.has_older_sibling_enr_2year         i.has_older_sibling_enr_4year
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files" local ca_ed_lab "/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}
{com}. 
. //startomg timer
. timer on 1
{txt}
{com}. 
. 
. ********************************************************************************
. 
. 
. 
. local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
{txt}
{com}. 
. foreach subject in ela math {c -(}
{txt}  2{com}.   // load the resctricted sample with sibling and acs controls
.   use $vaprojdir/data/va_samples/va_sib_acs_restr_smp.dta if touse_g11_`subject'==1, clear
{txt}  3{com}. 
.   ********************************************************************************
.   /* Primary test score va specification, no tfx, no peer fx, no sibling ctrl, no acs ctrl */
.   ********************************************************************************
.   vam sbac_`subject'_z_score ///
>     , teacher(school_id) year(year) class(school_id) ///
>     controls( ///
>       i.year ///
>       `school_controls' ///
>       `demographic_controls' ///
>       `ela_score_controls' ///
>       `math_score_controls' ///
>     ) ///
>     data(merge tv score_r) ///
>     driftlimit(`drift_limit') ///
>     estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_og.ster, replace)
{txt}  4{com}. 
.     // rename the va estimates and the test score residuals
.     rename tv va_`subject'_og
{txt}  5{com}.     rename score_r `subject'_r_og
{txt}  6{com}.     label var va_`subject'_og "``subject'_Str' VA OG Specification"
{txt}  7{com}.     label var `subject'_r_og "Score Residual from ``subject'_Str' VA OG Specification"
{txt}  8{com}. 
.     *******************
.     // specification test: regress score residuals on va estimates
.     reg `subject'_r_og va_`subject'_og, cluster(school_id)
{txt}  9{com}. 
.     // save spec test estimates
.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_va_`subject'_og.ster, replace
{txt} 10{com}. 
. 
. 
.     ********************************************************************************
.     /* Test score VA, no tfx, no peer fx, no sibling ctrl, with acs ctrl */
.     ********************************************************************************
. 
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `census_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_acs.ster, replace)
{txt} 11{com}. 
.     // rename va estimates and score residuals
.     rename tv va_`subject'_acs
{txt} 12{com}.     rename score_r `subject'_r_acs
{txt} 13{com}.     label var va_`subject'_acs "``subject'_Str' VA with Census Controls"
{txt} 14{com}.     label var `subject'_r_acs "Score Residual from ``subject'_Str' VA with Census Controls"
{txt} 15{com}. 
. 
.     *******************
.     // specification test: regress score residuals on va estimates
.     reg `subject'_r_acs va_`subject'_acs, cluster(school_id)
{txt} 16{com}. 
.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_acs.ster, replace
{txt} 17{com}. 
.     *******************
.     // forecast bias test for ACS leave out vars
. 
.     // difference in score residuals
.     gen `subject'_r_d_og_acs = `subject'_r_og - `subject'_r_acs
{txt} 18{com}.     // fb test
.     reg `subject'_r_d_og_acs va_`subject'_og, cluster(school_id)
{txt} 19{com}.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb_test_`subject'_acs_og.ster, replace
{txt} 20{com}. 
. 
. 
.     ********************************************************************************
.     /* Test score VA, no tfx, no peer fx, with sibling ctrl, no acs ctrl */
.     ********************************************************************************
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `sibling_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_sib.ster, replace)
{txt} 21{com}. 
.     //rename va estimates sand score residuals
.     rename tv va_`subject'_sib
{txt} 22{com}.     rename score_r `subject'_r_sib
{txt} 23{com}.     label var va_`subject'_sib "``subject'_Str' VA with Sibling Controls"
{txt} 24{com}.     label var `subject'_r_sib "Score Residual from ``subject'_Str' VA with Sibling Controls"
{txt} 25{com}. 
.     *******************
.     // specification test: regress score residuals on va estimates
.     reg `subject'_r_sib va_`subject'_sib, cluster(school_id)
{txt} 26{com}. 
.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_sib.ster, replace
{txt} 27{com}. 
. 
.     *******************
.     // forecast bias test for sibling controls as leave out vars
.     // difference in score residuals
.     gen `subject'_r_d_og_sib = `subject'_r_og - `subject'_r_sib
{txt} 28{com}.     // fb test
.     reg `subject'_r_d_og_sib va_`subject'_og, cluster(school_id)
{txt} 29{com}.     estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb_test_`subject'_sib_og.ster, replace
{txt} 30{com}. 
. 
. 
. 
.     ********************************************************************************
.     /* Test score VA, no tfx, no peer fx, with sibling ctrl, with acs ctrl */
.     ********************************************************************************
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `sibling_controls' ///
>         `census_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sib_acs_restr_smp/test_score_va/vam_`subject'_sib_acs.ster, replace)
{txt} 31{com}. 
.       //rename va estimates sand score residuals
.       rename tv va_`subject'_both
{txt} 32{com}.       rename score_r `subject'_r_both
{txt} 33{com}.       label var va_`subject'_both "``subject'_Str' VA with Sibling and Census Controls"
{txt} 34{com}.       label var `subject'_r_both "Score Residual from ``subject'_Str' VA with Sibling and Census Controls"
{txt} 35{com}. 
.       *******************
.       // specification test: regress score residuals on va estimates
.       reg `subject'_r_both va_`subject'_both, cluster(school_id)
{txt} 36{com}. 
.       estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/spec_test_`subject'_both.ster, replace
{txt} 37{com}. 
. 
.       *******************
.       // forecast bias test for sibling controls as leave out vars against specification with only census controls
.       // difference in score residuals with census controls and residuals with both census and sibling controls
.       gen `subject'_r_d_acs_both = `subject'_r_acs - `subject'_r_both
{txt} 38{com}.       // fb test
.       reg `subject'_r_d_acs_both va_`subject'_acs, cluster(school_id)
{txt} 39{com}.       //naming convention: forecast bias test for leave out variables being sibling controls, against VA with only acs controls
.       estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb_test_`subject'_sib_acs.ster, replace
{txt} 40{com}. 
. 
.       *******************
.       // forecast bias test for census controls as leave out vars against specification with only sibling controls
.       // difference in score residuals with census controls and residuals with both census and sibling controls
.       gen `subject'_r_d_sib_both = `subject'_r_sib - `subject'_r_both
{txt} 41{com}.       // fb test
.       reg `subject'_r_d_sib_both va_`subject'_sib, cluster(school_id)
{txt} 42{com}.       estimates save $vaprojdir/estimates/sib_acs_restr_smp/test_score_va/fb_test_`subject'_acs_sib.ster, replace
{txt} 43{com}. 
. 
. 
. 
. 
.       ********* Save VA estimates
.       collapse (firstnm) va_* ///
>         (mean) `subject'* ///
>         (sum) n_g11_`subject' = touse_g11_`subject' ///
>         , by(school_id cdscode grade year)
{txt} 44{com}.       // save to VA project data folder
.       save $vaprojdir/data/sib_acs_restr_smp/test_score_va/va_`subject'_sib_acs.dta, replace
{txt} 45{com}. 
. 
. 
. {c )-}
{txt}(Restrcited Test Score VA Sample with Sibling Controls and Census Controls)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   419,150
{txt}{hline 13}{c +}{hline 34}   F(36, 419113)   = {res} 17604.79
{txt}       Model {c |} {res} 201982.178        36  5610.61606   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 133570.564   419,113  .318698213   {txt}R-squared       ={res}    0.6019
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6019
{txt}       Total {c |} {res} 335552.742   419,149  .800557182   {txt}Root MSE        =   {res} .56453

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0513306{col 26}{space 2} .0035087{col 37}{space 1}   14.63{col 46}{space 3}0.000{col 54}{space 4} .0444536{col 67}{space 3} .0582075
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0677666{col 26}{space 2} .0034889{col 37}{space 1}   19.42{col 46}{space 3}0.000{col 54}{space 4} .0609285{col 67}{space 3} .0746048
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0707004{col 26}{space 2} .0035257{col 37}{space 1}  -20.05{col 46}{space 3}0.000{col 54}{space 4}-.0776106{col 67}{space 3}-.0637901
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003448{col 26}{space 2} 6.34e-06{col 37}{space 1}  -54.40{col 46}{space 3}0.000{col 54}{space 4}-.0003572{col 67}{space 3}-.0003324
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0894814{col 26}{space 2} .0017839{col 37}{space 1}  -50.16{col 46}{space 3}0.000{col 54}{space 4}-.0929779{col 67}{space 3} -.085985
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1035625{col 26}{space 2} .0027924{col 37}{space 1}   37.09{col 46}{space 3}0.000{col 54}{space 4} .0980896{col 67}{space 3} .1090355
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} -.004625{col 26}{space 2} .0024525{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-.0094318{col 67}{space 3} .0001819
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1439781{col 26}{space 2} .0049615{col 37}{space 1}  -29.02{col 46}{space 3}0.000{col 54}{space 4}-.1537024{col 67}{space 3}-.1342537
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}  .005861{col 26}{space 2} .0053353{col 37}{space 1}    1.10{col 46}{space 3}0.272{col 54}{space 4} -.004596{col 67}{space 3} .0163179
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0313657{col 26}{space 2} .0020702{col 37}{space 1}  -15.15{col 46}{space 3}0.000{col 54}{space 4}-.0354232{col 67}{space 3}-.0273081
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2217137{col 26}{space 2} .0047794{col 37}{space 1}  -46.39{col 46}{space 3}0.000{col 54}{space 4}-.2310813{col 67}{space 3}-.2123462
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1890186{col 26}{space 2} .0047307{col 37}{space 1}  -39.96{col 46}{space 3}0.000{col 54}{space 4}-.1982907{col 67}{space 3}-.1797465
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6080398{col 26}{space 2} .0035609{col 37}{space 1}  170.75{col 46}{space 3}0.000{col 54}{space 4} .6010605{col 67}{space 3} .6150191
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5874086{col 26}{space 2}  .003433{col 37}{space 1}  171.11{col 46}{space 3}0.000{col 54}{space 4} .5806801{col 67}{space 3} .5941371
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5750626{col 26}{space 2} .0035896{col 37}{space 1}  160.20{col 46}{space 3}0.000{col 54}{space 4} .5680271{col 67}{space 3} .5820982
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .571206{col 26}{space 2} .0044809{col 37}{space 1}  127.48{col 46}{space 3}0.000{col 54}{space 4} .5624236{col 67}{space 3} .5799884
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0007371{col 26}{space 2} .0019101{col 37}{space 1}    0.39{col 46}{space 3}0.700{col 54}{space 4}-.0030067{col 67}{space 3} .0044808
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0152787{col 26}{space 2} .0018993{col 37}{space 1}   -8.04{col 46}{space 3}0.000{col 54}{space 4}-.0190013{col 67}{space 3}-.0115562
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0116161{col 26}{space 2} .0019103{col 37}{space 1}   -6.08{col 46}{space 3}0.000{col 54}{space 4}-.0153602{col 67}{space 3} -.007872
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0109026{col 26}{space 2} .0019219{col 37}{space 1}    5.67{col 46}{space 3}0.000{col 54}{space 4} .0071358{col 67}{space 3} .0146694
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275615{col 26}{space 2} .0008616{col 37}{space 1}  -31.99{col 46}{space 3}0.000{col 54}{space 4}-.0292501{col 67}{space 3}-.0258729
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0217075{col 26}{space 2} .0007834{col 37}{space 1}  -27.71{col 46}{space 3}0.000{col 54}{space 4}-.0232429{col 67}{space 3} -.020172
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0237583{col 26}{space 2} .0007561{col 37}{space 1}  -31.42{col 46}{space 3}0.000{col 54}{space 4}-.0252403{col 67}{space 3}-.0222763
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0290696{col 26}{space 2}  .001261{col 37}{space 1}  -23.05{col 46}{space 3}0.000{col 54}{space 4}-.0315411{col 67}{space 3}-.0265982
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1681613{col 26}{space 2} .0035346{col 37}{space 1}   47.58{col 46}{space 3}0.000{col 54}{space 4} .1612335{col 67}{space 3} .1750891
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1891168{col 26}{space 2} .0035526{col 37}{space 1}   53.23{col 46}{space 3}0.000{col 54}{space 4} .1821538{col 67}{space 3} .1960797
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1935584{col 26}{space 2} .0036904{col 37}{space 1}   52.45{col 46}{space 3}0.000{col 54}{space 4} .1863253{col 67}{space 3} .2007915
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2444169{col 26}{space 2} .0045075{col 37}{space 1}   54.22{col 46}{space 3}0.000{col 54}{space 4} .2355825{col 67}{space 3} .2532514
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0037122{col 26}{space 2} .0023868{col 37}{space 1}   -1.56{col 46}{space 3}0.120{col 54}{space 4}-.0083903{col 67}{space 3}  .000966
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0136307{col 26}{space 2} .0022987{col 37}{space 1}   -5.93{col 46}{space 3}0.000{col 54}{space 4} -.018136{col 67}{space 3}-.0091254
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0062151{col 26}{space 2} .0023613{col 37}{space 1}   -2.63{col 46}{space 3}0.008{col 54}{space 4}-.0108432{col 67}{space 3}-.0015869
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0041479{col 26}{space 2} .0018842{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .0004549{col 67}{space 3}  .007841
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0030899{col 26}{space 2} .0009656{col 37}{space 1}   -3.20{col 46}{space 3}0.001{col 54}{space 4}-.0049824{col 67}{space 3}-.0011974
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0032555{col 26}{space 2}   .00101{col 37}{space 1}   -3.22{col 46}{space 3}0.001{col 54}{space 4}-.0052351{col 67}{space 3} -.001276
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0074872{col 26}{space 2} .0009984{col 37}{space 1}   -7.50{col 46}{space 3}0.000{col 54}{space 4}-.0094441{col 67}{space 3}-.0055302
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0052637{col 26}{space 2} .0012425{col 37}{space 1}   -4.24{col 46}{space 3}0.000{col 54}{space 4} -.007699{col 67}{space 3}-.0028284
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.285325{col 26}{space 2} .0388184{col 37}{space 1}   58.87{col 46}{space 3}0.000{col 54}{space 4} 2.209242{col 67}{space 3} 2.361408
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_ela_og.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.56453362 .17854489 .53555573 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res} .018591904   .5402730016          3424{txt}  {c |}
  2 {c |}  {res}.0136315214   .3903335166          2228{txt}  {c |}
  3 {c |}  {res}.0080039713   .2168298389          1067{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res} .018591904{txt}  {c |}
  2 {c |}  {res}.0136315214{txt}  {c |}
  3 {c |}  {res}.0136315214{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   418,255
                                                {txt}F(1, 1245)        =  {res}  1450.38
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0375
                                                {txt}Root MSE          =    {res} .55366

{txt}{ralign 78:(Std. err. adjusted for {res:1,246} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    ela_r_og{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} 1.001469{col 26}{space 2} .0262965{col 37}{space 1}   38.08{col 46}{space 3}0.000{col 54}{space 4} .9498789{col 67}{space 3} 1.053059
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0006557{col 26}{space 2} .0013915{col 37}{space 1}   -0.47{col 46}{space 3}0.638{col 54}{space 4}-.0033856{col 67}{space 3} .0020742
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_va_ela_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   419,150
{txt}{hline 13}{c +}{hline 34}   F(43, 419106)   = {res} 14774.65
{txt}       Model {c |} {res} 202178.292        43  4701.82075   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  133374.45   419,106  .318235601   {txt}R-squared       ={res}    0.6025
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6025
{txt}       Total {c |} {res} 335552.742   419,149  .800557182   {txt}Root MSE        =   {res} .56412

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0508786{col 26}{space 2} .0035085{col 37}{space 1}   14.50{col 46}{space 3}0.000{col 54}{space 4} .0440022{col 67}{space 3} .0577551
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0663565{col 26}{space 2} .0034962{col 37}{space 1}   18.98{col 46}{space 3}0.000{col 54}{space 4}  .059504{col 67}{space 3} .0732089
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0718314{col 26}{space 2} .0035424{col 37}{space 1}  -20.28{col 46}{space 3}0.000{col 54}{space 4}-.0787744{col 67}{space 3}-.0648885
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003412{col 26}{space 2} 6.34e-06{col 37}{space 1}  -53.77{col 46}{space 3}0.000{col 54}{space 4}-.0003536{col 67}{space 3}-.0003287
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0896237{col 26}{space 2}  .001783{col 37}{space 1}  -50.26{col 46}{space 3}0.000{col 54}{space 4}-.0931184{col 67}{space 3}-.0861291
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0863386{col 26}{space 2} .0031564{col 37}{space 1}   27.35{col 46}{space 3}0.000{col 54}{space 4} .0801521{col 67}{space 3} .0925251
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0112249{col 26}{space 2} .0027246{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-.0165649{col 67}{space 3}-.0058848
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1294282{col 26}{space 2} .0052005{col 37}{space 1}  -24.89{col 46}{space 3}0.000{col 54}{space 4} -.139621{col 67}{space 3}-.1192354
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0041024{col 26}{space 2} .0053515{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}-.0063864{col 67}{space 3} .0145912
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0265453{col 26}{space 2} .0022155{col 37}{space 1}  -11.98{col 46}{space 3}0.000{col 54}{space 4}-.0308875{col 67}{space 3} -.022203
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2229366{col 26}{space 2} .0047777{col 37}{space 1}  -46.66{col 46}{space 3}0.000{col 54}{space 4}-.2323007{col 67}{space 3}-.2135725
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1920399{col 26}{space 2} .0047338{col 37}{space 1}  -40.57{col 46}{space 3}0.000{col 54}{space 4}-.2013181{col 67}{space 3}-.1827617
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6065969{col 26}{space 2} .0035619{col 37}{space 1}  170.30{col 46}{space 3}0.000{col 54}{space 4} .5996156{col 67}{space 3} .6135782
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5861217{col 26}{space 2} .0034342{col 37}{space 1}  170.67{col 46}{space 3}0.000{col 54}{space 4} .5793907{col 67}{space 3} .5928527
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5736976{col 26}{space 2} .0035923{col 37}{space 1}  159.70{col 46}{space 3}0.000{col 54}{space 4} .5666569{col 67}{space 3} .5807384
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5702656{col 26}{space 2} .0044795{col 37}{space 1}  127.31{col 46}{space 3}0.000{col 54}{space 4}  .561486{col 67}{space 3} .5790452
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0005273{col 26}{space 2}  .001909{col 37}{space 1}    0.28{col 46}{space 3}0.782{col 54}{space 4}-.0032143{col 67}{space 3} .0042689
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0152824{col 26}{space 2} .0018983{col 37}{space 1}   -8.05{col 46}{space 3}0.000{col 54}{space 4}-.0190031{col 67}{space 3}-.0115618
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0116967{col 26}{space 2} .0019094{col 37}{space 1}   -6.13{col 46}{space 3}0.000{col 54}{space 4} -.015439{col 67}{space 3}-.0079544
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0110274{col 26}{space 2} .0019207{col 37}{space 1}    5.74{col 46}{space 3}0.000{col 54}{space 4}  .007263{col 67}{space 3} .0147918
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.027554{col 26}{space 2}  .000861{col 37}{space 1}  -32.00{col 46}{space 3}0.000{col 54}{space 4}-.0292415{col 67}{space 3}-.0258666
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0218117{col 26}{space 2} .0007829{col 37}{space 1}  -27.86{col 46}{space 3}0.000{col 54}{space 4}-.0233461{col 67}{space 3}-.0202773
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0237607{col 26}{space 2} .0007557{col 37}{space 1}  -31.44{col 46}{space 3}0.000{col 54}{space 4}-.0252417{col 67}{space 3}-.0222796
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0291604{col 26}{space 2} .0012601{col 37}{space 1}  -23.14{col 46}{space 3}0.000{col 54}{space 4}-.0316301{col 67}{space 3}-.0266906
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .167492{col 26}{space 2} .0035325{col 37}{space 1}   47.42{col 46}{space 3}0.000{col 54}{space 4} .1605685{col 67}{space 3} .1744155
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1884553{col 26}{space 2} .0035503{col 37}{space 1}   53.08{col 46}{space 3}0.000{col 54}{space 4} .1814967{col 67}{space 3} .1954138
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1923726{col 26}{space 2} .0036882{col 37}{space 1}   52.16{col 46}{space 3}0.000{col 54}{space 4} .1851438{col 67}{space 3} .1996014
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2435706{col 26}{space 2} .0045058{col 37}{space 1}   54.06{col 46}{space 3}0.000{col 54}{space 4} .2347394{col 67}{space 3} .2524019
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0039319{col 26}{space 2} .0023857{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-.0086078{col 67}{space 3}  .000744
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0139847{col 26}{space 2} .0022974{col 37}{space 1}   -6.09{col 46}{space 3}0.000{col 54}{space 4}-.0184876{col 67}{space 3}-.0094818
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0066104{col 26}{space 2} .0023598{col 37}{space 1}   -2.80{col 46}{space 3}0.005{col 54}{space 4}-.0112356{col 67}{space 3}-.0019853
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0033926{col 26}{space 2} .0018837{col 37}{space 1}    1.80{col 46}{space 3}0.072{col 54}{space 4}-.0002994{col 67}{space 3} .0070845
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.003157{col 26}{space 2}  .000965{col 37}{space 1}   -3.27{col 46}{space 3}0.001{col 54}{space 4}-.0050484{col 67}{space 3}-.0012657
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0032924{col 26}{space 2} .0010093{col 37}{space 1}   -3.26{col 46}{space 3}0.001{col 54}{space 4}-.0052706{col 67}{space 3}-.0013142
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0074545{col 26}{space 2} .0009978{col 37}{space 1}   -7.47{col 46}{space 3}0.000{col 54}{space 4}  -.00941{col 67}{space 3}-.0054989
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0056373{col 26}{space 2} .0012418{col 37}{space 1}   -4.54{col 46}{space 3}0.000{col 54}{space 4}-.0080712{col 67}{space 3}-.0032033
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2} .0009579{col 26}{space 2} .0000665{col 37}{space 1}   14.41{col 46}{space 3}0.000{col 54}{space 4} .0008276{col 67}{space 3} .0010883
{txt}eth_hispan~t {c |}{col 14}{res}{space 2} .0007006{col 26}{space 2}  .000066{col 37}{space 1}   10.62{col 46}{space 3}0.000{col 54}{space 4} .0005712{col 67}{space 3} .0008299
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0014325{col 26}{space 2} .0001231{col 37}{space 1}  -11.64{col 46}{space 3}0.000{col 54}{space 4}-.0016737{col 67}{space 3}-.0011914
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-.1049191{col 26}{space 2} .1764714{col 37}{space 1}   -0.59{col 46}{space 3}0.552{col 54}{space 4}-.4507977{col 67}{space 3} .2409596
{txt}educ~us_prop {c |}{col 14}{res}{space 2} .5614318{col 26}{space 2} .1661113{col 37}{space 1}    3.38{col 46}{space 3}0.001{col 54}{space 4} .2358586{col 67}{space 3}  .887005
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0000189{col 26}{space 2} .0001012{col 37}{space 1}   -0.19{col 46}{space 3}0.852{col 54}{space 4}-.0002171{col 67}{space 3} .0001794
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 3.38e-07{col 26}{space 2} 4.68e-08{col 37}{space 1}    7.22{col 46}{space 3}0.000{col 54}{space 4} 2.46e-07{col 67}{space 3} 4.29e-07
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.205301{col 26}{space 2} .0391855{col 37}{space 1}   56.28{col 46}{space 3}0.000{col 54}{space 4} 2.128498{col 67}{space 3} 2.282103
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_ela_acs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.56412375 .17697463 .53564501 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0180442026   .5333601439          3424{txt}  {c |}
  2 {c |}  {res}.0131181648   .3814426439          2228{txt}  {c |}
  3 {c |}  {res}.0076938894    .210511439          1067{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0180442026{txt}  {c |}
  2 {c |}  {res}.0131181648{txt}  {c |}
  3 {c |}  {res}.0131181648{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   418,255
                                                {txt}F(1, 1245)        =  {res}  1373.25
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0360
                                                {txt}Root MSE          =    {res} .55367

{txt}{ralign 78:(Std. err. adjusted for {res:1,246} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   ela_r_acs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_ela_acs {c |}{col 14}{res}{space 2} 1.002156{col 26}{space 2} .0270433{col 37}{space 1}   37.06{col 46}{space 3}0.000{col 54}{space 4} .9491008{col 67}{space 3} 1.055212
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0004872{col 26}{space 2} .0014002{col 37}{space 1}   -0.35{col 46}{space 3}0.728{col 54}{space 4}-.0032343{col 67}{space 3} .0022599
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_ela_acs.ster} saved

Linear regression                               Number of obs     = {res}   418,255
                                                {txt}F(1, 1245)        =  {res}    34.29
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0134
                                                {txt}Root MSE          =    {res} .02149

{txt}{ralign 78:(Std. err. adjusted for {res:1,246} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}ela_r_d_og~s{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .0229451{col 26}{space 2} .0039183{col 37}{space 1}    5.86{col 46}{space 3}0.000{col 54}{space 4} .0152578{col 67}{space 3} .0306323
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.01e-06{col 26}{space 2} .0005723{col 37}{space 1}   -0.01{col 46}{space 3}0.993{col 54}{space 4}-.0011278{col 67}{space 3} .0011178
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_ela_acs_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   419,150
{txt}{hline 13}{c +}{hline 34}   F(38, 419111)   = {res} 16686.61
{txt}       Model {c |} {res} 202022.961        38  5316.39371   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 133529.781   419,111  .318602425   {txt}R-squared       ={res}    0.6021
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6020
{txt}       Total {c |} {res} 335552.742   419,149  .800557182   {txt}Root MSE        =   {res} .56445

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0512328{col 26}{space 2} .0035084{col 37}{space 1}   14.60{col 46}{space 3}0.000{col 54}{space 4} .0443565{col 67}{space 3} .0581091
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .067487{col 26}{space 2} .0034893{col 37}{space 1}   19.34{col 46}{space 3}0.000{col 54}{space 4} .0606481{col 67}{space 3} .0743259
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0708505{col 26}{space 2} .0035274{col 37}{space 1}  -20.09{col 46}{space 3}0.000{col 54}{space 4}-.0777641{col 67}{space 3}-.0639369
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003442{col 26}{space 2} 6.34e-06{col 37}{space 1}  -54.30{col 46}{space 3}0.000{col 54}{space 4}-.0003566{col 67}{space 3}-.0003318
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0895274{col 26}{space 2} .0017837{col 37}{space 1}  -50.19{col 46}{space 3}0.000{col 54}{space 4}-.0930233{col 67}{space 3}-.0860315
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1032017{col 26}{space 2} .0027932{col 37}{space 1}   36.95{col 46}{space 3}0.000{col 54}{space 4} .0977271{col 67}{space 3} .1086762
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0041307{col 26}{space 2} .0024527{col 37}{space 1}   -1.68{col 46}{space 3}0.092{col 54}{space 4}-.0089379{col 67}{space 3} .0006765
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1439642{col 26}{space 2} .0049607{col 37}{space 1}  -29.02{col 46}{space 3}0.000{col 54}{space 4}-.1536871{col 67}{space 3}-.1342413
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0061929{col 26}{space 2} .0053346{col 37}{space 1}    1.16{col 46}{space 3}0.246{col 54}{space 4}-.0042628{col 67}{space 3} .0166485
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0313438{col 26}{space 2} .0020702{col 37}{space 1}  -15.14{col 46}{space 3}0.000{col 54}{space 4}-.0354014{col 67}{space 3}-.0272862
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2215168{col 26}{space 2} .0047788{col 37}{space 1}  -46.35{col 46}{space 3}0.000{col 54}{space 4} -.230883{col 67}{space 3}-.2121506
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1888649{col 26}{space 2} .0047302{col 37}{space 1}  -39.93{col 46}{space 3}0.000{col 54}{space 4} -.198136{col 67}{space 3}-.1795938
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .607691{col 26}{space 2} .0035606{col 37}{space 1}  170.67{col 46}{space 3}0.000{col 54}{space 4} .6007123{col 67}{space 3} .6146696
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5870993{col 26}{space 2} .0034327{col 37}{space 1}  171.03{col 46}{space 3}0.000{col 54}{space 4} .5803712{col 67}{space 3} .5938273
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .574653{col 26}{space 2} .0035896{col 37}{space 1}  160.09{col 46}{space 3}0.000{col 54}{space 4} .5676175{col 67}{space 3} .5816885
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5707023{col 26}{space 2} .0044805{col 37}{space 1}  127.38{col 46}{space 3}0.000{col 54}{space 4} .5619207{col 67}{space 3} .5794838
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0007046{col 26}{space 2} .0019098{col 37}{space 1}    0.37{col 46}{space 3}0.712{col 54}{space 4}-.0030386{col 67}{space 3} .0044478
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.015328{col 26}{space 2} .0018991{col 37}{space 1}   -8.07{col 46}{space 3}0.000{col 54}{space 4}-.0190502{col 67}{space 3}-.0116059
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0116168{col 26}{space 2} .0019101{col 37}{space 1}   -6.08{col 46}{space 3}0.000{col 54}{space 4}-.0153605{col 67}{space 3}-.0078731
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0108679{col 26}{space 2} .0019216{col 37}{space 1}    5.66{col 46}{space 3}0.000{col 54}{space 4} .0071016{col 67}{space 3} .0146342
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275152{col 26}{space 2} .0008614{col 37}{space 1}  -31.94{col 46}{space 3}0.000{col 54}{space 4}-.0292036{col 67}{space 3}-.0258269
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0216731{col 26}{space 2} .0007833{col 37}{space 1}  -27.67{col 46}{space 3}0.000{col 54}{space 4}-.0232084{col 67}{space 3}-.0201379
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0237217{col 26}{space 2} .0007561{col 37}{space 1}  -31.38{col 46}{space 3}0.000{col 54}{space 4}-.0252035{col 67}{space 3}-.0222399
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0289826{col 26}{space 2} .0012608{col 37}{space 1}  -22.99{col 46}{space 3}0.000{col 54}{space 4}-.0314538{col 67}{space 3}-.0265114
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1676711{col 26}{space 2} .0035344{col 37}{space 1}   47.44{col 46}{space 3}0.000{col 54}{space 4} .1607439{col 67}{space 3} .1745984
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1884233{col 26}{space 2} .0035526{col 37}{space 1}   53.04{col 46}{space 3}0.000{col 54}{space 4} .1814602{col 67}{space 3} .1953863
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .192968{col 26}{space 2} .0036903{col 37}{space 1}   52.29{col 46}{space 3}0.000{col 54}{space 4} .1857352{col 67}{space 3} .2002007
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2436004{col 26}{space 2} .0045074{col 37}{space 1}   54.04{col 46}{space 3}0.000{col 54}{space 4} .2347661{col 67}{space 3} .2524347
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0037419{col 26}{space 2} .0023865{col 37}{space 1}   -1.57{col 46}{space 3}0.117{col 54}{space 4}-.0084194{col 67}{space 3} .0009356
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0136762{col 26}{space 2} .0022983{col 37}{space 1}   -5.95{col 46}{space 3}0.000{col 54}{space 4}-.0181809{col 67}{space 3}-.0091715
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0062465{col 26}{space 2}  .002361{col 37}{space 1}   -2.65{col 46}{space 3}0.008{col 54}{space 4} -.010874{col 67}{space 3}-.0016191
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0040313{col 26}{space 2} .0018841{col 37}{space 1}    2.14{col 46}{space 3}0.032{col 54}{space 4} .0003385{col 67}{space 3} .0077241
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0030529{col 26}{space 2} .0009655{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4}-.0049452{col 67}{space 3}-.0011607
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0031828{col 26}{space 2} .0010098{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-.0051621{col 67}{space 3}-.0012036
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0074389{col 26}{space 2} .0009983{col 37}{space 1}   -7.45{col 46}{space 3}0.000{col 54}{space 4}-.0093956{col 67}{space 3}-.0054823
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0051647{col 26}{space 2} .0012424{col 37}{space 1}   -4.16{col 46}{space 3}0.000{col 54}{space 4}-.0075997{col 67}{space 3}-.0027296
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0173819{col 26}{space 2} .0034266{col 37}{space 1}   -5.07{col 46}{space 3}0.000{col 54}{space 4}-.0240979{col 67}{space 3}-.0106659
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0386199{col 26}{space 2} .0037092{col 37}{space 1}   10.41{col 46}{space 3}0.000{col 54}{space 4} .0313501{col 67}{space 3} .0458898
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.280788{col 26}{space 2} .0388275{col 37}{space 1}   58.74{col 46}{space 3}0.000{col 54}{space 4} 2.204687{col 67}{space 3} 2.356889
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_ela_sib.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.56444878 .17843777 .535502 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0185578514   .5399392397          3424{txt}  {c |}
  2 {c |}  {res}.0135955359   .3897557293          2228{txt}  {c |}
  3 {c |}  {res}.0079773741   .2163306074          1067{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0185578514{txt}  {c |}
  2 {c |}  {res}.0135955359{txt}  {c |}
  3 {c |}  {res}.0135955359{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   418,255
                                                {txt}F(1, 1245)        =  {res}  1446.37
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0374
                                                {txt}Root MSE          =    {res}  .5536

{txt}{ralign 78:(Std. err. adjusted for {res:1,246} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   ela_r_sib{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_ela_sib {c |}{col 14}{res}{space 2} 1.001452{col 26}{space 2} .0263324{col 37}{space 1}   38.03{col 46}{space 3}0.000{col 54}{space 4}  .949791{col 67}{space 3} 1.053113
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0006491{col 26}{space 2} .0013924{col 37}{space 1}   -0.47{col 46}{space 3}0.641{col 54}{space 4}-.0033808{col 67}{space 3} .0020826
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_ela_sib.ster} saved

Linear regression                               Number of obs     = {res}   418,255
                                                {txt}F(1, 1245)        =  {res}    14.91
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res} .00986

{txt}{ralign 78:(Std. err. adjusted for {res:1,246} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}ela_r_d_og~b{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}va_ela_og {c |}{col 14}{res}{space 2} .0010096{col 26}{space 2} .0002614{col 37}{space 1}    3.86{col 46}{space 3}0.000{col 54}{space 4} .0004967{col 67}{space 3} .0015225
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.19e-06{col 26}{space 2} .0000309{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4}-.0000617{col 67}{space 3} .0000593
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_ela_sib_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   419,150
{txt}{hline 13}{c +}{hline 34}   F(45, 419104)   = {res} 14124.93
{txt}       Model {c |} {res} 202218.075        45  4493.73501   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 133334.667   419,104  .318142196   {txt}R-squared       ={res}    0.6026
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6026
{txt}       Total {c |} {res} 335552.742   419,149  .800557182   {txt}Root MSE        =   {res} .56404

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0507969{col 26}{space 2} .0035081{col 37}{space 1}   14.48{col 46}{space 3}0.000{col 54}{space 4}  .043921{col 67}{space 3} .0576727
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0660955{col 26}{space 2} .0034966{col 37}{space 1}   18.90{col 46}{space 3}0.000{col 54}{space 4} .0592423{col 67}{space 3} .0729488
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0719721{col 26}{space 2} .0035441{col 37}{space 1}  -20.31{col 46}{space 3}0.000{col 54}{space 4}-.0789185{col 67}{space 3}-.0650257
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003405{col 26}{space 2} 6.35e-06{col 37}{space 1}  -53.66{col 46}{space 3}0.000{col 54}{space 4} -.000353{col 67}{space 3}-.0003281
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0896696{col 26}{space 2} .0017828{col 37}{space 1}  -50.30{col 46}{space 3}0.000{col 54}{space 4}-.0931638{col 67}{space 3}-.0861754
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .0858335{col 26}{space 2} .0031572{col 37}{space 1}   27.19{col 46}{space 3}0.000{col 54}{space 4} .0796454{col 67}{space 3} .0920216
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0107237{col 26}{space 2} .0027246{col 37}{space 1}   -3.94{col 46}{space 3}0.000{col 54}{space 4}-.0160639{col 67}{space 3}-.0053835
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1294031{col 26}{space 2} .0051997{col 37}{space 1}  -24.89{col 46}{space 3}0.000{col 54}{space 4}-.1395944{col 67}{space 3}-.1192118
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0043841{col 26}{space 2} .0053508{col 37}{space 1}    0.82{col 46}{space 3}0.413{col 54}{space 4}-.0061033{col 67}{space 3} .0148716
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2} -.026598{col 26}{space 2} .0022154{col 37}{space 1}  -12.01{col 46}{space 3}0.000{col 54}{space 4}-.0309402{col 67}{space 3}-.0222559
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2} -.222758{col 26}{space 2}  .004777{col 37}{space 1}  -46.63{col 46}{space 3}0.000{col 54}{space 4}-.2321208{col 67}{space 3}-.2133952
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1918808{col 26}{space 2} .0047333{col 37}{space 1}  -40.54{col 46}{space 3}0.000{col 54}{space 4} -.201158{col 67}{space 3}-.1826036
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6062497{col 26}{space 2} .0035616{col 37}{space 1}  170.22{col 46}{space 3}0.000{col 54}{space 4}  .599269{col 67}{space 3} .6132304
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5858179{col 26}{space 2}  .003434{col 37}{space 1}  170.59{col 46}{space 3}0.000{col 54}{space 4} .5790874{col 67}{space 3} .5925484
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .573308{col 26}{space 2} .0035922{col 37}{space 1}  159.60{col 46}{space 3}0.000{col 54}{space 4} .5662673{col 67}{space 3} .5803486
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5697764{col 26}{space 2}  .004479{col 37}{space 1}  127.21{col 46}{space 3}0.000{col 54}{space 4} .5609976{col 67}{space 3} .5785552
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0005039{col 26}{space 2} .0019088{col 37}{space 1}    0.26{col 46}{space 3}0.792{col 54}{space 4}-.0032372{col 67}{space 3}  .004245
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0153211{col 26}{space 2} .0018981{col 37}{space 1}   -8.07{col 46}{space 3}0.000{col 54}{space 4}-.0190413{col 67}{space 3}-.0116009
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0116844{col 26}{space 2} .0019091{col 37}{space 1}   -6.12{col 46}{space 3}0.000{col 54}{space 4}-.0154263{col 67}{space 3}-.0079425
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0110008{col 26}{space 2} .0019204{col 37}{space 1}    5.73{col 46}{space 3}0.000{col 54}{space 4} .0072369{col 67}{space 3} .0147647
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275082{col 26}{space 2} .0008608{col 37}{space 1}  -31.96{col 46}{space 3}0.000{col 54}{space 4}-.0291955{col 67}{space 3} -.025821
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0217778{col 26}{space 2} .0007828{col 37}{space 1}  -27.82{col 46}{space 3}0.000{col 54}{space 4} -.023312{col 67}{space 3}-.0202436
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0237268{col 26}{space 2} .0007556{col 37}{space 1}  -31.40{col 46}{space 3}0.000{col 54}{space 4}-.0252077{col 67}{space 3}-.0222459
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0290728{col 26}{space 2} .0012599{col 37}{space 1}  -23.07{col 46}{space 3}0.000{col 54}{space 4}-.0315423{col 67}{space 3}-.0266034
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1670175{col 26}{space 2} .0035322{col 37}{space 1}   47.28{col 46}{space 3}0.000{col 54}{space 4} .1600944{col 67}{space 3} .1739405
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .187779{col 26}{space 2} .0035504{col 37}{space 1}   52.89{col 46}{space 3}0.000{col 54}{space 4} .1808203{col 67}{space 3} .1947377
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1918004{col 26}{space 2}  .003688{col 37}{space 1}   52.01{col 46}{space 3}0.000{col 54}{space 4}  .184572{col 67}{space 3} .1990289
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2427675{col 26}{space 2} .0045057{col 37}{space 1}   53.88{col 46}{space 3}0.000{col 54}{space 4} .2339365{col 67}{space 3} .2515986
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0039475{col 26}{space 2} .0023854{col 37}{space 1}   -1.65{col 46}{space 3}0.098{col 54}{space 4}-.0086227{col 67}{space 3} .0007278
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0140196{col 26}{space 2} .0022971{col 37}{space 1}   -6.10{col 46}{space 3}0.000{col 54}{space 4}-.0185219{col 67}{space 3}-.0095173
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0066344{col 26}{space 2} .0023595{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-.0112588{col 67}{space 3}-.0020099
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0032901{col 26}{space 2} .0018835{col 37}{space 1}    1.75{col 46}{space 3}0.081{col 54}{space 4}-.0004016{col 67}{space 3} .0069818
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0031236{col 26}{space 2} .0009649{col 37}{space 1}   -3.24{col 46}{space 3}0.001{col 54}{space 4}-.0050147{col 67}{space 3}-.0012325
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0032222{col 26}{space 2} .0010092{col 37}{space 1}   -3.19{col 46}{space 3}0.001{col 54}{space 4}-.0052002{col 67}{space 3}-.0012442
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.007408{col 26}{space 2} .0009976{col 37}{space 1}   -7.43{col 46}{space 3}0.000{col 54}{space 4}-.0093633{col 67}{space 3}-.0054527
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0055366{col 26}{space 2} .0012417{col 37}{space 1}   -4.46{col 46}{space 3}0.000{col 54}{space 4}-.0079703{col 67}{space 3}-.0031029
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0169601{col 26}{space 2} .0034251{col 37}{space 1}   -4.95{col 46}{space 3}0.000{col 54}{space 4}-.0236732{col 67}{space 3} -.010247
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0382638{col 26}{space 2} .0037081{col 37}{space 1}   10.32{col 46}{space 3}0.000{col 54}{space 4} .0309959{col 67}{space 3} .0455316
{txt}eth_asian_~t {c |}{col 14}{res}{space 2} .0009644{col 26}{space 2} .0000665{col 37}{space 1}   14.51{col 46}{space 3}0.000{col 54}{space 4} .0008341{col 67}{space 3} .0010947
{txt}eth_hispan~t {c |}{col 14}{res}{space 2} .0006951{col 26}{space 2}  .000066{col 37}{space 1}   10.53{col 46}{space 3}0.000{col 54}{space 4} .0005658{col 67}{space 3} .0008244
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0014436{col 26}{space 2}  .000123{col 37}{space 1}  -11.73{col 46}{space 3}0.000{col 54}{space 4}-.0016847{col 67}{space 3}-.0012024
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}-.1202365{col 26}{space 2} .1764522{col 37}{space 1}   -0.68{col 46}{space 3}0.496{col 54}{space 4}-.4660776{col 67}{space 3} .2256045
{txt}educ~us_prop {c |}{col 14}{res}{space 2} .5592886{col 26}{space 2} .1661217{col 37}{space 1}    3.37{col 46}{space 3}0.001{col 54}{space 4} .2336952{col 67}{space 3}  .884882
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2}-.0000243{col 26}{space 2} .0001011{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4}-.0002226{col 67}{space 3} .0001739
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 3.24e-07{col 26}{space 2} 4.68e-08{col 37}{space 1}    6.92{col 46}{space 3}0.000{col 54}{space 4} 2.32e-07{col 67}{space 3} 4.16e-07
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.201968{col 26}{space 2} .0391943{col 37}{space 1}   56.18{col 46}{space 3}0.000{col 54}{space 4} 2.125148{col 67}{space 3} 2.278788
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_ela_sib_acs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.56404095 .17687225 .53559164 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0180110783   .5330160789          3424{txt}  {c |}
  2 {c |}  {res}.0130839575   .3808720004          2228{txt}  {c |}
  3 {c |}  {res}.0076708412    .210072655          1067{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0180110783{txt}  {c |}
  2 {c |}  {res}.0130839575{txt}  {c |}
  3 {c |}  {res}.0130839575{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   418,255
                                                {txt}F(1, 1245)        =  {res}  1369.59
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0359
                                                {txt}Root MSE          =    {res} .55361

{txt}{ralign 78:(Std. err. adjusted for {res:1,246} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  ela_r_both{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_ela_both {c |}{col 14}{res}{space 2} 1.002173{col 26}{space 2} .0270799{col 37}{space 1}   37.01{col 46}{space 3}0.000{col 54}{space 4} .9490455{col 67}{space 3}   1.0553
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0004805{col 26}{space 2} .0014011{col 37}{space 1}   -0.34{col 46}{space 3}0.732{col 54}{space 4}-.0032292{col 67}{space 3} .0022682
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_ela_both.ster} saved

Linear regression                               Number of obs     = {res}   418,255
                                                {txt}F(1, 1245)        =  {res}    16.73
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res} .00974

{txt}{ralign 78:(Std. err. adjusted for {res:1,246} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}ela_r_d_ac~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_ela_acs {c |}{col 14}{res}{space 2} .0010015{col 26}{space 2} .0002449{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} .0005211{col 67}{space 3} .0014819
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.15e-06{col 26}{space 2}  .000029{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-.0000579{col 67}{space 3} .0000556
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_ela_sib_acs.ster} saved

Linear regression                               Number of obs     = {res}   418,255
                                                {txt}F(1, 1245)        =  {res}    34.28
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0134
                                                {txt}Root MSE          =    {res} .02143

{txt}{ralign 78:(Std. err. adjusted for {res:1,246} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}ela_r_d_si~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_ela_sib {c |}{col 14}{res}{space 2} .0229149{col 26}{space 2} .0039135{col 37}{space 1}    5.86{col 46}{space 3}0.000{col 54}{space 4} .0152371{col 67}{space 3} .0305928
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.99e-06{col 26}{space 2} .0005708{col 37}{space 1}   -0.01{col 46}{space 3}0.993{col 54}{space 4}-.0011249{col 67}{space 3} .0011149
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_ela_acs_sib.ster} saved
{res}{txt}{p 0 4 2}
(file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/test_score_va/va_ela_sib_acs.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/test_score_va/va_ela_sib_acs.dta{rm}
saved
{p_end}
(Restrcited Test Score VA Sample with Sibling Controls and Census Controls)
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   417,489
{txt}{hline 13}{c +}{hline 34}   F(36, 417452)   = {res} 23368.96
{txt}       Model {c |} {res} 251901.821        36   6997.2728   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 124995.963   417,452  .299425953   {txt}R-squared       ={res}    0.6684
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6683
{txt}       Total {c |} {res} 376897.784   417,488  .902775131   {txt}Root MSE        =   {res}  .5472

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0573606{col 26}{space 2} .0034081{col 37}{space 1}   16.83{col 46}{space 3}0.000{col 54}{space 4} .0506808{col 67}{space 3} .0640405
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0677473{col 26}{space 2} .0033907{col 37}{space 1}   19.98{col 46}{space 3}0.000{col 54}{space 4} .0611017{col 67}{space 3} .0743929
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0904429{col 26}{space 2} .0034249{col 37}{space 1}  -26.41{col 46}{space 3}0.000{col 54}{space 4}-.0971556{col 67}{space 3}-.0837301
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003528{col 26}{space 2} 6.16e-06{col 37}{space 1}  -57.31{col 46}{space 3}0.000{col 54}{space 4}-.0003649{col 67}{space 3}-.0003407
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0544112{col 26}{space 2} .0017326{col 37}{space 1}   31.40{col 46}{space 3}0.000{col 54}{space 4} .0510154{col 67}{space 3}  .057807
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1900772{col 26}{space 2} .0027116{col 37}{space 1}   70.10{col 46}{space 3}0.000{col 54}{space 4} .1847626{col 67}{space 3} .1953917
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0712949{col 26}{space 2} .0023826{col 37}{space 1}  -29.92{col 46}{space 3}0.000{col 54}{space 4}-.0759648{col 67}{space 3} -.066625
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1718248{col 26}{space 2} .0048185{col 37}{space 1}  -35.66{col 46}{space 3}0.000{col 54}{space 4}-.1812688{col 67}{space 3}-.1623808
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0128378{col 26}{space 2} .0051866{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .0026723{col 67}{space 3} .0230033
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0641161{col 26}{space 2}  .002011{col 37}{space 1}  -31.88{col 46}{space 3}0.000{col 54}{space 4}-.0680577{col 67}{space 3}-.0601746
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0875429{col 26}{space 2}  .004645{col 37}{space 1}  -18.85{col 46}{space 3}0.000{col 54}{space 4} -.096647{col 67}{space 3}-.0784388
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1576512{col 26}{space 2} .0046064{col 37}{space 1}  -34.22{col 46}{space 3}0.000{col 54}{space 4}-.1666796{col 67}{space 3}-.1486228
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3459023{col 26}{space 2}   .00346{col 37}{space 1}   99.97{col 46}{space 3}0.000{col 54}{space 4} .3391208{col 67}{space 3} .3526838
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3292204{col 26}{space 2} .0033346{col 37}{space 1}   98.73{col 46}{space 3}0.000{col 54}{space 4} .3226845{col 67}{space 3} .3357562
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2985014{col 26}{space 2} .0034855{col 37}{space 1}   85.64{col 46}{space 3}0.000{col 54}{space 4}   .29167{col 67}{space 3} .3053328
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1857641{col 26}{space 2} .0043494{col 37}{space 1}   42.71{col 46}{space 3}0.000{col 54}{space 4} .1772394{col 67}{space 3} .1942889
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0231704{col 26}{space 2} .0018625{col 37}{space 1}   12.44{col 46}{space 3}0.000{col 54}{space 4}   .01952{col 67}{space 3} .0268207
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0059434{col 26}{space 2} .0018452{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4} .0023269{col 67}{space 3} .0095599
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0194671{col 26}{space 2} .0018556{col 37}{space 1}   10.49{col 46}{space 3}0.000{col 54}{space 4} .0158302{col 67}{space 3}  .023104
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.000025{col 26}{space 2} .0018652{col 37}{space 1}   -0.01{col 46}{space 3}0.989{col 54}{space 4}-.0036807{col 67}{space 3} .0036308
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0159315{col 26}{space 2} .0008383{col 37}{space 1}  -19.01{col 46}{space 3}0.000{col 54}{space 4}-.0175744{col 67}{space 3}-.0142885
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0102379{col 26}{space 2} .0007604{col 37}{space 1}  -13.46{col 46}{space 3}0.000{col 54}{space 4}-.0117284{col 67}{space 3}-.0087475
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0134722{col 26}{space 2} .0007341{col 37}{space 1}  -18.35{col 46}{space 3}0.000{col 54}{space 4} -.014911{col 67}{space 3}-.0120334
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0060101{col 26}{space 2} .0012226{col 37}{space 1}   -4.92{col 46}{space 3}0.000{col 54}{space 4}-.0084064{col 67}{space 3}-.0036138
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4903322{col 26}{space 2} .0034326{col 37}{space 1}  142.84{col 46}{space 3}0.000{col 54}{space 4} .4836043{col 67}{space 3}   .49706
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5122908{col 26}{space 2} .0034506{col 37}{space 1}  148.47{col 46}{space 3}0.000{col 54}{space 4} .5055278{col 67}{space 3} .5190539
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5385738{col 26}{space 2} .0035843{col 37}{space 1}  150.26{col 46}{space 3}0.000{col 54}{space 4} .5315487{col 67}{space 3} .5455989
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6696987{col 26}{space 2} .0043788{col 37}{space 1}  152.94{col 46}{space 3}0.000{col 54}{space 4} .6611164{col 67}{space 3} .6782811
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0241732{col 26}{space 2} .0023213{col 37}{space 1}   10.41{col 46}{space 3}0.000{col 54}{space 4} .0196235{col 67}{space 3} .0287229
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0016979{col 26}{space 2} .0022311{col 37}{space 1}    0.76{col 46}{space 3}0.447{col 54}{space 4}-.0026749{col 67}{space 3} .0060707
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .001422{col 26}{space 2} .0022947{col 37}{space 1}    0.62{col 46}{space 3}0.535{col 54}{space 4}-.0030756{col 67}{space 3} .0059195
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0786714{col 26}{space 2} .0018314{col 37}{space 1}   42.96{col 46}{space 3}0.000{col 54}{space 4}  .075082{col 67}{space 3} .0822608
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.022775{col 26}{space 2} .0009372{col 37}{space 1}  -24.30{col 46}{space 3}0.000{col 54}{space 4}-.0246119{col 67}{space 3} -.020938
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.019213{col 26}{space 2} .0009802{col 37}{space 1}  -19.60{col 46}{space 3}0.000{col 54}{space 4}-.0211341{col 67}{space 3}-.0172918
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0223934{col 26}{space 2} .0009693{col 37}{space 1}  -23.10{col 46}{space 3}0.000{col 54}{space 4}-.0242932{col 67}{space 3}-.0204935
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0268293{col 26}{space 2} .0012075{col 37}{space 1}  -22.22{col 46}{space 3}0.000{col 54}{space 4}-.0291959{col 67}{space 3}-.0244627
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.251889{col 26}{space 2} .0376971{col 37}{space 1}   59.74{col 46}{space 3}0.000{col 54}{space 4} 2.178004{col 67}{space 3} 2.325774
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_og.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_og.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.54719828 .16247033 .5225221 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0187589454   .6369350641          3415{txt}  {c |}
  2 {c |}  {res}.0147638536   .5049323998          2222{txt}  {c |}
  3 {c |}  {res}.0095898571   .3364618417          1066{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0187589454{txt}  {c |}
  2 {c |}  {res}.0147638536{txt}  {c |}
  3 {c |}  {res}.0147638536{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   416,637
                                                {txt}F(1, 1242)        =  {res}  2894.95
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0454
                                                {txt}Root MSE          =    {res} .53452

{txt}{ralign 78:(Std. err. adjusted for {res:1,243} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   math_r_og{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_math_og {c |}{col 14}{res}{space 2} .9860723{col 26}{space 2} .0183269{col 37}{space 1}   53.80{col 46}{space 3}0.000{col 54}{space 4} .9501173{col 67}{space 3} 1.022027
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0014052{col 26}{space 2} .0009957{col 37}{space 1}   -1.41{col 46}{space 3}0.158{col 54}{space 4}-.0033587{col 67}{space 3} .0005483
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_va_math_og.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_va_math_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   417,489
{txt}{hline 13}{c +}{hline 34}   F(43, 417445)   = {res} 19822.25
{txt}       Model {c |} {res} 252993.333        43  5883.56589   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  123904.45   417,445  .296816228   {txt}R-squared       ={res}    0.6713
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6712
{txt}       Total {c |} {res} 376897.784   417,488  .902775131   {txt}Root MSE        =   {res} .54481

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}  .055358{col 26}{space 2} .0033954{col 37}{space 1}   16.30{col 46}{space 3}0.000{col 54}{space 4}  .048703{col 67}{space 3} .0620129
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0635174{col 26}{space 2} .0033853{col 37}{space 1}   18.76{col 46}{space 3}0.000{col 54}{space 4} .0568824{col 67}{space 3} .0701524
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0935216{col 26}{space 2} .0034283{col 37}{space 1}  -27.28{col 46}{space 3}0.000{col 54}{space 4}-.1002409{col 67}{space 3}-.0868022
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2} -.000357{col 26}{space 2} 6.14e-06{col 37}{space 1}  -58.14{col 46}{space 3}0.000{col 54}{space 4} -.000369{col 67}{space 3}-.0003449
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0534467{col 26}{space 2} .0017254{col 37}{space 1}   30.98{col 46}{space 3}0.000{col 54}{space 4}  .050065{col 67}{space 3} .0568284
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1657748{col 26}{space 2} .0030534{col 37}{space 1}   54.29{col 46}{space 3}0.000{col 54}{space 4} .1597902{col 67}{space 3} .1717594
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0450169{col 26}{space 2}  .002637{col 37}{space 1}  -17.07{col 46}{space 3}0.000{col 54}{space 4}-.0501853{col 67}{space 3}-.0398485
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1354828{col 26}{space 2} .0050324{col 37}{space 1}  -26.92{col 46}{space 3}0.000{col 54}{space 4}-.1453461{col 67}{space 3}-.1256194
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0145091{col 26}{space 2} .0051835{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0043497{col 67}{space 3} .0246686
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2} -.031271{col 26}{space 2} .0021445{col 37}{space 1}  -14.58{col 46}{space 3}0.000{col 54}{space 4}-.0354741{col 67}{space 3}-.0270679
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}  -.08939{col 26}{space 2} .0046264{col 37}{space 1}  -19.32{col 46}{space 3}0.000{col 54}{space 4}-.0984576{col 67}{space 3}-.0803224
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1698516{col 26}{space 2} .0045927{col 37}{space 1}  -36.98{col 46}{space 3}0.000{col 54}{space 4}-.1788531{col 67}{space 3}-.1608501
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3392791{col 26}{space 2} .0034483{col 37}{space 1}   98.39{col 46}{space 3}0.000{col 54}{space 4} .3325206{col 67}{space 3} .3460377
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3228973{col 26}{space 2} .0033238{col 37}{space 1}   97.15{col 46}{space 3}0.000{col 54}{space 4} .3163828{col 67}{space 3} .3294117
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2900331{col 26}{space 2} .0034754{col 37}{space 1}   83.45{col 46}{space 3}0.000{col 54}{space 4} .2832215{col 67}{space 3} .2968447
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1816781{col 26}{space 2} .0043322{col 37}{space 1}   41.94{col 46}{space 3}0.000{col 54}{space 4} .1731871{col 67}{space 3} .1901692
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0220857{col 26}{space 2} .0018546{col 37}{space 1}   11.91{col 46}{space 3}0.000{col 54}{space 4} .0184507{col 67}{space 3} .0257207
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}   .00499{col 26}{space 2} .0018375{col 37}{space 1}    2.72{col 46}{space 3}0.007{col 54}{space 4} .0013886{col 67}{space 3} .0085915
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0182838{col 26}{space 2}  .001848{col 37}{space 1}    9.89{col 46}{space 3}0.000{col 54}{space 4} .0146619{col 67}{space 3} .0219058
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .000088{col 26}{space 2} .0018572{col 37}{space 1}    0.05{col 46}{space 3}0.962{col 54}{space 4}-.0035521{col 67}{space 3} .0037281
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.015775{col 26}{space 2} .0008346{col 37}{space 1}  -18.90{col 46}{space 3}0.000{col 54}{space 4}-.0174109{col 67}{space 3}-.0141392
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0102839{col 26}{space 2} .0007571{col 37}{space 1}  -13.58{col 46}{space 3}0.000{col 54}{space 4}-.0117679{col 67}{space 3}-.0087999
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.013121{col 26}{space 2}  .000731{col 37}{space 1}  -17.95{col 46}{space 3}0.000{col 54}{space 4}-.0145536{col 67}{space 3}-.0116883
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.006244{col 26}{space 2} .0012173{col 37}{space 1}   -5.13{col 46}{space 3}0.000{col 54}{space 4}-.0086299{col 67}{space 3}-.0038581
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4880303{col 26}{space 2}  .003418{col 37}{space 1}  142.78{col 46}{space 3}0.000{col 54}{space 4} .4813311{col 67}{space 3} .4947295
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .509636{col 26}{space 2} .0034359{col 37}{space 1}  148.33{col 46}{space 3}0.000{col 54}{space 4} .5029018{col 67}{space 3} .5163702
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5364833{col 26}{space 2} .0035691{col 37}{space 1}  150.31{col 46}{space 3}0.000{col 54}{space 4}  .529488{col 67}{space 3} .5434786
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6647322{col 26}{space 2} .0043612{col 37}{space 1}  152.42{col 46}{space 3}0.000{col 54}{space 4} .6561844{col 67}{space 3} .6732801
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0233791{col 26}{space 2} .0023117{col 37}{space 1}   10.11{col 46}{space 3}0.000{col 54}{space 4} .0188482{col 67}{space 3}   .02791
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0009751{col 26}{space 2} .0022218{col 37}{space 1}    0.44{col 46}{space 3}0.661{col 54}{space 4}-.0033795{col 67}{space 3} .0053297
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0006248{col 26}{space 2} .0022849{col 37}{space 1}    0.27{col 46}{space 3}0.784{col 54}{space 4}-.0038534{col 67}{space 3} .0051031
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0759158{col 26}{space 2} .0018241{col 37}{space 1}   41.62{col 46}{space 3}0.000{col 54}{space 4} .0723405{col 67}{space 3} .0794911
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0229222{col 26}{space 2} .0009332{col 37}{space 1}  -24.56{col 46}{space 3}0.000{col 54}{space 4}-.0247513{col 67}{space 3}-.0210931
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0192842{col 26}{space 2}  .000976{col 37}{space 1}  -19.76{col 46}{space 3}0.000{col 54}{space 4} -.021197{col 67}{space 3}-.0173713
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0224689{col 26}{space 2} .0009651{col 37}{space 1}  -23.28{col 46}{space 3}0.000{col 54}{space 4}-.0243605{col 67}{space 3}-.0205772
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0277284{col 26}{space 2} .0012024{col 37}{space 1}  -23.06{col 46}{space 3}0.000{col 54}{space 4}-.0300851{col 67}{space 3}-.0253718
{txt}{space 12} {c |}
eth_asian_~t {c |}{col 14}{res}{space 2} .0014643{col 26}{space 2} .0000643{col 37}{space 1}   22.76{col 46}{space 3}0.000{col 54}{space 4} .0013382{col 67}{space 3} .0015903
{txt}eth_hispan~t {c |}{col 14}{res}{space 2} -.000043{col 26}{space 2} .0000639{col 37}{space 1}   -0.67{col 46}{space 3}0.501{col 54}{space 4}-.0001684{col 67}{space 3} .0000823
{txt}eth_black_~t {c |}{col 14}{res}{space 2} -.001905{col 26}{space 2} .0001192{col 37}{space 1}  -15.98{col 46}{space 3}0.000{col 54}{space 4}-.0021387{col 67}{space 3}-.0016714
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2} 1.048928{col 26}{space 2} .1707257{col 37}{space 1}    6.14{col 46}{space 3}0.000{col 54}{space 4} .7143108{col 67}{space 3} 1.383545
{txt}educ~us_prop {c |}{col 14}{res}{space 2} 2.394832{col 26}{space 2} .1626531{col 37}{space 1}   14.72{col 46}{space 3}0.000{col 54}{space 4} 2.076037{col 67}{space 3} 2.713628
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2} .0008023{col 26}{space 2} .0000979{col 37}{space 1}    8.20{col 46}{space 3}0.000{col 54}{space 4} .0006105{col 67}{space 3} .0009941
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 1.28e-06{col 26}{space 2} 4.53e-08{col 37}{space 1}   28.21{col 46}{space 3}0.000{col 54}{space 4} 1.19e-06{col 67}{space 3} 1.37e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.113383{col 26}{space 2} .0379151{col 37}{space 1}   55.74{col 46}{space 3}0.000{col 54}{space 4}  2.03907{col 67}{space 3} 2.187695
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_acs.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_acs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.54480843 .15596383 .5220072 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0165923798   .6102534902          3415{txt}  {c |}
  2 {c |}  {res}.0128469322   .4713679279          2222{txt}  {c |}
  3 {c |}  {res}.0084602284   .3094518687          1066{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0165923798{txt}  {c |}
  2 {c |}  {res}.0128469322{txt}  {c |}
  3 {c |}  {res}.0128469322{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   416,637
                                                {txt}F(1, 1242)        =  {res}  2490.93
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0395
                                                {txt}Root MSE          =    {res} .53381

{txt}{ralign 78:(Std. err. adjusted for {res:1,243} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  math_r_acs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_math_acs {c |}{col 14}{res}{space 2} .9981633{col 26}{space 2} .0199996{col 37}{space 1}   49.91{col 46}{space 3}0.000{col 54}{space 4} .9589266{col 67}{space 3}   1.0374
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0010735{col 26}{space 2} .0009948{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-.0030251{col 67}{space 3} .0008781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_math_acs.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_math_acs.ster} saved

Linear regression                               Number of obs     = {res}   416,637
                                                {txt}F(1, 1242)        =  {res}    57.57
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0413
                                                {txt}Root MSE          =    {res} .05008

{txt}{ralign 78:(Std. err. adjusted for {res:1,243} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}math_r_d_o~s{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_math_og {c |}{col 14}{res}{space 2}  .087943{col 26}{space 2}  .011591{col 37}{space 1}    7.59{col 46}{space 3}0.000{col 54}{space 4} .0652029{col 67}{space 3} .1106831
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001109{col 26}{space 2} .0012028{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-.0024706{col 67}{space 3} .0022489
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_acs_og.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_acs_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   417,489
{txt}{hline 13}{c +}{hline 34}   F(38, 417450)   = {res} 22172.26
{txt}       Model {c |} {res}  252027.54        38  6632.30369   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 124870.244   417,450  .299126227   {txt}R-squared       ={res}    0.6687
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6687
{txt}       Total {c |} {res} 376897.784   417,488  .902775131   {txt}Root MSE        =   {res} .54692

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0571847{col 26}{space 2} .0034066{col 37}{space 1}   16.79{col 46}{space 3}0.000{col 54}{space 4} .0505078{col 67}{space 3} .0638615
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0672412{col 26}{space 2} .0033898{col 37}{space 1}   19.84{col 46}{space 3}0.000{col 54}{space 4} .0605972{col 67}{space 3} .0738852
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0907477{col 26}{space 2} .0034254{col 37}{space 1}  -26.49{col 46}{space 3}0.000{col 54}{space 4}-.0974613{col 67}{space 3}-.0840341
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003517{col 26}{space 2} 6.15e-06{col 37}{space 1}  -57.15{col 46}{space 3}0.000{col 54}{space 4}-.0003638{col 67}{space 3}-.0003397
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0543382{col 26}{space 2} .0017317{col 37}{space 1}   31.38{col 46}{space 3}0.000{col 54}{space 4} .0509441{col 67}{space 3} .0577323
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1894315{col 26}{space 2} .0027114{col 37}{space 1}   69.87{col 46}{space 3}0.000{col 54}{space 4} .1841172{col 67}{space 3} .1947457
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0704363{col 26}{space 2}  .002382{col 37}{space 1}  -29.57{col 46}{space 3}0.000{col 54}{space 4}-.0751049{col 67}{space 3}-.0657677
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1718231{col 26}{space 2} .0048161{col 37}{space 1}  -35.68{col 46}{space 3}0.000{col 54}{space 4}-.1812625{col 67}{space 3}-.1623838
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2}   .01342{col 26}{space 2} .0051841{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4} .0032594{col 67}{space 3} .0235807
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0640825{col 26}{space 2} .0020104{col 37}{space 1}  -31.88{col 46}{space 3}0.000{col 54}{space 4}-.0680228{col 67}{space 3}-.0601422
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0871824{col 26}{space 2} .0046427{col 37}{space 1}  -18.78{col 46}{space 3}0.000{col 54}{space 4} -.096282{col 67}{space 3}-.0780828
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1573463{col 26}{space 2} .0046043{col 37}{space 1}  -34.17{col 46}{space 3}0.000{col 54}{space 4}-.1663705{col 67}{space 3}-.1483221
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3452962{col 26}{space 2} .0034585{col 37}{space 1}   99.84{col 46}{space 3}0.000{col 54}{space 4} .3385176{col 67}{space 3} .3520747
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3286667{col 26}{space 2} .0033333{col 37}{space 1}   98.60{col 46}{space 3}0.000{col 54}{space 4} .3221336{col 67}{space 3} .3351998
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .297788{col 26}{space 2} .0034842{col 37}{space 1}   85.47{col 46}{space 3}0.000{col 54}{space 4} .2909591{col 67}{space 3}  .304617
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1849217{col 26}{space 2} .0043475{col 37}{space 1}   42.54{col 46}{space 3}0.000{col 54}{space 4} .1764008{col 67}{space 3} .1934426
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0231099{col 26}{space 2} .0018615{col 37}{space 1}   12.41{col 46}{space 3}0.000{col 54}{space 4} .0194613{col 67}{space 3} .0267584
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0058527{col 26}{space 2} .0018443{col 37}{space 1}    3.17{col 46}{space 3}0.002{col 54}{space 4} .0022379{col 67}{space 3} .0094675
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0194673{col 26}{space 2} .0018547{col 37}{space 1}   10.50{col 46}{space 3}0.000{col 54}{space 4} .0158321{col 67}{space 3} .0231025
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  -.00008{col 26}{space 2} .0018643{col 37}{space 1}   -0.04{col 46}{space 3}0.966{col 54}{space 4}-.0037339{col 67}{space 3} .0035739
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0158512{col 26}{space 2} .0008378{col 37}{space 1}  -18.92{col 46}{space 3}0.000{col 54}{space 4}-.0174934{col 67}{space 3}-.0142091
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0101758{col 26}{space 2} .0007601{col 37}{space 1}  -13.39{col 46}{space 3}0.000{col 54}{space 4}-.0116656{col 67}{space 3}-.0086861
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0134085{col 26}{space 2} .0007337{col 37}{space 1}  -18.27{col 46}{space 3}0.000{col 54}{space 4}-.0148466{col 67}{space 3}-.0119704
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0058638{col 26}{space 2}  .001222{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-.0082589{col 67}{space 3}-.0034686
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4894863{col 26}{space 2} .0034312{col 37}{space 1}  142.66{col 46}{space 3}0.000{col 54}{space 4} .4827613{col 67}{space 3} .4962113
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5110834{col 26}{space 2} .0034494{col 37}{space 1}  148.16{col 46}{space 3}0.000{col 54}{space 4} .5043226{col 67}{space 3} .5178442
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5375356{col 26}{space 2} .0035829{col 37}{space 1}  150.03{col 46}{space 3}0.000{col 54}{space 4} .5305132{col 67}{space 3} .5445579
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6682355{col 26}{space 2} .0043772{col 37}{space 1}  152.66{col 46}{space 3}0.000{col 54}{space 4} .6596563{col 67}{space 3} .6768147
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0241298{col 26}{space 2} .0023202{col 37}{space 1}   10.40{col 46}{space 3}0.000{col 54}{space 4} .0195823{col 67}{space 3} .0286773
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0016218{col 26}{space 2}   .00223{col 37}{space 1}    0.73{col 46}{space 3}0.467{col 54}{space 4}-.0027489{col 67}{space 3} .0059924
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0013635{col 26}{space 2} .0022935{col 37}{space 1}    0.59{col 46}{space 3}0.552{col 54}{space 4}-.0031318{col 67}{space 3} .0058588
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0784786{col 26}{space 2} .0018306{col 37}{space 1}   42.87{col 46}{space 3}0.000{col 54}{space 4} .0748907{col 67}{space 3} .0820665
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} -.022712{col 26}{space 2} .0009368{col 37}{space 1}  -24.25{col 46}{space 3}0.000{col 54}{space 4} -.024548{col 67}{space 3} -.020876
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0190868{col 26}{space 2} .0009797{col 37}{space 1}  -19.48{col 46}{space 3}0.000{col 54}{space 4} -.021007{col 67}{space 3}-.0171666
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0223071{col 26}{space 2} .0009689{col 37}{space 1}  -23.02{col 46}{space 3}0.000{col 54}{space 4}-.0242061{col 67}{space 3}-.0204082
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0266513{col 26}{space 2} .0012069{col 37}{space 1}  -22.08{col 46}{space 3}0.000{col 54}{space 4}-.0290168{col 67}{space 3}-.0242858
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0299208{col 26}{space 2} .0033263{col 37}{space 1}   -9.00{col 46}{space 3}0.000{col 54}{space 4}-.0364402{col 67}{space 3}-.0234013
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0681976{col 26}{space 2} .0035986{col 37}{space 1}   18.95{col 46}{space 3}0.000{col 54}{space 4} .0611444{col 67}{space 3} .0752507
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.243605{col 26}{space 2} .0376928{col 37}{space 1}   59.52{col 46}{space 3}0.000{col 54}{space 4} 2.169728{col 67}{space 3} 2.317482
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_sib.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_sib.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.54692433 .16222399 .52231179 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0186869068   .6362976464          3415{txt}  {c |}
  2 {c |}  {res}.0146820844     .50361247          2222{txt}  {c |}
  3 {c |}  {res}.0095093449   .3346967755          1066{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0186869068{txt}  {c |}
  2 {c |}  {res}.0146820844{txt}  {c |}
  3 {c |}  {res}.0146820844{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   416,637
                                                {txt}F(1, 1242)        =  {res}  2882.82
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0452
                                                {txt}Root MSE          =    {res}  .5343

{txt}{ralign 78:(Std. err. adjusted for {res:1,243} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  math_r_sib{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_math_sib {c |}{col 14}{res}{space 2} .9857967{col 26}{space 2} .0183603{col 37}{space 1}   53.69{col 46}{space 3}0.000{col 54}{space 4} .9497761{col 67}{space 3} 1.021817
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0013942{col 26}{space 2} .0009974{col 37}{space 1}   -1.40{col 46}{space 3}0.162{col 54}{space 4}-.0033509{col 67}{space 3} .0005626
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_math_sib.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_math_sib.ster} saved

Linear regression                               Number of obs     = {res}   416,637
                                                {txt}F(1, 1242)        =  {res}    24.76
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0002
                                                {txt}Root MSE          =    {res} .01735

{txt}{ralign 78:(Std. err. adjusted for {res:1,243} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}math_r_d_o~b{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}va_math_og {c |}{col 14}{res}{space 2}  .002063{col 26}{space 2} .0004146{col 37}{space 1}    4.98{col 46}{space 3}0.000{col 54}{space 4} .0012496{col 67}{space 3} .0028764
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.64e-06{col 26}{space 2} .0000542{col 37}{space 1}   -0.07{col 46}{space 3}0.946{col 54}{space 4}  -.00011{col 67}{space 3} .0001027
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_sib_og.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_sib_og.ster} saved
{txt}{hline}

      Source {c |}       SS           df       MS      Number of obs   ={res}   417,489
{txt}{hline 13}{c +}{hline 34}   F(45, 417443)   = {res} 18968.04
{txt}       Model {c |} {res} 253111.199        45  5624.69332   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 123786.584   417,443  .296535298   {txt}R-squared       ={res}    0.6716
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6715
{txt}       Total {c |} {res} 376897.784   417,488  .902775131   {txt}Root MSE        =   {res} .54455

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}  .055199{col 26}{space 2}  .003394{col 37}{space 1}   16.26{col 46}{space 3}0.000{col 54}{space 4} .0485468{col 67}{space 3} .0618512
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0630235{col 26}{space 2} .0033845{col 37}{space 1}   18.62{col 46}{space 3}0.000{col 54}{space 4} .0563899{col 67}{space 3} .0696571
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0938535{col 26}{space 2} .0034289{col 37}{space 1}  -27.37{col 46}{space 3}0.000{col 54}{space 4}-.1005739{col 67}{space 3} -.087133
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003558{col 26}{space 2} 6.14e-06{col 37}{space 1}  -57.97{col 46}{space 3}0.000{col 54}{space 4}-.0003678{col 67}{space 3}-.0003438
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0533759{col 26}{space 2} .0017246{col 37}{space 1}   30.95{col 46}{space 3}0.000{col 54}{space 4} .0499957{col 67}{space 3}  .056756
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1648597{col 26}{space 2} .0030532{col 37}{space 1}   54.00{col 46}{space 3}0.000{col 54}{space 4} .1588755{col 67}{space 3} .1708439
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0441664{col 26}{space 2} .0026362{col 37}{space 1}  -16.75{col 46}{space 3}0.000{col 54}{space 4}-.0493332{col 67}{space 3}-.0389995
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} -.135461{col 26}{space 2}   .00503{col 37}{space 1}  -26.93{col 46}{space 3}0.000{col 54}{space 4}-.1453198{col 67}{space 3}-.1256023
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0150022{col 26}{space 2} .0051811{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} .0048473{col 67}{space 3}  .025157
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0313756{col 26}{space 2} .0021437{col 37}{space 1}  -14.64{col 46}{space 3}0.000{col 54}{space 4}-.0355773{col 67}{space 3} -.027174
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0890733{col 26}{space 2} .0046243{col 37}{space 1}  -19.26{col 46}{space 3}0.000{col 54}{space 4}-.0981367{col 67}{space 3}-.0800099
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1695318{col 26}{space 2} .0045907{col 37}{space 1}  -36.93{col 46}{space 3}0.000{col 54}{space 4}-.1785294{col 67}{space 3}-.1605343
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3386966{col 26}{space 2} .0034469{col 37}{space 1}   98.26{col 46}{space 3}0.000{col 54}{space 4} .3319409{col 67}{space 3} .3454524
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3223769{col 26}{space 2} .0033224{col 37}{space 1}   97.03{col 46}{space 3}0.000{col 54}{space 4} .3158651{col 67}{space 3} .3288888
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .2893866{col 26}{space 2} .0034742{col 37}{space 1}   83.30{col 46}{space 3}0.000{col 54}{space 4} .2825773{col 67}{space 3} .2961959
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1808819{col 26}{space 2} .0043304{col 37}{space 1}   41.77{col 46}{space 3}0.000{col 54}{space 4} .1723945{col 67}{space 3} .1893693
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}  .022046{col 26}{space 2} .0018538{col 37}{space 1}   11.89{col 46}{space 3}0.000{col 54}{space 4} .0184126{col 67}{space 3} .0256793
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0049245{col 26}{space 2} .0018367{col 37}{space 1}    2.68{col 46}{space 3}0.007{col 54}{space 4} .0013247{col 67}{space 3} .0085244
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0183128{col 26}{space 2} .0018471{col 37}{space 1}    9.91{col 46}{space 3}0.000{col 54}{space 4} .0146924{col 67}{space 3} .0219331
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .000051{col 26}{space 2} .0018564{col 37}{space 1}    0.03{col 46}{space 3}0.978{col 54}{space 4}-.0035873{col 67}{space 3} .0036894
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0156976{col 26}{space 2} .0008342{col 37}{space 1}  -18.82{col 46}{space 3}0.000{col 54}{space 4}-.0173327{col 67}{space 3}-.0140626
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0102252{col 26}{space 2} .0007568{col 37}{space 1}  -13.51{col 46}{space 3}0.000{col 54}{space 4}-.0117085{col 67}{space 3}-.0087419
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} -.013065{col 26}{space 2} .0007306{col 37}{space 1}  -17.88{col 46}{space 3}0.000{col 54}{space 4} -.014497{col 67}{space 3} -.011633
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0060987{col 26}{space 2} .0012168{col 37}{space 1}   -5.01{col 46}{space 3}0.000{col 54}{space 4}-.0084835{col 67}{space 3}-.0037139
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4872222{col 26}{space 2} .0034167{col 37}{space 1}  142.60{col 46}{space 3}0.000{col 54}{space 4} .4805256{col 67}{space 3} .4939187
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5084723{col 26}{space 2} .0034348{col 37}{space 1}  148.04{col 46}{space 3}0.000{col 54}{space 4} .5017402{col 67}{space 3} .5152044
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5354906{col 26}{space 2} .0035678{col 37}{space 1}  150.09{col 46}{space 3}0.000{col 54}{space 4} .5284979{col 67}{space 3} .5424833
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6633201{col 26}{space 2} .0043597{col 37}{space 1}  152.15{col 46}{space 3}0.000{col 54}{space 4} .6547751{col 67}{space 3}  .671865
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0233653{col 26}{space 2} .0023107{col 37}{space 1}   10.11{col 46}{space 3}0.000{col 54}{space 4} .0188364{col 67}{space 3} .0278941
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0009218{col 26}{space 2} .0022207{col 37}{space 1}    0.42{col 46}{space 3}0.678{col 54}{space 4}-.0034308{col 67}{space 3} .0052743
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0005825{col 26}{space 2} .0022838{col 37}{space 1}    0.26{col 46}{space 3}0.799{col 54}{space 4}-.0038936{col 67}{space 3} .0050587
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}  .075759{col 26}{space 2} .0018234{col 37}{space 1}   41.55{col 46}{space 3}0.000{col 54}{space 4} .0721852{col 67}{space 3} .0793328
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0228669{col 26}{space 2} .0009328{col 37}{space 1}  -24.51{col 46}{space 3}0.000{col 54}{space 4}-.0246952{col 67}{space 3}-.0210387
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0191641{col 26}{space 2} .0009755{col 37}{space 1}  -19.64{col 46}{space 3}0.000{col 54}{space 4}-.0210761{col 67}{space 3}-.0172521
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0223869{col 26}{space 2} .0009647{col 37}{space 1}  -23.21{col 46}{space 3}0.000{col 54}{space 4}-.0242777{col 67}{space 3}-.0204961
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0275496{col 26}{space 2} .0012019{col 37}{space 1}  -22.92{col 46}{space 3}0.000{col 54}{space 4}-.0299052{col 67}{space 3} -.025194
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0273831{col 26}{space 2} .0033128{col 37}{space 1}   -8.27{col 46}{space 3}0.000{col 54}{space 4}-.0338762{col 67}{space 3}  -.02089
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0667733{col 26}{space 2} .0035846{col 37}{space 1}   18.63{col 46}{space 3}0.000{col 54}{space 4} .0597476{col 67}{space 3}  .073799
{txt}eth_asian_~t {c |}{col 14}{res}{space 2} .0014757{col 26}{space 2} .0000643{col 37}{space 1}   22.95{col 46}{space 3}0.000{col 54}{space 4} .0013497{col 67}{space 3} .0016017
{txt}eth_hispan~t {c |}{col 14}{res}{space 2}-.0000525{col 26}{space 2} .0000639{col 37}{space 1}   -0.82{col 46}{space 3}0.412{col 54}{space 4}-.0001777{col 67}{space 3} .0000728
{txt}eth_black_~t {c |}{col 14}{res}{space 2}-.0019242{col 26}{space 2} .0001192{col 37}{space 1}  -16.15{col 46}{space 3}0.000{col 54}{space 4}-.0021578{col 67}{space 3}-.0016907
{txt}educ_hs_dr~p {c |}{col 14}{res}{space 2}   1.0219{col 26}{space 2} .1706512{col 37}{space 1}    5.99{col 46}{space 3}0.000{col 54}{space 4}  .687429{col 67}{space 3} 1.356372
{txt}educ~us_prop {c |}{col 14}{res}{space 2}  2.39334{col 26}{space 2} .1626106{col 37}{space 1}   14.72{col 46}{space 3}0.000{col 54}{space 4} 2.074628{col 67}{space 3} 2.712052
{txt}pov_fam_ch~t {c |}{col 14}{res}{space 2} .0007933{col 26}{space 2} .0000978{col 37}{space 1}    8.11{col 46}{space 3}0.000{col 54}{space 4} .0006015{col 67}{space 3} .0009851
{txt}inc_medi~_hh {c |}{col 14}{res}{space 2} 1.26e-06{col 26}{space 2} 4.53e-08{col 37}{space 1}   27.69{col 46}{space 3}0.000{col 54}{space 4} 1.17e-06{col 67}{space 3} 1.34e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.106941{col 26}{space 2} .0379111{col 37}{space 1}   55.58{col 46}{space 3}0.000{col 54}{space 4} 2.032636{col 67}{space 3} 2.181246
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_sib_acs.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/vam_math_sib_acs.ster} saved
{res}Standard deviations: total, classes, students, teachers same year
.54455055 .15575246 .52180118 .
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0165316523   .6095937252          3415{txt}  {c |}
  2 {c |}  {res} .012778558   .4700705071          2222{txt}  {c |}
  3 {c |}  {res}.0083970163   .3079087561          1066{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
Drift limit specified:
2
Covariances used for VA computations:
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0165316523{txt}  {c |}
  2 {c |}  {res} .012778558{txt}  {c |}
  3 {c |}  {res} .012778558{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
{res}{txt}{hline}
{res}
{txt}Linear regression                               Number of obs     = {res}   416,637
                                                {txt}F(1, 1242)        =  {res}  2486.42
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0394
                                                {txt}Root MSE          =    {res}  .5336

{txt}{ralign 78:(Std. err. adjusted for {res:1,243} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} math_r_both{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_math_both {c |}{col 14}{res}{space 2} .9980369{col 26}{space 2} .0200152{col 37}{space 1}   49.86{col 46}{space 3}0.000{col 54}{space 4} .9587697{col 67}{space 3} 1.037304
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0010616{col 26}{space 2} .0009961{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-.0030158{col 67}{space 3} .0008926
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_math_both.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/spec_test_math_both.ster} saved

Linear regression                               Number of obs     = {res}   416,637
                                                {txt}F(1, 1242)        =  {res}    22.17
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0002
                                                {txt}Root MSE          =    {res}  .0168

{txt}{ralign 78:(Std. err. adjusted for {res:1,243} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}math_r_d_a~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_math_acs {c |}{col 14}{res}{space 2} .0019556{col 26}{space 2} .0004153{col 37}{space 1}    4.71{col 46}{space 3}0.000{col 54}{space 4} .0011408{col 67}{space 3} .0027704
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.93e-06{col 26}{space 2}   .00005{col 37}{space 1}   -0.06{col 46}{space 3}0.953{col 54}{space 4} -.000101{col 67}{space 3} .0000951
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_sib_acs.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_sib_acs.ster} saved

Linear regression                               Number of obs     = {res}   416,637
                                                {txt}F(1, 1242)        =  {res}    57.31
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0412
                                                {txt}Root MSE          =    {res}  .0499

{txt}{ralign 78:(Std. err. adjusted for {res:1,243} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}math_r_d_s~h{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}va_math_sib {c |}{col 14}{res}{space 2} .0877265{col 26}{space 2} .0115882{col 37}{space 1}    7.57{col 46}{space 3}0.000{col 54}{space 4} .0649918{col 67}{space 3} .1104611
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0001098{col 26}{space 2} .0011988{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-.0024617{col 67}{space 3} .0022421
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(note: file /home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_acs_sib.ster not found)
{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sib_acs_restr_smp/test_score_va/fb_test_math_acs_sib.ster} saved
{res}{txt}{p 0 4 2}
(file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/test_score_va/va_math_sib_acs.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sib_acs_restr_smp/test_score_va/va_math_sib_acs.dta{rm}
saved
{p_end}

{com}. 
. 
. timer off 1
{txt}
{com}. timer list
{res}   1:     45.84 /        1 =      45.8430
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sib_acs.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}28 Apr 2022, 23:04:38
{txt}{.-}
{smcl}
{txt}{sf}{ul off}