{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Apr 2022, 03:42:51
{txt}
{com}. 
. //run the do helper file to set the local macros
. include `vaprojdofiles'/sbac/macros_va.doh
{txt}
{com}. #delimit ;
{txt}delimiter now ;
{com}. *** file paths
> local home $vaprojdir ;
. local ca_ed_lab "/home/research/ca_ed_lab" ;
{txt}
{com}. local k12_test_scores "$vaprojdir/data/restricted_access/clean/k12_test_scores" ;
{txt}
{com}. local public_access "$vaprojdir/data/public_access" ;
{txt}
{com}. local k12_public_schools "$vaprojdir/data/public_access/clean/k12_public_schools" ;
{txt}
{com}. local k12_test_scores_public "$vaprojdir/data/public_access/clean/k12_test_scores" ;
{txt}
{com}. **** Dates ;
. local test_score_min_year
>         2015
>         ;
{txt}
{com}. local test_score_max_year
>         2018
>         ;
{txt}
{com}. local star_min_year
>         2003
>         ;
{txt}
{com}. local star_max_year
>         2013
>         ;
{txt}
{com}. local caaspp_min_year
>         2015
>         ;
{txt}
{com}. local caaspp_max_year
>         2019
>         ;
{txt}
{com}. local outcome_min_year
>         2015
>         ;
{txt}
{com}. local outcome_max_year
>         2018
>         ;
{txt}
{com}. **** Outcome Strings ;
. local ela_str
>         "ELA"
>         ;
{txt}
{com}. local math_str
>         "Math"
>         ;
{txt}
{com}. local enr_str
>         "Enrolled On Time"
>         ;
{txt}
{com}. local enr_2year_str
>         "Enrolled On Time 2-Year"
>         ;
{txt}
{com}. local enr_4year_str
>         "Enrolled On Time 4-Year"
>         ;
{txt}
{com}. **** Value Added ;
. local school_controls
>         /*cohort_size*/
>         ;
{txt}
{com}. local demographic_controls
>         age
>         i.male
>         i.eth_asian i.eth_hispanic i.eth_black i.eth_other
>         i.econ_disadvantage
>         i.limited_eng_prof
>         i.disabled
>         ;
{txt}
{com}. local peer_demographic_controls
>         peer_age
>         peer_male
>         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other
>         peer_econ_disadvantage
>         peer_limited_eng_prof
>         peer_disabled
>         ;
{txt}
{com}. local ela_score_controls
>         i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
>         ;
{txt}
{com}. local peer_ela_score_controls
>         i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
>         ;
{txt}
{com}. local math_score_controls
>         i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
>         ;
{txt}
{com}. local peer_math_score_controls
>         i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
>         ;
{txt}
{com}. local va_control_vars "`school_controls' `demographic_controls'" ;
{txt}
{com}. local va_control_vars : subinstr local va_control_vars "i." "", all ;
{txt}
{com}. local va_control_vars : list uniq va_control_vars ;
{txt}
{com}. local census_grade
>         6
>         ;
{txt}
{com}. local census_controls
>         /*eth_white_pct*/ eth_asian_pct eth_hispanic_pct eth_black_pct /*eth_other_pct*/
>         educ_hs_dropout_prop /*educ_deg_2year_prop*/ educ_deg_4year_plus_prop
>         pov_fam_child_lt18_pct
>         inc_median_hh
>         ;
{txt}
{com}. **** School Characteristics ;
. local sch_chars
>         fte_teach_pc fte_pupil_pc /*fte_admin_pc*/
>         /*eng_learner_staff_pc*/
>         new_teacher_prop
>         /*educ_grad_sch_prop educ_associate_prop*/
>         /*status_tenured_prop*/
>         credential_full_prop
>         /*authorization_stem_prop authorization_ela_prop*/
>         c.male_prop##c.enr_male_prop
>         c.eth_minority_prop##c.enr_minority_prop
>         enr_total
>         ;
{txt}
{com}. local sch_char_vars "`sch_chars'" ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "i." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "c." "", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "##" " ", all ;
{txt}
{com}. local sch_char_vars : subinstr local sch_char_vars "#" " ", all ;
{txt}
{com}. local sch_char_vars : list uniq sch_char_vars ;
{txt}
{com}. local dem_chars
>         enr_male_prop
>         enr_minority_prop
>         frpm_prop el_prop
>         enr_total
>         ;
{txt}
{com}. local dem_char_vars "`dem_chars'" ;
{txt}
{com}. local dem_char_vars : list uniq dem_char_vars ;
{txt}
{com}. local expenditures
>         expenditures_instr_pc
>         expenditures3000_pc
>         expenditures4000_pc
>         expenditures_other_pc
>         expenditures7000_pc
>         ;
{txt}
{com}. local expenditure_vars "`expenditures'" ;
{txt}
{com}. local expenditure_vars : list uniq expenditure_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_vars | dem_char_vars ;
{txt}
{com}. local sch_char_control_vars : list sch_char_control_vars | expenditure_vars ;
{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. {txt}
{com}. 
. #delimit ;
{txt}delimiter now ;
{com}. #delimit cr
{txt}delimiter now cr
{com}. macro list
{txt}{p 0 16}
vaprojxwalks:{space 3}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
mattxwalks:{space 5}{res}{res}/home/research/ca_ed_lab/users/msnaven/data/restricted_access/clean/crosswalks
{p_end}
{txt}{p 0 16}
nscdtadir_oldformat:{break}
{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc/oldformat
{p_end}
{txt}{p 0 16}
nscdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/cde_nsc
{p_end}
{txt}{p 0 16}
cstdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean//cde/cst
{p_end}
{txt}{p 0 16}
vadtadir:{space 7}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/sbac
{p_end}
{txt}{p 0 16}
vaprojdir:{space 6}{res}{res}/home/research/ca_ed_lab/projects/common_core_va
{p_end}
{txt}{p 0 16}
projdir:{space 8}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls
{p_end}
{txt}{p 0 16}
clndtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/clean/calschls
{p_end}
{txt}{p 0 16}
rawdtadir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/stata
{p_end}
{txt}{p 0 16}
rawcsvdir:{space 6}{res}{res}/home/research/ca_ed_lab/data/restricted_access/raw/calschls/csv
{p_end}
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
S_6:{space 12}{res}{res}.7097029923018954
{p_end}
{txt}{p 0 16}
S_5:{space 12}{res}{res}4
{p_end}
{txt}{p 0 16}
S_4:{space 12}{res}{res}.379339567907114
{p_end}
{txt}{p 0 16}
ReS_jv2:{space 8}{res}{res}__000006 __000007 __000008 __000009 __00000A __00000B __00000C __00000D __00000E __00000F __00000G __00000H __00000I __00000J __00000K
{p_end}
{txt}{p 0 16}
dropv:{space 10}{res}{res}_cdscode_x
{p_end}
{txt}{p 0 16}
n_offset:{space 7}{res}{res}0
{p_end}
{txt}{p 0 16}
sort:{space 11}{res}{res}0
{p_end}
{txt}{p 0 16}
dots:{space 11}{res}{res}nois _dots 5 0
{p_end}
{txt}{p 0 16}
dotss:{space 10}{res}{res}nois _dots 0, title(Survey results being calculated)
{p_end}
{txt}{p 0 16}
S_3:{space 12}{res}{res}.0104764158075594
{p_end}
{txt}{p 0 16}
ReS_Call:{space 7}{res}{res}version 16.1:
{p_end}
{txt}{p 0 16}
S_level:{space 8}{res}{res}95
{p_end}
{txt}{p 0 16}
F1:{space 13}{res}{res}help advice;
{p_end}
{txt}{p 0 16}
F2:{space 13}{res}{res}describe;
{p_end}
{txt}{p 0 16}
F7:{space 13}{res}{res}save 
{p_end}
{txt}{p 0 16}
F8:{space 13}{res}{res}use 
{p_end}
{txt}{p 0 16}
S_ADO:{space 10}{res}{res}BASE;SITE;.;PERSONAL;PLUS;OLDPLACE
{p_end}
{txt}{p 0 16}
S_StataMP:{space 6}{res}{res}MP
{p_end}
{txt}{p 0 16}
S_StataSE:{space 6}{res}{res}SE
{p_end}
{txt}{p 0 16}
S_CONSOLE:{space 6}{res}{res}console
{p_end}
{txt}{p 0 16}
S_OS:{space 11}{res}{res}Unix
{p_end}
{txt}{p 0 16}
S_MACH:{space 9}{res}{res}PC (64-bit x86-64)
{p_end}
{txt}{p 0 16}
_sch_char_control_vars:{break}
{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total frpm_prop el_prop expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditure_vars:{break}
{res}expenditures_instr_pc expenditures3000_pc expenditures4000_pc expenditures_other_pc expenditures7000_pc
{p_end}
{txt}{p 0 16}
_expenditures:{space 2}{res}{res}expenditures_instr_pc         expenditures3000_pc         expenditures4000_pc         expenditures_other_pc         expenditures7000_pc
{p_end}
{txt}{p 0 16}
_dem_char_vars:{space 1}{res}{res}enr_male_prop enr_minority_prop frpm_prop el_prop enr_total
{p_end}
{txt}{p 0 16}
_dem_chars:{space 5}{res}{res}enr_male_prop         enr_minority_prop         frpm_prop el_prop         enr_total
{p_end}
{txt}{p 0 16}
_sch_char_vars:{space 1}{res}{res}fte_teach_pc fte_pupil_pc new_teacher_prop credential_full_prop male_prop enr_male_prop eth_minority_prop enr_minority_prop enr_total
{p_end}
{txt}{p 0 16}
_sch_chars:{space 5}{res}{res}fte_teach_pc fte_pupil_pc                   new_teacher_prop                           credential_full_prop                  c.male_prop##c.enr_male_prop         c.eth_minority_prop##c.enr_minority_prop         enr_total
{p_end}
{txt}{p 0 16}
_census_controls:{break}
{res}eth_asian_pct eth_hispanic_pct eth_black_pct          educ_hs_dropout_prop  educ_deg_4year_plus_prop         pov_fam_child_lt18_pct         inc_median_hh
{p_end}
{txt}{p 0 16}
_census_grade:{space 2}{res}{res}6
{p_end}
{txt}{p 0 16}
_va_control_vars:{break}
{res}age male eth_asian eth_hispanic eth_black eth_other econ_disadvantage limited_eng_prof disabled
{p_end}
{txt}{p 0 16}
_peer_math_score_controls:{break}
{res}i.year#(c.peer_prior_math_z_score##c.peer_prior_math_z_score##c.peer_prior_math_z_score)
{p_end}
{txt}{p 0 16}
_math_score_controls:{break}
{res}i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score)
{p_end}
{txt}{p 0 16}
_peer_ela_score_controls:{break}
{res}i.year#(c.peer_prior_ela_z_score##c.peer_prior_ela_z_score##c.peer_prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_ela_score_controls:{break}
{res}i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score)
{p_end}
{txt}{p 0 16}
_peer_demographic_controls:{break}
{res}peer_age         peer_male         peer_eth_asian peer_eth_hispanic peer_eth_black peer_eth_other         peer_econ_disadvantage         peer_limited_eng_prof         peer_disabled
{p_end}
{txt}{p 0 16}
_demographic_controls:{break}
{res}age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled
{p_end}
{txt}{p 0 16}
_enr_4year_str:{space 1}{res}{res}Enrolled On Time 4-Year
{p_end}
{txt}{p 0 16}
_enr_2year_str:{space 1}{res}{res}Enrolled On Time 2-Year
{p_end}
{txt}{p 0 16}
_enr_str:{space 7}{res}{res}Enrolled On Time
{p_end}
{txt}{p 0 16}
_math_str:{space 6}{res}{res}Math
{p_end}
{txt}{p 0 16}
_ela_str:{space 7}{res}{res}ELA
{p_end}
{txt}{p 0 16}
_outcome_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_outcome_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_caaspp_max_year:{break}
{res}2019
{p_end}
{txt}{p 0 16}
_caaspp_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_star_max_year:{space 1}{res}{res}2013
{p_end}
{txt}{p 0 16}
_star_min_year:{space 1}{res}{res}2003
{p_end}
{txt}{p 0 16}
_test_score_max_year:{break}
{res}2018
{p_end}
{txt}{p 0 16}
_test_score_min_year:{break}
{res}2015
{p_end}
{txt}{p 0 16}
_k12_test_scores_public:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_k12_public_schools:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access/clean/k12_public_schools
{p_end}
{txt}{p 0 16}
_public_access:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/data/public_access
{p_end}
{txt}{p 0 16}
_k12_test_scores:{break}
{res}/home/research/ca_ed_lab/projects/common_core_va/data/restricted_access/clean/k12_test_scores
{p_end}
{txt}{p 0 16}
_ca_ed_lab:{space 5}{res}{res}/home/research/ca_ed_lab
{p_end}
{txt}{p 0 16}
_sibling_out_xwalk:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk
{p_end}
{txt}{p 0 16}
_k12_postsecondary_out_merge:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/k12_postsecondary_out_merge
{p_end}
{txt}{p 0 16}
_ufamilyxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/ufamilyxwalk
{p_end}
{txt}{p 0 16}
_siblingxwalk:{space 2}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/siblingpairxwalk
{p_end}
{txt}{p 0 16}
_va_g11_out_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_out_dataset
{p_end}
{txt}{p 0 16}
_va_g11_dataset:{break}
{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_g11_dataset
{p_end}
{txt}{p 0 16}
_va_dataset:{space 4}{res}{res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/va_dataset
{p_end}
{txt}{p 0 16}
_vaprojdofiles:{space 1}{res}{res}/home/research/ca_ed_lab/projects/common_core_va/do_files
{p_end}
{txt}{p 0 16}
_setlimit:{space 6}{res}{res}0
{p_end}
{txt}{p 0 16}
_1:{space 13}{res}{res}0
{p_end}
{txt}{p 0 16}
_0:{space 13}{res}{res}0
{p_end}
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. 
. ********************************************************************************
. 
. 
. //load the VA grade 11 sample
. use `va_g11_dataset', clear
{txt}(CST/SBAC Student Test Score Samples)

{com}. 
. //merge on to sibling outcomes crosswalk to get sibling enrollment controls
. merge m:1 state_student_id using `sibling_out_xwalk', nogen keep(1 3)
       {txt}=void resultlist(string scalar macname)
       =        string rowvector    src
       =        string colvector    res
       =        real scalar    i
       =string scalar result(string scalar result)
       =        real scalar    l
       =void resulttext(string scalar macroname, real scalar i)
       =        string scalar    toret
       =void map_mtype(string scalar macname)
       =        string scalar    input, toret
       =void fullfilename(string scalar forstatamac, string scalar fullnamemac, string scalar macname)
       =        string scalar    fullname, path, filename
       =        real scalar    l
       {hline 56} begin merge {hline}
03     - version 11
03     - gettoken mtype 0 : 0, parse(" ,")
03     - if (!strpos("`mtype'", ":") & "`mtype'"!="") {c -(}
       = if (!strpos("m:1", ":") & "m:1"!="") {c -(}
03       if (_caller()>=11) {c -(}
03       di as smcl as txt "{c -(}p{c )-}"
03       di as smcl "(you are using old"
03       di as smcl "{c -(}bf:merge{c )-} syntax; see"
03       di as smcl "{c -(}bf:{c -(}help merge:[D] merge{c )-}{c )-} for new syntax)"
03       di as smcl "{c -(}p_end{c )-}"
03       {c )-}
03       merge_10 `mtype' `0'
03       exit
03       {c )-}
03     - local origmtype `"`mtype'"'
       = local origmtype `"m:1"'
03     - mata: map_mtype(`"mtype"')
{res}{txt}03     - gettoken token : 0, parse(" ,")
03     - if ("`token'"=="_n") {c -(}
       = if ("state_student_id"=="_n") {c -(}
03       if ("`mtype'"!="1:1") {c -(}
03       error_seq_not11 "`mtype'" "`origmtype'"
03       {c )-}
03       gettoken token 0 : 0, parse(" ,")
03       local mtype "_n"
03       {c )-}
03     - syntax [varlist(default=none)] using/ [, ASSERT(string) DEBUG GENerate(name) FORCE KEEP(string) KEEPUSing(string) noLabels NOGENerate noNOTEs REPLACE noREPort SORTED UPDATE ]
03     - if ("`mtype'"!="_n") {c -(}
       = if ("m:1"!="_n") {c -(}
03     - local origmtype `"`mtype'"'
       = local origmtype `"m:1"'
03     - mata: map_mtype(`"mtype"')
{res}{txt}03     - if ("`varlist'"=="") {c -(}
       = if ("state_student_id"=="") {c -(}
03       error_mat_varlist "`mtype'" "`origmtype'"
03       {c )-}
03     - {c )-}
03     - else {c -(}
03       if ("`mtype'"=="_n") {c -(}
03       if ("`varlist'"!="") {c -(}
03       error_seq_varlist
03       {c )-}
03       {c )-}
03       {c )-}
03     - mata: fullfilename("using", "usingfull", "using")
{res}{txt}03     - mata: resultlist("assert")
{res}{txt}03     - mata: resultlist("keep")
{res}{txt}03     - if ("`generate'"!="") {c -(}
       = if (""!="") {c -(}
03       if ("`nogenerate'"!="") {c -(}
03       di as smcl err "{c -(}p{c )-}"
03       di as smcl "options -generate()- and -nogenerate-"
03       di as smcl "may not be specified together."
03       di as smcl err "{c -(}p_end{c )-}"
03       {c )-}
03       confirm new var `generate'
03       {c )-}
03     - if ("`replace'"!="") {c -(}
       = if (""!="") {c -(}
03       if ("`update'"=="") {c -(}
03       error_replace
03       {c )-}
03       {c )-}
03     - if ("`sorted'"=="" & "`mtype'"!="_n") {c -(}
       = if (""=="" & "m:1"!="_n") {c -(}
03     - local sortedby : sortedby
03     - checksort "`sortedby'" "`varlist'"
       = checksort "" "state_student_id"
03     - if (!r(sorted)) {c -(}
03     - sort `varlist'
       = sort state_student_id
03     - {c )-}
03     - quietly describe using "`using'", varlist short
       = quietly describe using "/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk.dta", varlist short
03     - local sortedby "`r(sortlist)'"
       = local sortedby "ufamilyid birth_order"
03     - checksort "`sortedby'" "`varlist'"
       = checksort "ufamilyid birth_order" "state_student_id"
03     - if (!r(sorted)) {c -(}
03     - preserve
03     - qui use "`using'", clear
       = qui use "/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/siblingxwalk/sibling_out_xwalk.dta", clear
03     - sort `varlist'
       = sort state_student_id
03     - tempfile using
03     - qui save "`using'", replace
       = qui save "/home/tmp/St192370.000002", replace
03     - restore
03     - {c )-}
03     - {c )-}
03     - if ("`nogenerate'"!="") {c -(}
       = if ("nogenerate"!="") {c -(}
03     - tempvar mergevar
03     - local mergevaristemp 1
03     - {c )-}
03     - else {c -(}
03       local mergevar = cond("`generate'"!="", "`generate'", "_merge")
03       local mergevaristemp 0
03       {c )-}
03     - local options `update' `replace' `notes' `labels' _merge(`mergevar') `force'
       = local options     _merge(__000000) 
03     - if (bsubstr("`mtype'", 1, 1)=="1") {c -(}
       = if (bsubstr("m:1", 1, 1)=="1") {c -(}
03       local options `options' uniqmaster
03       {c )-}
03     - if (bsubstr("`mtype'", 3, 1)=="1") {c -(}
       = if (bsubstr("m:1", 3, 1)=="1") {c -(}
03     - local options `options' uniqusing
       = local options _merge(__000000) uniqusing
03     - {c )-}
03     - if ("`keepusing'"!="") {c -(}
       = if (""!="") {c -(}
03       local options `options' keep(`keepusing')
03       {c )-}
03     - if ("`keep'" !="" & !strpos("`keep'" , "2")) {c -(}
       = if ("1 3" !="" & !strpos("1 3" , "2")) {c -(}
03     - local options `options' nokeep
       = local options _merge(__000000) uniqusing nokeep
03     - {c )-}
03     - if (_caller() > 15) {c -(}
03     - local version : di "version " string(_caller()) ": "
03     - {c )-}
03     - local _merge `"`version'_merge `varlist' using "`using'", nowarn"'
       = local _merge `"version 17: _merge state_student_id using "/home/tmp/St192370.000002", nowarn"'
03     - local _merge `"`_merge' `options' tabulate(mresults)"'
       = local _merge `"version 17: _merge state_student_id using "/home/tmp/St192370.000002", nowarn _merge(__000000) uniqusing nokeep tabulate(mresults)"'
03     - if ("`debug'"!="") {c -(}
       = if (""!="") {c -(}
03       di as txt _n "command is"
03       di `"`_merge'"' _n
03       {c )-}
03     - `_merge'
       = version 17: _merge state_student_id using "/home/tmp/St192370.000002", nowarn _merge(__000000) uniqusing nokeep tabulate(mresults)
03     - if (!`mergevaristemp') {c -(}
       = if (!1) {c -(}
03       capture label list _merge
03       if (_rc) {c -(}
03       label define _merge 1 "Master only (1)" 2 "Using only (2)" 3 "Matched (3)" 4 "Missing updated (4)" 5 "Nonmissing conflict (5)"
03       {c )-}
03       label values `mergevar' _merge
03       label variable `mergevar' "Matching result from merge"
03       {c )-}
03     - if ("`assert'"!="") {c -(}
       = if (""!="") {c -(}
03       if (_caller() < 13) {c -(}
03       buildexpr expr : `mergevar' "`assert'"
03       capture assert `expr'
03       if (_rc) {c -(}
03       error_assert `mergevar' "`assert'"
03       {c )-}
03       {c )-}
03       else {c -(}
03       capture checkmresults "`mresults'" "`assert'"
03       if (_rc) {c -(}
03       error_assert `mergevar' "`assert'"
03       {c )-}
03       {c )-}
03       {c )-}
03     - if ("`keep'"!="") {c -(}
       = if ("1 3"!="") {c -(}
03     - buildexpr expr : `mergevar' "`keep'"
       = buildexpr expr : __000000 "1 3"
03     - quietly keep if `expr'
       = quietly keep if (__000000==1 | __000000==3)
03     - {c )-}
03     - if ("`mtype'"=="1:1") {c -(}
       = if ("m:1"=="1:1") {c -(}
03       qui count if `mergevar'==2
03       if (r(N)==0) {c -(}
03       sort `varlist'
03       {c )-}
03       {c )-}
03     - if (c(noisily) & "`report'"=="") {c -(}
       = if (c(noisily) & ""=="") {c -(}
03     - local isupdate = ("`replace'"!="" | "`update'"!="")
       = local isupdate = (""!="" | ""!="")
03     - present_table `isupdate' `mergevar' `mergevaristemp'
       = present_table 0 __000000 1

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         884,570
{txt}{col 9}from master{col 30}{res}         884,570{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}         900,294{txt}  
{col 5}{hline 41}
03     - {c )-}
       {hline 58} end merge {hline}

{com}. 
. drop if mi(has_older_sibling_enr_2year)
{txt}(884,570 observations deleted)

{com}. drop if mi(has_older_sibling_enr_4year)
{txt}(0 observations deleted)

{com}. 
. compress
  {txt}variable {bf}{res}age{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (1,800,588 bytes saved)

{com}. tempfile va_g11_sibling_dataset
{txt}
{com}. save `va_g11_sibling_dataset'
{txt}{p 0 4 2}
file {bf}
/home/tmp/St192370.000001{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. ********************************************************************************
. *********** VA estimates for VA samples matched to siblings sample
. ********************************************************************************
. 
. 
. if `setlimit' == 0 {c -(}
.   local drift_limit = max(`test_score_max_year' - `test_score_min_year' - 1, 1)
. {c )-}
{txt}
{com}. else {c -(}
.   local drift_limit = `setlimit'
. {c )-}
{txt}
{com}. 
. foreach subject in ela math {c -(}
{txt}  2{com}. 
. 
.     /* load the VA g11 subject sample with siblings outcome sample
>      (those who have at least one older sibling matched to the postsecondary
>    outcomes) */
.     use `va_g11_sibling_dataset' if touse_g11_`subject'==1 & sibling_out_sample == 1, clear
{txt}  3{com}. 
.     ******************************************************************************
.     ************ Value added estimation with no peer controls ********************
.     ****** No TFX, without sibling college going controls
.     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`subject'_nosibctrl.ster, replace)
{txt}  4{com}. 
.     //rename the first time to make sure indep var names for spec test are all the same
.     rename tv va_cfr_g11_`subject'
{txt}  5{com}.         rename score_r sbac_g11_`subject'_r
{txt}  6{com}. 
. 
.     ************ specification test: regressing score residuals on VA estimates
.     ******* No peer controls
.     ******** sibling sample without sibling controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
{txt}  7{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_nocontrol.ster, replace
{txt}  8{com}.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_nocontrol.ster, replace
{txt}  9{com}. 
.     //rename again to distinguish between nocontrol and with control va estimates
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
{txt} 10{com}.     rename sbac_g11_`subject'_r sbac_g11_`subject'_r_nosibctrl
{txt} 11{com}.     label var va_cfr_g11_`subject'_nosibctrl "`subject' VA with family FE without TFX without sibling control"
{txt} 12{com}.     label var sbac_g11_`subject'_r_nosibctrl "`subject' score residual with family FE without TFX without sibling control"
{txt} 13{com}. 
.     ****** No TFX (teacher fixed effects), include sibling controls
.     vam sbac_`subject'_z_score ///
>                 , teacher(school_id) year(year) class(school_id) ///
>                 controls( ///
>                         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>                         `school_controls' ///
>                         `demographic_controls' ///
>                         `ela_score_controls' ///
>                         `math_score_controls' ///
>                 ) ///
>                 data(merge tv score_r) ///
>                 driftlimit(`drift_limit') ///
>       estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`subject'.ster, replace)
{txt} 14{com}. 
. 
.     rename tv va_cfr_g11_`subject'
{txt} 15{com}.         rename score_r sbac_g11_`subject'_r
{txt} 16{com}. 
.     ************ specification test: regressing score residuals on VA estimates
.     ******* No peer controls
.     ******** sibling sample with sibling controls
.     reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
{txt} 17{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 18{com}.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 19{com}. 
. 
. 
.     label var va_cfr_g11_`subject' "`subject' VA with family FE without TFX"
{txt} 20{com}.     label var sbac_g11_`subject'_r "`subject' score residual with family FE without TFX"
{txt} 21{com}. 
. /*
>     ****** With TFX, and TFX is added back in the the VA estimates
>     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_tfx_g11_`subject'
>     drop score_r
>     label var va_tfx_g11_`subject' "`subject' VA with family FE with TFX"
> 
> 
>  */
. 
. 
. 
. 
. 
. 
. 
.     ******************************************************************************
.     ************ Value added estimation with peer controls ********************
.     ****** No TFX (teacher fixed effects)
.     /* vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_cfr_g11_`subject'_peer
>     rename score_r sbac_g11_`subject'_r_peer
>     label var va_cfr_g11_`subject'_peer "`subject' VA with family FE with TFX"
>     label var sbac_g11_`subject'_r_peer "`subject' score residual with family FE with TFX"
> 
> 
>     ****** With TFX
>     vam sbac_`subject'_z_score ///
>       , teacher(school_id) year(year) class(school_id) ///
>       controls( ///
>         i.year ///
>         i.has_older_sibling_enr_2year ///
>         i.has_older_sibling_enr_4year ///
>         `school_controls' ///
>         `demographic_controls' ///
>         `ela_score_controls' ///
>         `math_score_controls' ///
>         `peer_demographic_controls' ///
>         `peer_ela_score_controls' ///
>         `peer_math_score_controls' ///
>       ) ///
>       tfx_resid(school_id) ///
>       data(merge tv score_r) ///
>       driftlimit(`drift_limit')
>     rename tv va_tfx_g11_`subject'_peer
>     drop score_r */
. 
. 
.     ******************************************************************************
.     ************ specification test: regressing score residuals on VA estimates
. 
.     /* ******* With peer controls
>     reg sbac_g11_`subject'_r_peer va_cfr_g11_`subject'_peer, cluster(school_id)
>     estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_peer_sibling.ster, replace */
. 
. 
. 
. 
.     ******************************************************************************
.     /* CFR Forecast Bias Test */
.     ***** leave out variable is sibling controls
.     **no peer controls
.     gen sbac_g11_`subject'_r_d = sbac_g11_`subject'_r_nosibctrl - sbac_g11_`subject'_r
{txt} 22{com}.     //var rename gymnastics to make sure the indep var names are all the same when making tables later
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_temp
{txt} 23{com}.     rename va_cfr_g11_`subject'_nosibctrl va_cfr_g11_`subject'
{txt} 24{com}. 
.     reg sbac_g11_`subject'_r_d va_cfr_g11_`subject',    cluster(school_id)
{txt} 25{com}.     //save to my personal folder
.     estimates save $projdir/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 26{com}.     //save to VA project folder
.     estimates save $vaprojdir/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_`subject'_sibling.ster, replace
{txt} 27{com}. 
.     //roll back the rename gymnastics to restore original var names
.     rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
{txt} 28{com}.     rename va_cfr_g11_`subject'_temp va_cfr_g11_`subject'
{txt} 29{com}. 
. 
.     **************** Save Value Added Estimates
.     collapse (firstnm) va_* ///
>                 (mean) sbac_*_r* ///
>                 (sum) n_g11_`subject' = touse_g11_`subject' ///
>       if sibling_full_sample == 1 & sibling_out_sample == 1 ///
>                 , by(school_id cdscode grade year)
{txt} 30{com}.     //save to my personal folder
.         save $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibling.dta, replace
{txt} 31{com}.     //save to VA project folder
.     save $vaprojdir/data/sibling_va/test_score_va/va_g11_`subject'_sibling.dta, replace
{txt} 32{com}. 
. 
. {c )-}
{txt}02   - foreach subject in ela math {c -(}
02   - use `va_g11_sibling_dataset' if touse_g11_`subject'==1 & sibling_out_sample == 1, clear
     = use /home/tmp/St192370.000001 if touse_g11_ela==1 & sibling_out_sample == 1, clear
(CST/SBAC Student Test Score Samples)
02   - vam sbac_`subject'_z_score , teacher(school_id) year(year) class(school_id) controls( i.year `school_controls' `demographic_controls' `ela_score_controls' `math_score_controls' ) data(merge tv score_r) driftlimit(`drift_limit') estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`subject'_nosibctrl.ster, replace)
     = vam sbac_ela_z_score , teacher(school_id) year(year) class(school_id) controls( i.year  age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score) i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score) ) data(merge tv score_r) driftlimit(2) estimates(/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela_nosibctrl.ster, replace)
       {hline 58} begin vam {hline}
03     - version 10.1
03     - set more off
03     - syntax varname(ts fv) [aweight/], teacher(varname) year(varname) class(varname) [ by(varlist) controls(varlist ts fv) absorb(varname) tfx_resid(varname) data(string) output(string) output_addvars(varlist) driftlimit(integer -1) QUASIexperiment CONStant noseed varclasszero estimates(string asis)]
03     - local depvar `varlist'
       = local depvar sbac_ela_z_score
03     - capture confirm variable score_r, exact
03     - if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named score_r."
03       exit 110
03       {c )-}
03     - capture confirm variable tv, exact
03     - if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv."
03       exit 110
03       {c )-}
03     - if ("`quasiexperiment'"!="") {c -(}
       = if (""!="") {c -(}
03       capture confirm variable tv_2yr_l, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_2yr_l."
03       exit 110
03       {c )-}
03       capture confirm variable tv_2yr_f, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_2yr_f."
03       exit 110
03       {c )-}
03       capture confirm variable tv_ss, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_ss."
03       exit 110
03       {c )-}
03       {c )-}
03     - local merge_tv=0
03     - local merge_resid=0
03     - if ("`data'"=="") local data="preserve"
       = if ("merge tv score_r"=="") local data="preserve"
03     - else {c -(}
03     - if !inlist("`data'","preserve","tv","merge tv","merge score_r","merge tv score_r","merge score_r tv","variance") {c -(}
       = if !inlist("merge tv score_r","preserve","tv","merge tv","merge score_r","merge tv score_r","merge score_r tv","variance") {c -(}
03       di as error "Not a valid argument for data. Choose either 'preserve', 'tv', 'merge [tv AND/OR score_r]', or 'variance'."
03       exit 198
03       {c )-}
03     - else {c -(}
03     - tokenize "`data'"
       = tokenize "merge tv score_r"
03     - if ("`1'")=="merge" {c -(}
       = if ("merge")=="merge" {c -(}
03     - if ("`2'"=="tv") | ("`3'"=="tv") local merge_tv=1
       = if ("tv"=="tv") | ("score_r"=="tv") local merge_tv=1
03     - if ("`2'"=="score_r") | ("`3'"=="score_r") local merge_resid=1
       = if ("tv"=="score_r") | ("score_r"=="score_r") local merge_resid=1
03     - {c )-}
03     - {c )-}
03     - {c )-}
03     - if "`tfx_resid'"!="" & "`absorb'"!="" {c -(}
       = if ""!="" & ""!="" {c -(}
03       di as error "Cannot specify an absorb variable and a tfx_resid variable simultaneously."
03       exit 198
03       {c )-}
03     - if `"`output'"'=="" {c -(}
       = if `""'=="" {c -(}
03     - tempfile output
03     - local nooutput=1
03     - {c )-}
03     - else local nooutput=0
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       tempvar byvar
03       egen `byvar'=group(`by'), label
03       sum `byvar', meanonly
03       local by_vals=`r(max)'
03       {c )-}
03     - else local by_vals=1
03     - if "`weight'"!="" {c -(}
       = if ""!="" {c -(}
03       local ind_weight "`weight'"
03       macro drop _weight
03       local ind_exp "`exp'"
03       macro drop _exp
03       local times_exp "* `exp'"
03       {c )-}
03     - preserve
03     - local firstloop=1
03     - forvalues l=1/`by_vals' {c -(}
       = forvalues l=1/1 {c -(}
03     - if (`firstloop'!=1) restore, preserve
       = if (1!=1) restore, preserve
03     - di "{c -(}txt{c )-}{c -(}hline{c )-}"
{txt}{hline}
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       local bylabel : label `byvar' `l', strict
03       di "{c -(}bf:-> by variables:{c )-} `by' = `bylabel'"
03       {c )-}
03     - qui drop if missing(`teacher',`year',`class')
       = qui drop if missing(school_id,year,school_id)
03     - if ("`by'"!="") qui keep if `byvar'==`l'
       = if (""!="") qui keep if ==1
03     - if "`absorb'"!="" | "`tfx_resid'"!="" {c -(}
       = if ""!="" | ""!="" {c -(}
03       if "`ind_weight'"=="" {c -(}
03       noisily areg `depvar' `controls' , absorb(`absorb'`tfx_resid')
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03       else if "`ind_weight'"!="" {c -(}
03       noisily areg `depvar' `controls' [`ind_weight' = `ind_exp'] , absorb(`absorb'`tfx_resid')
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - if "`ind_weight'"=="" {c -(}
       = if ""=="" {c -(}
03     - version 11 : noisily reg `depvar' `controls'
       = version 11 : noisily reg sbac_ela_z_score i.year age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other i.econ_disadvantage i.limited_eng_prof i.disabled i.year#c.prior_ela_z_score i.year#c.prior_ela_z_score#c.prior_ela_z_score i.year#c.prior_ela_z_score#c.prior_ela_z_score#c.prior_ela_z_score i.year#c.prior_math_z_score i.year#c.prior_math_z_score#c.prior_math_z_score i.year#c.prior_math_z_score#c.prior_math_z_score#c.prior_math_z_score

      Source {c |}       SS           df       MS      Number of obs   ={res}   677,254
{txt}{hline 13}{c +}{hline 34}   F(36, 677217)   = {res} 28471.16
{txt}       Model {c |} {res} 329901.804        36  9163.93899   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 217974.086   677,217  .321867416   {txt}R-squared       ={res}    0.6021
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6021
{txt}       Total {c |} {res} 547875.889   677,253  .808967829   {txt}Root MSE        =   {res} .56733

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0499644{col 26}{space 2} .0027484{col 37}{space 1}   18.18{col 46}{space 3}0.000{col 54}{space 4} .0445776{col 67}{space 3} .0553512
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0676601{col 26}{space 2} .0027356{col 37}{space 1}   24.73{col 46}{space 3}0.000{col 54}{space 4} .0622985{col 67}{space 3} .0730217
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0710576{col 26}{space 2} .0027417{col 37}{space 1}  -25.92{col 46}{space 3}0.000{col 54}{space 4}-.0764313{col 67}{space 3} -.065684
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003426{col 26}{space 2} 4.88e-06{col 37}{space 1}  -70.14{col 46}{space 3}0.000{col 54}{space 4}-.0003522{col 67}{space 3} -.000333
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0902902{col 26}{space 2} .0014094{col 37}{space 1}  -64.06{col 46}{space 3}0.000{col 54}{space 4}-.0930527{col 67}{space 3}-.0875278
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1036863{col 26}{space 2}  .002264{col 37}{space 1}   45.80{col 46}{space 3}0.000{col 54}{space 4} .0992489{col 67}{space 3} .1081236
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0050762{col 26}{space 2} .0019297{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.0088584{col 67}{space 3} -.001294
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1444525{col 26}{space 2} .0037981{col 37}{space 1}  -38.03{col 46}{space 3}0.000{col 54}{space 4}-.1518967{col 67}{space 3}-.1370083
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0043308{col 26}{space 2} .0042032{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4}-.0039074{col 67}{space 3} .0125689
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0366117{col 26}{space 2} .0016359{col 37}{space 1}  -22.38{col 46}{space 3}0.000{col 54}{space 4} -.039818{col 67}{space 3}-.0334053
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2115924{col 26}{space 2} .0036819{col 37}{space 1}  -57.47{col 46}{space 3}0.000{col 54}{space 4}-.2188087{col 67}{space 3} -.204376
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1861937{col 26}{space 2} .0037187{col 37}{space 1}  -50.07{col 46}{space 3}0.000{col 54}{space 4}-.1934822{col 67}{space 3}-.1789052
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6117768{col 26}{space 2} .0027977{col 37}{space 1}  218.67{col 46}{space 3}0.000{col 54}{space 4} .6062934{col 67}{space 3} .6172602
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .593261{col 26}{space 2} .0027254{col 37}{space 1}  217.68{col 46}{space 3}0.000{col 54}{space 4} .5879193{col 67}{space 3} .5986027
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5819387{col 26}{space 2} .0028658{col 37}{space 1}  203.07{col 46}{space 3}0.000{col 54}{space 4} .5763219{col 67}{space 3} .5875555
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5727827{col 26}{space 2} .0034906{col 37}{space 1}  164.09{col 46}{space 3}0.000{col 54}{space 4} .5659413{col 67}{space 3} .5796241
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0002419{col 26}{space 2} .0014746{col 37}{space 1}    0.16{col 46}{space 3}0.870{col 54}{space 4}-.0026483{col 67}{space 3} .0031321
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0138144{col 26}{space 2} .0014878{col 37}{space 1}   -9.29{col 46}{space 3}0.000{col 54}{space 4}-.0167304{col 67}{space 3}-.0108984
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0132171{col 26}{space 2} .0014998{col 37}{space 1}   -8.81{col 46}{space 3}0.000{col 54}{space 4}-.0161566{col 67}{space 3}-.0102775
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0110561{col 26}{space 2} .0015063{col 37}{space 1}    7.34{col 46}{space 3}0.000{col 54}{space 4} .0081038{col 67}{space 3} .0140084
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275553{col 26}{space 2} .0006825{col 37}{space 1}  -40.37{col 46}{space 3}0.000{col 54}{space 4}-.0288931{col 67}{space 3}-.0262176
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0226716{col 26}{space 2} .0006239{col 37}{space 1}  -36.34{col 46}{space 3}0.000{col 54}{space 4}-.0238944{col 67}{space 3}-.0214489
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0236694{col 26}{space 2} .0006071{col 37}{space 1}  -38.99{col 46}{space 3}0.000{col 54}{space 4}-.0248592{col 67}{space 3}-.0224796
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0294713{col 26}{space 2} .0009879{col 37}{space 1}  -29.83{col 46}{space 3}0.000{col 54}{space 4}-.0314076{col 67}{space 3} -.027535
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1695626{col 26}{space 2}  .002779{col 37}{space 1}   61.01{col 46}{space 3}0.000{col 54}{space 4} .1641157{col 67}{space 3} .1750094
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .1896512{col 26}{space 2} .0028265{col 37}{space 1}   67.10{col 46}{space 3}0.000{col 54}{space 4} .1841112{col 67}{space 3} .1951911
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1889889{col 26}{space 2} .0029484{col 37}{space 1}   64.10{col 46}{space 3}0.000{col 54}{space 4} .1832101{col 67}{space 3} .1947678
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2478465{col 26}{space 2} .0035318{col 37}{space 1}   70.18{col 46}{space 3}0.000{col 54}{space 4} .2409242{col 67}{space 3} .2547687
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0045974{col 26}{space 2} .0018502{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.0082238{col 67}{space 3}-.0009711
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0127122{col 26}{space 2} .0018014{col 37}{space 1}   -7.06{col 46}{space 3}0.000{col 54}{space 4}-.0162428{col 67}{space 3}-.0091815
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0071678{col 26}{space 2} .0018429{col 37}{space 1}   -3.89{col 46}{space 3}0.000{col 54}{space 4}-.0107798{col 67}{space 3}-.0035559
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0042888{col 26}{space 2} .0014656{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .0014163{col 67}{space 3} .0071613
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0031236{col 26}{space 2} .0007616{col 37}{space 1}   -4.10{col 46}{space 3}0.000{col 54}{space 4}-.0046164{col 67}{space 3}-.0016309
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0035752{col 26}{space 2} .0008052{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-.0051535{col 67}{space 3} -.001997
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0066743{col 26}{space 2} .0007956{col 37}{space 1}   -8.39{col 46}{space 3}0.000{col 54}{space 4}-.0082336{col 67}{space 3}-.0051149
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.005854{col 26}{space 2} .0009793{col 37}{space 1}   -5.98{col 46}{space 3}0.000{col 54}{space 4}-.0077734{col 67}{space 3}-.0039346
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.270121{col 26}{space 2} .0299192{col 37}{space 1}   75.88{col 46}{space 3}0.000{col 54}{space 4}  2.21148{col 67}{space 3} 2.328761
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}03     - if `"`estimates'"'!="" {c -(}
       = if `"/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela_nosibctrl.ster, replace"'!="" {c -(}
03     - estimates save `estimates'
       = estimates save /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela_nosibctrl.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela_nosibctrl.ster} saved
03     - {c )-}
03     - {c )-}
03     - else if "`ind_weight'"!="" {c -(}
       = else if ""!="" {c -(}
03       version 11 : noisily reg `depvar' `controls' [`ind_weight' = `ind_exp']
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03     - {c )-}
03     - if "`tfx_resid'"=="" {c -(}
       = if ""=="" {c -(}
03     - qui predict score_r if e(sample),r
03     - if "`constant'"!="" {c -(}
       = if ""!="" {c -(}
03       gen b_cons = _b[_cons] if e(sample)
03       {c )-}
03     - {c )-}
03     - else {c -(}
03       qui predict score_r if e(sample), dresiduals
03       if "`constant'"!="" {c -(}
03       gen b_cons = _b[_cons] if e(sample)
03       {c )-}
03       {c )-}
03     - if "`ind_weight'"!="" {c -(}
       = if ""!="" {c -(}
03       tempvar tot_ind_weight class_ind_weight
03       qui egen `tot_ind_weight' = total(`ind_exp') if !mi(score_r)
03       qui egen `class_ind_weight' = total(`ind_exp') if !mi(score_r), by(`teacher' `year' `group' `class')
03       {c )-}
03     - if `merge_resid'==1 {c -(}
       = if 1==1 {c -(}
03     - tempfile resid_data_`l'
       = tempfile resid_data_1
03     - qui save `"`resid_data_`l''"', replace
       = qui save `"/home/tmp/St192370.000004"', replace
03     - {c )-}
03     - tempname num_obs num_par
03     - scalar `num_obs' = e(N)
       = scalar __000000 = e(N)
03     - if "`absorb'"!="" {c -(}
       = if ""!="" {c -(}
03       scalar `num_par' = e(df_m) + e(df_a) + 1
03       {c )-}
03     - else {c -(}
03     - scalar `num_par' = e(df_m) + 1
       = scalar __000001 = e(df_m) + 1
03     - {c )-}
03     - tempvar n_tested
03     - qui bys `teacher' `year' `group' `class': egen `n_tested' = count(score_r)
       = qui bys school_id year  school_id: egen __000002 = count(score_r)
03     - tempvar class_mean index
03     - qui by `teacher' `year' `group' `class': egen `class_mean' = mean(score_r)
       = qui by school_id year  school_id: egen __000003 = mean(score_r)
03     - qui by `teacher' `year' `group' `class': g `index' = _n
       = qui by school_id year  school_id: g __000004 = _n
03     - tempname var_total
03     - qui sum score_r
03     - scalar `var_total' = r(Var)*((`num_obs' - 1)/(`num_obs' - `num_par'))
       = scalar __000005 = r(Var)*((__000000 - 1)/(__000000 - __000001))
03     - tempname num_class var_ind var_class
03     - tempvar individual_dev_from_class
03     - qui gen `individual_dev_from_class' = score_r - `class_mean'
       = qui gen __000009 = score_r - __000003
03     - qui count if `index'==1 & `n_tested'!=0
       = qui count if __000004==1 & __000002!=0
03     - scalar `num_class' = r(N)
       = scalar __000006 = r(N)
03     - qui sum `individual_dev_from_class'
       = qui sum __000009
03     - scalar `var_ind' = r(Var)*((`num_obs' - 1)/(`num_obs' - `num_class' - `num_par' + 1))
       = scalar __000007 = r(Var)*((__000000 - 1)/(__000000 - __000006 - __000001 + 1))
03     - qui by `teacher' `year' `group' `class': keep if _n==1
       = qui by school_id year  school_id: keep if _n==1
03     - if "`seed'"=="" {c -(}
       = if ""=="" {c -(}
03     - set seed 9827496
03     - {c )-}
03     - tempvar rand classnum
03     - g `rand'=uniform()
       = g __00000A=uniform()
03     - bys `teacher' `year' (`rand'): gen `classnum'=_n
       = bys school_id year (__00000A): gen __00000B=_n
03     - tempname cov_sameyear corr_sameyear obs_sameyear
03     - qui sum `classnum'
       = qui sum __00000B
03     - if (r(max)==1) {c -(}
03     - local missing_sameyear=1
03     - scalar `cov_sameyear'=0
       = scalar __00000C=0
03     - {c )-}
03     - else {c -(}
03       local missing_sameyear=0
03       tempvar identifier
03       egen `identifier'=group(`teacher' `year')
03       qui tsset `identifier' `classnum'
03       qui corr `class_mean' f.`class_mean' [aw=`n_tested'+f.`n_tested'], cov
03       scalar `cov_sameyear'=r(cov_12)
03       scalar `corr_sameyear'=r(cov_12) / ( sqrt(r(Var_1)) * sqrt(r(Var_2)) )
03       scalar `obs_sameyear'=r(N)
03       {c )-}
03     - scalar `var_class' = `var_total' - `var_ind' - `cov_sameyear'
       = scalar __000008 = __000005 - __000007 - __00000C
03     - if (`var_class'<0) {c -(}
       = if (__000008<0) {c -(}
03       if ("`varclasszero'"!="varclasszero") {c -(}
03       di as error "Note: var_class has been computed as being less than 0."
03       di "var_class is defined as = var_total - var_ind - cov_sameyear."
03       di "Computed variances: var_total, var_ind, cov_sameyear, var_class"
03       di `var_total',`var_ind',`cov_sameyear',`var_class'
03       di "This negative variance can occur because cov_sameyear is calculated using only the subsample of observations that teach multiple classes per year (in the same by-group)."
03       {c )-}
03       else if ("`varclasszero'"=="varclasszero") {c -(}
03       scalar `var_class' = 0
03       {c )-}
03       {c )-}
03     - tempvar weight
03     - qui g `weight'=1/(`var_class' + `var_ind'/`n_tested')
       = qui g __00000F=1/(__000008 + __000007/__000002)
03     - tempvar excess_weight
03     - qui gen `excess_weight'=(missing(`weight'))
       = qui gen __00000G=(missing(__00000F))
03     - qui replace `weight'=1 if missing(`weight')
       = qui replace __00000F=1 if missing(__00000F)
03     - collapse (mean) `class_mean' (rawsum) `weight' `n_tested' `excess_weight' [aw=`weight'], by(`teacher' `year' `by') fast
       = collapse (mean) __000003 (rawsum) __00000F __000002 __00000G [aw=__00000F], by(school_id year ) fast
{res}{txt}03     - qui replace `weight'=`weight'-`excess_weight'
       = qui replace __00000F=__00000F-__00000G
03     - qui tsset `teacher' `year'
       = qui tsset school_id year
03     - tempvar minyear maxyear diff validyear minvalidyear maxvalidyear diffvalid
03     - qui bys `teacher': egen `minyear'=min(`year')
       = qui bys school_id: egen __00000H=min(year)
03     - qui by `teacher': egen `maxyear'=max(`year')
       = qui by school_id: egen __00000I=max(year)
03     - qui g `diff'=`maxyear'-`minyear'
       = qui g __00000J=__00000I-__00000H
03     - qui sum `diff'
       = qui sum __00000J
03     - local maxspan=`r(max)'
       = local maxspan=3
03     - qui gen `validyear'=`year' if !missing(`class_mean')
       = qui gen __00000K=year if !missing(__000003)
03     - qui by `teacher': egen `minvalidyear'=min(`validyear')
       = qui by school_id: egen __00000L=min(__00000K)
03     - qui by `teacher': egen `maxvalidyear'=max(`validyear')
       = qui by school_id: egen __00000M=max(__00000K)
03     - qui g `diffvalid'=`maxvalidyear'-`minvalidyear'
       = qui g __00000N=__00000M-__00000L
03     - qui sum `diffvalid'
       = qui sum __00000N
03     - local maxscorespan=`r(max)'
       = local maxscorespan=3
03     - if (`maxscorespan'<`maxspan') & (`driftlimit'<=0) {c -(}
       = if (3<3) & (2<=0) {c -(}
03       di as error _n "error: The maximum lags of teacher data is `maxspan', but the maximum lags of teacher data with class scores is `maxscorespan'."
03       di as error "       You must either set driftlimit() <= `maxscorespan', or drop observations so that the spans are no longer mismatched."
03       exit 499
03       {c )-}
03     - if (`driftlimit'>`maxscorespan') {c -(}
       = if (2>3) {c -(}
03       di as error "error: driftlimit(`driftlimit') was specified, which is greater than the number of lags (`maxscorespan') in the data."
03       exit 499
03       {c )-}
03     - mata:CC=compute_cov_corr("`class_mean'","`n_tested'",`maxscorespan',"`teacher'")
       = mata:CC=compute_cov_corr("__000003","__000002",3,"school_id")
{res}{txt}03     - if (`driftlimit'>0) mata:m=create_m(CC[.,1],st_numscalar("`cov_sameyear'"),`maxspan',`driftlimit')
       = if (2>0) mata:m=create_m(CC[.,1],st_numscalar("__00000C"),3,2)
{res}{txt}03     - else mata:m=create_m(CC[.,1],st_numscalar("`cov_sameyear'"))
       = else mata:m=create_m(CC[.,1],st_numscalar("__00000C"))
03     - di "Standard deviations: total, classes, students, teachers same year"
Standard deviations: total, classes, students, teachers same year
03     - if (`missing_sameyear'==0) di sqrt(`var_total'),sqrt(`var_class'),sqrt(`var_ind'),sqrt(`cov_sameyear')
       = if (1==0) di sqrt(__000005),sqrt(__000008),sqrt(__000007),sqrt(__00000C)
03     - else di sqrt(`var_total'),sqrt(`var_class'),sqrt(`var_ind'),.
       = else di sqrt(__000005),sqrt(__000008),sqrt(__000007),.
.5673336 .18211037 .53731111 .
03     - di "Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:"
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
03     - mata:CC[.,1..3]
{res}       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0199303169   .5743741184          3541{txt}  {c |}
  2 {c |}  {res}.0151232796   .4358772714          2299{txt}  {c |}
  3 {c |}  {res}.0085328264   .2388976851          1105{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
03     - if (`driftlimit'>0) {c -(}
       = if (2>0) {c -(}
03     - di "Drift limit specified:"
Drift limit specified:
03     - di `driftlimit'
       = di 2
2
03     - di "Covariances used for VA computations:"
Covariances used for VA computations:
03     - mata: m[2..length(m)]'
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0199303169{txt}  {c |}
  2 {c |}  {res}.0151232796{txt}  {c |}
  3 {c |}  {res}.0151232796{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
03     - {c )-}
03     - mata:check_m_nomissing(m)
{res}{txt}03     - if (`firstloop'==1) {c -(}
       = if (1==1) {c -(}
03     - mata:cov_lag_accum= CC[.,1]
{res}{txt}03     - mata:corr_lag_accum= CC[.,2]
{res}{txt}03     - mata:obs_lag_accum= CC[.,3]
{res}{txt}03     - mata:cov_se_lag_accum= CC[.,4]
{res}{txt}03     - mata:var_total_accum= st_numscalar("`var_total'")
       = mata:var_total_accum= st_numscalar("__000005")
{res}{txt}03     - mata:var_class_accum= st_numscalar("`var_class'")
       = mata:var_class_accum= st_numscalar("__000008")
{res}{txt}03     - mata:var_ind_accum= st_numscalar("`var_ind'")
       = mata:var_ind_accum= st_numscalar("__000007")
{res}{txt}03     - if (`missing_sameyear'==1) {c -(}
       = if (1==1) {c -(}
03     - mata:cov_sameyear_accum=.
{res}{txt}03     - mata:corr_sameyear_accum=.
{res}{txt}03     - mata:obs_sameyear_accum=0
{res}{txt}03     - {c )-}
03     - else {c -(}
03       mata:cov_sameyear_accum=st_numscalar("`cov_sameyear'")
03       mata:corr_sameyear_accum=st_numscalar("`corr_sameyear'")
03       mata:obs_sameyear_accum=st_numscalar("`obs_sameyear'")
03       {c )-}
03     - {c )-}
03     - else {c -(}
03       mata:cov_lag_accum= rightAppendMatrices(cov_lag_accum,CC[.,1])
03       mata:corr_lag_accum= rightAppendMatrices(corr_lag_accum,CC[.,2])
03       mata:obs_lag_accum= rightAppendMatrices(obs_lag_accum,CC[.,3])
03       mata:cov_se_lag_accum= rightAppendMatrices(cov_se_lag_accum,CC[.,4])
03       mata:var_total_accum= var_total_accum,st_numscalar("`var_total'")
03       mata:var_class_accum= var_class_accum,st_numscalar("`var_class'")
03       mata:var_ind_accum= var_ind_accum,st_numscalar("`var_ind'")
03       if (`missing_sameyear'==1) {c -(}
03       mata:cov_sameyear_accum= cov_sameyear_accum,.
03       mata:corr_sameyear_accum= corr_sameyear_accum,.
03       mata:obs_sameyear_accum= obs_sameyear_accum,.
03       {c )-}
03       else {c -(}
03       mata:cov_sameyear_accum=cov_sameyear_accum,st_numscalar("`cov_sameyear'")
03       mata:corr_sameyear_accum=corr_sameyear_accum,st_numscalar("`corr_sameyear'")
03       mata:obs_sameyear_accum=obs_sameyear_accum,st_numscalar("`obs_sameyear'")
03       {c )-}
03       {c )-}
03     - sort `teacher' `year'
       = sort school_id year
03     - tempvar obs_teacher
03     - by `teacher': egen `obs_teacher'=count(`teacher')
       = by school_id: egen __00000O=count(school_id)
03     - qui gen float tv=.
03     - if "`quasiexperiment'"!="" {c -(}
       = if ""!="" {c -(}
03       qui gen float tv_2yr_l=.
03       qui gen float tv_2yr_f=.
03       qui gen float tv_ss=.
03       mata: driftcalclist(vectorToStripeDiag(m), "`teacher'", "`year'", "`class_mean'", "`weight'", "`obs_teacher'", "tv", "tv_2yr_l", "tv_2yr_f", "tv_ss")
03       {c )-}
03     - else mata:driftcalclist(vectorToStripeDiag(m), "`teacher'", "`year'", "`class_mean'", "`weight'", "`obs_teacher'", "tv")
       = else mata:driftcalclist(vectorToStripeDiag(m), "school_id", "year", "__000003", "__00000F", "__00000O", "tv")
{res}{txt}03     - if ("`quasiexperiment'"=="") keep `teacher' `year' `by' tv
       = if (""=="") keep school_id year  tv
03     - else keep `teacher' `year' `by' tv tv_2yr_l tv_2yr_f tv_ss
       = else keep school_id year  tv tv_2yr_l tv_2yr_f tv_ss
03     - if (`firstloop'!=1) append using `"`output'"', nolabel
       = if (1!=1) append using `"/home/tmp/St192370.000002"', nolabel
03     - qui save `"`output'"', replace
       = qui save `"/home/tmp/St192370.000002"', replace
03     - local firstloop=0
03     - {c )-}
03     - di "{c -(}txt{c )-}{c -(}hline{c )-}"
{txt}{hline}
03     - if "`output_addvars'"!="" quietly {c -(}
       = if ""!="" quietly {c -(}
03       restore, preserve
03       keep `teacher' `year' `by' `output_addvars'
03       bys `teacher' `year' `by' `output_addvars': keep if _n==1
03       merge m:1 `teacher' `year' `by' using `"`output'"', nogen nolabel
03       {c )-}
03     - sort `teacher' `year' `by'
       = sort school_id year 
03     - qui save `"`output'"', replace
       = qui save `"/home/tmp/St192370.000002"', replace
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       local bylabels=""
03       forvalues i=1/`by_vals' {c -(}
03       local bylabel : label `byvar' `i', strict
03       local bylabel=subinstr("`bylabel'"," ","_",.)
03       local bylabels `bylabels' _`bylabel'
03       {c )-}
03       mata:saveVariancesToDataset(cov_lag_accum, corr_lag_accum, obs_lag_accum, cov_se_lag_accum, var_total_accum, var_class_accum, var_ind_accum, cov_sameyear_accum, corr_sameyear_accum, obs_sameyear_accum, tokens(st_local("bylabels")))
03       {c )-}
03     - else mata:saveVariancesToDataset(cov_lag_accum, corr_lag_accum, obs_lag_accum, cov_se_lag_accum, var_total_accum, var_class_accum, var_ind_accum, cov_sameyear_accum, corr_sameyear_accum, obs_sameyear_accum, "")
{res}{txt}03     - if (`nooutput'!=1) qui outsheet using `"`output'_variance.csv"', comma replace
       = if (1!=1) qui outsheet using `"/home/tmp/St192370.000002_variance.csv"', comma replace
03     - tokenize "`data'"
       = tokenize "merge tv score_r"
03     - if inlist("`1'","preserve","merge") {c -(}
       = if inlist("merge","preserve","merge") {c -(}
03     - restore
03     - if (`merge_resid'==1) {c -(}
       = if (1==1) {c -(}
03     - if ("`byvar'"!="") qui keep if missing(`teacher',`year',`class',`byvar')
       = if (""!="") qui keep if missing(school_id,year,school_id,)
03     - else qui keep if missing(`teacher',`year',`class')
       = else qui keep if missing(school_id,year,school_id)
03     - forvalues l=1/`by_vals' {c -(}
       = forvalues l=1/1 {c -(}
03     - append using `"`resid_data_`l''"', nolabel
       = append using `"/home/tmp/St192370.000004"', nolabel
03     - {c )-}
03     - {c )-}
03     - if (`merge_tv'==1) qui merge m:1 `teacher' `year' `by' `output_addvars' using `"`output'"', nogen nolabel
       = if (1==1) qui merge m:1 school_id year   using `"/home/tmp/St192370.000002"', nogen nolabel
03     - {c )-}
03     - else {c -(}
03       restore, not
03       if ("`data'"=="tv") use `"`output'"', clear
03       {c )-}
       {hline 60} end vam {hline}
02   - rename tv va_cfr_g11_`subject'
     = rename tv va_cfr_g11_ela
       =struct rename_peldf {c -(}
       =        string scalar        element
       =        real scalar  elementtype
       =        real scalar            arg
       =        real scalar            match
       =struct rename_patterndf {c -(}
       =        real scalar  patterntype
       =        string scalar            original
       =        struct rename_peldf rowvector          ellist
       =        real rowvector            n_of
       =        string rowvector            varnames
       =        string matrix            pieces
       =struct rename_optiondf {c -(}
       =        real scalar       isrecase
       =        real scalar       isrecase_upper, isrecase_lower, isrecase_proper
       =        real scalar       isdryrun
       =        real scalar       isrenumber, isaddnumber
       =        real scalar            from
       =        real scalar       issort
       =        real scalar       isdebug
       =        real scalar       istest
       =        real scalar       isr
       =void rename_optiondf_init(struct rename_optiondf scalar option)
       =        option.isrecase = option.isdryrun = 0
       =                                option.isrecase_proper = 0
       =        option.isrenumber = option.isaddnumber = 0
       =        option.issort     = 0
       =        option.isdebug    = 0
       =        option.istest     = 0
       =        option.isr        = 0
       =struct rename_renamedf {c -(}
       =        struct rename_patterndf rowvector      oldplist
       =        struct rename_patterndf rowvector      newplist
       =        struct rename_optiondf scalar       option
       =void rename_cmd(string scalar thirdarg)
       =        string scalar    input
       =real scalar can_do_fast(string scalar input)
       =        string rowvector    token
       =        real scalar    rc
       =        if (length(token)!=2) return(0)
       =        if (!st_isname(token[1])) return(0)
       =        if (!st_isname(token[2])) return(0)
       =        if (token[1] == token[2]) return(0)
       =        return(1)
       =void rename_cmd_u(string scalar input)
       =        struct rename_renamedf scalar       ren
       =                dump_pattern(ren.oldplist, "old after parsing", 0)
       =                dump_pattern(ren.newplist, "new after parsing", 0)
       =void xeq_old_to_new(struct rename_renamedf scalar ren)
       =                dump_pattern(ren.oldplist, "old after linkage", 0)
       =                dump_pattern(ren.newplist, "new after linkage", 0)
       =                dump_pattern(ren.oldplist, "old final", 1)
       =                dump_pattern(ren.newplist, "new final", 1)
       =void xeq_recase(struct rename_renamedf scalar ren)
       =        fillin_old_varnames(ren.oldplist, ren.newplist, 0)
       =                dump_pattern(ren.oldplist, "old final", 1)
       =                dump_pattern(ren.newplist, "new final", 1)
       =void parse_cmd(struct rename_renamedf scalar ren, string scalar input)
       =        real scalar            c
       =        string scalar            lhs, ops
       =        string scalar            oldnames, newnames
       =        parse_cmd_pat_els(ren.oldplist, oldnames, 0)
       =                parse_cmd_pat_els(ren.newplist, newnames, 1)
       =real scalar parse_cmd_commaloc(string scalar s)
       =        real scalar    i, L
       =        real scalar    nestlev
       =        string scalar    c
       =void getarg(string scalar input, string scalar arg, string scalar rest)
       =        real scalar    L, npar, i
       =        string scalar    c
       =void parse_cmd_options(struct rename_optiondf scalar option, string scalar ops)
       =        string scalar            token
       =        transmorphic      t
       =        rename_optiondf_init(option)
       =void confirm_options_consistent(struct rename_optiondf scalar option)
       =        string rowvector    list
       =void parse_cmd_options_u(struct rename_optiondf scalar option, string scalar token, transmorphic t)
       =real scalar parse_cmd_options_u_std(struct rename_optiondf scalar option, string scalar source)
       =        real scalar    l
       =                option.isdebug = 1
       =                option.isdryrun = 1
       =                option.isrecase = option.isrecase_lower = 1
       =                option.isrecase = option.isrecase_proper= 1
       =                option.isr = 1
       =                option.issort = 1
       =                option.istest = 1
       =                option.isrecase = option.isrecase_upper = 1
       =        else    return(0)
       =        return(1)
       =real scalar parse_cmd_options_u_number(struct rename_optiondf scalar option, string scalar source,
       =                                                                transmorphic t)
       =        string scalar            token
       =        real scalar            from
       =        real scalar            l
       =        string scalar            op
       =        if (option.isrenumber | option.isaddnumber)  return(0)
       =                option.isrenumber = 1
       =                option.isaddnumber = 1
       =                return(1)
       =        return(1)
       =void parse_cmd_pat_els(struct rename_patterndf rowvector pat, string scalar toparse, real pattype)
       =        string scalar            token, curlist
       =        transmorphic      t
       =        real scalar       first
       =        first   = 1
       =                                first    = 1
       =                                first   = 0
       =void parse_cmd_pat_el(struct rename_patterndf rowvector pat, string scalar token, real pattype)
       =        string scalar            mytoken
       =        struct rename_patterndf scalar      mypat
       =        real scalar            i, j
       =        real matrix            found
       =        mypat.n_of        = J(1, (8), 0)
       =        confirm_not_empty(mytoken, pattype==0 ?
       =                if (i=strpos(mytoken, "*")) found = (found \ (i, (3)))
       =                if (i=strpos(mytoken, "?")) found = (found \ (i, (4) ))
       =                if (i=strpos(mytoken, "#")) found = (found \ (i, (5)))
       =                if (i=strpos(mytoken, "(")) found = (found \ (i, (6)))
       =                if (i=strpos(mytoken, "=")) found = (found \ (i, (7)))
       =                if (i=strpos(mytoken, ".")) found = (found \ (i, (8)))
       =                        if (i==(3)) {c -(}
       =                        else if (i==(4)) {c -(}
       =                        else if (i==(5)) {c -(}
       =                        else if (i==(6)) {c -(}
       =                        else if (i==(7)) {c -(}
       =                        else if (i==(8)) {c -(}
       =string scalar set_subscript(struct rename_patterndf scalar pat, string scalar token, real pt)
       =        real scalar    i
       =        string scalar    c
       =        if (pt != 1) {c -(}
       =        if (pt != 1)              return(token)
       =void set_pat_ETstrlist(struct rename_patterndf scalar pat, string scalar token)
       =        struct rename_peldf scalar          el
       =        el.elementtype = (1)
       =        pat.n_of[(1)] = pat.n_of[(1)] + 1
       =string scalar set_pat_str(struct rename_patterndf scalar pat, string scalar token)
       =        struct rename_peldf scalar          el
       =        el.elementtype = (2)
       =string scalar set_pat_ETstar(struct rename_patterndf scalar pat, string scalar token, real scalar loc)
       =        struct rename_peldf scalar          el
       =        if (pat.patterntype == 0 && length(pat.ellist)) {c -(}
       =                if (pat.ellist[length(pat.ellist)].elementtype == (3)) {c -(}
       =        el.elementtype = (3)
       =string scalar set_pat_ETnum_v(struct rename_patterndf scalar pat, string scalar token, real scalar loc)
       =        struct rename_peldf scalar          el
       =        if (pat.patterntype == 0 && length(pat.ellist)) {c -(}
       =                if (pat.ellist[length(pat.ellist)].elementtype == (5)) {c -(}
       =        el.elementtype = (5)
       =string scalar set_pat_ETeq(struct rename_patterndf scalar pat, string scalar token, real scalar loc)
       =        struct rename_peldf scalar  el
       =        if (pat.patterntype == 0) {c -(}
       =        el.elementtype = (7)
       =string scalar set_pat_ETodot(struct rename_patterndf scalar pat, string scalar token, real scalar loc)
       =        struct rename_peldf scalar  el
       =        if (pat.patterntype == 0) {c -(}
       =        el.elementtype = (8)
       =string scalar set_pat_ETqm(struct rename_patterndf scalar pat, string scalar token, real scalar loc)
       =        struct rename_peldf scalar  el
       =        el.elementtype = (4)
       =string scalar set_pat_ETnum_f(struct rename_patterndf scalar pat, string scalar token, real scalar loc)
       =        struct rename_peldf scalar          el
       =        real scalar            j
       =        el.elementtype = (6)
       =        if (el.arg > 10) {c -(}
       =void make_patternlist_lengths_equal(struct rename_renamedf scalar ren)
       =void build_recase_newpattern(struct rename_renamedf scalar ren)
       =        real scalar    i
       =        ren.newplist = rename_patterndf(length(ren.oldplist))
       =                ren.newplist[i].n_of        = J(1, (8), 0)
       =void link_patterns(struct rename_renamedf scalar ren)
       =        real scalar    i, jn
       =real scalar check_and_fix_ETnum(struct rename_patterndf scalar newp, struct rename_optiondf scalar option)
       =        real scalar            n, j, jn
       =        real scalar  tt
       =                if (tt==(5) | tt==(6)) {c -(}
       =                                (tt==(5) ? (9) : (10))
       =struct rename_linklocdf {c -(}
       =        real scalar    j_old, last_sequential_j_old
       =        real scalar    j_new
       =        real scalar    jn
       =        real rowvector    mapsub
       =void rename_linklocdf_init(struct rename_linklocdf scalar ll, real scalar jn)
       =void rename_linklocdf_next(struct rename_linklocdf scalar ll, struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp)
       =        real scalar subscr
       =real scalar map_subscript(real scalar subscr, real rowvector mapsub, struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp)
       =void link_patterns_u(struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp, real scalar jn)
       =        struct rename_linklocdf scalar      ll
       =        rename_linklocdf_init(ll, jn)
       =        rename_linklocdf_next(ll, oldp, newp)
       =                rename_linklocdf_next(ll, oldp, newp)
       =real rowvector pelidx_of_wcidx(struct rename_patterndf scalar oldp)
       =        real rowvector            toret
       =        real scalar            i
       =        real scalar  tt
       =                if (tt!=(1) & tt!=(2)) toret = (toret, i)
       =void confirm_wildcards_link(struct rename_patterndf scalar oldp, real scalar j_old,
       =                            struct rename_patterndf scalar newp, real scalar j_new)
       =        real scalar  tt_old, tt_new
       =        if (tt_new == (3)) return
       =        if (tt_new == (8))  return
       =        if (tt_new == (4)) {c -(}
       =                if (tt_old == (4)) return
       =        if (tt_new==(5) | tt_new==(6)) {c -(}
       =                if (tt_old==(5) | tt_old==(6)) return
       =string scalar printable_wildcard(struct rename_peldf scalar el)
       =        real scalar  tt
       =        if (tt == (3))  return("*")
       =        if (tt == (4))    return("?")
       =        if (tt == (8))  return(".")
       =        if (tt == (5)) return("#")
       =        if (tt == (6)) return("(" + el.arg*"*" + ")")
       =real scalar count_wildcards(struct rename_patterndf scalar pat)
       =        return(pat.n_of[(3)]  +
       =               pat.n_of[(4)]    +
       =               pat.n_of[(5)] +
       =               pat.n_of[(6)] +
       =               pat.n_of[(8)])
       =real scalar is_wildcard(real scalar tt)
       =        return( tt == (3)  |
       =                tt == (4)    |
       =                tt == (5) |
       =                tt == (6) |
       =                tt == (9) |
       =                tt == (10) |
       =                tt == (8)  )
       =real scalar find_next_wildcard(struct rename_peldf rowvector d, real scalar j0)
       =        real scalar    j
       =void fillin_old_varnames(struct rename_patterndf rowvector oldplist, struct rename_patterndf rowvector newplist,
       =                                                        real scalar issort)
       =        real scalar    i
       =        string scalar    tmpname
       =void fillin_old_varnames_u(struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp,
       =                                        real scalar issort, string scalar tmpname)
       =        string rowvector            varnames, piece
       =        real scalar            i, n, nvars, nels
       =        string matrix            pieces
       =        real scalar  tt
       =        real scalar       filter_varlist, fillin_pieces
       =        filter_varlist = (oldp.n_of[(5)] + oldp.n_of[(6)] != 0)
       =        fillin_pieces  = (newp.n_of[(5)] + newp.n_of[(6)] +
       =                          newp.n_of[(3)]  + newp.n_of[(4)]    != 0)
       =        if (issort) fillin_pieces = 1
       =                        if (tt==(3) | tt==(4)) {c -(}
       =string scalar varlistpattern(struct rename_peldf rowvector ellist)
       =        real scalar    j
       =        string scalar    result
       =        if (ellist[1].elementtype == (1)) return(ellist[1].element)
       =string scalar varlist_el(struct rename_peldf scalar el)
       =        if (el.elementtype == (2))    return(el.element)
       =        if (el.elementtype == (3))   return("*")
       =        if (el.elementtype == (4))     return("?")
       =        if (el.elementtype == (5))  return("?*")
       =        if (el.elementtype == (6))  return(el.arg*"?")
       =struct rename_matchdf {c -(}
       =        real scalar    j0, j1
       =        real scalar    i0, i1
       =        string scalar    name
       =        string rowvector    pieces
       =real scalar matchvarname(string rowvector pieces, struct rename_peldf rowvector ellist, string scalar name)
       =        struct rename_matchdf scalar        m
       =                if (ellist[1].elementtype==(1)) {c -(}
       =                        return(1)
       =        if (!match_step(m, ellist)) return(0)
       =        return(1)
       =void match_setup(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist, string scalar name)
       =real scalar match_step(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist)
       =        real scalar            lefttomatch
       =        real scalar      mr
       =        real scalar     r
       =                if ((r=match_query_done(m))!=(-1)) return(r)
       =                if (match_simplification(m, ellist)==-1) return(0)
       =                if ((r=match_query_done(m))!=(-1)) return(r)
       =                        if (match_step_1(m, ellist)==-1) return(0)
       =                        if ((r=match_query_done(m))!=(-1)) return(r)
       =                        return(0)
       =                        if (mr==-1 | mr==0) return(0)
       =                        if (mr==-1 | mr==0) return(0)
       =real scalar match_step_1(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist)
       =        if (ellist[m.j0].elementtype==(5)) {c -(}
       =                return(match_ETnum_v(m, ellist, 1))
       =        if (ellist[m.j0].elementtype==(3)) {c -(}
       =        return(-1)
       =real scalar match_step_2(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist)
       =        if (ellist[m.j0].elementtype==(5)) {c -(}
       =                return(match_ETnum_v(m, ellist, 1))
       =        if (ellist[m.j0+1].elementtype==(5)) {c -(}
       =                return(match_ETnum_v(m, ellist, 0))
       =        return(-1)
       =real scalar match_step_3p(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist)
       =        real scalar    j
       =        if (ellist[m.j0].elementtype==(3)) {c -(}
       =                if (ellist[j].elementtype==(3)) {c -(}
       =                if (ellist[j].elementtype==(5)) {c -(}
       =                        return(match_ETnum_v(m, ellist, 0))
       =        if (ellist[m.j0].elementtype==(5)) {c -(}
       =                return(match_ETnum_v(m, ellist, 1))
       =        return(-1)
       =real scalar match_query_done(struct rename_matchdf scalar m)
       =                if (m.i0 < m.i1) return(0)
       =                return(1)
       =        return((-1))
       =real scalar match_simplification(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist)
       =        real scalar      mr
       =        while ((m.i1 >m.i0 & m.j1> m.j0)) {c -(}
       =                mr = match_fixed(m, ellist, 1)
       =                if (mr==-1) return(-1)
       =                if (mr==0)   break
       =        while ((m.i1 >m.i0 & m.j1> m.j0)) {c -(}
       =                mr = match_fixed(m, ellist, 0)
       =                if (mr==-1) return(-1)
       =                if (mr==0)   break
       =real scalar match_fixed(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist, real scalar s)
       =        real scalar    j
       =        j = (s==1 ? m.j0 : m.j1-1)
       =        if (ellist[j].elementtype==(2))   return(match_ETstr(m, ellist, s))
       =        if (ellist[j].elementtype==(6)) return(match_ETnum_f(m, ellist, s))
       =        if (ellist[j].elementtype==(4))    return(match_ETqm(m, ellist, s))
       =        return(0)
       =real scalar match_ETstr(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist, real scalar s)
       =        real scalar    j, len
       =        j = (s==1 ? m.j0 : m.j1-1)
       =        if (ellist[j].elementtype != (2)) return(0)
       =        if ((s==1 ?  usubstr(m.name, m.i0, len) :
       =                return(-1)
       =        return(1)
       =real scalar match_ETnum_f(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist, real scalar s)
       =        real scalar    j, i, len
       =        string scalar    str, c
       =        j = (s==1 ? m.j0 : m.j1-1)
       =        if (ellist[j].elementtype != (6)) return(0)
       =        str = (s==1 ?  usubstr(m.name, m.i0, len) : usubstr(m.name, -len, .))
       =        if (ustrlen(str)!=len) return(-1)
       =                if (c<"0" | c>"9") return(-1)
       =        return(1)
       =real scalar match_ETqm(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist, real scalar s)
       =        if (ellist[s==1 ? m.j0 : m.j1-1].elementtype != (4)) {c -(}
       =                return(0)
       =        if (m.i0==m.i1) return(-1)
       =        return(1)
       =real scalar match_ETnum_v(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist, real scalar s)
       =        real scalar            j, i0, i1, len
       =        string scalar            c
       =        string scalar            c1
       =        struct rename_matchdf scalar        hold
       =        j = (s==1 ? m.j0 : m.j1-1)
       =        if (ellist[j].elementtype != (5)) return(0)
       =        if (s==1) {c -(}
       =                if (match_step(m, ellist)==1) return(1)
       =        return(-1)
       =real scalar match_ETstar_left(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist)
       =        real scalar            len, newlen
       =        struct rename_matchdf scalar        hold
       =        real scalar       next_is_ETnum_v
       =        if (ellist[m.j0].elementtype != (3)) return(0)
       =                post_match_piece(m, 1, len)
       =                return(1)
       =        next_is_ETnum_v = (ellist[m.j0+1].elementtype==(5))
       =                post_match_piece(m, 1, len)
       =                if (match_step(m, ellist)==1) {c -(}
       =                                        post_match_piece(m, 1, newlen)
       =                        return(1)
       =        return(-1)
       =real scalar mstargiveback(string scalar s)
       =        real scalar    l
       =        string scalar    c
       =        string scalar    c1
       =void post_match_piece(struct rename_matchdf scalar m, real scalar s, real scalar len)
       =        if (s==1) {c -(}
       =void sort_old_varnames(struct rename_renamedf scalar ren)
       =        real scalar i
       =void sort_appropriate_field(struct rename_patterndf rowvector oldplist, struct rename_patterndf rowvector newplist)
       =        real scalar            i
       =        real scalar            j
       =real scalar j_of_renumber(struct rename_patterndf scalar plist)
       =        real scalar            j
       =        real scalar  tt
       =                if (tt==(9) | tt==(10)) return(j)
       =real scalar j_of_number(struct rename_patterndf scalar plist)
       =        real scalar            j, jtoret
       =        real scalar  tt
       =                if (tt==(3) | tt==(4) | tt==(5) | tt==(6)) {c -(}
       =void sort_on_field(struct rename_patterndf scalar plist, real scalar j)
       =        real scalar  tt
       =        real colvector            o
       =        string colvector            vc
       =                if (tt==(5) | tt==(6)) {c -(}
       =void fillin_new_varnames_recase(struct rename_renamedf scalar ren)
       =        real scalar    i
       =void fillin_new_varnames(struct rename_patterndf rowvector oldplist, struct rename_patterndf rowvector newplist, real scalar from)
       =        real scalar    i
       =void fillin_new_varnames_u(struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp, real scalar from)
       =        real scalar    i
       =        if (newp.ellist[1].elementtype==(1)) {c -(}
       =void fillin_new_varnames_u_u(struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp, real scalar from, real scalar i)
       =        real scalar            j
       =        string scalar            name
       =        real scalar  tt
       =                if (tt==(2)) {c -(}
       =                else if (tt==(3)) {c -(}
       =                else if (tt==(4)) {c -(}
       =                else if (tt==(5)) {c -(}
       =                else if (tt==(6)) {c -(}
       =                else if (tt==(7)) {c -(}
       =                else if (tt==(9)) {c -(}
       =                else if (tt==(10)) {c -(}
       =                else if (tt != (8)) {c -(}
       =string scalar fmt_ETnum_f(struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp, real scalar i, real scalar j)
       =        real scalar    n, len
       =        string scalar    res, orig
       =string scalar fmt_ETnum_f_r(struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp, real scalar j, real scalar from)
       =        real scalar    n, len
       =        string scalar res
       =string matrix build_toren(struct rename_patterndf rowvector oldplist, struct rename_patterndf rowvector newplist)
       =        string matrix    toren
       =        real scalar    i, N, n, k, k2
       =        real colvector    toselect
       =        string rowvector    lastrow, newrow
       =        real scalar hasomissions
       =                                hasomissions = 1
       =void perform_renames(string matrix toren, struct rename_optiondf scalar option)
       =        real scalar       use_intermediary
       =        string matrix            toren_nonulls
       =                        perform_dryrun(toren, toren_nonulls, 0)
       =void confirm_newnames_new(string matrix toren)
       =        real scalar    i
       =        real rowvector    varnum
       =        string rowvector    tocheck, badvar
       =void perform_set_r(string matrix toren)
       =void perform_test(string matrix toren, real scalar use_intermediary)
       =        real scalar    i
       =void perform_rename_straight(string matrix toren)
       =        real scalar    i
       =        real scalar    breakstatus
       =void perform_rename_intermediary(string matrix toren)
       =        real scalar    i
       =        real scalar    breakstatus
       =        string rowvector    tmpname
       =void perform_dryrun(string matrix toren, string matrix toren_nonulls, real scalar use_intermediary)
       =        real scalar    i
       =        real scalar    maxlen
       =        string scalar    sfmt, sfmtit
       =void dryrun_note1(string matrix toren, string matrix toren_nonulls)
       =        real scalar    i
       =        real scalar    nulls
       =void dryrun_note2(string matrix toren, real scalar use_intermediary)
       =        string colvector    dupnames, newname, oldname
       =real scalar names_not_jointly_unique(string matrix toren)
       =        real scalar    n0, n1
       =        string colvector    fulllist
       =void confirm_names_unique(string matrix toren)
       =void confirm_names_unique_1(string matrix toren, real scalar j)
       =        string colvector    names, corresponding
       =        string scalar    s
       =        real scalar    n
       =string colvector corresponding_names(string matrix toren, string scalar name, real scalar js, real scalar jd)
       =        real scalar    i
       =        string colvector    dups
       =void confirm_new_varnames_valid(string matrix toren)
       =        real scalar    i, n
       =        real colvector    bad
       =void confirm_not_empty(string scalar str, string scalar expected)
       =void errprint_bf_list(string vector list , |real scalar USER_MAXEL)
       =        real scalar            MAXEL
       =        real scalar            i, top
       =        real scalar       chopped
       =                        chopped = 1
       =                        chopped = 0
       =void errprint_bf_string(string scalar user_s, |real scalar USER_MAXLEN)
       =        real scalar            MAXLEN
       =        real scalar            len_last, target_last
       =        real scalar            len_remaining
       =        real scalar            i
       =        string rowvector            els
       =        string scalar            s, first, last
       =        real scalar       cont
       =        cont = 1
       =                else            cont   = 0
       =        string scalar    indent
       =void error_preceding_dash( pattype)
       =                        (pattype==0 ? "oldname" : "newname" ) )
       =void error_following_dash( pattype, string scalar what)
       =                        (pattype==0 ? "oldname" : "newname" ) )
       =void option_not_allowed(string scalar option)
       =void option_number_misspecified(string scalar op)
       =void error_ETnum_f_too_long(real scalar n_digits)
       =        errprintf("the {c -(}bf:(###...#){c )-} pattern is %g.\n", 10)
       =void error_patternlengths_unequal(struct rename_patterndf rowvector oldplist, struct rename_patterndf rowvector newplist)
       =        string scalar    s_old, s_new
       =void error_too_many_renumbers(string scalar op, struct rename_patterndf scalar newp)
       =void error_strlist_length(struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp)
       =        real scalar    n_old, n_new
       =        string scalar    s_old, s_new
       =void error_missing_ETnum(string scalar opname, struct rename_patterndf scalar newp)
       =void error_too_many_wildcards(struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp,
       =                                                        real scalar isaddnumber)
       =void error_wildcardmatch_qm(struct rename_patterndf scalar oldp, real scalar j_old,
       =                            struct rename_patterndf scalar newp, real scalar j_new)
       =void error_wildcardmatch_hash(struct rename_patterndf scalar oldp, real scalar j_old,
       =                              struct rename_patterndf scalar newp, real scalar j_new)
       =void error_no_right_bracket(string scalar original)
       =void error_inside_brackets(string scalar original)
       =void error_newnumber_subscripted(struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp)
       =void error_subscript_invalid(struct rename_patterndf scalar oldp, struct rename_patterndf scalar newp, real scalar subscr)
       =void error_subscripts_in_old(struct rename_patterndf scalar pat)
       =void dump_pattern(struct rename_patterndf rowvector pat, string scalar typ, real scalar incl_names)
       =        real scalar    i, j, n
       =        real scalar    nv, k, m
       =                        pat[i].n_of[(2)],
       =                        pat[i].n_of[(3)],
       =                        pat[i].n_of[(4)],
       =                        pat[i].n_of[(5)],
       =                        pat[i].n_of[(6)],
       =                        pat[i].n_of[(7)],
       =                        pat[i].n_of[(8)])
       =string scalar dump_xlate_tt(real scalar t)
       =        if (t==(1))     return("ETstrlist")
       =        if (t==(2))         return("ETstr")
       =        if (t==(3))        return("ETstar")
       =        if (t==(4))          return("ETqm")
       =        if (t==(5))       return("ETnum_v")
       =        if (t==(6))       return("ETnum_f")
       =        if (t==(7))          return("ETeq")
       =        if (t==(8))        return("ETodot")
       =        if (t==(9))     return("ETnum_v_r")
       =        if (t==(10))     return("ETnum_f_r")
       =void dump_options(struct rename_renamedf scalar ren)
       =void match_debug(struct rename_matchdf scalar m, struct rename_peldf rowvector ellist, string scalar msg)
       =string rowvector list_subtract(string rowvector a, string rowvector b)
       =        string rowvector result
       =string rowvector expand_varlist(string scalar pattern, string scalar tmpname)
       =        real scalar    rc
       =        string rowvector    result
       =string scalar ordinal_suffix(real scalar i)
       =        real scalar    lastdigit
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - rename score_r sbac_g11_`subject'_r
     = rename score_r sbac_g11_ela_r
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
     = reg sbac_g11_ela_r va_cfr_g11_ela, cluster(school_id)
       {hline 58} begin reg {hline}
03     - if _by() {c -(}
03       local by "by `_byvars'`_byrc0':"
03       {c )-}
03     - `by' regress `0'
       =  regress sbac_g11_ela_r va_cfr_g11_ela, cluster(school_id)

Linear regression                               Number of obs     = {res}   675,586
                                                {txt}F(1, 1275)        =  {res}  2114.68
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0410
                                                {txt}Root MSE          =    {res} .55544

{txt}{ralign 78:(Std. err. adjusted for {res:1,276} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_e~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~a {c |}{col 14}{res}{space 2} .9820442{col 26}{space 2} .0213554{col 37}{space 1}   45.99{col 46}{space 3}0.000{col 54}{space 4} .9401486{col 67}{space 3}  1.02394
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0002073{col 26}{space 2} .0012526{col 37}{space 1}   -0.17{col 46}{space 3}0.869{col 54}{space 4}-.0026646{col 67}{space 3} .0022501
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}       {hline 60} end reg {hline}
02   - estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_nocontrol.ster, replace
     = estimates save /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_nocontrol.ster, replace
     = estimates save /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_ela_sibling_nocontrol.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
     = rename va_cfr_g11_ela va_cfr_g11_ela_nosibctrl
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - rename sbac_g11_`subject'_r sbac_g11_`subject'_r_nosibctrl
     = rename sbac_g11_ela_r sbac_g11_ela_r_nosibctrl
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - label var va_cfr_g11_`subject'_nosibctrl "`subject' VA with family FE without TFX without sibling control"
     = label var va_cfr_g11_ela_nosibctrl "ela VA with family FE without TFX without sibling control"
       {hline 56} begin label {hline}
03     - version 10.0
03     - local vv : display "version " string(_caller()) ", missing:"
03     - gettoken val : 0
03     - if (strpos("`val'", "val") > 0 ) {c -(}
       = if (strpos("var", "val") > 0 ) {c -(}
03       gettoken val 0 : 0
03       syntax anything [, nofix]
03       if "`fix'" != "" {c -(}
03       local fix ", nofix"
03       {c )-}
03       gettoken var rest : anything
03       while `"`rest'"' != "" {c -(}
03       gettoken lab rest : rest
03       local label "`lab'"
03       {c )-}
03       local vlist : list anything - lab
03       if "`lab'" == "." {c -(}
03       local lab ""
03       {c )-}
03       foreach var of varlist `vlist' {c -(}
03       `vv' _label `val' `var' `lab' `fix'
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - `vv' _label `macval(0)'
       = version 17, missing: _label var va_cfr_g11_ela_nosibctrl "ela VA with family FE without TFX without sibling control"
03     - {c )-}
       {hline 58} end label {hline}
02   - label var sbac_g11_`subject'_r_nosibctrl "`subject' score residual with family FE without TFX without sibling control"
     = label var sbac_g11_ela_r_nosibctrl "ela score residual with family FE without TFX without sibling control"
       {hline 56} begin label {hline}
03     - version 10.0
03     - local vv : display "version " string(_caller()) ", missing:"
03     - gettoken val : 0
03     - if (strpos("`val'", "val") > 0 ) {c -(}
       = if (strpos("var", "val") > 0 ) {c -(}
03       gettoken val 0 : 0
03       syntax anything [, nofix]
03       if "`fix'" != "" {c -(}
03       local fix ", nofix"
03       {c )-}
03       gettoken var rest : anything
03       while `"`rest'"' != "" {c -(}
03       gettoken lab rest : rest
03       local label "`lab'"
03       {c )-}
03       local vlist : list anything - lab
03       if "`lab'" == "." {c -(}
03       local lab ""
03       {c )-}
03       foreach var of varlist `vlist' {c -(}
03       `vv' _label `val' `var' `lab' `fix'
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - `vv' _label `macval(0)'
       = version 17, missing: _label var sbac_g11_ela_r_nosibctrl "ela score residual with family FE without TFX without sibling control"
03     - {c )-}
       {hline 58} end label {hline}
02   - vam sbac_`subject'_z_score , teacher(school_id) year(year) class(school_id) controls( i.year i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year `school_controls' `demographic_controls' `ela_score_controls' `math_score_controls' ) data(merge tv score_r) driftlimit(`drift_limit') estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`subject'.ster, replace)
     = vam sbac_ela_z_score , teacher(school_id) year(year) class(school_id) controls( i.year i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year  age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score) i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score) ) data(merge tv score_r) driftlimit(2) estimates(/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela.ster, replace)
       {hline 58} begin vam {hline}
03     - version 10.1
03     - set more off
03     - syntax varname(ts fv) [aweight/], teacher(varname) year(varname) class(varname) [ by(varlist) controls(varlist ts fv) absorb(varname) tfx_resid(varname) data(string) output(string) output_addvars(varlist) driftlimit(integer -1) QUASIexperiment CONStant noseed varclasszero estimates(string asis)]
03     - local depvar `varlist'
       = local depvar sbac_ela_z_score
03     - capture confirm variable score_r, exact
03     - if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named score_r."
03       exit 110
03       {c )-}
03     - capture confirm variable tv, exact
03     - if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv."
03       exit 110
03       {c )-}
03     - if ("`quasiexperiment'"!="") {c -(}
       = if (""!="") {c -(}
03       capture confirm variable tv_2yr_l, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_2yr_l."
03       exit 110
03       {c )-}
03       capture confirm variable tv_2yr_f, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_2yr_f."
03       exit 110
03       {c )-}
03       capture confirm variable tv_ss, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_ss."
03       exit 110
03       {c )-}
03       {c )-}
03     - local merge_tv=0
03     - local merge_resid=0
03     - if ("`data'"=="") local data="preserve"
       = if ("merge tv score_r"=="") local data="preserve"
03     - else {c -(}
03     - if !inlist("`data'","preserve","tv","merge tv","merge score_r","merge tv score_r","merge score_r tv","variance") {c -(}
       = if !inlist("merge tv score_r","preserve","tv","merge tv","merge score_r","merge tv score_r","merge score_r tv","variance") {c -(}
03       di as error "Not a valid argument for data. Choose either 'preserve', 'tv', 'merge [tv AND/OR score_r]', or 'variance'."
03       exit 198
03       {c )-}
03     - else {c -(}
03     - tokenize "`data'"
       = tokenize "merge tv score_r"
03     - if ("`1'")=="merge" {c -(}
       = if ("merge")=="merge" {c -(}
03     - if ("`2'"=="tv") | ("`3'"=="tv") local merge_tv=1
       = if ("tv"=="tv") | ("score_r"=="tv") local merge_tv=1
03     - if ("`2'"=="score_r") | ("`3'"=="score_r") local merge_resid=1
       = if ("tv"=="score_r") | ("score_r"=="score_r") local merge_resid=1
03     - {c )-}
03     - {c )-}
03     - {c )-}
03     - if "`tfx_resid'"!="" & "`absorb'"!="" {c -(}
       = if ""!="" & ""!="" {c -(}
03       di as error "Cannot specify an absorb variable and a tfx_resid variable simultaneously."
03       exit 198
03       {c )-}
03     - if `"`output'"'=="" {c -(}
       = if `""'=="" {c -(}
03     - tempfile output
03     - local nooutput=1
03     - {c )-}
03     - else local nooutput=0
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       tempvar byvar
03       egen `byvar'=group(`by'), label
03       sum `byvar', meanonly
03       local by_vals=`r(max)'
03       {c )-}
03     - else local by_vals=1
03     - if "`weight'"!="" {c -(}
       = if ""!="" {c -(}
03       local ind_weight "`weight'"
03       macro drop _weight
03       local ind_exp "`exp'"
03       macro drop _exp
03       local times_exp "* `exp'"
03       {c )-}
03     - preserve
03     - local firstloop=1
03     - forvalues l=1/`by_vals' {c -(}
       = forvalues l=1/1 {c -(}
03     - if (`firstloop'!=1) restore, preserve
       = if (1!=1) restore, preserve
03     - di "{c -(}txt{c )-}{c -(}hline{c )-}"
{txt}{hline}
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       local bylabel : label `byvar' `l', strict
03       di "{c -(}bf:-> by variables:{c )-} `by' = `bylabel'"
03       {c )-}
03     - qui drop if missing(`teacher',`year',`class')
       = qui drop if missing(school_id,year,school_id)
03     - if ("`by'"!="") qui keep if `byvar'==`l'
       = if (""!="") qui keep if ==1
03     - if "`absorb'"!="" | "`tfx_resid'"!="" {c -(}
       = if ""!="" | ""!="" {c -(}
03       if "`ind_weight'"=="" {c -(}
03       noisily areg `depvar' `controls' , absorb(`absorb'`tfx_resid')
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03       else if "`ind_weight'"!="" {c -(}
03       noisily areg `depvar' `controls' [`ind_weight' = `ind_exp'] , absorb(`absorb'`tfx_resid')
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - if "`ind_weight'"=="" {c -(}
       = if ""=="" {c -(}
03     - version 11 : noisily reg `depvar' `controls'
       = version 11 : noisily reg sbac_ela_z_score i.year i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other i.econ_disadvantage i.limited_eng_prof i.disabled i.year#c.prior_ela_z_score i.year#c.prior_ela_z_score#c.prior_ela_z_score i.year#c.prior_ela_z_score#c.prior_ela_z_score#c.prior_ela_z_score i.year#c.prior_math_z_score i.year#c.prior_math_z_score#c.prior_math_z_score i.year#c.prior_math_z_score#c.prior_math_z_score#c.prior_math_z_score

      Source {c |}       SS           df       MS      Number of obs   ={res}   677,254
{txt}{hline 13}{c +}{hline 34}   F(38, 677215)   = {res} 26986.67
{txt}       Model {c |} {res} 329970.233        38  8683.42718   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 217905.656   677,215  .321767321   {txt}R-squared       ={res}    0.6023
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6022
{txt}       Total {c |} {res} 547875.889   677,253  .808967829   {txt}Root MSE        =   {res} .56725

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_ela_z~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0498498{col 26}{space 2} .0027482{col 37}{space 1}   18.14{col 46}{space 3}0.000{col 54}{space 4} .0444634{col 67}{space 3} .0552361
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0673758{col 26}{space 2} .0027359{col 37}{space 1}   24.63{col 46}{space 3}0.000{col 54}{space 4} .0620135{col 67}{space 3} .0727382
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.071269{col 26}{space 2} .0027432{col 37}{space 1}  -25.98{col 46}{space 3}0.000{col 54}{space 4}-.0766456{col 67}{space 3}-.0658924
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0175035{col 26}{space 2} .0026999{col 37}{space 1}   -6.48{col 46}{space 3}0.000{col 54}{space 4}-.0227952{col 67}{space 3}-.0122119
{txt}1.has_~4year {c |}{col 14}{res}{space 2}  .039867{col 26}{space 2} .0029653{col 37}{space 1}   13.44{col 46}{space 3}0.000{col 54}{space 4}  .034055{col 67}{space 3} .0456789
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003419{col 26}{space 2} 4.89e-06{col 37}{space 1}  -69.98{col 46}{space 3}0.000{col 54}{space 4}-.0003514{col 67}{space 3}-.0003323
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}-.0903183{col 26}{space 2} .0014092{col 37}{space 1}  -64.09{col 46}{space 3}0.000{col 54}{space 4}-.0930803{col 67}{space 3}-.0875563
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1032116{col 26}{space 2} .0022649{col 37}{space 1}   45.57{col 46}{space 3}0.000{col 54}{space 4} .0987725{col 67}{space 3} .1076507
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2} -.004525{col 26}{space 2} .0019299{col 37}{space 1}   -2.34{col 46}{space 3}0.019{col 54}{space 4}-.0083076{col 67}{space 3}-.0007424
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2} -.144409{col 26}{space 2} .0037975{col 37}{space 1}  -38.03{col 46}{space 3}0.000{col 54}{space 4} -.151852{col 67}{space 3}-.1369659
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0046592{col 26}{space 2} .0042026{col 37}{space 1}    1.11{col 46}{space 3}0.268{col 54}{space 4}-.0035778{col 67}{space 3} .0128962
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0366289{col 26}{space 2}  .001636{col 37}{space 1}  -22.39{col 46}{space 3}0.000{col 54}{space 4}-.0398356{col 67}{space 3}-.0334223
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.2114748{col 26}{space 2} .0036813{col 37}{space 1}  -57.45{col 46}{space 3}0.000{col 54}{space 4}-.2186901{col 67}{space 3}-.2042595
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1860965{col 26}{space 2} .0037182{col 37}{space 1}  -50.05{col 46}{space 3}0.000{col 54}{space 4}-.1933841{col 67}{space 3}-.1788088
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .6114396{col 26}{space 2} .0027974{col 37}{space 1}  218.57{col 46}{space 3}0.000{col 54}{space 4} .6059567{col 67}{space 3} .6169225
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5929491{col 26}{space 2} .0027252{col 37}{space 1}  217.58{col 46}{space 3}0.000{col 54}{space 4} .5876078{col 67}{space 3} .5982904
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5815692{col 26}{space 2} .0028657{col 37}{space 1}  202.94{col 46}{space 3}0.000{col 54}{space 4} .5759525{col 67}{space 3} .5871858
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .5722926{col 26}{space 2} .0034902{col 37}{space 1}  163.97{col 46}{space 3}0.000{col 54}{space 4} .5654519{col 67}{space 3} .5791333
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}   .00022{col 26}{space 2} .0014744{col 37}{space 1}    0.15{col 46}{space 3}0.881{col 54}{space 4}-.0026698{col 67}{space 3} .0031099
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.013837{col 26}{space 2} .0014876{col 37}{space 1}   -9.30{col 46}{space 3}0.000{col 54}{space 4}-.0167526{col 67}{space 3}-.0109213
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0132133{col 26}{space 2} .0014996{col 37}{space 1}   -8.81{col 46}{space 3}0.000{col 54}{space 4}-.0161525{col 67}{space 3}-.0102741
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0110797{col 26}{space 2} .0015061{col 37}{space 1}    7.36{col 46}{space 3}0.000{col 54}{space 4} .0081278{col 67}{space 3} .0140316
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0275112{col 26}{space 2} .0006824{col 37}{space 1}  -40.31{col 46}{space 3}0.000{col 54}{space 4}-.0288488{col 67}{space 3}-.0261737
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0226352{col 26}{space 2} .0006238{col 37}{space 1}  -36.29{col 46}{space 3}0.000{col 54}{space 4}-.0238577{col 67}{space 3}-.0214126
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0236356{col 26}{space 2}  .000607{col 37}{space 1}  -38.94{col 46}{space 3}0.000{col 54}{space 4}-.0248252{col 67}{space 3}-.0224459
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0293958{col 26}{space 2} .0009878{col 37}{space 1}  -29.76{col 46}{space 3}0.000{col 54}{space 4}-.0313318{col 67}{space 3}-.0274597
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .1690369{col 26}{space 2} .0027789{col 37}{space 1}   60.83{col 46}{space 3}0.000{col 54}{space 4} .1635904{col 67}{space 3} .1744833
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .188978{col 26}{space 2} .0028265{col 37}{space 1}   66.86{col 46}{space 3}0.000{col 54}{space 4} .1834381{col 67}{space 3} .1945179
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .1883251{col 26}{space 2} .0029483{col 37}{space 1}   63.87{col 46}{space 3}0.000{col 54}{space 4} .1825465{col 67}{space 3} .1941038
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .2470745{col 26}{space 2} .0035317{col 37}{space 1}   69.96{col 46}{space 3}0.000{col 54}{space 4} .2401525{col 67}{space 3} .2539964
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0046344{col 26}{space 2} .0018499{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.0082602{col 67}{space 3}-.0010085
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0127756{col 26}{space 2} .0018011{col 37}{space 1}   -7.09{col 46}{space 3}0.000{col 54}{space 4}-.0163057{col 67}{space 3}-.0092454
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0071923{col 26}{space 2} .0018426{col 37}{space 1}   -3.90{col 46}{space 3}0.000{col 54}{space 4}-.0108037{col 67}{space 3}-.0035809
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0041748{col 26}{space 2} .0014655{col 37}{space 1}    2.85{col 46}{space 3}0.004{col 54}{space 4} .0013025{col 67}{space 3} .0070471
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0030776{col 26}{space 2} .0007615{col 37}{space 1}   -4.04{col 46}{space 3}0.000{col 54}{space 4}-.0045702{col 67}{space 3}-.0015851
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0035084{col 26}{space 2} .0008051{col 37}{space 1}   -4.36{col 46}{space 3}0.000{col 54}{space 4}-.0050865{col 67}{space 3}-.0019304
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0066265{col 26}{space 2} .0007955{col 37}{space 1}   -8.33{col 46}{space 3}0.000{col 54}{space 4}-.0081856{col 67}{space 3}-.0050673
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0057665{col 26}{space 2} .0009792{col 37}{space 1}   -5.89{col 46}{space 3}0.000{col 54}{space 4}-.0076857{col 67}{space 3}-.0038473
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  2.26474{col 26}{space 2} .0299302{col 37}{space 1}   75.67{col 46}{space 3}0.000{col 54}{space 4} 2.206078{col 67}{space 3} 2.323403
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}03     - if `"`estimates'"'!="" {c -(}
       = if `"/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela.ster, replace"'!="" {c -(}
03     - estimates save `estimates'
       = estimates save /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_ela.ster} saved
03     - {c )-}
03     - {c )-}
03     - else if "`ind_weight'"!="" {c -(}
       = else if ""!="" {c -(}
03       version 11 : noisily reg `depvar' `controls' [`ind_weight' = `ind_exp']
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03     - {c )-}
03     - if "`tfx_resid'"=="" {c -(}
       = if ""=="" {c -(}
03     - qui predict score_r if e(sample),r
03     - if "`constant'"!="" {c -(}
       = if ""!="" {c -(}
03       gen b_cons = _b[_cons] if e(sample)
03       {c )-}
03     - {c )-}
03     - else {c -(}
03       qui predict score_r if e(sample), dresiduals
03       if "`constant'"!="" {c -(}
03       gen b_cons = _b[_cons] if e(sample)
03       {c )-}
03       {c )-}
03     - if "`ind_weight'"!="" {c -(}
       = if ""!="" {c -(}
03       tempvar tot_ind_weight class_ind_weight
03       qui egen `tot_ind_weight' = total(`ind_exp') if !mi(score_r)
03       qui egen `class_ind_weight' = total(`ind_exp') if !mi(score_r), by(`teacher' `year' `group' `class')
03       {c )-}
03     - if `merge_resid'==1 {c -(}
       = if 1==1 {c -(}
03     - tempfile resid_data_`l'
       = tempfile resid_data_1
03     - qui save `"`resid_data_`l''"', replace
       = qui save `"/home/tmp/St192370.000004"', replace
03     - {c )-}
03     - tempname num_obs num_par
03     - scalar `num_obs' = e(N)
       = scalar __000000 = e(N)
03     - if "`absorb'"!="" {c -(}
       = if ""!="" {c -(}
03       scalar `num_par' = e(df_m) + e(df_a) + 1
03       {c )-}
03     - else {c -(}
03     - scalar `num_par' = e(df_m) + 1
       = scalar __000001 = e(df_m) + 1
03     - {c )-}
03     - tempvar n_tested
03     - qui bys `teacher' `year' `group' `class': egen `n_tested' = count(score_r)
       = qui bys school_id year  school_id: egen __000002 = count(score_r)
03     - tempvar class_mean index
03     - qui by `teacher' `year' `group' `class': egen `class_mean' = mean(score_r)
       = qui by school_id year  school_id: egen __000003 = mean(score_r)
03     - qui by `teacher' `year' `group' `class': g `index' = _n
       = qui by school_id year  school_id: g __000004 = _n
03     - tempname var_total
03     - qui sum score_r
03     - scalar `var_total' = r(Var)*((`num_obs' - 1)/(`num_obs' - `num_par'))
       = scalar __000005 = r(Var)*((__000000 - 1)/(__000000 - __000001))
03     - tempname num_class var_ind var_class
03     - tempvar individual_dev_from_class
03     - qui gen `individual_dev_from_class' = score_r - `class_mean'
       = qui gen __000009 = score_r - __000003
03     - qui count if `index'==1 & `n_tested'!=0
       = qui count if __000004==1 & __000002!=0
03     - scalar `num_class' = r(N)
       = scalar __000006 = r(N)
03     - qui sum `individual_dev_from_class'
       = qui sum __000009
03     - scalar `var_ind' = r(Var)*((`num_obs' - 1)/(`num_obs' - `num_class' - `num_par' + 1))
       = scalar __000007 = r(Var)*((__000000 - 1)/(__000000 - __000006 - __000001 + 1))
03     - qui by `teacher' `year' `group' `class': keep if _n==1
       = qui by school_id year  school_id: keep if _n==1
03     - if "`seed'"=="" {c -(}
       = if ""=="" {c -(}
03     - set seed 9827496
03     - {c )-}
03     - tempvar rand classnum
03     - g `rand'=uniform()
       = g __00000A=uniform()
03     - bys `teacher' `year' (`rand'): gen `classnum'=_n
       = bys school_id year (__00000A): gen __00000B=_n
03     - tempname cov_sameyear corr_sameyear obs_sameyear
03     - qui sum `classnum'
       = qui sum __00000B
03     - if (r(max)==1) {c -(}
03     - local missing_sameyear=1
03     - scalar `cov_sameyear'=0
       = scalar __00000C=0
03     - {c )-}
03     - else {c -(}
03       local missing_sameyear=0
03       tempvar identifier
03       egen `identifier'=group(`teacher' `year')
03       qui tsset `identifier' `classnum'
03       qui corr `class_mean' f.`class_mean' [aw=`n_tested'+f.`n_tested'], cov
03       scalar `cov_sameyear'=r(cov_12)
03       scalar `corr_sameyear'=r(cov_12) / ( sqrt(r(Var_1)) * sqrt(r(Var_2)) )
03       scalar `obs_sameyear'=r(N)
03       {c )-}
03     - scalar `var_class' = `var_total' - `var_ind' - `cov_sameyear'
       = scalar __000008 = __000005 - __000007 - __00000C
03     - if (`var_class'<0) {c -(}
       = if (__000008<0) {c -(}
03       if ("`varclasszero'"!="varclasszero") {c -(}
03       di as error "Note: var_class has been computed as being less than 0."
03       di "var_class is defined as = var_total - var_ind - cov_sameyear."
03       di "Computed variances: var_total, var_ind, cov_sameyear, var_class"
03       di `var_total',`var_ind',`cov_sameyear',`var_class'
03       di "This negative variance can occur because cov_sameyear is calculated using only the subsample of observations that teach multiple classes per year (in the same by-group)."
03       {c )-}
03       else if ("`varclasszero'"=="varclasszero") {c -(}
03       scalar `var_class' = 0
03       {c )-}
03       {c )-}
03     - tempvar weight
03     - qui g `weight'=1/(`var_class' + `var_ind'/`n_tested')
       = qui g __00000F=1/(__000008 + __000007/__000002)
03     - tempvar excess_weight
03     - qui gen `excess_weight'=(missing(`weight'))
       = qui gen __00000G=(missing(__00000F))
03     - qui replace `weight'=1 if missing(`weight')
       = qui replace __00000F=1 if missing(__00000F)
03     - collapse (mean) `class_mean' (rawsum) `weight' `n_tested' `excess_weight' [aw=`weight'], by(`teacher' `year' `by') fast
       = collapse (mean) __000003 (rawsum) __00000F __000002 __00000G [aw=__00000F], by(school_id year ) fast
{res}{txt}03     - qui replace `weight'=`weight'-`excess_weight'
       = qui replace __00000F=__00000F-__00000G
03     - qui tsset `teacher' `year'
       = qui tsset school_id year
03     - tempvar minyear maxyear diff validyear minvalidyear maxvalidyear diffvalid
03     - qui bys `teacher': egen `minyear'=min(`year')
       = qui bys school_id: egen __00000H=min(year)
03     - qui by `teacher': egen `maxyear'=max(`year')
       = qui by school_id: egen __00000I=max(year)
03     - qui g `diff'=`maxyear'-`minyear'
       = qui g __00000J=__00000I-__00000H
03     - qui sum `diff'
       = qui sum __00000J
03     - local maxspan=`r(max)'
       = local maxspan=3
03     - qui gen `validyear'=`year' if !missing(`class_mean')
       = qui gen __00000K=year if !missing(__000003)
03     - qui by `teacher': egen `minvalidyear'=min(`validyear')
       = qui by school_id: egen __00000L=min(__00000K)
03     - qui by `teacher': egen `maxvalidyear'=max(`validyear')
       = qui by school_id: egen __00000M=max(__00000K)
03     - qui g `diffvalid'=`maxvalidyear'-`minvalidyear'
       = qui g __00000N=__00000M-__00000L
03     - qui sum `diffvalid'
       = qui sum __00000N
03     - local maxscorespan=`r(max)'
       = local maxscorespan=3
03     - if (`maxscorespan'<`maxspan') & (`driftlimit'<=0) {c -(}
       = if (3<3) & (2<=0) {c -(}
03       di as error _n "error: The maximum lags of teacher data is `maxspan', but the maximum lags of teacher data with class scores is `maxscorespan'."
03       di as error "       You must either set driftlimit() <= `maxscorespan', or drop observations so that the spans are no longer mismatched."
03       exit 499
03       {c )-}
03     - if (`driftlimit'>`maxscorespan') {c -(}
       = if (2>3) {c -(}
03       di as error "error: driftlimit(`driftlimit') was specified, which is greater than the number of lags (`maxscorespan') in the data."
03       exit 499
03       {c )-}
03     - mata:CC=compute_cov_corr("`class_mean'","`n_tested'",`maxscorespan',"`teacher'")
       = mata:CC=compute_cov_corr("__000003","__000002",3,"school_id")
{res}{txt}03     - if (`driftlimit'>0) mata:m=create_m(CC[.,1],st_numscalar("`cov_sameyear'"),`maxspan',`driftlimit')
       = if (2>0) mata:m=create_m(CC[.,1],st_numscalar("__00000C"),3,2)
{res}{txt}03     - else mata:m=create_m(CC[.,1],st_numscalar("`cov_sameyear'"))
       = else mata:m=create_m(CC[.,1],st_numscalar("__00000C"))
03     - di "Standard deviations: total, classes, students, teachers same year"
Standard deviations: total, classes, students, teachers same year
03     - if (`missing_sameyear'==0) di sqrt(`var_total'),sqrt(`var_class'),sqrt(`var_ind'),sqrt(`cov_sameyear')
       = if (1==0) di sqrt(__000005),sqrt(__000008),sqrt(__000007),sqrt(__00000C)
03     - else di sqrt(`var_total'),sqrt(`var_class'),sqrt(`var_ind'),.
       = else di sqrt(__000005),sqrt(__000008),sqrt(__000007),.
.56724538 .18200216 .53725463 .
03     - di "Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:"
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
03     - mata:CC[.,1..3]
{res}       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0198934192   .5739685075          3541{txt}  {c |}
  2 {c |}  {res} .015092812   .4354752096          2299{txt}  {c |}
  3 {c |}  {res}.0084986285   .2381615671          1105{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
03     - if (`driftlimit'>0) {c -(}
       = if (2>0) {c -(}
03     - di "Drift limit specified:"
Drift limit specified:
03     - di `driftlimit'
       = di 2
2
03     - di "Covariances used for VA computations:"
Covariances used for VA computations:
03     - mata: m[2..length(m)]'
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0198934192{txt}  {c |}
  2 {c |}  {res} .015092812{txt}  {c |}
  3 {c |}  {res} .015092812{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
03     - {c )-}
03     - mata:check_m_nomissing(m)
{res}{txt}03     - if (`firstloop'==1) {c -(}
       = if (1==1) {c -(}
03     - mata:cov_lag_accum= CC[.,1]
{res}{txt}03     - mata:corr_lag_accum= CC[.,2]
{res}{txt}03     - mata:obs_lag_accum= CC[.,3]
{res}{txt}03     - mata:cov_se_lag_accum= CC[.,4]
{res}{txt}03     - mata:var_total_accum= st_numscalar("`var_total'")
       = mata:var_total_accum= st_numscalar("__000005")
{res}{txt}03     - mata:var_class_accum= st_numscalar("`var_class'")
       = mata:var_class_accum= st_numscalar("__000008")
{res}{txt}03     - mata:var_ind_accum= st_numscalar("`var_ind'")
       = mata:var_ind_accum= st_numscalar("__000007")
{res}{txt}03     - if (`missing_sameyear'==1) {c -(}
       = if (1==1) {c -(}
03     - mata:cov_sameyear_accum=.
{res}{txt}03     - mata:corr_sameyear_accum=.
{res}{txt}03     - mata:obs_sameyear_accum=0
{res}{txt}03     - {c )-}
03     - else {c -(}
03       mata:cov_sameyear_accum=st_numscalar("`cov_sameyear'")
03       mata:corr_sameyear_accum=st_numscalar("`corr_sameyear'")
03       mata:obs_sameyear_accum=st_numscalar("`obs_sameyear'")
03       {c )-}
03     - {c )-}
03     - else {c -(}
03       mata:cov_lag_accum= rightAppendMatrices(cov_lag_accum,CC[.,1])
03       mata:corr_lag_accum= rightAppendMatrices(corr_lag_accum,CC[.,2])
03       mata:obs_lag_accum= rightAppendMatrices(obs_lag_accum,CC[.,3])
03       mata:cov_se_lag_accum= rightAppendMatrices(cov_se_lag_accum,CC[.,4])
03       mata:var_total_accum= var_total_accum,st_numscalar("`var_total'")
03       mata:var_class_accum= var_class_accum,st_numscalar("`var_class'")
03       mata:var_ind_accum= var_ind_accum,st_numscalar("`var_ind'")
03       if (`missing_sameyear'==1) {c -(}
03       mata:cov_sameyear_accum= cov_sameyear_accum,.
03       mata:corr_sameyear_accum= corr_sameyear_accum,.
03       mata:obs_sameyear_accum= obs_sameyear_accum,.
03       {c )-}
03       else {c -(}
03       mata:cov_sameyear_accum=cov_sameyear_accum,st_numscalar("`cov_sameyear'")
03       mata:corr_sameyear_accum=corr_sameyear_accum,st_numscalar("`corr_sameyear'")
03       mata:obs_sameyear_accum=obs_sameyear_accum,st_numscalar("`obs_sameyear'")
03       {c )-}
03       {c )-}
03     - sort `teacher' `year'
       = sort school_id year
03     - tempvar obs_teacher
03     - by `teacher': egen `obs_teacher'=count(`teacher')
       = by school_id: egen __00000O=count(school_id)
03     - qui gen float tv=.
03     - if "`quasiexperiment'"!="" {c -(}
       = if ""!="" {c -(}
03       qui gen float tv_2yr_l=.
03       qui gen float tv_2yr_f=.
03       qui gen float tv_ss=.
03       mata: driftcalclist(vectorToStripeDiag(m), "`teacher'", "`year'", "`class_mean'", "`weight'", "`obs_teacher'", "tv", "tv_2yr_l", "tv_2yr_f", "tv_ss")
03       {c )-}
03     - else mata:driftcalclist(vectorToStripeDiag(m), "`teacher'", "`year'", "`class_mean'", "`weight'", "`obs_teacher'", "tv")
       = else mata:driftcalclist(vectorToStripeDiag(m), "school_id", "year", "__000003", "__00000F", "__00000O", "tv")
{res}{txt}03     - if ("`quasiexperiment'"=="") keep `teacher' `year' `by' tv
       = if (""=="") keep school_id year  tv
03     - else keep `teacher' `year' `by' tv tv_2yr_l tv_2yr_f tv_ss
       = else keep school_id year  tv tv_2yr_l tv_2yr_f tv_ss
03     - if (`firstloop'!=1) append using `"`output'"', nolabel
       = if (1!=1) append using `"/home/tmp/St192370.000002"', nolabel
03     - qui save `"`output'"', replace
       = qui save `"/home/tmp/St192370.000002"', replace
03     - local firstloop=0
03     - {c )-}
03     - di "{c -(}txt{c )-}{c -(}hline{c )-}"
{txt}{hline}
03     - if "`output_addvars'"!="" quietly {c -(}
       = if ""!="" quietly {c -(}
03       restore, preserve
03       keep `teacher' `year' `by' `output_addvars'
03       bys `teacher' `year' `by' `output_addvars': keep if _n==1
03       merge m:1 `teacher' `year' `by' using `"`output'"', nogen nolabel
03       {c )-}
03     - sort `teacher' `year' `by'
       = sort school_id year 
03     - qui save `"`output'"', replace
       = qui save `"/home/tmp/St192370.000002"', replace
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       local bylabels=""
03       forvalues i=1/`by_vals' {c -(}
03       local bylabel : label `byvar' `i', strict
03       local bylabel=subinstr("`bylabel'"," ","_",.)
03       local bylabels `bylabels' _`bylabel'
03       {c )-}
03       mata:saveVariancesToDataset(cov_lag_accum, corr_lag_accum, obs_lag_accum, cov_se_lag_accum, var_total_accum, var_class_accum, var_ind_accum, cov_sameyear_accum, corr_sameyear_accum, obs_sameyear_accum, tokens(st_local("bylabels")))
03       {c )-}
03     - else mata:saveVariancesToDataset(cov_lag_accum, corr_lag_accum, obs_lag_accum, cov_se_lag_accum, var_total_accum, var_class_accum, var_ind_accum, cov_sameyear_accum, corr_sameyear_accum, obs_sameyear_accum, "")
{res}{txt}03     - if (`nooutput'!=1) qui outsheet using `"`output'_variance.csv"', comma replace
       = if (1!=1) qui outsheet using `"/home/tmp/St192370.000002_variance.csv"', comma replace
03     - tokenize "`data'"
       = tokenize "merge tv score_r"
03     - if inlist("`1'","preserve","merge") {c -(}
       = if inlist("merge","preserve","merge") {c -(}
03     - restore
03     - if (`merge_resid'==1) {c -(}
       = if (1==1) {c -(}
03     - if ("`byvar'"!="") qui keep if missing(`teacher',`year',`class',`byvar')
       = if (""!="") qui keep if missing(school_id,year,school_id,)
03     - else qui keep if missing(`teacher',`year',`class')
       = else qui keep if missing(school_id,year,school_id)
03     - forvalues l=1/`by_vals' {c -(}
       = forvalues l=1/1 {c -(}
03     - append using `"`resid_data_`l''"', nolabel
       = append using `"/home/tmp/St192370.000004"', nolabel
03     - {c )-}
03     - {c )-}
03     - if (`merge_tv'==1) qui merge m:1 `teacher' `year' `by' `output_addvars' using `"`output'"', nogen nolabel
       = if (1==1) qui merge m:1 school_id year   using `"/home/tmp/St192370.000002"', nogen nolabel
03     - {c )-}
03     - else {c -(}
03       restore, not
03       if ("`data'"=="tv") use `"`output'"', clear
03       {c )-}
       {hline 60} end vam {hline}
02   - rename tv va_cfr_g11_`subject'
     = rename tv va_cfr_g11_ela
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - rename score_r sbac_g11_`subject'_r
     = rename score_r sbac_g11_ela_r
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
     = reg sbac_g11_ela_r va_cfr_g11_ela, cluster(school_id)
       {hline 58} begin reg {hline}
03     - if _by() {c -(}
03       local by "by `_byvars'`_byrc0':"
03       {c )-}
03     - `by' regress `0'
       =  regress sbac_g11_ela_r va_cfr_g11_ela, cluster(school_id)

Linear regression                               Number of obs     = {res}   675,586
                                                {txt}F(1, 1275)        =  {res}  2110.09
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0409
                                                {txt}Root MSE          =    {res} .55538

{txt}{ralign 78:(Std. err. adjusted for {res:1,276} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_e~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~a {c |}{col 14}{res}{space 2} .9819345{col 26}{space 2} .0213763{col 37}{space 1}   45.94{col 46}{space 3}0.000{col 54}{space 4}  .939998{col 67}{space 3} 1.023871
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0002035{col 26}{space 2} .0012535{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-.0026626{col 67}{space 3} .0022555
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}       {hline 60} end reg {hline}
02   - estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster, replace
     = estimates save /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster, replace
     = estimates save /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_ela_sibling.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - label var va_cfr_g11_`subject' "`subject' VA with family FE without TFX"
     = label var va_cfr_g11_ela "ela VA with family FE without TFX"
       {hline 56} begin label {hline}
03     - version 10.0
03     - local vv : display "version " string(_caller()) ", missing:"
03     - gettoken val : 0
03     - if (strpos("`val'", "val") > 0 ) {c -(}
       = if (strpos("var", "val") > 0 ) {c -(}
03       gettoken val 0 : 0
03       syntax anything [, nofix]
03       if "`fix'" != "" {c -(}
03       local fix ", nofix"
03       {c )-}
03       gettoken var rest : anything
03       while `"`rest'"' != "" {c -(}
03       gettoken lab rest : rest
03       local label "`lab'"
03       {c )-}
03       local vlist : list anything - lab
03       if "`lab'" == "." {c -(}
03       local lab ""
03       {c )-}
03       foreach var of varlist `vlist' {c -(}
03       `vv' _label `val' `var' `lab' `fix'
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - `vv' _label `macval(0)'
       = version 17, missing: _label var va_cfr_g11_ela "ela VA with family FE without TFX"
03     - {c )-}
       {hline 58} end label {hline}
02   - label var sbac_g11_`subject'_r "`subject' score residual with family FE without TFX"
     = label var sbac_g11_ela_r "ela score residual with family FE without TFX"
       {hline 56} begin label {hline}
03     - version 10.0
03     - local vv : display "version " string(_caller()) ", missing:"
03     - gettoken val : 0
03     - if (strpos("`val'", "val") > 0 ) {c -(}
       = if (strpos("var", "val") > 0 ) {c -(}
03       gettoken val 0 : 0
03       syntax anything [, nofix]
03       if "`fix'" != "" {c -(}
03       local fix ", nofix"
03       {c )-}
03       gettoken var rest : anything
03       while `"`rest'"' != "" {c -(}
03       gettoken lab rest : rest
03       local label "`lab'"
03       {c )-}
03       local vlist : list anything - lab
03       if "`lab'" == "." {c -(}
03       local lab ""
03       {c )-}
03       foreach var of varlist `vlist' {c -(}
03       `vv' _label `val' `var' `lab' `fix'
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - `vv' _label `macval(0)'
       = version 17, missing: _label var sbac_g11_ela_r "ela score residual with family FE without TFX"
03     - {c )-}
       {hline 58} end label {hline}
02   - gen sbac_g11_`subject'_r_d = sbac_g11_`subject'_r_nosibctrl - sbac_g11_`subject'_r
     = gen sbac_g11_ela_r_d = sbac_g11_ela_r_nosibctrl - sbac_g11_ela_r
02   - rename va_cfr_g11_`subject' va_cfr_g11_`subject'_temp
     = rename va_cfr_g11_ela va_cfr_g11_ela_temp
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - rename va_cfr_g11_`subject'_nosibctrl va_cfr_g11_`subject'
     = rename va_cfr_g11_ela_nosibctrl va_cfr_g11_ela
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - reg sbac_g11_`subject'_r_d va_cfr_g11_`subject', cluster(school_id)
     = reg sbac_g11_ela_r_d va_cfr_g11_ela, cluster(school_id)
       {hline 58} begin reg {hline}
03     - if _by() {c -(}
03       local by "by `_byvars'`_byrc0':"
03       {c )-}
03     - `by' regress `0'
       =  regress sbac_g11_ela_r_d va_cfr_g11_ela, cluster(school_id)

Linear regression                               Number of obs     = {res}   675,586
                                                {txt}F(1, 1275)        =  {res}    20.94
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res} .01005

{txt}{ralign 78:(Std. err. adjusted for {res:1,276} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_e~d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~a {c |}{col 14}{res}{space 2} .0010195{col 26}{space 2} .0002228{col 37}{space 1}    4.58{col 46}{space 3}0.000{col 54}{space 4} .0005824{col 67}{space 3} .0014566
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-7.85e-07{col 26}{space 2} .0000279{col 37}{space 1}   -0.03{col 46}{space 3}0.978{col 54}{space 4}-.0000556{col 67}{space 3}  .000054
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}       {hline 60} end reg {hline}
02   - estimates save $projdir/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_`subject'_sibling.ster, replace
     = estimates save /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - estimates save $vaprojdir/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_`subject'_sibling.ster, replace
     = estimates save /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_ela_sibling.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
     = rename va_cfr_g11_ela va_cfr_g11_ela_nosibctrl
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - rename va_cfr_g11_`subject'_temp va_cfr_g11_`subject'
     = rename va_cfr_g11_ela_temp va_cfr_g11_ela
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - collapse (firstnm) va_* (mean) sbac_*_r* (sum) n_g11_`subject' = touse_g11_`subject' if sibling_full_sample == 1 & sibling_out_sample == 1 , by(school_id cdscode grade year)
     = collapse (firstnm) va_* (mean) sbac_*_r* (sum) n_g11_ela = touse_g11_ela if sibling_full_sample == 1 & sibling_out_sample == 1 , by(school_id cdscode grade year)
       {hline 53} begin collapse {hline}
03     - version 8, missing
03     - if _caller() < 5 {c -(}
03       collaps4 `0'
03       exit
03       {c )-}
03     - collapse_17 `0'
       = collapse_17 (firstnm) va_* (mean) sbac_*_r* (sum) n_g11_ela = touse_g11_ela if sibling_full_sample == 1 & sibling_out_sample == 1 , by(school_id cdscode grade year)
{res}{txt}03     - if "`col17_graphbar'" != "" {c -(}
       = if "" != "" {c -(}
03       c_local `col17_graphbar' "``col17_graphbar''"
03       {c )-}
       {hline 55} end collapse {hline}
02   - save $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibling.dta, replace
     = save /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_ela_sibling.dta, replace
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_ela_sibling.dta{rm}
saved
{p_end}
02   - save $vaprojdir/data/sibling_va/test_score_va/va_g11_`subject'_sibling.dta, replace
     = save /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/test_score_va/va_g11_ela_sibling.dta, replace
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/test_score_va/va_g11_ela_sibling.dta{rm}
saved
{p_end}
02   - {c )-}
02   - use `va_g11_sibling_dataset' if touse_g11_`subject'==1 & sibling_out_sample == 1, clear
     = use /home/tmp/St192370.000001 if touse_g11_math==1 & sibling_out_sample == 1, clear
(CST/SBAC Student Test Score Samples)
02   - vam sbac_`subject'_z_score , teacher(school_id) year(year) class(school_id) controls( i.year `school_controls' `demographic_controls' `ela_score_controls' `math_score_controls' ) data(merge tv score_r) driftlimit(`drift_limit') estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`subject'_nosibctrl.ster, replace)
     = vam sbac_math_z_score , teacher(school_id) year(year) class(school_id) controls( i.year  age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score) i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score) ) data(merge tv score_r) driftlimit(2) estimates(/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_math_nosibctrl.ster, replace)
       {hline 58} begin vam {hline}
03     - version 10.1
03     - set more off
03     - syntax varname(ts fv) [aweight/], teacher(varname) year(varname) class(varname) [ by(varlist) controls(varlist ts fv) absorb(varname) tfx_resid(varname) data(string) output(string) output_addvars(varlist) driftlimit(integer -1) QUASIexperiment CONStant noseed varclasszero estimates(string asis)]
03     - local depvar `varlist'
       = local depvar sbac_math_z_score
03     - capture confirm variable score_r, exact
03     - if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named score_r."
03       exit 110
03       {c )-}
03     - capture confirm variable tv, exact
03     - if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv."
03       exit 110
03       {c )-}
03     - if ("`quasiexperiment'"!="") {c -(}
       = if (""!="") {c -(}
03       capture confirm variable tv_2yr_l, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_2yr_l."
03       exit 110
03       {c )-}
03       capture confirm variable tv_2yr_f, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_2yr_f."
03       exit 110
03       {c )-}
03       capture confirm variable tv_ss, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_ss."
03       exit 110
03       {c )-}
03       {c )-}
03     - local merge_tv=0
03     - local merge_resid=0
03     - if ("`data'"=="") local data="preserve"
       = if ("merge tv score_r"=="") local data="preserve"
03     - else {c -(}
03     - if !inlist("`data'","preserve","tv","merge tv","merge score_r","merge tv score_r","merge score_r tv","variance") {c -(}
       = if !inlist("merge tv score_r","preserve","tv","merge tv","merge score_r","merge tv score_r","merge score_r tv","variance") {c -(}
03       di as error "Not a valid argument for data. Choose either 'preserve', 'tv', 'merge [tv AND/OR score_r]', or 'variance'."
03       exit 198
03       {c )-}
03     - else {c -(}
03     - tokenize "`data'"
       = tokenize "merge tv score_r"
03     - if ("`1'")=="merge" {c -(}
       = if ("merge")=="merge" {c -(}
03     - if ("`2'"=="tv") | ("`3'"=="tv") local merge_tv=1
       = if ("tv"=="tv") | ("score_r"=="tv") local merge_tv=1
03     - if ("`2'"=="score_r") | ("`3'"=="score_r") local merge_resid=1
       = if ("tv"=="score_r") | ("score_r"=="score_r") local merge_resid=1
03     - {c )-}
03     - {c )-}
03     - {c )-}
03     - if "`tfx_resid'"!="" & "`absorb'"!="" {c -(}
       = if ""!="" & ""!="" {c -(}
03       di as error "Cannot specify an absorb variable and a tfx_resid variable simultaneously."
03       exit 198
03       {c )-}
03     - if `"`output'"'=="" {c -(}
       = if `""'=="" {c -(}
03     - tempfile output
03     - local nooutput=1
03     - {c )-}
03     - else local nooutput=0
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       tempvar byvar
03       egen `byvar'=group(`by'), label
03       sum `byvar', meanonly
03       local by_vals=`r(max)'
03       {c )-}
03     - else local by_vals=1
03     - if "`weight'"!="" {c -(}
       = if ""!="" {c -(}
03       local ind_weight "`weight'"
03       macro drop _weight
03       local ind_exp "`exp'"
03       macro drop _exp
03       local times_exp "* `exp'"
03       {c )-}
03     - preserve
03     - local firstloop=1
03     - forvalues l=1/`by_vals' {c -(}
       = forvalues l=1/1 {c -(}
03     - if (`firstloop'!=1) restore, preserve
       = if (1!=1) restore, preserve
03     - di "{c -(}txt{c )-}{c -(}hline{c )-}"
{txt}{hline}
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       local bylabel : label `byvar' `l', strict
03       di "{c -(}bf:-> by variables:{c )-} `by' = `bylabel'"
03       {c )-}
03     - qui drop if missing(`teacher',`year',`class')
       = qui drop if missing(school_id,year,school_id)
03     - if ("`by'"!="") qui keep if `byvar'==`l'
       = if (""!="") qui keep if ==1
03     - if "`absorb'"!="" | "`tfx_resid'"!="" {c -(}
       = if ""!="" | ""!="" {c -(}
03       if "`ind_weight'"=="" {c -(}
03       noisily areg `depvar' `controls' , absorb(`absorb'`tfx_resid')
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03       else if "`ind_weight'"!="" {c -(}
03       noisily areg `depvar' `controls' [`ind_weight' = `ind_exp'] , absorb(`absorb'`tfx_resid')
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - if "`ind_weight'"=="" {c -(}
       = if ""=="" {c -(}
03     - version 11 : noisily reg `depvar' `controls'
       = version 11 : noisily reg sbac_math_z_score i.year age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other i.econ_disadvantage i.limited_eng_prof i.disabled i.year#c.prior_ela_z_score i.year#c.prior_ela_z_score#c.prior_ela_z_score i.year#c.prior_ela_z_score#c.prior_ela_z_score#c.prior_ela_z_score i.year#c.prior_math_z_score i.year#c.prior_math_z_score#c.prior_math_z_score i.year#c.prior_math_z_score#c.prior_math_z_score#c.prior_math_z_score

      Source {c |}       SS           df       MS      Number of obs   ={res}   674,462
{txt}{hline 13}{c +}{hline 34}   F(36, 674425)   = {res} 37012.66
{txt}       Model {c |} {res} 400184.449        36  11116.2347   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 202554.093   674,425  .300335979   {txt}R-squared       ={res}    0.6639
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6639
{txt}       Total {c |} {res} 602738.541   674,461  .893659591   {txt}Root MSE        =   {res} .54803

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2}   .05854{col 26}{space 2} .0026615{col 37}{space 1}   22.00{col 46}{space 3}0.000{col 54}{space 4} .0533236{col 67}{space 3} .0637563
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0686921{col 26}{space 2} .0026501{col 37}{space 1}   25.92{col 46}{space 3}0.000{col 54}{space 4}  .063498{col 67}{space 3} .0738862
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0883919{col 26}{space 2} .0026544{col 37}{space 1}  -33.30{col 46}{space 3}0.000{col 54}{space 4}-.0935944{col 67}{space 3}-.0831894
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}-.0003538{col 26}{space 2} 4.73e-06{col 37}{space 1}  -74.82{col 46}{space 3}0.000{col 54}{space 4}-.0003631{col 67}{space 3}-.0003445
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2}  .052894{col 26}{space 2} .0013642{col 37}{space 1}   38.77{col 46}{space 3}0.000{col 54}{space 4} .0502202{col 67}{space 3} .0555679
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2} .1902327{col 26}{space 2} .0021907{col 37}{space 1}   86.83{col 46}{space 3}0.000{col 54}{space 4}  .185939{col 67}{space 3} .1945265
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0668171{col 26}{space 2} .0018686{col 37}{space 1}  -35.76{col 46}{space 3}0.000{col 54}{space 4}-.0704794{col 67}{space 3}-.0631548
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1697084{col 26}{space 2} .0036767{col 37}{space 1}  -46.16{col 46}{space 3}0.000{col 54}{space 4}-.1769147{col 67}{space 3}-.1625022
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0057796{col 26}{space 2}  .004072{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-.0022015{col 67}{space 3} .0137606
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0650642{col 26}{space 2} .0015838{col 37}{space 1}  -41.08{col 46}{space 3}0.000{col 54}{space 4}-.0681685{col 67}{space 3}-.0619599
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0853626{col 26}{space 2} .0035675{col 37}{space 1}  -23.93{col 46}{space 3}0.000{col 54}{space 4}-.0923547{col 67}{space 3}-.0783705
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2}-.1559783{col 26}{space 2} .0036066{col 37}{space 1}  -43.25{col 46}{space 3}0.000{col 54}{space 4}-.1630471{col 67}{space 3}-.1489095
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3460793{col 26}{space 2} .0027089{col 37}{space 1}  127.76{col 46}{space 3}0.000{col 54}{space 4} .3407699{col 67}{space 3} .3513887
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3328641{col 26}{space 2}  .002639{col 37}{space 1}  126.13{col 46}{space 3}0.000{col 54}{space 4} .3276918{col 67}{space 3} .3380365
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3021307{col 26}{space 2} .0027744{col 37}{space 1}  108.90{col 46}{space 3}0.000{col 54}{space 4} .2966929{col 67}{space 3} .3075685
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1877411{col 26}{space 2} .0033763{col 37}{space 1}   55.61{col 46}{space 3}0.000{col 54}{space 4} .1811236{col 67}{space 3} .1943586
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0241664{col 26}{space 2} .0014326{col 37}{space 1}   16.87{col 46}{space 3}0.000{col 54}{space 4} .0213586{col 67}{space 3} .0269742
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0056111{col 26}{space 2}  .001441{col 37}{space 1}    3.89{col 46}{space 3}0.000{col 54}{space 4} .0027867{col 67}{space 3} .0084354
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0197895{col 26}{space 2} .0014526{col 37}{space 1}   13.62{col 46}{space 3}0.000{col 54}{space 4} .0169424{col 67}{space 3} .0226366
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0001293{col 26}{space 2}  .001457{col 37}{space 1}   -0.09{col 46}{space 3}0.929{col 54}{space 4} -.002985{col 67}{space 3} .0027264
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0156205{col 26}{space 2} .0006613{col 37}{space 1}  -23.62{col 46}{space 3}0.000{col 54}{space 4}-.0169166{col 67}{space 3}-.0143244
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0104033{col 26}{space 2} .0006037{col 37}{space 1}  -17.23{col 46}{space 3}0.000{col 54}{space 4}-.0115865{col 67}{space 3}-.0092201
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0133383{col 26}{space 2} .0005876{col 37}{space 1}  -22.70{col 46}{space 3}0.000{col 54}{space 4}  -.01449{col 67}{space 3}-.0121866
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0065435{col 26}{space 2} .0009548{col 37}{space 1}   -6.85{col 46}{space 3}0.000{col 54}{space 4}-.0084149{col 67}{space 3}-.0046721
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4873828{col 26}{space 2} .0026899{col 37}{space 1}  181.19{col 46}{space 3}0.000{col 54}{space 4} .4821107{col 67}{space 3} .4926549
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .509296{col 26}{space 2} .0027366{col 37}{space 1}  186.10{col 46}{space 3}0.000{col 54}{space 4} .5039323{col 67}{space 3} .5146596
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}  .532375{col 26}{space 2} .0028544{col 37}{space 1}  186.51{col 46}{space 3}0.000{col 54}{space 4} .5267805{col 67}{space 3} .5379695
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6711163{col 26}{space 2} .0034189{col 37}{space 1}  196.29{col 46}{space 3}0.000{col 54}{space 4} .6644153{col 67}{space 3} .6778174
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0240714{col 26}{space 2}  .001793{col 37}{space 1}   13.43{col 46}{space 3}0.000{col 54}{space 4} .0205572{col 67}{space 3} .0275857
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0046303{col 26}{space 2} .0017438{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} .0012126{col 67}{space 3}  .008048
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0006828{col 26}{space 2} .0017864{col 37}{space 1}   -0.38{col 46}{space 3}0.702{col 54}{space 4}-.0041841{col 67}{space 3} .0028184
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0777338{col 26}{space 2} .0014196{col 37}{space 1}   54.76{col 46}{space 3}0.000{col 54}{space 4} .0749514{col 67}{space 3} .0805163
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0227705{col 26}{space 2} .0007368{col 37}{space 1}  -30.90{col 46}{space 3}0.000{col 54}{space 4}-.0242147{col 67}{space 3}-.0213264
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0202824{col 26}{space 2} .0007792{col 37}{space 1}  -26.03{col 46}{space 3}0.000{col 54}{space 4}-.0218095{col 67}{space 3}-.0187552
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0213844{col 26}{space 2} .0007705{col 37}{space 1}  -27.76{col 46}{space 3}0.000{col 54}{space 4}-.0228945{col 67}{space 3}-.0198743
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0265723{col 26}{space 2} .0009485{col 37}{space 1}  -28.01{col 46}{space 3}0.000{col 54}{space 4}-.0284315{col 67}{space 3}-.0247132
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.248523{col 26}{space 2} .0289643{col 37}{space 1}   77.63{col 46}{space 3}0.000{col 54}{space 4} 2.191754{col 67}{space 3} 2.305292
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}03     - if `"`estimates'"'!="" {c -(}
       = if `"/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_math_nosibctrl.ster, replace"'!="" {c -(}
03     - estimates save `estimates'
       = estimates save /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_math_nosibctrl.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_math_nosibctrl.ster} saved
03     - {c )-}
03     - {c )-}
03     - else if "`ind_weight'"!="" {c -(}
       = else if ""!="" {c -(}
03       version 11 : noisily reg `depvar' `controls' [`ind_weight' = `ind_exp']
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03     - {c )-}
03     - if "`tfx_resid'"=="" {c -(}
       = if ""=="" {c -(}
03     - qui predict score_r if e(sample),r
03     - if "`constant'"!="" {c -(}
       = if ""!="" {c -(}
03       gen b_cons = _b[_cons] if e(sample)
03       {c )-}
03     - {c )-}
03     - else {c -(}
03       qui predict score_r if e(sample), dresiduals
03       if "`constant'"!="" {c -(}
03       gen b_cons = _b[_cons] if e(sample)
03       {c )-}
03       {c )-}
03     - if "`ind_weight'"!="" {c -(}
       = if ""!="" {c -(}
03       tempvar tot_ind_weight class_ind_weight
03       qui egen `tot_ind_weight' = total(`ind_exp') if !mi(score_r)
03       qui egen `class_ind_weight' = total(`ind_exp') if !mi(score_r), by(`teacher' `year' `group' `class')
03       {c )-}
03     - if `merge_resid'==1 {c -(}
       = if 1==1 {c -(}
03     - tempfile resid_data_`l'
       = tempfile resid_data_1
03     - qui save `"`resid_data_`l''"', replace
       = qui save `"/home/tmp/St192370.000004"', replace
03     - {c )-}
03     - tempname num_obs num_par
03     - scalar `num_obs' = e(N)
       = scalar __000000 = e(N)
03     - if "`absorb'"!="" {c -(}
       = if ""!="" {c -(}
03       scalar `num_par' = e(df_m) + e(df_a) + 1
03       {c )-}
03     - else {c -(}
03     - scalar `num_par' = e(df_m) + 1
       = scalar __000001 = e(df_m) + 1
03     - {c )-}
03     - tempvar n_tested
03     - qui bys `teacher' `year' `group' `class': egen `n_tested' = count(score_r)
       = qui bys school_id year  school_id: egen __000002 = count(score_r)
03     - tempvar class_mean index
03     - qui by `teacher' `year' `group' `class': egen `class_mean' = mean(score_r)
       = qui by school_id year  school_id: egen __000003 = mean(score_r)
03     - qui by `teacher' `year' `group' `class': g `index' = _n
       = qui by school_id year  school_id: g __000004 = _n
03     - tempname var_total
03     - qui sum score_r
03     - scalar `var_total' = r(Var)*((`num_obs' - 1)/(`num_obs' - `num_par'))
       = scalar __000005 = r(Var)*((__000000 - 1)/(__000000 - __000001))
03     - tempname num_class var_ind var_class
03     - tempvar individual_dev_from_class
03     - qui gen `individual_dev_from_class' = score_r - `class_mean'
       = qui gen __000009 = score_r - __000003
03     - qui count if `index'==1 & `n_tested'!=0
       = qui count if __000004==1 & __000002!=0
03     - scalar `num_class' = r(N)
       = scalar __000006 = r(N)
03     - qui sum `individual_dev_from_class'
       = qui sum __000009
03     - scalar `var_ind' = r(Var)*((`num_obs' - 1)/(`num_obs' - `num_class' - `num_par' + 1))
       = scalar __000007 = r(Var)*((__000000 - 1)/(__000000 - __000006 - __000001 + 1))
03     - qui by `teacher' `year' `group' `class': keep if _n==1
       = qui by school_id year  school_id: keep if _n==1
03     - if "`seed'"=="" {c -(}
       = if ""=="" {c -(}
03     - set seed 9827496
03     - {c )-}
03     - tempvar rand classnum
03     - g `rand'=uniform()
       = g __00000A=uniform()
03     - bys `teacher' `year' (`rand'): gen `classnum'=_n
       = bys school_id year (__00000A): gen __00000B=_n
03     - tempname cov_sameyear corr_sameyear obs_sameyear
03     - qui sum `classnum'
       = qui sum __00000B
03     - if (r(max)==1) {c -(}
03     - local missing_sameyear=1
03     - scalar `cov_sameyear'=0
       = scalar __00000C=0
03     - {c )-}
03     - else {c -(}
03       local missing_sameyear=0
03       tempvar identifier
03       egen `identifier'=group(`teacher' `year')
03       qui tsset `identifier' `classnum'
03       qui corr `class_mean' f.`class_mean' [aw=`n_tested'+f.`n_tested'], cov
03       scalar `cov_sameyear'=r(cov_12)
03       scalar `corr_sameyear'=r(cov_12) / ( sqrt(r(Var_1)) * sqrt(r(Var_2)) )
03       scalar `obs_sameyear'=r(N)
03       {c )-}
03     - scalar `var_class' = `var_total' - `var_ind' - `cov_sameyear'
       = scalar __000008 = __000005 - __000007 - __00000C
03     - if (`var_class'<0) {c -(}
       = if (__000008<0) {c -(}
03       if ("`varclasszero'"!="varclasszero") {c -(}
03       di as error "Note: var_class has been computed as being less than 0."
03       di "var_class is defined as = var_total - var_ind - cov_sameyear."
03       di "Computed variances: var_total, var_ind, cov_sameyear, var_class"
03       di `var_total',`var_ind',`cov_sameyear',`var_class'
03       di "This negative variance can occur because cov_sameyear is calculated using only the subsample of observations that teach multiple classes per year (in the same by-group)."
03       {c )-}
03       else if ("`varclasszero'"=="varclasszero") {c -(}
03       scalar `var_class' = 0
03       {c )-}
03       {c )-}
03     - tempvar weight
03     - qui g `weight'=1/(`var_class' + `var_ind'/`n_tested')
       = qui g __00000F=1/(__000008 + __000007/__000002)
03     - tempvar excess_weight
03     - qui gen `excess_weight'=(missing(`weight'))
       = qui gen __00000G=(missing(__00000F))
03     - qui replace `weight'=1 if missing(`weight')
       = qui replace __00000F=1 if missing(__00000F)
03     - collapse (mean) `class_mean' (rawsum) `weight' `n_tested' `excess_weight' [aw=`weight'], by(`teacher' `year' `by') fast
       = collapse (mean) __000003 (rawsum) __00000F __000002 __00000G [aw=__00000F], by(school_id year ) fast
{res}{txt}03     - qui replace `weight'=`weight'-`excess_weight'
       = qui replace __00000F=__00000F-__00000G
03     - qui tsset `teacher' `year'
       = qui tsset school_id year
03     - tempvar minyear maxyear diff validyear minvalidyear maxvalidyear diffvalid
03     - qui bys `teacher': egen `minyear'=min(`year')
       = qui bys school_id: egen __00000H=min(year)
03     - qui by `teacher': egen `maxyear'=max(`year')
       = qui by school_id: egen __00000I=max(year)
03     - qui g `diff'=`maxyear'-`minyear'
       = qui g __00000J=__00000I-__00000H
03     - qui sum `diff'
       = qui sum __00000J
03     - local maxspan=`r(max)'
       = local maxspan=3
03     - qui gen `validyear'=`year' if !missing(`class_mean')
       = qui gen __00000K=year if !missing(__000003)
03     - qui by `teacher': egen `minvalidyear'=min(`validyear')
       = qui by school_id: egen __00000L=min(__00000K)
03     - qui by `teacher': egen `maxvalidyear'=max(`validyear')
       = qui by school_id: egen __00000M=max(__00000K)
03     - qui g `diffvalid'=`maxvalidyear'-`minvalidyear'
       = qui g __00000N=__00000M-__00000L
03     - qui sum `diffvalid'
       = qui sum __00000N
03     - local maxscorespan=`r(max)'
       = local maxscorespan=3
03     - if (`maxscorespan'<`maxspan') & (`driftlimit'<=0) {c -(}
       = if (3<3) & (2<=0) {c -(}
03       di as error _n "error: The maximum lags of teacher data is `maxspan', but the maximum lags of teacher data with class scores is `maxscorespan'."
03       di as error "       You must either set driftlimit() <= `maxscorespan', or drop observations so that the spans are no longer mismatched."
03       exit 499
03       {c )-}
03     - if (`driftlimit'>`maxscorespan') {c -(}
       = if (2>3) {c -(}
03       di as error "error: driftlimit(`driftlimit') was specified, which is greater than the number of lags (`maxscorespan') in the data."
03       exit 499
03       {c )-}
03     - mata:CC=compute_cov_corr("`class_mean'","`n_tested'",`maxscorespan',"`teacher'")
       = mata:CC=compute_cov_corr("__000003","__000002",3,"school_id")
{res}{txt}03     - if (`driftlimit'>0) mata:m=create_m(CC[.,1],st_numscalar("`cov_sameyear'"),`maxspan',`driftlimit')
       = if (2>0) mata:m=create_m(CC[.,1],st_numscalar("__00000C"),3,2)
{res}{txt}03     - else mata:m=create_m(CC[.,1],st_numscalar("`cov_sameyear'"))
       = else mata:m=create_m(CC[.,1],st_numscalar("__00000C"))
03     - di "Standard deviations: total, classes, students, teachers same year"
Standard deviations: total, classes, students, teachers same year
03     - if (`missing_sameyear'==0) di sqrt(`var_total'),sqrt(`var_class'),sqrt(`var_ind'),sqrt(`cov_sameyear')
       = if (1==0) di sqrt(__000005),sqrt(__000008),sqrt(__000007),sqrt(__00000C)
03     - else di sqrt(`var_total'),sqrt(`var_class'),sqrt(`var_ind'),.
       = else di sqrt(__000005),sqrt(__000008),sqrt(__000007),.
.54802918 .16390201 .52294561 .
03     - di "Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:"
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
03     - mata:CC[.,1..3]
{res}       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0194658737   .6783396224          3534{txt}  {c |}
  2 {c |}  {res}.0154052278   .5463185172          2296{txt}  {c |}
  3 {c |}  {res}.0098236127   .3639788075          1105{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
03     - if (`driftlimit'>0) {c -(}
       = if (2>0) {c -(}
03     - di "Drift limit specified:"
Drift limit specified:
03     - di `driftlimit'
       = di 2
2
03     - di "Covariances used for VA computations:"
Covariances used for VA computations:
03     - mata: m[2..length(m)]'
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0194658737{txt}  {c |}
  2 {c |}  {res}.0154052278{txt}  {c |}
  3 {c |}  {res}.0154052278{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
03     - {c )-}
03     - mata:check_m_nomissing(m)
{res}{txt}03     - if (`firstloop'==1) {c -(}
       = if (1==1) {c -(}
03     - mata:cov_lag_accum= CC[.,1]
{res}{txt}03     - mata:corr_lag_accum= CC[.,2]
{res}{txt}03     - mata:obs_lag_accum= CC[.,3]
{res}{txt}03     - mata:cov_se_lag_accum= CC[.,4]
{res}{txt}03     - mata:var_total_accum= st_numscalar("`var_total'")
       = mata:var_total_accum= st_numscalar("__000005")
{res}{txt}03     - mata:var_class_accum= st_numscalar("`var_class'")
       = mata:var_class_accum= st_numscalar("__000008")
{res}{txt}03     - mata:var_ind_accum= st_numscalar("`var_ind'")
       = mata:var_ind_accum= st_numscalar("__000007")
{res}{txt}03     - if (`missing_sameyear'==1) {c -(}
       = if (1==1) {c -(}
03     - mata:cov_sameyear_accum=.
{res}{txt}03     - mata:corr_sameyear_accum=.
{res}{txt}03     - mata:obs_sameyear_accum=0
{res}{txt}03     - {c )-}
03     - else {c -(}
03       mata:cov_sameyear_accum=st_numscalar("`cov_sameyear'")
03       mata:corr_sameyear_accum=st_numscalar("`corr_sameyear'")
03       mata:obs_sameyear_accum=st_numscalar("`obs_sameyear'")
03       {c )-}
03     - {c )-}
03     - else {c -(}
03       mata:cov_lag_accum= rightAppendMatrices(cov_lag_accum,CC[.,1])
03       mata:corr_lag_accum= rightAppendMatrices(corr_lag_accum,CC[.,2])
03       mata:obs_lag_accum= rightAppendMatrices(obs_lag_accum,CC[.,3])
03       mata:cov_se_lag_accum= rightAppendMatrices(cov_se_lag_accum,CC[.,4])
03       mata:var_total_accum= var_total_accum,st_numscalar("`var_total'")
03       mata:var_class_accum= var_class_accum,st_numscalar("`var_class'")
03       mata:var_ind_accum= var_ind_accum,st_numscalar("`var_ind'")
03       if (`missing_sameyear'==1) {c -(}
03       mata:cov_sameyear_accum= cov_sameyear_accum,.
03       mata:corr_sameyear_accum= corr_sameyear_accum,.
03       mata:obs_sameyear_accum= obs_sameyear_accum,.
03       {c )-}
03       else {c -(}
03       mata:cov_sameyear_accum=cov_sameyear_accum,st_numscalar("`cov_sameyear'")
03       mata:corr_sameyear_accum=corr_sameyear_accum,st_numscalar("`corr_sameyear'")
03       mata:obs_sameyear_accum=obs_sameyear_accum,st_numscalar("`obs_sameyear'")
03       {c )-}
03       {c )-}
03     - sort `teacher' `year'
       = sort school_id year
03     - tempvar obs_teacher
03     - by `teacher': egen `obs_teacher'=count(`teacher')
       = by school_id: egen __00000O=count(school_id)
03     - qui gen float tv=.
03     - if "`quasiexperiment'"!="" {c -(}
       = if ""!="" {c -(}
03       qui gen float tv_2yr_l=.
03       qui gen float tv_2yr_f=.
03       qui gen float tv_ss=.
03       mata: driftcalclist(vectorToStripeDiag(m), "`teacher'", "`year'", "`class_mean'", "`weight'", "`obs_teacher'", "tv", "tv_2yr_l", "tv_2yr_f", "tv_ss")
03       {c )-}
03     - else mata:driftcalclist(vectorToStripeDiag(m), "`teacher'", "`year'", "`class_mean'", "`weight'", "`obs_teacher'", "tv")
       = else mata:driftcalclist(vectorToStripeDiag(m), "school_id", "year", "__000003", "__00000F", "__00000O", "tv")
{res}{txt}03     - if ("`quasiexperiment'"=="") keep `teacher' `year' `by' tv
       = if (""=="") keep school_id year  tv
03     - else keep `teacher' `year' `by' tv tv_2yr_l tv_2yr_f tv_ss
       = else keep school_id year  tv tv_2yr_l tv_2yr_f tv_ss
03     - if (`firstloop'!=1) append using `"`output'"', nolabel
       = if (1!=1) append using `"/home/tmp/St192370.000002"', nolabel
03     - qui save `"`output'"', replace
       = qui save `"/home/tmp/St192370.000002"', replace
03     - local firstloop=0
03     - {c )-}
03     - di "{c -(}txt{c )-}{c -(}hline{c )-}"
{txt}{hline}
03     - if "`output_addvars'"!="" quietly {c -(}
       = if ""!="" quietly {c -(}
03       restore, preserve
03       keep `teacher' `year' `by' `output_addvars'
03       bys `teacher' `year' `by' `output_addvars': keep if _n==1
03       merge m:1 `teacher' `year' `by' using `"`output'"', nogen nolabel
03       {c )-}
03     - sort `teacher' `year' `by'
       = sort school_id year 
03     - qui save `"`output'"', replace
       = qui save `"/home/tmp/St192370.000002"', replace
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       local bylabels=""
03       forvalues i=1/`by_vals' {c -(}
03       local bylabel : label `byvar' `i', strict
03       local bylabel=subinstr("`bylabel'"," ","_",.)
03       local bylabels `bylabels' _`bylabel'
03       {c )-}
03       mata:saveVariancesToDataset(cov_lag_accum, corr_lag_accum, obs_lag_accum, cov_se_lag_accum, var_total_accum, var_class_accum, var_ind_accum, cov_sameyear_accum, corr_sameyear_accum, obs_sameyear_accum, tokens(st_local("bylabels")))
03       {c )-}
03     - else mata:saveVariancesToDataset(cov_lag_accum, corr_lag_accum, obs_lag_accum, cov_se_lag_accum, var_total_accum, var_class_accum, var_ind_accum, cov_sameyear_accum, corr_sameyear_accum, obs_sameyear_accum, "")
{res}{txt}03     - if (`nooutput'!=1) qui outsheet using `"`output'_variance.csv"', comma replace
       = if (1!=1) qui outsheet using `"/home/tmp/St192370.000002_variance.csv"', comma replace
03     - tokenize "`data'"
       = tokenize "merge tv score_r"
03     - if inlist("`1'","preserve","merge") {c -(}
       = if inlist("merge","preserve","merge") {c -(}
03     - restore
03     - if (`merge_resid'==1) {c -(}
       = if (1==1) {c -(}
03     - if ("`byvar'"!="") qui keep if missing(`teacher',`year',`class',`byvar')
       = if (""!="") qui keep if missing(school_id,year,school_id,)
03     - else qui keep if missing(`teacher',`year',`class')
       = else qui keep if missing(school_id,year,school_id)
03     - forvalues l=1/`by_vals' {c -(}
       = forvalues l=1/1 {c -(}
03     - append using `"`resid_data_`l''"', nolabel
       = append using `"/home/tmp/St192370.000004"', nolabel
03     - {c )-}
03     - {c )-}
03     - if (`merge_tv'==1) qui merge m:1 `teacher' `year' `by' `output_addvars' using `"`output'"', nogen nolabel
       = if (1==1) qui merge m:1 school_id year   using `"/home/tmp/St192370.000002"', nogen nolabel
03     - {c )-}
03     - else {c -(}
03       restore, not
03       if ("`data'"=="tv") use `"`output'"', clear
03       {c )-}
       {hline 60} end vam {hline}
02   - rename tv va_cfr_g11_`subject'
     = rename tv va_cfr_g11_math
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - rename score_r sbac_g11_`subject'_r
     = rename score_r sbac_g11_math_r
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
     = reg sbac_g11_math_r va_cfr_g11_math, cluster(school_id)
       {hline 58} begin reg {hline}
03     - if _by() {c -(}
03       local by "by `_byvars'`_byrc0':"
03       {c )-}
03     - `by' regress `0'
       =  regress sbac_g11_math_r va_cfr_g11_math, cluster(school_id)

Linear regression                               Number of obs     = {res}   672,870
                                                {txt}F(1, 1273)        =  {res}  4237.24
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0479
                                                {txt}Root MSE          =    {res} .53469

{txt}{ralign 78:(Std. err. adjusted for {res:1,274} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_m~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~h {c |}{col 14}{res}{space 2} .9690228{col 26}{space 2} .0148865{col 37}{space 1}   65.09{col 46}{space 3}0.000{col 54}{space 4}  .939818{col 67}{space 3} .9982275
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.000864{col 26}{space 2} .0008938{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-.0026175{col 67}{space 3} .0008894
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}       {hline 60} end reg {hline}
02   - estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_nocontrol.ster, replace
     = estimates save /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_`subject'_sibling_nocontrol.ster, replace
     = estimates save /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_math_sibling_nocontrol.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
     = rename va_cfr_g11_math va_cfr_g11_math_nosibctrl
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - rename sbac_g11_`subject'_r sbac_g11_`subject'_r_nosibctrl
     = rename sbac_g11_math_r sbac_g11_math_r_nosibctrl
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - label var va_cfr_g11_`subject'_nosibctrl "`subject' VA with family FE without TFX without sibling control"
     = label var va_cfr_g11_math_nosibctrl "math VA with family FE without TFX without sibling control"
       {hline 56} begin label {hline}
03     - version 10.0
03     - local vv : display "version " string(_caller()) ", missing:"
03     - gettoken val : 0
03     - if (strpos("`val'", "val") > 0 ) {c -(}
       = if (strpos("var", "val") > 0 ) {c -(}
03       gettoken val 0 : 0
03       syntax anything [, nofix]
03       if "`fix'" != "" {c -(}
03       local fix ", nofix"
03       {c )-}
03       gettoken var rest : anything
03       while `"`rest'"' != "" {c -(}
03       gettoken lab rest : rest
03       local label "`lab'"
03       {c )-}
03       local vlist : list anything - lab
03       if "`lab'" == "." {c -(}
03       local lab ""
03       {c )-}
03       foreach var of varlist `vlist' {c -(}
03       `vv' _label `val' `var' `lab' `fix'
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - `vv' _label `macval(0)'
       = version 17, missing: _label var va_cfr_g11_math_nosibctrl "math VA with family FE without TFX without sibling control"
03     - {c )-}
       {hline 58} end label {hline}
02   - label var sbac_g11_`subject'_r_nosibctrl "`subject' score residual with family FE without TFX without sibling control"
     = label var sbac_g11_math_r_nosibctrl "math score residual with family FE without TFX without sibling control"
       {hline 56} begin label {hline}
03     - version 10.0
03     - local vv : display "version " string(_caller()) ", missing:"
03     - gettoken val : 0
03     - if (strpos("`val'", "val") > 0 ) {c -(}
       = if (strpos("var", "val") > 0 ) {c -(}
03       gettoken val 0 : 0
03       syntax anything [, nofix]
03       if "`fix'" != "" {c -(}
03       local fix ", nofix"
03       {c )-}
03       gettoken var rest : anything
03       while `"`rest'"' != "" {c -(}
03       gettoken lab rest : rest
03       local label "`lab'"
03       {c )-}
03       local vlist : list anything - lab
03       if "`lab'" == "." {c -(}
03       local lab ""
03       {c )-}
03       foreach var of varlist `vlist' {c -(}
03       `vv' _label `val' `var' `lab' `fix'
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - `vv' _label `macval(0)'
       = version 17, missing: _label var sbac_g11_math_r_nosibctrl "math score residual with family FE without TFX without sibling control"
03     - {c )-}
       {hline 58} end label {hline}
02   - vam sbac_`subject'_z_score , teacher(school_id) year(year) class(school_id) controls( i.year i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year `school_controls' `demographic_controls' `ela_score_controls' `math_score_controls' ) data(merge tv score_r) driftlimit(`drift_limit') estimates($vaprojdir/estimates/sibling_va/test_score_va/vam_cfr_g11_`subject'.ster, replace)
     = vam sbac_math_z_score , teacher(school_id) year(year) class(school_id) controls( i.year i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year  age         i.male         i.eth_asian i.eth_hispanic i.eth_black i.eth_other         i.econ_disadvantage         i.limited_eng_prof         i.disabled i.year#(c.prior_ela_z_score##c.prior_ela_z_score##c.prior_ela_z_score) i.year#(c.prior_math_z_score##c.prior_math_z_score##c.prior_math_z_score) ) data(merge tv score_r) driftlimit(2) estimates(/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_math.ster, replace)
       {hline 58} begin vam {hline}
03     - version 10.1
03     - set more off
03     - syntax varname(ts fv) [aweight/], teacher(varname) year(varname) class(varname) [ by(varlist) controls(varlist ts fv) absorb(varname) tfx_resid(varname) data(string) output(string) output_addvars(varlist) driftlimit(integer -1) QUASIexperiment CONStant noseed varclasszero estimates(string asis)]
03     - local depvar `varlist'
       = local depvar sbac_math_z_score
03     - capture confirm variable score_r, exact
03     - if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named score_r."
03       exit 110
03       {c )-}
03     - capture confirm variable tv, exact
03     - if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv."
03       exit 110
03       {c )-}
03     - if ("`quasiexperiment'"!="") {c -(}
       = if (""!="") {c -(}
03       capture confirm variable tv_2yr_l, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_2yr_l."
03       exit 110
03       {c )-}
03       capture confirm variable tv_2yr_f, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_2yr_f."
03       exit 110
03       {c )-}
03       capture confirm variable tv_ss, exact
03       if (_rc==0) {c -(}
03       di as error "The dataset loaded in memory when vam is run cannot have a variable named tv_ss."
03       exit 110
03       {c )-}
03       {c )-}
03     - local merge_tv=0
03     - local merge_resid=0
03     - if ("`data'"=="") local data="preserve"
       = if ("merge tv score_r"=="") local data="preserve"
03     - else {c -(}
03     - if !inlist("`data'","preserve","tv","merge tv","merge score_r","merge tv score_r","merge score_r tv","variance") {c -(}
       = if !inlist("merge tv score_r","preserve","tv","merge tv","merge score_r","merge tv score_r","merge score_r tv","variance") {c -(}
03       di as error "Not a valid argument for data. Choose either 'preserve', 'tv', 'merge [tv AND/OR score_r]', or 'variance'."
03       exit 198
03       {c )-}
03     - else {c -(}
03     - tokenize "`data'"
       = tokenize "merge tv score_r"
03     - if ("`1'")=="merge" {c -(}
       = if ("merge")=="merge" {c -(}
03     - if ("`2'"=="tv") | ("`3'"=="tv") local merge_tv=1
       = if ("tv"=="tv") | ("score_r"=="tv") local merge_tv=1
03     - if ("`2'"=="score_r") | ("`3'"=="score_r") local merge_resid=1
       = if ("tv"=="score_r") | ("score_r"=="score_r") local merge_resid=1
03     - {c )-}
03     - {c )-}
03     - {c )-}
03     - if "`tfx_resid'"!="" & "`absorb'"!="" {c -(}
       = if ""!="" & ""!="" {c -(}
03       di as error "Cannot specify an absorb variable and a tfx_resid variable simultaneously."
03       exit 198
03       {c )-}
03     - if `"`output'"'=="" {c -(}
       = if `""'=="" {c -(}
03     - tempfile output
03     - local nooutput=1
03     - {c )-}
03     - else local nooutput=0
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       tempvar byvar
03       egen `byvar'=group(`by'), label
03       sum `byvar', meanonly
03       local by_vals=`r(max)'
03       {c )-}
03     - else local by_vals=1
03     - if "`weight'"!="" {c -(}
       = if ""!="" {c -(}
03       local ind_weight "`weight'"
03       macro drop _weight
03       local ind_exp "`exp'"
03       macro drop _exp
03       local times_exp "* `exp'"
03       {c )-}
03     - preserve
03     - local firstloop=1
03     - forvalues l=1/`by_vals' {c -(}
       = forvalues l=1/1 {c -(}
03     - if (`firstloop'!=1) restore, preserve
       = if (1!=1) restore, preserve
03     - di "{c -(}txt{c )-}{c -(}hline{c )-}"
{txt}{hline}
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       local bylabel : label `byvar' `l', strict
03       di "{c -(}bf:-> by variables:{c )-} `by' = `bylabel'"
03       {c )-}
03     - qui drop if missing(`teacher',`year',`class')
       = qui drop if missing(school_id,year,school_id)
03     - if ("`by'"!="") qui keep if `byvar'==`l'
       = if (""!="") qui keep if ==1
03     - if "`absorb'"!="" | "`tfx_resid'"!="" {c -(}
       = if ""!="" | ""!="" {c -(}
03       if "`ind_weight'"=="" {c -(}
03       noisily areg `depvar' `controls' , absorb(`absorb'`tfx_resid')
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03       else if "`ind_weight'"!="" {c -(}
03       noisily areg `depvar' `controls' [`ind_weight' = `ind_exp'] , absorb(`absorb'`tfx_resid')
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - if "`ind_weight'"=="" {c -(}
       = if ""=="" {c -(}
03     - version 11 : noisily reg `depvar' `controls'
       = version 11 : noisily reg sbac_math_z_score i.year i.has_older_sibling_enr_2year i.has_older_sibling_enr_4year age i.male i.eth_asian i.eth_hispanic i.eth_black i.eth_other i.econ_disadvantage i.limited_eng_prof i.disabled i.year#c.prior_ela_z_score i.year#c.prior_ela_z_score#c.prior_ela_z_score i.year#c.prior_ela_z_score#c.prior_ela_z_score#c.prior_ela_z_score i.year#c.prior_math_z_score i.year#c.prior_math_z_score#c.prior_math_z_score i.year#c.prior_math_z_score#c.prior_math_z_score#c.prior_math_z_score

      Source {c |}       SS           df       MS      Number of obs   ={res}   674,462
{txt}{hline 13}{c +}{hline 34}   F(38, 674423)   = {res} 35112.12
{txt}       Model {c |} {res}  400366.82        38   10535.969   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 202371.721   674,423  .300066459   {txt}R-squared       ={res}    0.6642
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6642
{txt}       Total {c |} {res} 602738.541   674,461  .893659591   {txt}Root MSE        =   {res} .54778

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sbac_math_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}
{space 7}2016  {c |}{col 14}{res}{space 2} .0583161{col 26}{space 2} .0026605{col 37}{space 1}   21.92{col 46}{space 3}0.000{col 54}{space 4} .0531017{col 67}{space 3} .0635305
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}   .06815{col 26}{space 2} .0026497{col 37}{space 1}   25.72{col 46}{space 3}0.000{col 54}{space 4} .0629567{col 67}{space 3} .0733433
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0888705{col 26}{space 2} .0026551{col 37}{space 1}  -33.47{col 46}{space 3}0.000{col 54}{space 4}-.0940743{col 67}{space 3}-.0836666
{txt}{space 12} {c |}
1.has_~2year {c |}{col 14}{res}{space 2}-.0257658{col 26}{space 2}  .002612{col 37}{space 1}   -9.86{col 46}{space 3}0.000{col 54}{space 4}-.0308854{col 67}{space 3}-.0206463
{txt}1.has_~4year {c |}{col 14}{res}{space 2} .0664619{col 26}{space 2} .0028684{col 37}{space 1}   23.17{col 46}{space 3}0.000{col 54}{space 4}   .06084{col 67}{space 3} .0720837
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0003525{col 26}{space 2} 4.73e-06{col 37}{space 1}  -74.55{col 46}{space 3}0.000{col 54}{space 4}-.0003617{col 67}{space 3}-.0003432
{txt}{space 12} {c |}
{space 8}male {c |}
{space 7}Male  {c |}{col 14}{res}{space 2} .0528537{col 26}{space 2} .0013636{col 37}{space 1}   38.76{col 46}{space 3}0.000{col 54}{space 4}  .050181{col 67}{space 3} .0555263
{txt}{space 1}1.eth_asian {c |}{col 14}{res}{space 2}  .189382{col 26}{space 2}  .002191{col 37}{space 1}   86.44{col 46}{space 3}0.000{col 54}{space 4} .1850878{col 67}{space 3} .1936762
{txt}1.eth_hisp~c {c |}{col 14}{res}{space 2}-.0659531{col 26}{space 2} .0018682{col 37}{space 1}  -35.30{col 46}{space 3}0.000{col 54}{space 4}-.0696147{col 67}{space 3}-.0622915
{txt}{space 1}1.eth_black {c |}{col 14}{res}{space 2}-.1696506{col 26}{space 2} .0036751{col 37}{space 1}  -46.16{col 46}{space 3}0.000{col 54}{space 4}-.1768536{col 67}{space 3}-.1624476
{txt}{space 1}1.eth_other {c |}{col 14}{res}{space 2} .0063197{col 26}{space 2} .0040703{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4} -.001658{col 67}{space 3} .0142973
{txt}{space 12} {c |}
econ_disad~e {c |}
Economic ..  {c |}{col 14}{res}{space 2}-.0651353{col 26}{space 2} .0015835{col 37}{space 1}  -41.13{col 46}{space 3}0.000{col 54}{space 4}-.0682389{col 67}{space 3}-.0620317
{txt}{space 12} {c |}
limited_en~f {c |}
Limited E..  {c |}{col 14}{res}{space 2}-.0851729{col 26}{space 2} .0035659{col 37}{space 1}  -23.89{col 46}{space 3}0.000{col 54}{space 4} -.092162{col 67}{space 3}-.0781839
{txt}{space 12} {c |}
{space 4}disabled {c |}
{space 3}Disabled  {c |}{col 14}{res}{space 2} -.155758{col 26}{space 2} .0036051{col 37}{space 1}  -43.21{col 46}{space 3}0.000{col 54}{space 4}-.1628239{col 67}{space 3}-.1486922
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .3455483{col 26}{space 2} .0027079{col 37}{space 1}  127.61{col 46}{space 3}0.000{col 54}{space 4}  .340241{col 67}{space 3} .3508557
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .3323749{col 26}{space 2} .0026381{col 37}{space 1}  125.99{col 46}{space 3}0.000{col 54}{space 4} .3272044{col 67}{space 3} .3375454
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .3015533{col 26}{space 2} .0027736{col 37}{space 1}  108.72{col 46}{space 3}0.000{col 54}{space 4} .2961173{col 67}{space 3} .3069894
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .1869776{col 26}{space 2}  .003375{col 37}{space 1}   55.40{col 46}{space 3}0.000{col 54}{space 4} .1803628{col 67}{space 3} .1935925
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0241348{col 26}{space 2}  .001432{col 37}{space 1}   16.85{col 46}{space 3}0.000{col 54}{space 4} .0213282{col 67}{space 3} .0269415
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}  .005581{col 26}{space 2} .0014404{col 37}{space 1}    3.87{col 46}{space 3}0.000{col 54}{space 4} .0027578{col 67}{space 3} .0084042
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .0198104{col 26}{space 2}  .001452{col 37}{space 1}   13.64{col 46}{space 3}0.000{col 54}{space 4} .0169645{col 67}{space 3} .0226563
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0000811{col 26}{space 2} .0014564{col 37}{space 1}   -0.06{col 46}{space 3}0.956{col 54}{space 4}-.0029356{col 67}{space 3} .0027734
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e#{c |}
{space 10}c. {c |}
prior_ela_~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0155503{col 26}{space 2}  .000661{col 37}{space 1}  -23.53{col 46}{space 3}0.000{col 54}{space 4}-.0168458{col 67}{space 3}-.0142548
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} -.010345{col 26}{space 2} .0006034{col 37}{space 1}  -17.14{col 46}{space 3}0.000{col 54}{space 4}-.0115277{col 67}{space 3}-.0091623
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0132864{col 26}{space 2} .0005874{col 37}{space 1}  -22.62{col 46}{space 3}0.000{col 54}{space 4}-.0144376{col 67}{space 3}-.0121352
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0064213{col 26}{space 2} .0009544{col 37}{space 1}   -6.73{col 46}{space 3}0.000{col 54}{space 4}-.0082918{col 67}{space 3}-.0045507
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .4865136{col 26}{space 2} .0026889{col 37}{space 1}  180.93{col 46}{space 3}0.000{col 54}{space 4} .4812434{col 67}{space 3} .4917838
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .5081895{col 26}{space 2} .0027358{col 37}{space 1}  185.76{col 46}{space 3}0.000{col 54}{space 4} .5028275{col 67}{space 3} .5135516
{txt}{space 7}2017  {c |}{col 14}{res}{space 2} .5312935{col 26}{space 2} .0028535{col 37}{space 1}  186.19{col 46}{space 3}0.000{col 54}{space 4} .5257007{col 67}{space 3} .5368862
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .6698344{col 26}{space 2} .0034178{col 37}{space 1}  195.98{col 46}{space 3}0.000{col 54}{space 4} .6631356{col 67}{space 3} .6765332
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0240231{col 26}{space 2} .0017922{col 37}{space 1}   13.40{col 46}{space 3}0.000{col 54}{space 4} .0205104{col 67}{space 3} .0275359
{txt}{space 7}2016  {c |}{col 14}{res}{space 2} .0045412{col 26}{space 2}  .001743{col 37}{space 1}    2.61{col 46}{space 3}0.009{col 54}{space 4}  .001125{col 67}{space 3} .0079574
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0007193{col 26}{space 2} .0017856{col 37}{space 1}   -0.40{col 46}{space 3}0.687{col 54}{space 4}-.0042191{col 67}{space 3} .0027804
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} .0775742{col 26}{space 2} .0014191{col 37}{space 1}   54.66{col 46}{space 3}0.000{col 54}{space 4} .0747928{col 67}{space 3} .0803556
{txt}{space 12} {c |}
{space 8}year#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e#{c |}
{space 10}c. {c |}
prior_math~e {c |}
{space 7}2015  {c |}{col 14}{res}{space 2}-.0226939{col 26}{space 2} .0007365{col 37}{space 1}  -30.81{col 46}{space 3}0.000{col 54}{space 4}-.0241375{col 67}{space 3}-.0212504
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0201758{col 26}{space 2} .0007788{col 37}{space 1}  -25.90{col 46}{space 3}0.000{col 54}{space 4}-.0217023{col 67}{space 3}-.0186493
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0213052{col 26}{space 2} .0007701{col 37}{space 1}  -27.66{col 46}{space 3}0.000{col 54}{space 4}-.0228146{col 67}{space 3}-.0197957
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0264218{col 26}{space 2} .0009481{col 37}{space 1}  -27.87{col 46}{space 3}0.000{col 54}{space 4}-.0282801{col 67}{space 3}-.0245634
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.238644{col 26}{space 2} .0289663{col 37}{space 1}   77.28{col 46}{space 3}0.000{col 54}{space 4} 2.181871{col 67}{space 3} 2.295417
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}03     - if `"`estimates'"'!="" {c -(}
       = if `"/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_math.ster, replace"'!="" {c -(}
03     - estimates save `estimates'
       = estimates save /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_math.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/vam_cfr_g11_math.ster} saved
03     - {c )-}
03     - {c )-}
03     - else if "`ind_weight'"!="" {c -(}
       = else if ""!="" {c -(}
03       version 11 : noisily reg `depvar' `controls' [`ind_weight' = `ind_exp']
03       if `"`estimates'"'!="" {c -(}
03       estimates save `estimates'
03       {c )-}
03       {c )-}
03     - {c )-}
03     - if "`tfx_resid'"=="" {c -(}
       = if ""=="" {c -(}
03     - qui predict score_r if e(sample),r
03     - if "`constant'"!="" {c -(}
       = if ""!="" {c -(}
03       gen b_cons = _b[_cons] if e(sample)
03       {c )-}
03     - {c )-}
03     - else {c -(}
03       qui predict score_r if e(sample), dresiduals
03       if "`constant'"!="" {c -(}
03       gen b_cons = _b[_cons] if e(sample)
03       {c )-}
03       {c )-}
03     - if "`ind_weight'"!="" {c -(}
       = if ""!="" {c -(}
03       tempvar tot_ind_weight class_ind_weight
03       qui egen `tot_ind_weight' = total(`ind_exp') if !mi(score_r)
03       qui egen `class_ind_weight' = total(`ind_exp') if !mi(score_r), by(`teacher' `year' `group' `class')
03       {c )-}
03     - if `merge_resid'==1 {c -(}
       = if 1==1 {c -(}
03     - tempfile resid_data_`l'
       = tempfile resid_data_1
03     - qui save `"`resid_data_`l''"', replace
       = qui save `"/home/tmp/St192370.000004"', replace
03     - {c )-}
03     - tempname num_obs num_par
03     - scalar `num_obs' = e(N)
       = scalar __000000 = e(N)
03     - if "`absorb'"!="" {c -(}
       = if ""!="" {c -(}
03       scalar `num_par' = e(df_m) + e(df_a) + 1
03       {c )-}
03     - else {c -(}
03     - scalar `num_par' = e(df_m) + 1
       = scalar __000001 = e(df_m) + 1
03     - {c )-}
03     - tempvar n_tested
03     - qui bys `teacher' `year' `group' `class': egen `n_tested' = count(score_r)
       = qui bys school_id year  school_id: egen __000002 = count(score_r)
03     - tempvar class_mean index
03     - qui by `teacher' `year' `group' `class': egen `class_mean' = mean(score_r)
       = qui by school_id year  school_id: egen __000003 = mean(score_r)
03     - qui by `teacher' `year' `group' `class': g `index' = _n
       = qui by school_id year  school_id: g __000004 = _n
03     - tempname var_total
03     - qui sum score_r
03     - scalar `var_total' = r(Var)*((`num_obs' - 1)/(`num_obs' - `num_par'))
       = scalar __000005 = r(Var)*((__000000 - 1)/(__000000 - __000001))
03     - tempname num_class var_ind var_class
03     - tempvar individual_dev_from_class
03     - qui gen `individual_dev_from_class' = score_r - `class_mean'
       = qui gen __000009 = score_r - __000003
03     - qui count if `index'==1 & `n_tested'!=0
       = qui count if __000004==1 & __000002!=0
03     - scalar `num_class' = r(N)
       = scalar __000006 = r(N)
03     - qui sum `individual_dev_from_class'
       = qui sum __000009
03     - scalar `var_ind' = r(Var)*((`num_obs' - 1)/(`num_obs' - `num_class' - `num_par' + 1))
       = scalar __000007 = r(Var)*((__000000 - 1)/(__000000 - __000006 - __000001 + 1))
03     - qui by `teacher' `year' `group' `class': keep if _n==1
       = qui by school_id year  school_id: keep if _n==1
03     - if "`seed'"=="" {c -(}
       = if ""=="" {c -(}
03     - set seed 9827496
03     - {c )-}
03     - tempvar rand classnum
03     - g `rand'=uniform()
       = g __00000A=uniform()
03     - bys `teacher' `year' (`rand'): gen `classnum'=_n
       = bys school_id year (__00000A): gen __00000B=_n
03     - tempname cov_sameyear corr_sameyear obs_sameyear
03     - qui sum `classnum'
       = qui sum __00000B
03     - if (r(max)==1) {c -(}
03     - local missing_sameyear=1
03     - scalar `cov_sameyear'=0
       = scalar __00000C=0
03     - {c )-}
03     - else {c -(}
03       local missing_sameyear=0
03       tempvar identifier
03       egen `identifier'=group(`teacher' `year')
03       qui tsset `identifier' `classnum'
03       qui corr `class_mean' f.`class_mean' [aw=`n_tested'+f.`n_tested'], cov
03       scalar `cov_sameyear'=r(cov_12)
03       scalar `corr_sameyear'=r(cov_12) / ( sqrt(r(Var_1)) * sqrt(r(Var_2)) )
03       scalar `obs_sameyear'=r(N)
03       {c )-}
03     - scalar `var_class' = `var_total' - `var_ind' - `cov_sameyear'
       = scalar __000008 = __000005 - __000007 - __00000C
03     - if (`var_class'<0) {c -(}
       = if (__000008<0) {c -(}
03       if ("`varclasszero'"!="varclasszero") {c -(}
03       di as error "Note: var_class has been computed as being less than 0."
03       di "var_class is defined as = var_total - var_ind - cov_sameyear."
03       di "Computed variances: var_total, var_ind, cov_sameyear, var_class"
03       di `var_total',`var_ind',`cov_sameyear',`var_class'
03       di "This negative variance can occur because cov_sameyear is calculated using only the subsample of observations that teach multiple classes per year (in the same by-group)."
03       {c )-}
03       else if ("`varclasszero'"=="varclasszero") {c -(}
03       scalar `var_class' = 0
03       {c )-}
03       {c )-}
03     - tempvar weight
03     - qui g `weight'=1/(`var_class' + `var_ind'/`n_tested')
       = qui g __00000F=1/(__000008 + __000007/__000002)
03     - tempvar excess_weight
03     - qui gen `excess_weight'=(missing(`weight'))
       = qui gen __00000G=(missing(__00000F))
03     - qui replace `weight'=1 if missing(`weight')
       = qui replace __00000F=1 if missing(__00000F)
03     - collapse (mean) `class_mean' (rawsum) `weight' `n_tested' `excess_weight' [aw=`weight'], by(`teacher' `year' `by') fast
       = collapse (mean) __000003 (rawsum) __00000F __000002 __00000G [aw=__00000F], by(school_id year ) fast
{res}{txt}03     - qui replace `weight'=`weight'-`excess_weight'
       = qui replace __00000F=__00000F-__00000G
03     - qui tsset `teacher' `year'
       = qui tsset school_id year
03     - tempvar minyear maxyear diff validyear minvalidyear maxvalidyear diffvalid
03     - qui bys `teacher': egen `minyear'=min(`year')
       = qui bys school_id: egen __00000H=min(year)
03     - qui by `teacher': egen `maxyear'=max(`year')
       = qui by school_id: egen __00000I=max(year)
03     - qui g `diff'=`maxyear'-`minyear'
       = qui g __00000J=__00000I-__00000H
03     - qui sum `diff'
       = qui sum __00000J
03     - local maxspan=`r(max)'
       = local maxspan=3
03     - qui gen `validyear'=`year' if !missing(`class_mean')
       = qui gen __00000K=year if !missing(__000003)
03     - qui by `teacher': egen `minvalidyear'=min(`validyear')
       = qui by school_id: egen __00000L=min(__00000K)
03     - qui by `teacher': egen `maxvalidyear'=max(`validyear')
       = qui by school_id: egen __00000M=max(__00000K)
03     - qui g `diffvalid'=`maxvalidyear'-`minvalidyear'
       = qui g __00000N=__00000M-__00000L
03     - qui sum `diffvalid'
       = qui sum __00000N
03     - local maxscorespan=`r(max)'
       = local maxscorespan=3
03     - if (`maxscorespan'<`maxspan') & (`driftlimit'<=0) {c -(}
       = if (3<3) & (2<=0) {c -(}
03       di as error _n "error: The maximum lags of teacher data is `maxspan', but the maximum lags of teacher data with class scores is `maxscorespan'."
03       di as error "       You must either set driftlimit() <= `maxscorespan', or drop observations so that the spans are no longer mismatched."
03       exit 499
03       {c )-}
03     - if (`driftlimit'>`maxscorespan') {c -(}
       = if (2>3) {c -(}
03       di as error "error: driftlimit(`driftlimit') was specified, which is greater than the number of lags (`maxscorespan') in the data."
03       exit 499
03       {c )-}
03     - mata:CC=compute_cov_corr("`class_mean'","`n_tested'",`maxscorespan',"`teacher'")
       = mata:CC=compute_cov_corr("__000003","__000002",3,"school_id")
{res}{txt}03     - if (`driftlimit'>0) mata:m=create_m(CC[.,1],st_numscalar("`cov_sameyear'"),`maxspan',`driftlimit')
       = if (2>0) mata:m=create_m(CC[.,1],st_numscalar("__00000C"),3,2)
{res}{txt}03     - else mata:m=create_m(CC[.,1],st_numscalar("`cov_sameyear'"))
       = else mata:m=create_m(CC[.,1],st_numscalar("__00000C"))
03     - di "Standard deviations: total, classes, students, teachers same year"
Standard deviations: total, classes, students, teachers same year
03     - if (`missing_sameyear'==0) di sqrt(`var_total'),sqrt(`var_class'),sqrt(`var_ind'),sqrt(`cov_sameyear')
       = if (1==0) di sqrt(__000005),sqrt(__000008),sqrt(__000007),sqrt(__00000C)
03     - else di sqrt(`var_total'),sqrt(`var_class'),sqrt(`var_ind'),.
       = else di sqrt(__000005),sqrt(__000008),sqrt(__000007),.
.54778322 .16371553 .52274629 .
03     - di "Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:"
Covariances (left), correlations (middle), observations (right).  Row i indicates the relation between year t and t+i:
03     - mata:CC[.,1..3]
{res}       {txt}          1             2             3
    {c TLC}{hline 43}{c TRC}
  1 {c |}  {res}.0194140802   .6779384445          3534{txt}  {c |}
  2 {c |}  {res} .015356176   .5457502346          2296{txt}  {c |}
  3 {c |}  {res}.0097630068   .3626400715          1105{txt}  {c |}
    {c BLC}{hline 43}{c BRC}
03     - if (`driftlimit'>0) {c -(}
       = if (2>0) {c -(}
03     - di "Drift limit specified:"
Drift limit specified:
03     - di `driftlimit'
       = di 2
2
03     - di "Covariances used for VA computations:"
Covariances used for VA computations:
03     - mata: m[2..length(m)]'
{res}       {txt}          1
    {c TLC}{hline 15}{c TRC}
  1 {c |}  {res}.0194140802{txt}  {c |}
  2 {c |}  {res} .015356176{txt}  {c |}
  3 {c |}  {res} .015356176{txt}  {c |}
    {c BLC}{hline 15}{c BRC}
03     - {c )-}
03     - mata:check_m_nomissing(m)
{res}{txt}03     - if (`firstloop'==1) {c -(}
       = if (1==1) {c -(}
03     - mata:cov_lag_accum= CC[.,1]
{res}{txt}03     - mata:corr_lag_accum= CC[.,2]
{res}{txt}03     - mata:obs_lag_accum= CC[.,3]
{res}{txt}03     - mata:cov_se_lag_accum= CC[.,4]
{res}{txt}03     - mata:var_total_accum= st_numscalar("`var_total'")
       = mata:var_total_accum= st_numscalar("__000005")
{res}{txt}03     - mata:var_class_accum= st_numscalar("`var_class'")
       = mata:var_class_accum= st_numscalar("__000008")
{res}{txt}03     - mata:var_ind_accum= st_numscalar("`var_ind'")
       = mata:var_ind_accum= st_numscalar("__000007")
{res}{txt}03     - if (`missing_sameyear'==1) {c -(}
       = if (1==1) {c -(}
03     - mata:cov_sameyear_accum=.
{res}{txt}03     - mata:corr_sameyear_accum=.
{res}{txt}03     - mata:obs_sameyear_accum=0
{res}{txt}03     - {c )-}
03     - else {c -(}
03       mata:cov_sameyear_accum=st_numscalar("`cov_sameyear'")
03       mata:corr_sameyear_accum=st_numscalar("`corr_sameyear'")
03       mata:obs_sameyear_accum=st_numscalar("`obs_sameyear'")
03       {c )-}
03     - {c )-}
03     - else {c -(}
03       mata:cov_lag_accum= rightAppendMatrices(cov_lag_accum,CC[.,1])
03       mata:corr_lag_accum= rightAppendMatrices(corr_lag_accum,CC[.,2])
03       mata:obs_lag_accum= rightAppendMatrices(obs_lag_accum,CC[.,3])
03       mata:cov_se_lag_accum= rightAppendMatrices(cov_se_lag_accum,CC[.,4])
03       mata:var_total_accum= var_total_accum,st_numscalar("`var_total'")
03       mata:var_class_accum= var_class_accum,st_numscalar("`var_class'")
03       mata:var_ind_accum= var_ind_accum,st_numscalar("`var_ind'")
03       if (`missing_sameyear'==1) {c -(}
03       mata:cov_sameyear_accum= cov_sameyear_accum,.
03       mata:corr_sameyear_accum= corr_sameyear_accum,.
03       mata:obs_sameyear_accum= obs_sameyear_accum,.
03       {c )-}
03       else {c -(}
03       mata:cov_sameyear_accum=cov_sameyear_accum,st_numscalar("`cov_sameyear'")
03       mata:corr_sameyear_accum=corr_sameyear_accum,st_numscalar("`corr_sameyear'")
03       mata:obs_sameyear_accum=obs_sameyear_accum,st_numscalar("`obs_sameyear'")
03       {c )-}
03       {c )-}
03     - sort `teacher' `year'
       = sort school_id year
03     - tempvar obs_teacher
03     - by `teacher': egen `obs_teacher'=count(`teacher')
       = by school_id: egen __00000O=count(school_id)
03     - qui gen float tv=.
03     - if "`quasiexperiment'"!="" {c -(}
       = if ""!="" {c -(}
03       qui gen float tv_2yr_l=.
03       qui gen float tv_2yr_f=.
03       qui gen float tv_ss=.
03       mata: driftcalclist(vectorToStripeDiag(m), "`teacher'", "`year'", "`class_mean'", "`weight'", "`obs_teacher'", "tv", "tv_2yr_l", "tv_2yr_f", "tv_ss")
03       {c )-}
03     - else mata:driftcalclist(vectorToStripeDiag(m), "`teacher'", "`year'", "`class_mean'", "`weight'", "`obs_teacher'", "tv")
       = else mata:driftcalclist(vectorToStripeDiag(m), "school_id", "year", "__000003", "__00000F", "__00000O", "tv")
{res}{txt}03     - if ("`quasiexperiment'"=="") keep `teacher' `year' `by' tv
       = if (""=="") keep school_id year  tv
03     - else keep `teacher' `year' `by' tv tv_2yr_l tv_2yr_f tv_ss
       = else keep school_id year  tv tv_2yr_l tv_2yr_f tv_ss
03     - if (`firstloop'!=1) append using `"`output'"', nolabel
       = if (1!=1) append using `"/home/tmp/St192370.000002"', nolabel
03     - qui save `"`output'"', replace
       = qui save `"/home/tmp/St192370.000002"', replace
03     - local firstloop=0
03     - {c )-}
03     - di "{c -(}txt{c )-}{c -(}hline{c )-}"
{txt}{hline}
03     - if "`output_addvars'"!="" quietly {c -(}
       = if ""!="" quietly {c -(}
03       restore, preserve
03       keep `teacher' `year' `by' `output_addvars'
03       bys `teacher' `year' `by' `output_addvars': keep if _n==1
03       merge m:1 `teacher' `year' `by' using `"`output'"', nogen nolabel
03       {c )-}
03     - sort `teacher' `year' `by'
       = sort school_id year 
03     - qui save `"`output'"', replace
       = qui save `"/home/tmp/St192370.000002"', replace
03     - if ("`by'"!="") {c -(}
       = if (""!="") {c -(}
03       local bylabels=""
03       forvalues i=1/`by_vals' {c -(}
03       local bylabel : label `byvar' `i', strict
03       local bylabel=subinstr("`bylabel'"," ","_",.)
03       local bylabels `bylabels' _`bylabel'
03       {c )-}
03       mata:saveVariancesToDataset(cov_lag_accum, corr_lag_accum, obs_lag_accum, cov_se_lag_accum, var_total_accum, var_class_accum, var_ind_accum, cov_sameyear_accum, corr_sameyear_accum, obs_sameyear_accum, tokens(st_local("bylabels")))
03       {c )-}
03     - else mata:saveVariancesToDataset(cov_lag_accum, corr_lag_accum, obs_lag_accum, cov_se_lag_accum, var_total_accum, var_class_accum, var_ind_accum, cov_sameyear_accum, corr_sameyear_accum, obs_sameyear_accum, "")
{res}{txt}03     - if (`nooutput'!=1) qui outsheet using `"`output'_variance.csv"', comma replace
       = if (1!=1) qui outsheet using `"/home/tmp/St192370.000002_variance.csv"', comma replace
03     - tokenize "`data'"
       = tokenize "merge tv score_r"
03     - if inlist("`1'","preserve","merge") {c -(}
       = if inlist("merge","preserve","merge") {c -(}
03     - restore
03     - if (`merge_resid'==1) {c -(}
       = if (1==1) {c -(}
03     - if ("`byvar'"!="") qui keep if missing(`teacher',`year',`class',`byvar')
       = if (""!="") qui keep if missing(school_id,year,school_id,)
03     - else qui keep if missing(`teacher',`year',`class')
       = else qui keep if missing(school_id,year,school_id)
03     - forvalues l=1/`by_vals' {c -(}
       = forvalues l=1/1 {c -(}
03     - append using `"`resid_data_`l''"', nolabel
       = append using `"/home/tmp/St192370.000004"', nolabel
03     - {c )-}
03     - {c )-}
03     - if (`merge_tv'==1) qui merge m:1 `teacher' `year' `by' `output_addvars' using `"`output'"', nogen nolabel
       = if (1==1) qui merge m:1 school_id year   using `"/home/tmp/St192370.000002"', nogen nolabel
03     - {c )-}
03     - else {c -(}
03       restore, not
03       if ("`data'"=="tv") use `"`output'"', clear
03       {c )-}
       {hline 60} end vam {hline}
02   - rename tv va_cfr_g11_`subject'
     = rename tv va_cfr_g11_math
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - rename score_r sbac_g11_`subject'_r
     = rename score_r sbac_g11_math_r
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - reg sbac_g11_`subject'_r va_cfr_g11_`subject', cluster(school_id)
     = reg sbac_g11_math_r va_cfr_g11_math, cluster(school_id)
       {hline 58} begin reg {hline}
03     - if _by() {c -(}
03       local by "by `_byvars'`_byrc0':"
03       {c )-}
03     - `by' regress `0'
       =  regress sbac_g11_math_r va_cfr_g11_math, cluster(school_id)

Linear regression                               Number of obs     = {res}   672,870
                                                {txt}F(1, 1273)        =  {res}  4234.93
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0477
                                                {txt}Root MSE          =    {res} .53449

{txt}{ralign 78:(Std. err. adjusted for {res:1,274} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_m~r{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~h {c |}{col 14}{res}{space 2} .9686532{col 26}{space 2} .0148849{col 37}{space 1}   65.08{col 46}{space 3}0.000{col 54}{space 4} .9394516{col 67}{space 3} .9978548
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0008575{col 26}{space 2} .0008948{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-.0026129{col 67}{space 3}  .000898
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}       {hline 60} end reg {hline}
02   - estimates save $projdir/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster, replace
     = estimates save /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/spec_test_va_cfr_g11_math_sibling.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - estimates save $vaprojdir/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_`subject'_sibling.ster, replace
     = estimates save /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_math_sibling.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_math_sibling.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_math_sibling.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/spec_test_va_cfr_g11_math_sibling.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - label var va_cfr_g11_`subject' "`subject' VA with family FE without TFX"
     = label var va_cfr_g11_math "math VA with family FE without TFX"
       {hline 56} begin label {hline}
03     - version 10.0
03     - local vv : display "version " string(_caller()) ", missing:"
03     - gettoken val : 0
03     - if (strpos("`val'", "val") > 0 ) {c -(}
       = if (strpos("var", "val") > 0 ) {c -(}
03       gettoken val 0 : 0
03       syntax anything [, nofix]
03       if "`fix'" != "" {c -(}
03       local fix ", nofix"
03       {c )-}
03       gettoken var rest : anything
03       while `"`rest'"' != "" {c -(}
03       gettoken lab rest : rest
03       local label "`lab'"
03       {c )-}
03       local vlist : list anything - lab
03       if "`lab'" == "." {c -(}
03       local lab ""
03       {c )-}
03       foreach var of varlist `vlist' {c -(}
03       `vv' _label `val' `var' `lab' `fix'
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - `vv' _label `macval(0)'
       = version 17, missing: _label var va_cfr_g11_math "math VA with family FE without TFX"
03     - {c )-}
       {hline 58} end label {hline}
02   - label var sbac_g11_`subject'_r "`subject' score residual with family FE without TFX"
     = label var sbac_g11_math_r "math score residual with family FE without TFX"
       {hline 56} begin label {hline}
03     - version 10.0
03     - local vv : display "version " string(_caller()) ", missing:"
03     - gettoken val : 0
03     - if (strpos("`val'", "val") > 0 ) {c -(}
       = if (strpos("var", "val") > 0 ) {c -(}
03       gettoken val 0 : 0
03       syntax anything [, nofix]
03       if "`fix'" != "" {c -(}
03       local fix ", nofix"
03       {c )-}
03       gettoken var rest : anything
03       while `"`rest'"' != "" {c -(}
03       gettoken lab rest : rest
03       local label "`lab'"
03       {c )-}
03       local vlist : list anything - lab
03       if "`lab'" == "." {c -(}
03       local lab ""
03       {c )-}
03       foreach var of varlist `vlist' {c -(}
03       `vv' _label `val' `var' `lab' `fix'
03       {c )-}
03       {c )-}
03     - else {c -(}
03     - `vv' _label `macval(0)'
       = version 17, missing: _label var sbac_g11_math_r "math score residual with family FE without TFX"
03     - {c )-}
       {hline 58} end label {hline}
02   - gen sbac_g11_`subject'_r_d = sbac_g11_`subject'_r_nosibctrl - sbac_g11_`subject'_r
     = gen sbac_g11_math_r_d = sbac_g11_math_r_nosibctrl - sbac_g11_math_r
02   - rename va_cfr_g11_`subject' va_cfr_g11_`subject'_temp
     = rename va_cfr_g11_math va_cfr_g11_math_temp
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - rename va_cfr_g11_`subject'_nosibctrl va_cfr_g11_`subject'
     = rename va_cfr_g11_math_nosibctrl va_cfr_g11_math
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - reg sbac_g11_`subject'_r_d va_cfr_g11_`subject', cluster(school_id)
     = reg sbac_g11_math_r_d va_cfr_g11_math, cluster(school_id)
       {hline 58} begin reg {hline}
03     - if _by() {c -(}
03       local by "by `_byvars'`_byrc0':"
03       {c )-}
03     - `by' regress `0'
       =  regress sbac_g11_math_r_d va_cfr_g11_math, cluster(school_id)

Linear regression                               Number of obs     = {res}   672,870
                                                {txt}F(1, 1273)        =  {res}    16.31
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res} .01644

{txt}{ralign 78:(Std. err. adjusted for {res:1,274} clusters in {res:school_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}sbac_g11_m~d{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
va_cfr_g11~h {c |}{col 14}{res}{space 2} .0014631{col 26}{space 2} .0003623{col 37}{space 1}    4.04{col 46}{space 3}0.000{col 54}{space 4} .0007523{col 67}{space 3} .0021739
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.99e-06{col 26}{space 2}  .000046{col 37}{space 1}   -0.04{col 46}{space 3}0.965{col 54}{space 4}-.0000922{col 67}{space 3} .0000882
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}       {hline 60} end reg {hline}
02   - estimates save $projdir/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_`subject'_sibling.ster, replace
     = estimates save /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_math_sibling.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_math_sibling.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_math_sibling.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/users/chesun/gsr/caschls/est/siblingvaregs/test_score_va/fb_test_va_cfr_g11_math_sibling.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - estimates save $vaprojdir/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_`subject'_sibling.ster, replace
     = estimates save /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_math_sibling.ster, replace
       {hline 52} begin estimates {hline}
03     - version 8
03     - local vv : di "version " string(_caller()) ", missing:"
03     - gettoken key 0 : 0, parse(" ,:")
03     - local lkey = length(`"`key'"')
       = local lkey = length(`"save"')
03     - local is_bayesmh = ("`e(cmd)'"=="bayesmh" || "`e(prefix)'"=="bayes")
       = local is_bayesmh = ("regress"=="bayesmh" || ""=="bayes")
03     - local is_stintcox = ("`e(cmd)'"=="stintcox")
       = local is_stintcox = ("regress"=="stintcox")
03     - local is_stxer `e(stxer)'
       = local is_stxer 
03     - local changeab 6
03     - local tabab 3
03     - local forab 3
03     - local statsab 4
03     - local dirab 3
03     - if _caller() < 10 {c -(}
03       local changeab 2
03       local tabab 1
03       local forab 1
03       local statsab 2
03       local dirab 1
03       {c )-}
03     - if `"`key'"' == "" {c -(}
       = if `"save"' == "" {c -(}
03       if "`e(cmd)'" != "" {c -(}
03       `vv' Replay "."
03       {c )-}
03       {c )-}
03     - else if `"`key'"' == bsubstr("query", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("query", 1, 4) {c -(}
03       Query `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("store", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("store", 1, max(3,4)) {c -(}
03       if `is_stintcox' {c -(}
03       _stintcox_saved `is_stintcox' "store"
03       {c )-}
03       else {c -(}
03       _bayesmh_saved `is_bayesmh' "store"
03       {c )-}
03       Store `0'
03       StxerStore, is_stxer(`is_stxer') zero(`"`0'"')
03       {c )-}
03     - else if `"`key'"' == bsubstr("restore", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("restore", 1, max(3,4)) {c -(}
03       Restore `0'
03       StxerRestore `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("change", 1, max(`changeab',`lkey')) {c -(}
       = else if `"save"' == bsubstr("change", 1, max(6,4)) {c -(}
03       Change `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("for", 1, max(`forab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("for", 1, max(3, 4)) {c -(}
03       `vv' For `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("dir", 1, max(`dirab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("dir", 1, max(3, 4)) {c -(}
03       Dir `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("stats",1,max(`statsab',max(2,`lkey'))) {c -(}
       = else if `"save"' == bsubstr("stats",1,max(4,max(2,4))) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "stats"
03       {c )-}
03       {c )-}
03       Stats `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("table", 1, max(`tabab', `lkey')) {c -(}
       = else if `"save"' == bsubstr("table", 1, max(3, 4)) {c -(}
03       if (`is_bayesmh') {c -(}
03       _parse comma lhs rhs : 0
03       if (`"`lhs'"'=="" | `"`lhs'"'==".") {c -(}
03       _bayesmh_notallowed `is_bayesmh' "table"
03       {c )-}
03       {c )-}
03       `vv' est_table `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("selected", 1, max(3, `lkey')) {c -(}
       = else if `"save"' == bsubstr("selected", 1, max(3, 4)) {c -(}
03       `vv' est_selected `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("replay", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("replay", 1, 4) {c -(}
03       `vv' Replay `0'
03       {c )-}
03     - else if `"`key'"' == "drop" {c -(}
       = else if `"save"' == "drop" {c -(}
03       Drop `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == bsubstr("notes", 1, max(4,`lkey')) {c -(}
       = else if `"save"' == bsubstr("notes", 1, max(4,4)) {c -(}
03       estimates_notes `0'
03       {c )-}
03     - else if `"`key'"' == "title" {c -(}
       = else if `"save"' == "title" {c -(}
03       Title `0'
03       {c )-}
03     - else if `"`key'"' == "clear" {c -(}
       = else if `"save"' == "clear" {c -(}
03       Clear `0'
03       local droplist `s(droplist)'
03       StxerDrop , droplist(`droplist')
03       {c )-}
03     - else if `"`key'"' == "esample" {c -(}
       = else if `"save"' == "esample" {c -(}
03       estimates_sample `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("describe", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("describe", 1, max(3,4)) {c -(}
03       Describe `0'
03       {c )-}
03     - else if `"`key'"' == "save" {c -(}
       = else if `"save"' == "save" {c -(}
03     - if `is_stintcox' {c -(}
       = if 0 {c -(}
03       _stintcox_saved `is_stintcox' "save"
03       {c )-}
03     - else {c -(}
03     - _bayesmh_saved `is_bayesmh' "save"
       = _bayesmh_saved 0 "save"
03     - {c )-}
03     - EstSave `macval(0)'
       = EstSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_math_sibling.ster, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_math_sibling.ster} saved
03     - StxerSave `0'
       = StxerSave  /home/research/ca_ed_lab/projects/common_core_va/estimates/sibling_va/test_score_va/fb_test_va_cfr_g11_math_sibling.ster, replace
03     - {c )-}
03     - else if `"`key'"' == "use" {c -(}
       = else if `"save"' == "use" {c -(}
03       EstUse `macval(0)'
03       StxerUse `0'
03       {c )-}
03     - else if `"`key'"' == bsubstr("local", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("local", 1, max(3,4)) {c -(}
03       SubcmdMoved "local" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("scalar", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("scalar", 1, max(3,4)) {c -(}
03       SubcmdMoved "scalar" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("matrix", 1, max(3,`lkey')) {c -(}
       = else if `"save"' == bsubstr("matrix", 1, max(3,4)) {c -(}
03       SubcmdMoved "matrix" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "post" {c -(}
       = else if `"save"' == "post" {c -(}
03       SubcmdMoved "post" "ereturn"
03       {c )-}
03     - else if `"`key'"' == "repost" {c -(}
       = else if `"save"' == "repost" {c -(}
03       SubcmdMoved "repost" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("display", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("display", 1, max(2,4)) {c -(}
03       SubcmdMoved "display" "ereturn"
03       {c )-}
03     - else if `"`key'"' == bsubstr("hold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("hold", 1, 4) {c -(}
03       SubcmdMoved "hold" " _estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("unhold", 1, `lkey') {c -(}
       = else if `"save"' == bsubstr("unhold", 1, 4) {c -(}
03       SubcmdMoved "unhold" "_estimates"
03       {c )-}
03     - else if `"`key'"' == bsubstr("list", 1, max(2,`lkey')) {c -(}
       = else if `"save"' == bsubstr("list", 1, max(2,4)) {c -(}
03       SubcmdMoved "list" "ereturn"
03       {c )-}
03     - else {c -(}
03       di as err `"subcommand {c -(}bf:estimates{c )-} {c -(}bf:`key'{c )-} is unrecognized"'
03       exit 198
03       {c )-}
       {hline 54} end estimates {hline}
02   - rename va_cfr_g11_`subject' va_cfr_g11_`subject'_nosibctrl
     = rename va_cfr_g11_math va_cfr_g11_math_nosibctrl
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - rename va_cfr_g11_`subject'_temp va_cfr_g11_`subject'
     = rename va_cfr_g11_math_temp va_cfr_g11_math
       {hline 55} begin rename {hline}
03     - version 12
03     - mata: rename_cmd("`3'")
       = mata: rename_cmd("")
{res}{txt}       {hline 57} end rename {hline}
02   - collapse (firstnm) va_* (mean) sbac_*_r* (sum) n_g11_`subject' = touse_g11_`subject' if sibling_full_sample == 1 & sibling_out_sample == 1 , by(school_id cdscode grade year)
     = collapse (firstnm) va_* (mean) sbac_*_r* (sum) n_g11_math = touse_g11_math if sibling_full_sample == 1 & sibling_out_sample == 1 , by(school_id cdscode grade year)
       {hline 53} begin collapse {hline}
03     - version 8, missing
03     - if _caller() < 5 {c -(}
03       collaps4 `0'
03       exit
03       {c )-}
03     - collapse_17 `0'
       = collapse_17 (firstnm) va_* (mean) sbac_*_r* (sum) n_g11_math = touse_g11_math if sibling_full_sample == 1 & sibling_out_sample == 1 , by(school_id cdscode grade year)
{res}{txt}03     - if "`col17_graphbar'" != "" {c -(}
       = if "" != "" {c -(}
03       c_local `col17_graphbar' "``col17_graphbar''"
03       {c )-}
       {hline 55} end collapse {hline}
02   - save $projdir/dta/common_core_va/test_score_va/va_g11_`subject'_sibling.dta, replace
     = save /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_math_sibling.dta, replace
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/common_core_va/test_score_va/va_g11_math_sibling.dta{rm}
saved
{p_end}
02   - save $vaprojdir/data/sibling_va/test_score_va/va_g11_`subject'_sibling.dta, replace
     = save /home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/test_score_va/va_g11_math_sibling.dta, replace
{p 0 4 2}
file {bf}
/home/research/ca_ed_lab/projects/common_core_va/data/sibling_va/test_score_va/va_g11_math_sibling.dta{rm}
saved
{p_end}
02   - {c )-}

{com}. 
. 
. 
. 
. 
. 
. set trace off
{txt}
{com}. 
. timer off 1
{txt}
{com}. timer list
{res}   1:     33.12 /        1 =      33.1190
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/siblingvaregs/va_sibling.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 9 Apr 2022, 03:43:25
{txt}{.-}
{smcl}
{txt}{sf}{ul off}