{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/demographics/pooledsecanalysis.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Jul 2022, 18:09:39
{txt}
{com}. 
. use $projdir/dta/demographics/pooled/pooledsecdiagnostics, replace
{txt}(Secondary demographics diagnostics pooled across grade 9 and 11 across all 5 yea)

{com}. 
. grstyle init  //initializes the grstyle package
{res}{txt}
{com}. grstyle set plain   //set graph background to plain
{txt}
{com}. grstyle set color Set1, opacity(50): histogram //use Set1 color palette (red and blue) for histogram bars fill color and set opacity to 50%
{res}{txt}
{com}. grstyle set color white, opacity(25): histogram_line //set color white and opacity 25% for histogram bar outline color
{res}{txt}
{com}. 
. //create and export frequency histogram for pooled response rate (pooled across grades 9 and 11 and all 5 years)
. histogram pooledrr, freq
{txt}(bin={res}31{txt}, start={res}0{txt}, width={res}.16129032{txt})
{res}{txt}
{com}. graph export $projdir/out/graph/pooleddiagnostics/secondary/pooledrr.png, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/pooleddiagnostics/secondary/pooledrr.png} written in PNG format

{com}. 
. //create and export frequency histogram for pooled female response rate
. histogram pooledfemalerr, freq
{txt}(bin={res}31{txt}, start={res}0{txt}, width={res}.09677419{txt})
{res}{txt}
{com}. graph export $projdir/out/graph/pooleddiagnostics/secondary/pooledfemalerr.png, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/pooleddiagnostics/secondary/pooledfemalerr.png} written in PNG format

{com}. 
. //create and export frequency histograms for pooled response rates for 4 races/ethnicities
. 
. //generate checks to see if survey responses are more than enrollment
. gen checkhispanic = 0
{txt}
{com}. replace checkhispanic = 1 if svyhispanictotal > enrhispanictotal
{txt}(109 real changes made)

{com}. gen checkasian = 0
{txt}
{com}. replace checkasian = 1 if svyasiantotal > enrasiantotal
{txt}(95 real changes made)

{com}. gen checkblack = 0
{txt}
{com}. replace checkblack = 1 if svyblacktotal > enrblacktotal
{txt}(304 real changes made)

{com}. gen checkwhite = 0
{txt}
{com}. replace checkwhite = 1 if svywhitetotal > enrwhitetotal
{txt}(320 real changes made)

{com}. 
. drop if checkhispanic == 1
{txt}(109 observations deleted)

{com}. drop if checkasian == 1
{txt}(86 observations deleted)

{com}. drop if checkblack == 1
{txt}(215 observations deleted)

{com}. drop if checkwhite == 1
{txt}(141 observations deleted)

{com}. 
. histogram pooledhispanicrr, freq
{txt}(bin={res}29{txt}, start={res}0{txt}, width={res}.03448276{txt})
{res}{txt}
{com}. graph export $projdir/out/graph/pooleddiagnostics/secondary/pooledhispanicrr.png, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/pooleddiagnostics/secondary/pooledhispanicrr.png} written in PNG format

{com}. 
. histogram pooledasianrr, freq
{txt}(bin={res}25{txt}, start={res}0{txt}, width={res}.04{txt})
{res}{txt}
{com}. graph export $projdir/out/graph/pooleddiagnostics/secondary/pooledasianrr.png, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/pooleddiagnostics/secondary/pooledasianrr.png} written in PNG format

{com}. 
. histogram pooledblackrr, freq
{txt}(bin={res}26{txt}, start={res}0{txt}, width={res}.03846154{txt})
{res}{txt}
{com}. graph export $projdir/out/graph/pooleddiagnostics/secondary/pooledblackrr.png, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/pooleddiagnostics/secondary/pooledblackrr.png} written in PNG format

{com}. 
. histogram pooledwhiterr, freq
{txt}(bin={res}29{txt}, start={res}0{txt}, width={res}.03448276{txt})
{res}{txt}
{com}. graph export $projdir/out/graph/pooleddiagnostics/secondary/pooledwhiterr.png, replace
{res}{txt}file {bf:/home/research/ca_ed_lab/users/chesun/gsr/caschls/out/graph/pooleddiagnostics/secondary/pooledwhiterr.png} written in PNG format

{com}. 
. 
. 
. 
. grstyle clear // sets off grstyle
{txt}
{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/research/ca_ed_lab/users/chesun/gsr/caschls/log/share/demographics/pooledsecanalysis.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Jul 2022, 18:09:40
{txt}{.-}
{smcl}
{txt}{sf}{ul off}