-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/builda
> nalysisdata/qoiclean/staff/staffqoiclean1415.smcl
  log type:  smcl
 opened on:  19 Dec 2024, 19:15:29

. 
. use $clndtadir/staff/staff1415, clear
(2014-15 Staff CSSS Data)

. 
. /* Note: 1415 dataset does not have qoi 24 64 and 87
> The qoi in this dataset are qoi 10 20 41 44 98 103-105 109 111 112 128*/
. 
. keep cdscode q10 q20 q42 q72 q66 q44 q45 q46 q50 q52 q53 hpdcs13 //keep quest
> ions of interest

. //delete all value labels not associated with variables
. labdu , delete

. //rename questions of interest using question numbers in 1819 as standard
. 
. /* rename the later questions to avoid var name conflict */
. rename q44 q103

. elabel rename q44 q103

. rename q45 q104

. elabel rename q45 q104

. rename q46 q105

. elabel rename q46 q105

. rename q50 q109

. elabel rename q50 q109

. rename q52 q111

. elabel rename q52 q111

. rename q53 q112

. elabel rename q53 q112

. rename hpdcs13 q128

. elabel rename hpdcs13 q128

. 
. rename q42 q41

. elabel rename q42 q41

. rename q72 q44

. elabel rename q72 q44

. rename q66 q98

. elabel rename q66 q98

. 
. 
. /* Note: 1415 dataset does not have qoi 24 64 and 87 */
. foreach i of numlist 10 20 41 44 98 103/105 109 111 112 128 {
  2.   rename q`i' qoi`i'
  3.   elabel rename q`i' qoi`i' //rename the value labels to be consistent wit
> h var name change
  4. }

. 
. /* count the total number of responses in each school */
. sort cdscode

. by cdscode: gen totalresp = _N

. label var totalresp "total number of responses at each school including missi
> ng"

. 
. ***************************** clean qoi 10 20 44 ****************************
> ***
. /* value labels for qoi 10 20 41 44:
> 1 strongly agree
> 2 agree
> 3 disagree
> 4 strongly disagree
> 5 not applicable
> 
> value label for qoi41 in 1617 is different from 1819 and 1718, but we can tre
> at them equivalently:
> 1 nearly all adults
> 2 most adults
> 3 some adults
> 4 few adults
> 5 almost none
> Here treat 1 and 2 as agree, 3 as neutral, and 4 and 5 as disagree
> 
> recode:
> -2 strongly disagree
> -1 disagree
> 0 not applicable
> 1 agree
> 2 strongly agree
> */
. 
. /* recode qoi 10, 20, 24, 41, 44, 64, 87, 128 */
. foreach i of numlist 10 20 44 {
  2.   gen qoi`i'temp =.
  3.   replace qoi`i'temp = -2 if qoi`i' == 4
  4.   replace qoi`i'temp = -1 if qoi`i' == 3
  5.   replace qoi`i'temp =  0 if qoi`i' == 5
  6.   replace qoi`i'temp =  1 if qoi`i' == 2
  7.   replace qoi`i'temp =  2 if qoi`i' == 1
  8. 
.   drop qoi`i'
  9.   rename qoi`i'temp qoi`i'
 10. }
(33,088 missing values generated)
(2,143 real changes made)
(6,221 real changes made)
(462 real changes made)
(13,937 real changes made)
(8,699 real changes made)
(33,088 missing values generated)
(798 real changes made)
(2,930 real changes made)
(8,701 real changes made)
(10,483 real changes made)
(8,478 real changes made)
(33,088 missing values generated)
(320 real changes made)
(1,909 real changes made)
(256 real changes made)
(17,417 real changes made)
(10,355 real changes made)

. 
. /* recode qoi 41 */
. replace qoi41 = 3 - qoi41
(31,207 real changes made)

. 
. /* generate dummies for each response option */
. foreach i of numlist 10 20 41 44 {
  2.   gen stragree`i' = 0
  3.   replace stragree`i' = 1 if qoi`i' == 2
  4. 
.   gen agree`i' = 0
  5.   replace agree`i' = 1 if qoi`i' == 1
  6. 
.   gen disagree`i' = 0
  7.   replace disagree`i' = 1 if qoi`i' == -1
  8. 
.   gen strdisagree`i' = 0
  9.   replace strdisagree`i' = 1 if qoi`i' == -2
 10. 
.   gen neither`i' = 0
 11.   replace neither`i' = 1 if qoi`i' == 0
 12. 
.   gen missing`i' = 0
 13.   replace missing`i' = 1 if missing(qoi`i')
 14. }
(8,699 real changes made)
(13,937 real changes made)
(6,221 real changes made)
(2,143 real changes made)
(462 real changes made)
(1,626 real changes made)
(8,478 real changes made)
(10,483 real changes made)
(2,930 real changes made)
(798 real changes made)
(8,701 real changes made)
(1,698 real changes made)
(11,062 real changes made)
(12,898 real changes made)
(1,248 real changes made)
(189 real changes made)
(5,810 real changes made)
(1,881 real changes made)
(10,355 real changes made)
(17,417 real changes made)
(1,909 real changes made)
(320 real changes made)
(256 real changes made)
(2,831 real changes made)

. /*
> /* note: mean of qoi41 is not comparable to later years */
> gen all41 = 0
> replace all41 = 1 if qoi41 == 1
> 
> gen most41 = 0
> replace most41 = 1 if qoi41 == 2
> 
> gen some41 = 0
> replace some41 = 1 if qoi41 == 3
> 
> gen few41 = 0
> replace few41 = 1 if qoi41 == 4
> 
> gen none41 = 0
> replace none41 = 1 if qoi41 == 5
> 
> gen missing41 = 0
> replace missing41 = 1 if missing(qoi41)
>  */
. 
. 
. ******************************* clean qoi128 ********************************
> ***
. /* change the values for each response option to bring it in line with above 
> qois
> and make it possible to compare averages with previous qois */
. /* original value label for qoi128:
> 1 strongly agree
> 2 agree
> 3 neither agree nor disagree
> 4 disagree
> 5 strongly disagree
> 
> recode:
> -2 strongly disagree
> -1 disagree
> 0 neither
> 1 agree
> 2 strongly agree
>  */
. 
.  gen qoi128temp =.
(33,088 missing values generated)

.  replace qoi128temp = 3 - qoi128
(9,974 real changes made)

. 
.  drop qoi128

.  rename qoi128temp qoi128

. 
.  label drop qoi128 //delete the original qoi128 value label

.  label define qoi128 2 "Strongly agree" 1 "Agree" -1 "Disagree" -2 "Strongly 
> disagree" 0 "Neither agree nor disagree"

.  label values qoi128 qoi128

. 
. /* generate dummies for each response option in qoi128 */
. gen stragree128 = 0

. replace stragree128 = 1 if qoi128 == 2
(2,978 real changes made)

. 
. gen agree128 = 0

. replace agree128 = 1 if qoi128 == 1
(4,779 real changes made)

. 
. gen disagree128 = 0

. replace disagree128 = 1 if qoi128 == -1
(792 real changes made)

. 
. gen strdisagree128 = 0

. replace strdisagree128 = 1 if qoi128 == -2
(204 real changes made)

. 
. gen neither128 = 0

. replace neither128 = 1 if qoi128 == 0
(1,221 real changes made)

. 
. gen missing128 = 0

. replace missing128 = 1 if missing(qoi128)
(23,114 real changes made)

. 
. 
. ****************************** clean qoi 98 *********************************
> ***
. /* value lables for qoi 98:
> 1 insignificant problem
> 2 mild problem
> 3 moderate problem
> 4 severe problem
> 
> recode:
> -3 severe problem
> -2 moderate problem
> -1 mild problem
> 1 insignificant problem
> */
. 
. /* recode qoi 98 */
. gen qoi98temp = .
(33,088 missing values generated)

. replace qoi98temp = -3 if qoi98 == 4
(2,178 real changes made)

. replace qoi98temp = -2 if qoi98 == 3
(4,820 real changes made)

. replace qoi98temp = -1 if qoi98 == 2
(9,234 real changes made)

. replace qoi98temp =  1 if qoi98 == 1
(14,195 real changes made)

. 
. drop qoi98

. rename qoi98temp qoi98

. 
. gen insig98 = 0

. replace insig98 = 1 if qoi98 == 1
(14,195 real changes made)

. 
. gen mild98 = 0

. replace mild98 = 1 if qoi98 == -1
(9,234 real changes made)

. 
. gen moderate98 = 0

. replace moderate98 = 1 if qoi98 == -2
(4,820 real changes made)

. 
. gen severe98 = 0

. replace severe98 = 1 if qoi98 == -3
(2,178 real changes made)

. 
. gen missing98 = 0

. replace missing98 = 1 if missing(qoi98)
(2,661 real changes made)

. 
. 
. ***************************clean qoi 103-105 109 111 112*********************
> ***
. /* value labels for qoi 103-105 109 111 112:
> 1 yes
> 2 no
> 3 not applicable
> 
> recode:
> 1 no
> 0 not applicable
> -1 yes
> This is because no means don't need more support so it's good
> yes is bad
> */
. 
. /* recode qoi 103-105 109 111 112 */
. foreach i of numlist 103/105 109 111 112 {
  2.   replace qoi`i' = -1 if qoi`i' == 1
  3.   replace qoi`i' =  0 if qoi`i' == 3
  4.   replace qoi`i' =  1 if qoi`i' == 2
  5. }
(14,370 real changes made)
(3,906 real changes made)
(12,543 real changes made)
(15,044 real changes made)
(4,009 real changes made)
(11,751 real changes made)
(13,488 real changes made)
(2,914 real changes made)
(14,434 real changes made)
(16,333 real changes made)
(3,121 real changes made)
(11,148 real changes made)
(17,577 real changes made)
(1,991 real changes made)
(11,270 real changes made)
(13,386 real changes made)
(1,216 real changes made)
(16,155 real changes made)

. 
. foreach i of numlist 103/105 109 111 112 {
  2.   gen yes`i' = 0
  3.   replace yes`i' = 1 if qoi`i' == -1
  4. 
.   gen no`i' = 0
  5.   replace no`i' = 1 if qoi`i' == 1
  6. 
.   gen notapp`i' = 0
  7.   replace notapp`i' = 1 if qoi`i' == 0
  8. 
.   gen missing`i' = 0
  9.   replace missing`i' = 1 if missing(qoi`i')
 10. }
(14,370 real changes made)
(12,543 real changes made)
(3,906 real changes made)
(2,269 real changes made)
(15,044 real changes made)
(11,751 real changes made)
(4,009 real changes made)
(2,284 real changes made)
(13,488 real changes made)
(14,434 real changes made)
(2,914 real changes made)
(2,252 real changes made)
(16,333 real changes made)
(11,148 real changes made)
(3,121 real changes made)
(2,486 real changes made)
(17,577 real changes made)
(11,270 real changes made)
(1,991 real changes made)
(2,250 real changes made)
(13,386 real changes made)
(16,155 real changes made)
(1,216 real changes made)
(2,331 real changes made)

. 
. 
. /* collapse the dataset, resulting dataset has mean for each qoi, total numbe
> r of responses, and number of responses for each option in each question */
. collapse (mean) qoi* totalresp (sum) stragree* agree* disagree* strdisagree* 
> neither* insig98 mild98 moderate98 severe98 yes* no* missing*, by(cdscode)

. /* NOTE: no* includes notapp* and none*, including both in collapse will case
>  name conflict error. */
. 
. 
. ************************ relabel all the vars *******************************
> ***
. foreach i of numlist 10 20 41 44 98 103/105 109 111 112 128 {
  2.   label var qoi`i' "mean of qoi`i'"
  3. }

. 
. label var totalresp "total number of responses in the school including missin
> g"

. 
. /* rename the qoi vars to reflect they are now averages */
. rename qoi* qoi*mean

. 
. /* label vars for the number of response for each option */
. foreach i of numlist 10 20 41 44 98 103/105 109 111 112 128 {
  2.   label var missing`i' "number of missing responses for qoi`i'"
  3. }

. 
. /* label the response options for 10 20 44 */
. foreach i of numlist 10 20 41 44 128 {
  2.   label var strdisagree`i' "number of people choosing strongly disagree fo
> r qoi`i'"
  3.   label var disagree`i' "number of people choosing disagree for qoi`i'"
  4.   label var agree`i' "number of people choosing agree for qoi`i'"
  5.   label var stragree`i' "number of people choosing strongly agree for qoi`
> i'"
  6.   label var neither`i' "number of people choosing not applicable for qoi`i
> '"
  7. }

. /*
> /* label the response options for qoi41 */
> label var all41 "number of people choosing nearly all adults for qoi41"
> label var most41 "number of people choosing most adults for qoi41"
> label var some41 "number of people choosing some adults for qoi41"
> label var few41 "number of people choosing few adults for qoi41"
> label var none41 "number of people choosing almost none for qoi41" */
. /*
> /* label the response options for 128  */
> foreach i of numlist 128 {
>   label var strdisagree`i' "number of people choosing strongly disagree for q
> oi`i'"
>   label var disagree`i' "number of people choosing disagree for qoi`i'"
>   label var agree`i' "number of people choosing agree for qoi`i'"
>   label var stragree`i' "number of people choosing strongly agree for qoi`i'"
>   label var neither`i' "number of people choosing neither agree nor disagree 
> for qoi`i'"
> } */
. 
. /* label the response options for qoi98 */
. label var insig98 "number of people choosing insignificant problem for qoi98"

. label var mild98 "number of people choosing mild problem for qoi98"

. label var moderate98 "number of people choosing moderate problem for qoi98"

. label var severe98 "number of people choosing severe problem for qoi98"

. 
. /* label the response options for qoi 103-105 109 111 112 */
. foreach i of numlist 103/105 109 111 112 {
  2.   label var yes`i' "number of people choosing yes for qoi`i'"
  3.   label var no`i' "number of people choosing no for qoi`i'"
  4.   label var notapp`i' "number of people choosing not applicable for qoi`i'
> "
  5. }

. 
. 
. ********************* generate percentage agree/disagree etc ****************
> ***
. /* first, generate the net total responses for each question excluding missin
> g */
. foreach i of numlist 10 20 41 44 98 103/105 109 111 112 128 {
  2.   gen nettotalresp`i' = totalresp - missing`i'
  3.   label var nettotalresp`i' "net total responses for qoi`i' excluding miss
> ing "
  4. }

. 
. /* generate percentage agree/disagree for qoi 10 20 44 */
. foreach i of numlist 10 20 41 44 128 {
  2.   gen pctdisagree`i' = (strdisagree`i' + disagree`i')/nettotalresp`i'
  3.   label var pctdisagree`i' "percent strongly disagree or disagree in qoi`i
> '"
  4.   gen pctagree`i' = (stragree`i' + agree`i')/nettotalresp`i'
  5.   label var pctagree`i' "percent strongly agree or agree in qoi`i'"
  6.   gen pctneither`i' = neither`i'/nettotalresp`i'
  7.   label var pctneither`i' "percent not applicable in qoi`i'"
  8. }
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(91 missing values generated)
(91 missing values generated)
(91 missing values generated)

. /*
> /* Note: treat all and most as agree, some few and none as disagree in qoi41 
> */
> gen pctagree41 = (all41 + most41)/nettotalresp41
> label var pctagree41 "percent all or most adults in qoi41, equivlent to agree
> "
> gen pctdisagree41 = (some41 + few41 + none41)/nettotalresp41
> label var pctdisagree41 "percent some, few, or none in qoi41, equivalent to d
> isagree"
> 
> /* generate percentage agree/disagree for qoi 128 */
> foreach i of numlist 128 {
>   gen pctdisagree`i' = (strdisagree`i' + disagree`i')/nettotalresp`i'
>   label var pctdisagree`i' "percent strongly disagree or disagree in qoi`i'"
>   gen pctagree`i' = (stragree`i' + agree`i')/nettotalresp`i'
>   label var pctagree`i' "percent strongly agree or agree in qoi`i'"
>   gen pctneither`i' = neither`i'/nettotalresp`i'
>   label var pctneither`i' "percent not applicable in qoi`i'"
> }
> */
. 
. /* generate percentage small/big problem for qoi98 */
. gen pctsmallprob98 = (insig98 + mild98)/nettotalresp98
(2 missing values generated)

. gen pctbigprob98 = (moderate98 + severe98)/nettotalresp98
(2 missing values generated)

. label var pctsmallprob98 "percentage insignificant or mild problem for qoi98"

. label var pctbigprob98 "percentage moderate or severe problem for qoi98"

. 
. /* generate percentage yes/no for qoi 103/105 109 111 112 */
. foreach i of numlist 103/105 109 111 112 {
  2.   gen pctyes`i' = yes`i'/nettotalresp`i'
  3.   label var pctyes`i' "percentage answering yes for qoi`i'"
  4.   gen pctno`i' = no`i'/nettotalresp`i'
  5.   label var pctno`i' "percentage answering no for qoi`i'"
  6.   gen pctnotapp`i' = notapp`i'/nettotalresp`i'
  7.   label var pctnotapp`i' "percent not applicable in qoi`i'"
  8. }
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)

. 
. /* generate a year var to prepare for constructing a panel*/
. gen year = 1415

. 
. label data "cleaned staff 1415 survey questions of interest with percent disa
> gree/agree etc."

. compress
  variable totalresp was float now int
  variable nettotalresp10 was float now int
  variable nettotalresp20 was float now int
  variable nettotalresp41 was float now int
  variable nettotalresp44 was float now int
  variable nettotalresp98 was float now int
  variable nettotalresp103 was float now int
  variable nettotalresp104 was float now int
  variable nettotalresp105 was float now int
  variable nettotalresp109 was float now int
  variable nettotalresp111 was float now int
  variable nettotalresp112 was float now int
  variable nettotalresp128 was float now int
  variable year was float now int
  variable stragree10 was double now int
  variable stragree20 was double now int
  variable stragree41 was double now int
  variable stragree44 was double now int
  variable stragree128 was double now byte
  variable agree10 was double now int
  variable agree20 was double now int
  variable agree41 was double now int
  variable agree44 was double now int
  variable agree128 was double now byte
  variable disagree10 was double now byte
  variable disagree20 was double now byte
  variable disagree41 was double now byte
  variable disagree44 was double now byte
  variable disagree128 was double now byte
  variable strdisagree10 was double now byte
  variable strdisagree20 was double now byte
  variable strdisagree41 was double now byte
  variable strdisagree44 was double now byte
  variable strdisagree128 was double now byte
  variable neither10 was double now byte
  variable neither20 was double now int
  variable neither41 was double now int
  variable neither44 was double now byte
  variable neither128 was double now byte
  variable insig98 was double now int
  variable mild98 was double now int
  variable moderate98 was double now byte
  variable severe98 was double now byte
  variable yes103 was double now int
  variable yes104 was double now int
  variable yes105 was double now int
  variable yes109 was double now int
  variable yes111 was double now int
  variable yes112 was double now int
  variable no103 was double now int
  variable notapp103 was double now byte
  variable no104 was double now int
  variable notapp104 was double now byte
  variable no105 was double now int
  variable notapp105 was double now byte
  variable no109 was double now int
  variable notapp109 was double now byte
  variable no111 was double now int
  variable notapp111 was double now byte
  variable no112 was double now int
  variable notapp112 was double now byte
  variable missing10 was double now byte
  variable missing20 was double now byte
  variable missing41 was double now byte
  variable missing44 was double now byte
  variable missing128 was double now int
  variable missing98 was double now byte
  variable missing103 was double now byte
  variable missing104 was double now byte
  variable missing105 was double now byte
  variable missing109 was double now byte
  variable missing111 was double now byte
  variable missing112 was double now byte
  (601,952 bytes saved)

. save $projdir/dta/buildanalysisdata/qoiclean/staff/staffqoiclean1415, replace
file
    /home/research/ca_ed_lab/users/chesun/gsr/caschls/dta/buildanalysisdata/q
    > oiclean/staff/staffqoiclean1415.dta saved

. 
. log close
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/users/chesun/gsr/caschls/log/build/builda
> nalysisdata/qoiclean/staff/staffqoiclean1415.smcl
  log type:  smcl
 closed on:  19 Dec 2024, 19:15:29
-------------------------------------------------------------------------------
